// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#ifndef CUSTOM_GLOBAL_TYPES
	#include <SDK/GlobalTypes.hpp>
#else
	#include <Custom/GlobalTypes.hpp>
#endif


#include <SDK/soundsystem_voicecontainers/CAudioMorphData.hpp>



namespace CS2 {
	namespace soundsystem_voicecontainers {
		class CAudioPhonemeTag;
		class CAudioEmphasisSample;
	}
}
namespace CS2 {
	namespace soundsystem_voicecontainers {
		class CAudioSentence  {
		public:
			bool m_bShouldVoiceDuck; // 0x0 | Schema_Builtin | Size: 0x1
			S2_PAD(0x7);
			GlobalTypes::CUtlVector< soundsystem_voicecontainers::CAudioPhonemeTag > m_RunTimePhonemes; // 0x8 | Schema_Atomic | Size: 0x18
			// char  m_RunTimePhonemes[0x18]; // 0x8 | Schema_Atomic | Size: 0x18
			// GlobalTypes::CUtlVector< soundsystem_voicecontainers::CAudioPhonemeTag > m_RunTimePhonemes; // 0x8 | Schema_Atomic | Size: 0x18
			GlobalTypes::CUtlVector< soundsystem_voicecontainers::CAudioEmphasisSample > m_EmphasisSamples; // 0x20 | Schema_Atomic | Size: 0x18
			// char  m_EmphasisSamples[0x18]; // 0x20 | Schema_Atomic | Size: 0x18
			// GlobalTypes::CUtlVector< soundsystem_voicecontainers::CAudioEmphasisSample > m_EmphasisSamples; // 0x20 | Schema_Atomic | Size: 0x18
			soundsystem_voicecontainers::CAudioMorphData m_morphData; // 0x38 | Schema_DeclaredClass | Size: 0x68
		};
		static_assert(offsetof(CS2::soundsystem_voicecontainers::CAudioSentence, m_bShouldVoiceDuck) == 0x0, "m_bShouldVoiceDuck in CAudioSentence should be at offset 0x0");
		static_assert(offsetof(CS2::soundsystem_voicecontainers::CAudioSentence, m_RunTimePhonemes) == 0x8, "m_RunTimePhonemes in CAudioSentence should be at offset 0x8");
		static_assert(offsetof(CS2::soundsystem_voicecontainers::CAudioSentence, m_EmphasisSamples) == 0x20, "m_EmphasisSamples in CAudioSentence should be at offset 0x20");
		static_assert(offsetof(CS2::soundsystem_voicecontainers::CAudioSentence, m_morphData) == 0x38, "m_morphData in CAudioSentence should be at offset 0x38");
		static_assert(sizeof(CS2::soundsystem_voicecontainers::CAudioSentence) == 0xA0, "CAudioSentence size should be 0xA0");
	}
}
