// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#ifndef CUSTOM_GLOBAL_TYPES
	#include <SDK/GlobalTypes.hpp>
#else
	#include <Custom/GlobalTypes.hpp>
#endif





namespace CS2 {
	namespace soundsystem_voicecontainers {
		class CAudioMorphData  {
		public:
			// GlobalTypes::CUtlVector< float32 > m_times; // 0x0 | Schema_Atomic | Size: 0x18
			char  m_times[0x18]; // 0x0 | Schema_Atomic | Size: 0x18
			// GlobalTypes::CUtlVector< uint32 > m_nameHashCodes; // 0x18 | Schema_Atomic | Size: 0x18
			char  m_nameHashCodes[0x18]; // 0x18 | Schema_Atomic | Size: 0x18
			// GlobalTypes::CUtlVector< GlobalTypes::CUtlString > m_nameStrings; // 0x30 | Schema_Atomic | Size: 0x18
			char  m_nameStrings[0x18]; // 0x30 | Schema_Atomic | Size: 0x18
			// GlobalTypes::CUtlVector< GlobalTypes::CUtlVector< float32 > > m_samples; // 0x48 | Schema_Atomic | Size: 0x18
			char  m_samples[0x18]; // 0x48 | Schema_Atomic | Size: 0x18
			float32 m_flEaseIn; // 0x60 | Schema_Builtin | Size: 0x4
			float32 m_flEaseOut; // 0x64 | Schema_Builtin | Size: 0x4
		};
		static_assert(offsetof(CS2::soundsystem_voicecontainers::CAudioMorphData, m_times) == 0x0, "m_times in CAudioMorphData should be at offset 0x0");
		static_assert(offsetof(CS2::soundsystem_voicecontainers::CAudioMorphData, m_nameHashCodes) == 0x18, "m_nameHashCodes in CAudioMorphData should be at offset 0x18");
		static_assert(offsetof(CS2::soundsystem_voicecontainers::CAudioMorphData, m_nameStrings) == 0x30, "m_nameStrings in CAudioMorphData should be at offset 0x30");
		static_assert(offsetof(CS2::soundsystem_voicecontainers::CAudioMorphData, m_samples) == 0x48, "m_samples in CAudioMorphData should be at offset 0x48");
		static_assert(offsetof(CS2::soundsystem_voicecontainers::CAudioMorphData, m_flEaseIn) == 0x60, "m_flEaseIn in CAudioMorphData should be at offset 0x60");
		static_assert(offsetof(CS2::soundsystem_voicecontainers::CAudioMorphData, m_flEaseOut) == 0x64, "m_flEaseOut in CAudioMorphData should be at offset 0x64");
		static_assert(sizeof(CS2::soundsystem_voicecontainers::CAudioMorphData) == 0x68, "CAudioMorphData size should be 0x68");
	}
}
