// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#include <SDK/GlobalTypes.hpp>




namespace CS2 {
	namespace soundsystem_voicecontainers {
		class CGainScalePerInstance  {
		public:
			float32 m_flMinVolume; // 0x0 | Schema_Builtin | Size: 0x4
			int32_t m_nInstancesAtMinVolume; // 0x4 | Schema_Builtin | Size: 0x4
			float32 m_flMaxVolume; // 0x8 | Schema_Builtin | Size: 0x4
			int32_t m_nInstancesAtMaxVolume; // 0xc | Schema_Builtin | Size: 0x4
		};
		static_assert(offsetof(CS2::soundsystem_voicecontainers::CGainScalePerInstance, m_flMinVolume) == 0x0, "m_flMinVolume in CVoiceContainerStaticAdditiveSynth::CGainScalePerInstance should be at offset 0x0");
		static_assert(offsetof(CS2::soundsystem_voicecontainers::CGainScalePerInstance, m_nInstancesAtMinVolume) == 0x4, "m_nInstancesAtMinVolume in CVoiceContainerStaticAdditiveSynth::CGainScalePerInstance should be at offset 0x4");
		static_assert(offsetof(CS2::soundsystem_voicecontainers::CGainScalePerInstance, m_flMaxVolume) == 0x8, "m_flMaxVolume in CVoiceContainerStaticAdditiveSynth::CGainScalePerInstance should be at offset 0x8");
		static_assert(offsetof(CS2::soundsystem_voicecontainers::CGainScalePerInstance, m_nInstancesAtMaxVolume) == 0xC, "m_nInstancesAtMaxVolume in CVoiceContainerStaticAdditiveSynth::CGainScalePerInstance should be at offset 0xC");
		static_assert(sizeof(CS2::soundsystem_voicecontainers::CGainScalePerInstance) == 0x10, "CVoiceContainerStaticAdditiveSynth::CGainScalePerInstance size should be 0x10");
	}
}
