// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#include <SDK/GlobalTypes.hpp>

#include <SDK/soundsystem_voicecontainers/EWaveform.hpp>
#include <SDK/soundsystem_voicecontainers/EMidiNote.hpp>
#include <SDK/soundsystem_voicecontainers/CGainScalePerInstance.hpp>



namespace CS2 {
	namespace soundsystem_voicecontainers {
		class CHarmonic  {
		public:
			soundsystem_voicecontainers::EWaveform m_nWaveform; // 0x0 | Schema_DeclaredEnum | Size: 0x1
			soundsystem_voicecontainers::EMidiNote m_nFundamental; // 0x1 | Schema_DeclaredEnum | Size: 0x1
			S2_PAD(0x2);
			int32_t m_nOctave; // 0x4 | Schema_Builtin | Size: 0x4
			float32 m_flCents; // 0x8 | Schema_Builtin | Size: 0x4
			float32 m_flPhase; // 0xc | Schema_Builtin | Size: 0x4
			GlobalTypes::CPiecewiseCurve m_curve; // 0x10 | Schema_Atomic | Size: 0x40
			soundsystem_voicecontainers::CGainScalePerInstance m_volumeScaling; // 0x50 | Schema_DeclaredClass | Size: 0x10
			S2_PAD(0x8); // End padding
		};
		static_assert(offsetof(CS2::soundsystem_voicecontainers::CHarmonic, m_nWaveform) == 0x0, "m_nWaveform in CVoiceContainerStaticAdditiveSynth::CHarmonic should be at offset 0x0");
		static_assert(offsetof(CS2::soundsystem_voicecontainers::CHarmonic, m_nFundamental) == 0x1, "m_nFundamental in CVoiceContainerStaticAdditiveSynth::CHarmonic should be at offset 0x1");
		static_assert(offsetof(CS2::soundsystem_voicecontainers::CHarmonic, m_nOctave) == 0x4, "m_nOctave in CVoiceContainerStaticAdditiveSynth::CHarmonic should be at offset 0x4");
		static_assert(offsetof(CS2::soundsystem_voicecontainers::CHarmonic, m_flCents) == 0x8, "m_flCents in CVoiceContainerStaticAdditiveSynth::CHarmonic should be at offset 0x8");
		static_assert(offsetof(CS2::soundsystem_voicecontainers::CHarmonic, m_flPhase) == 0xC, "m_flPhase in CVoiceContainerStaticAdditiveSynth::CHarmonic should be at offset 0xC");
		static_assert(offsetof(CS2::soundsystem_voicecontainers::CHarmonic, m_curve) == 0x10, "m_curve in CVoiceContainerStaticAdditiveSynth::CHarmonic should be at offset 0x10");
		static_assert(offsetof(CS2::soundsystem_voicecontainers::CHarmonic, m_volumeScaling) == 0x50, "m_volumeScaling in CVoiceContainerStaticAdditiveSynth::CHarmonic should be at offset 0x50");
		static_assert(sizeof(CS2::soundsystem_voicecontainers::CHarmonic) == 0x68, "CVoiceContainerStaticAdditiveSynth::CHarmonic size should be 0x68");
	}
}
