// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#ifndef CUSTOM_GLOBAL_TYPES
	#include "../GlobalTypes.hpp"
#else
	#include <Custom/GlobalTypes.hpp>
#endif


#include "CVoiceContainerAsyncGenerator.hpp"





using namespace GlobalTypes;
namespace CS2 {
	namespace soundsystem_voicecontainers {
		class CVoiceContainerTapePlayer : public CS2::soundsystem_voicecontainers::CVoiceContainerAsyncGenerator {
		public:
			bool m_bShouldWraparound; // 0xb8 | Schema_Builtin | Size: 0x1
			S2_PAD(0x7);
			// GlobalTypes::CStrongHandle<resourcesystem::InfoForResourceTypeCVoiceContainerBase> m_sourceAudio; // 0xc0 | Schema_Atomic | Size: 0x8
			char m_sourceAudio[0x8]; // 0xc0 | Schema_Atomic | Size: 0x8
			float32 m_flTapeSpeedAttackTime; // 0xc8 | Schema_Builtin | Size: 0x4
			float32 m_flTapeSpeedReleaseTime; // 0xcc | Schema_Builtin | Size: 0x4
			S2_PAD(0x28); // End padding
		};
#ifdef USE_STATIC_ASSERTS
		static_assert(offsetof(CS2::soundsystem_voicecontainers::CVoiceContainerTapePlayer, m_bShouldWraparound) == 0xB8, "m_bShouldWraparound in CVoiceContainerTapePlayer should be at offset 0xB8");
		static_assert(offsetof(CS2::soundsystem_voicecontainers::CVoiceContainerTapePlayer, m_sourceAudio) == 0xC0, "m_sourceAudio in CVoiceContainerTapePlayer should be at offset 0xC0");
		static_assert(offsetof(CS2::soundsystem_voicecontainers::CVoiceContainerTapePlayer, m_flTapeSpeedAttackTime) == 0xC8, "m_flTapeSpeedAttackTime in CVoiceContainerTapePlayer should be at offset 0xC8");
		static_assert(offsetof(CS2::soundsystem_voicecontainers::CVoiceContainerTapePlayer, m_flTapeSpeedReleaseTime) == 0xCC, "m_flTapeSpeedReleaseTime in CVoiceContainerTapePlayer should be at offset 0xCC");
		static_assert(sizeof(CS2::soundsystem_voicecontainers::CVoiceContainerTapePlayer) == 0xF8, "CVoiceContainerTapePlayer size should be 0xF8");

#endif
	}
}
