// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#ifndef CUSTOM_GLOBAL_TYPES
	#include "../GlobalTypes.hpp"
#else
	#include "../Custom/GlobalTypes.hpp"
#endif


#include "CVoiceContainerBase.hpp"
#include "CSoundContainerReference.hpp"





using namespace GlobalTypes;
namespace CS2 {
	namespace soundsystem_voicecontainers {
		class CVoiceContainerParameterBlender : public CS2::soundsystem_voicecontainers::CVoiceContainerBase {
		public:
			soundsystem_voicecontainers::CSoundContainerReference m_firstSound; // 0xa8 | Schema_DeclaredClass | Size: 0x18
			soundsystem_voicecontainers::CSoundContainerReference m_secondSound; // 0xc0 | Schema_DeclaredClass | Size: 0x18
			bool m_bEnableOcclusionBlend; // 0xd8 | Schema_Builtin | Size: 0x1
			S2_PAD(0x7);
			GlobalTypes::CPiecewiseCurve m_curve1; // 0xe0 | Schema_Atomic | Size: 0x40
			GlobalTypes::CPiecewiseCurve m_curve2; // 0x120 | Schema_Atomic | Size: 0x40
			bool m_bEnableDistanceBlend; // 0x160 | Schema_Builtin | Size: 0x1
			S2_PAD(0x7);
			GlobalTypes::CPiecewiseCurve m_curve3; // 0x168 | Schema_Atomic | Size: 0x40
			GlobalTypes::CPiecewiseCurve m_curve4; // 0x1a8 | Schema_Atomic | Size: 0x40
		};
#ifdef USE_STATIC_ASSERTS
		static_assert(offsetof(CS2::soundsystem_voicecontainers::CVoiceContainerParameterBlender, m_firstSound) == 0xA8, "m_firstSound in CVoiceContainerParameterBlender should be at offset 0xA8");
		static_assert(offsetof(CS2::soundsystem_voicecontainers::CVoiceContainerParameterBlender, m_secondSound) == 0xC0, "m_secondSound in CVoiceContainerParameterBlender should be at offset 0xC0");
		static_assert(offsetof(CS2::soundsystem_voicecontainers::CVoiceContainerParameterBlender, m_bEnableOcclusionBlend) == 0xD8, "m_bEnableOcclusionBlend in CVoiceContainerParameterBlender should be at offset 0xD8");
		static_assert(offsetof(CS2::soundsystem_voicecontainers::CVoiceContainerParameterBlender, m_curve1) == 0xE0, "m_curve1 in CVoiceContainerParameterBlender should be at offset 0xE0");
		static_assert(offsetof(CS2::soundsystem_voicecontainers::CVoiceContainerParameterBlender, m_curve2) == 0x120, "m_curve2 in CVoiceContainerParameterBlender should be at offset 0x120");
		static_assert(offsetof(CS2::soundsystem_voicecontainers::CVoiceContainerParameterBlender, m_bEnableDistanceBlend) == 0x160, "m_bEnableDistanceBlend in CVoiceContainerParameterBlender should be at offset 0x160");
		static_assert(offsetof(CS2::soundsystem_voicecontainers::CVoiceContainerParameterBlender, m_curve3) == 0x168, "m_curve3 in CVoiceContainerParameterBlender should be at offset 0x168");
		static_assert(offsetof(CS2::soundsystem_voicecontainers::CVoiceContainerParameterBlender, m_curve4) == 0x1A8, "m_curve4 in CVoiceContainerParameterBlender should be at offset 0x1A8");
		static_assert(sizeof(CS2::soundsystem_voicecontainers::CVoiceContainerParameterBlender) == 0x1E8, "CVoiceContainerParameterBlender size should be 0x1E8");

#endif
	}
}
