// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#ifndef CUSTOM_GLOBAL_TYPES
	#include "../GlobalTypes.hpp"
#else
	#include "../Custom/GlobalTypes.hpp"
#endif


#include "CVoiceContainerBase.hpp"
#include "CSoundContainerReference.hpp"





using namespace GlobalTypes;
namespace CS2 {
	namespace soundsystem_voicecontainers {
		class CVoiceContainerLoopXFade : public CS2::soundsystem_voicecontainers::CVoiceContainerBase {
		public:
			soundsystem_voicecontainers::CSoundContainerReference m_sound; // 0xa8 | Schema_DeclaredClass | Size: 0x18
			float32 m_flLoopEnd; // 0xc0 | Schema_Builtin | Size: 0x4
			float32 m_flLoopStart; // 0xc4 | Schema_Builtin | Size: 0x4
			float32 m_flFadeOut; // 0xc8 | Schema_Builtin | Size: 0x4
			float32 m_flFadeIn; // 0xcc | Schema_Builtin | Size: 0x4
			bool m_bPlayHead; // 0xd0 | Schema_Builtin | Size: 0x1
			bool m_bPlayTail; // 0xd1 | Schema_Builtin | Size: 0x1
			bool m_bEqualPow; // 0xd2 | Schema_Builtin | Size: 0x1
			S2_PAD(0x5); // End padding
		};
		static_assert(offsetof(CS2::soundsystem_voicecontainers::CVoiceContainerLoopXFade, m_sound) == 0xA8, "m_sound in CVoiceContainerLoopXFade should be at offset 0xA8");
		static_assert(offsetof(CS2::soundsystem_voicecontainers::CVoiceContainerLoopXFade, m_flLoopEnd) == 0xC0, "m_flLoopEnd in CVoiceContainerLoopXFade should be at offset 0xC0");
		static_assert(offsetof(CS2::soundsystem_voicecontainers::CVoiceContainerLoopXFade, m_flLoopStart) == 0xC4, "m_flLoopStart in CVoiceContainerLoopXFade should be at offset 0xC4");
		static_assert(offsetof(CS2::soundsystem_voicecontainers::CVoiceContainerLoopXFade, m_flFadeOut) == 0xC8, "m_flFadeOut in CVoiceContainerLoopXFade should be at offset 0xC8");
		static_assert(offsetof(CS2::soundsystem_voicecontainers::CVoiceContainerLoopXFade, m_flFadeIn) == 0xCC, "m_flFadeIn in CVoiceContainerLoopXFade should be at offset 0xCC");
		static_assert(offsetof(CS2::soundsystem_voicecontainers::CVoiceContainerLoopXFade, m_bPlayHead) == 0xD0, "m_bPlayHead in CVoiceContainerLoopXFade should be at offset 0xD0");
		static_assert(offsetof(CS2::soundsystem_voicecontainers::CVoiceContainerLoopXFade, m_bPlayTail) == 0xD1, "m_bPlayTail in CVoiceContainerLoopXFade should be at offset 0xD1");
		static_assert(offsetof(CS2::soundsystem_voicecontainers::CVoiceContainerLoopXFade, m_bEqualPow) == 0xD2, "m_bEqualPow in CVoiceContainerLoopXFade should be at offset 0xD2");
		static_assert(sizeof(CS2::soundsystem_voicecontainers::CVoiceContainerLoopXFade) == 0xD8, "CVoiceContainerLoopXFade size should be 0xD8");
	}
}
