// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#ifndef CUSTOM_GLOBAL_TYPES
	#include "../GlobalTypes.hpp"
#else
	#include "../Custom/GlobalTypes.hpp"
#endif


#include "CVoiceContainerGenerator.hpp"





using namespace GlobalTypes;
namespace CS2 {
	namespace soundsystem_voicecontainers {
		class CVoiceContainerShapedNoise : public CS2::soundsystem_voicecontainers::CVoiceContainerGenerator {
		public:
			bool m_bUseCurveForFrequency; // 0xa8 | Schema_Builtin | Size: 0x1
			S2_PAD(0x3);
			float32 m_flFrequency; // 0xac | Schema_Builtin | Size: 0x4
			GlobalTypes::CPiecewiseCurve m_frequencySweep; // 0xb0 | Schema_Atomic | Size: 0x40
			bool m_bUseCurveForResonance; // 0xf0 | Schema_Builtin | Size: 0x1
			S2_PAD(0x3);
			float32 m_flResonance; // 0xf4 | Schema_Builtin | Size: 0x4
			GlobalTypes::CPiecewiseCurve m_resonanceSweep; // 0xf8 | Schema_Atomic | Size: 0x40
			bool m_bUseCurveForAmplitude; // 0x138 | Schema_Builtin | Size: 0x1
			S2_PAD(0x3);
			float32 m_flGainInDecibels; // 0x13c | Schema_Builtin | Size: 0x4
			GlobalTypes::CPiecewiseCurve m_gainSweep; // 0x140 | Schema_Atomic | Size: 0x40
		};
		static_assert(offsetof(CS2::soundsystem_voicecontainers::CVoiceContainerShapedNoise, m_bUseCurveForFrequency) == 0xA8, "m_bUseCurveForFrequency in CVoiceContainerShapedNoise should be at offset 0xA8");
		static_assert(offsetof(CS2::soundsystem_voicecontainers::CVoiceContainerShapedNoise, m_flFrequency) == 0xAC, "m_flFrequency in CVoiceContainerShapedNoise should be at offset 0xAC");
		static_assert(offsetof(CS2::soundsystem_voicecontainers::CVoiceContainerShapedNoise, m_frequencySweep) == 0xB0, "m_frequencySweep in CVoiceContainerShapedNoise should be at offset 0xB0");
		static_assert(offsetof(CS2::soundsystem_voicecontainers::CVoiceContainerShapedNoise, m_bUseCurveForResonance) == 0xF0, "m_bUseCurveForResonance in CVoiceContainerShapedNoise should be at offset 0xF0");
		static_assert(offsetof(CS2::soundsystem_voicecontainers::CVoiceContainerShapedNoise, m_flResonance) == 0xF4, "m_flResonance in CVoiceContainerShapedNoise should be at offset 0xF4");
		static_assert(offsetof(CS2::soundsystem_voicecontainers::CVoiceContainerShapedNoise, m_resonanceSweep) == 0xF8, "m_resonanceSweep in CVoiceContainerShapedNoise should be at offset 0xF8");
		static_assert(offsetof(CS2::soundsystem_voicecontainers::CVoiceContainerShapedNoise, m_bUseCurveForAmplitude) == 0x138, "m_bUseCurveForAmplitude in CVoiceContainerShapedNoise should be at offset 0x138");
		static_assert(offsetof(CS2::soundsystem_voicecontainers::CVoiceContainerShapedNoise, m_flGainInDecibels) == 0x13C, "m_flGainInDecibels in CVoiceContainerShapedNoise should be at offset 0x13C");
		static_assert(offsetof(CS2::soundsystem_voicecontainers::CVoiceContainerShapedNoise, m_gainSweep) == 0x140, "m_gainSweep in CVoiceContainerShapedNoise should be at offset 0x140");
		static_assert(sizeof(CS2::soundsystem_voicecontainers::CVoiceContainerShapedNoise) == 0x180, "CVoiceContainerShapedNoise size should be 0x180");
	}
}
