// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#ifndef CUSTOM_GLOBAL_TYPES
	#include <SDK/GlobalTypes.hpp>
#else
	#include <Custom/GlobalTypes.hpp>
#endif





namespace CS2 {
	namespace materialsystem2 {
		class PostProcessingVignetteParameters_t  {
		public:
			float32 m_flVignetteStrength; // 0x0 | Schema_Builtin | Size: 0x4
			GlobalTypes::Vector2D m_vCenter; // 0x4 | Schema_Atomic | Size: 0x8
			float32 m_flRadius; // 0xc | Schema_Builtin | Size: 0x4
			float32 m_flRoundness; // 0x10 | Schema_Builtin | Size: 0x4
			float32 m_flFeather; // 0x14 | Schema_Builtin | Size: 0x4
			GlobalTypes::Vector m_vColorTint; // 0x18 | Schema_Atomic | Size: 0xc
		};
		static_assert(offsetof(CS2::materialsystem2::PostProcessingVignetteParameters_t, m_flVignetteStrength) == 0x0, "m_flVignetteStrength in PostProcessingVignetteParameters_t should be at offset 0x0");
		static_assert(offsetof(CS2::materialsystem2::PostProcessingVignetteParameters_t, m_vCenter) == 0x4, "m_vCenter in PostProcessingVignetteParameters_t should be at offset 0x4");
		static_assert(offsetof(CS2::materialsystem2::PostProcessingVignetteParameters_t, m_flRadius) == 0xC, "m_flRadius in PostProcessingVignetteParameters_t should be at offset 0xC");
		static_assert(offsetof(CS2::materialsystem2::PostProcessingVignetteParameters_t, m_flRoundness) == 0x10, "m_flRoundness in PostProcessingVignetteParameters_t should be at offset 0x10");
		static_assert(offsetof(CS2::materialsystem2::PostProcessingVignetteParameters_t, m_flFeather) == 0x14, "m_flFeather in PostProcessingVignetteParameters_t should be at offset 0x14");
		static_assert(offsetof(CS2::materialsystem2::PostProcessingVignetteParameters_t, m_vColorTint) == 0x18, "m_vColorTint in PostProcessingVignetteParameters_t should be at offset 0x18");
		static_assert(sizeof(CS2::materialsystem2::PostProcessingVignetteParameters_t) == 0x24, "PostProcessingVignetteParameters_t size should be 0x24");
	}
}
