// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#include <SDK/GlobalTypes.hpp>




namespace CS2 {
	namespace materialsystem2 {
		class PostProcessingFogScatteringParameters_t  {
		public:
			float32 m_fRadius; // 0x0 | Schema_Builtin | Size: 0x4
			float32 m_fScale; // 0x4 | Schema_Builtin | Size: 0x4
			float32 m_fCubemapScale; // 0x8 | Schema_Builtin | Size: 0x4
			float32 m_fVolumetricScale; // 0xc | Schema_Builtin | Size: 0x4
			float32 m_fGradientScale; // 0x10 | Schema_Builtin | Size: 0x4
		};
		static_assert(offsetof(CS2::materialsystem2::PostProcessingFogScatteringParameters_t, m_fRadius) == 0x0, "m_fRadius in PostProcessingFogScatteringParameters_t should be at offset 0x0");
		static_assert(offsetof(CS2::materialsystem2::PostProcessingFogScatteringParameters_t, m_fScale) == 0x4, "m_fScale in PostProcessingFogScatteringParameters_t should be at offset 0x4");
		static_assert(offsetof(CS2::materialsystem2::PostProcessingFogScatteringParameters_t, m_fCubemapScale) == 0x8, "m_fCubemapScale in PostProcessingFogScatteringParameters_t should be at offset 0x8");
		static_assert(offsetof(CS2::materialsystem2::PostProcessingFogScatteringParameters_t, m_fVolumetricScale) == 0xC, "m_fVolumetricScale in PostProcessingFogScatteringParameters_t should be at offset 0xC");
		static_assert(offsetof(CS2::materialsystem2::PostProcessingFogScatteringParameters_t, m_fGradientScale) == 0x10, "m_fGradientScale in PostProcessingFogScatteringParameters_t should be at offset 0x10");
		static_assert(sizeof(CS2::materialsystem2::PostProcessingFogScatteringParameters_t) == 0x14, "PostProcessingFogScatteringParameters_t size should be 0x14");
	}
}
