// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#ifndef CUSTOM_GLOBAL_TYPES
	#include <SDK/GlobalTypes.hpp>
#else
	#include <Custom/GlobalTypes.hpp>
#endif


#include <SDK/materialsystem2/PostProcessingTonemapParameters_t.hpp>
#include <SDK/materialsystem2/PostProcessingBloomParameters_t.hpp>
#include <SDK/materialsystem2/PostProcessingVignetteParameters_t.hpp>
#include <SDK/materialsystem2/PostProcessingLocalContrastParameters_t.hpp>
#include <SDK/materialsystem2/PostProcessingFogScatteringParameters_t.hpp>





using namespace GlobalTypes;
namespace CS2 {
	namespace materialsystem2 {
		class PostProcessingResource_t  {
		public:
			bool m_bHasTonemapParams; // 0x0 | Schema_Builtin | Size: 0x1
			S2_PAD(0x3);
			materialsystem2::PostProcessingTonemapParameters_t m_toneMapParams; // 0x4 | Schema_DeclaredClass | Size: 0x3c
			bool m_bHasBloomParams; // 0x40 | Schema_Builtin | Size: 0x1
			S2_PAD(0x3);
			materialsystem2::PostProcessingBloomParameters_t m_bloomParams; // 0x44 | Schema_DeclaredClass | Size: 0x88
			bool m_bHasVignetteParams; // 0xcc | Schema_Builtin | Size: 0x1
			S2_PAD(0x3);
			materialsystem2::PostProcessingVignetteParameters_t m_vignetteParams; // 0xd0 | Schema_DeclaredClass | Size: 0x24
			bool m_bHasLocalContrastParams; // 0xf4 | Schema_Builtin | Size: 0x1
			S2_PAD(0x3);
			materialsystem2::PostProcessingLocalContrastParameters_t m_localConstrastParams; // 0xf8 | Schema_DeclaredClass | Size: 0x14
			int32_t m_nColorCorrectionVolumeDim; // 0x10c | Schema_Builtin | Size: 0x4
			GlobalTypes::CUtlBinaryBlock m_colorCorrectionVolumeData; // 0x110 | Schema_Atomic | Size: 0x10
			bool m_bHasColorCorrection; // 0x120 | Schema_Builtin | Size: 0x1
			bool m_bHasFogScatteringParams; // 0x121 | Schema_Builtin | Size: 0x1
			S2_PAD(0x2);
			materialsystem2::PostProcessingFogScatteringParameters_t m_fogScatteringParams; // 0x124 | Schema_DeclaredClass | Size: 0x14
		};
		static_assert(offsetof(CS2::materialsystem2::PostProcessingResource_t, m_bHasTonemapParams) == 0x0, "m_bHasTonemapParams in PostProcessingResource_t should be at offset 0x0");
		static_assert(offsetof(CS2::materialsystem2::PostProcessingResource_t, m_toneMapParams) == 0x4, "m_toneMapParams in PostProcessingResource_t should be at offset 0x4");
		static_assert(offsetof(CS2::materialsystem2::PostProcessingResource_t, m_bHasBloomParams) == 0x40, "m_bHasBloomParams in PostProcessingResource_t should be at offset 0x40");
		static_assert(offsetof(CS2::materialsystem2::PostProcessingResource_t, m_bloomParams) == 0x44, "m_bloomParams in PostProcessingResource_t should be at offset 0x44");
		static_assert(offsetof(CS2::materialsystem2::PostProcessingResource_t, m_bHasVignetteParams) == 0xCC, "m_bHasVignetteParams in PostProcessingResource_t should be at offset 0xCC");
		static_assert(offsetof(CS2::materialsystem2::PostProcessingResource_t, m_vignetteParams) == 0xD0, "m_vignetteParams in PostProcessingResource_t should be at offset 0xD0");
		static_assert(offsetof(CS2::materialsystem2::PostProcessingResource_t, m_bHasLocalContrastParams) == 0xF4, "m_bHasLocalContrastParams in PostProcessingResource_t should be at offset 0xF4");
		static_assert(offsetof(CS2::materialsystem2::PostProcessingResource_t, m_localConstrastParams) == 0xF8, "m_localConstrastParams in PostProcessingResource_t should be at offset 0xF8");
		static_assert(offsetof(CS2::materialsystem2::PostProcessingResource_t, m_nColorCorrectionVolumeDim) == 0x10C, "m_nColorCorrectionVolumeDim in PostProcessingResource_t should be at offset 0x10C");
		static_assert(offsetof(CS2::materialsystem2::PostProcessingResource_t, m_colorCorrectionVolumeData) == 0x110, "m_colorCorrectionVolumeData in PostProcessingResource_t should be at offset 0x110");
		static_assert(offsetof(CS2::materialsystem2::PostProcessingResource_t, m_bHasColorCorrection) == 0x120, "m_bHasColorCorrection in PostProcessingResource_t should be at offset 0x120");
		static_assert(offsetof(CS2::materialsystem2::PostProcessingResource_t, m_bHasFogScatteringParams) == 0x121, "m_bHasFogScatteringParams in PostProcessingResource_t should be at offset 0x121");
		static_assert(offsetof(CS2::materialsystem2::PostProcessingResource_t, m_fogScatteringParams) == 0x124, "m_fogScatteringParams in PostProcessingResource_t should be at offset 0x124");
		static_assert(sizeof(CS2::materialsystem2::PostProcessingResource_t) == 0x138, "PostProcessingResource_t size should be 0x138");
	}
}
