// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#include <SDK/GlobalTypes.hpp>

#include <SDK/particles/CParticleFunctionInitializer.hpp>



namespace CS2 {
	namespace particles {
		class C_INIT_ModelCull : public CS2::particles::CParticleFunctionInitializer {
		public:
			int32_t m_nControlPointNumber; // 0x1c8 | Schema_Builtin | Size: 0x4
			bool m_bBoundBox; // 0x1cc | Schema_Builtin | Size: 0x1
			bool m_bCullOutside; // 0x1cd | Schema_Builtin | Size: 0x1
			bool m_bUseBones; // 0x1ce | Schema_Builtin | Size: 0x1
			char m_HitboxSetName[128]; // 0x1cf | Schema_FixedArray | Size: 0x80
			S2_PAD(0x1); // End padding
		};
		static_assert(offsetof(CS2::particles::C_INIT_ModelCull, m_nControlPointNumber) == 0x1C8, "m_nControlPointNumber in C_INIT_ModelCull should be at offset 0x1C8");
		static_assert(offsetof(CS2::particles::C_INIT_ModelCull, m_bBoundBox) == 0x1CC, "m_bBoundBox in C_INIT_ModelCull should be at offset 0x1CC");
		static_assert(offsetof(CS2::particles::C_INIT_ModelCull, m_bCullOutside) == 0x1CD, "m_bCullOutside in C_INIT_ModelCull should be at offset 0x1CD");
		static_assert(offsetof(CS2::particles::C_INIT_ModelCull, m_bUseBones) == 0x1CE, "m_bUseBones in C_INIT_ModelCull should be at offset 0x1CE");
		static_assert(offsetof(CS2::particles::C_INIT_ModelCull, m_HitboxSetName) == 0x1CF, "m_HitboxSetName in C_INIT_ModelCull should be at offset 0x1CF");
		static_assert(sizeof(CS2::particles::C_INIT_ModelCull) == 0x250, "C_INIT_ModelCull size should be 0x250");
	}
}
