// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#ifndef CUSTOM_GLOBAL_TYPES
	#include <SDK/GlobalTypes.hpp>
#else
	#include <Custom/GlobalTypes.hpp>
#endif


#include <SDK/particles/CParticleFunctionInitializer.hpp>
#include <SDK/particleslib/CPerParticleFloatInput.hpp>
#include <SDK/particleslib/CParticleCollectionFloatInput.hpp>
#include <SDK/particles/CPathParameters.hpp>



namespace CS2 {
	namespace particles {
		class C_INIT_CreateSequentialPathV2 : public CS2::particles::CParticleFunctionInitializer {
		public:
			particleslib::CPerParticleFloatInput m_fMaxDistance; // 0x1d8 | Schema_DeclaredClass | Size: 0x170
			particleslib::CParticleCollectionFloatInput m_flNumToAssign; // 0x348 | Schema_DeclaredClass | Size: 0x170
			bool m_bLoop; // 0x4b8 | Schema_Builtin | Size: 0x1
			bool m_bCPPairs; // 0x4b9 | Schema_Builtin | Size: 0x1
			bool m_bSaveOffset; // 0x4ba | Schema_Builtin | Size: 0x1
			S2_PAD(0x5);
			particles::CPathParameters m_PathParams; // 0x4c0 | Schema_DeclaredClass | Size: 0x40
			S2_PAD(0x10); // End padding
		};
		static_assert(offsetof(CS2::particles::C_INIT_CreateSequentialPathV2, m_fMaxDistance) == 0x1D8, "m_fMaxDistance in C_INIT_CreateSequentialPathV2 should be at offset 0x1D8");
		static_assert(offsetof(CS2::particles::C_INIT_CreateSequentialPathV2, m_flNumToAssign) == 0x348, "m_flNumToAssign in C_INIT_CreateSequentialPathV2 should be at offset 0x348");
		static_assert(offsetof(CS2::particles::C_INIT_CreateSequentialPathV2, m_bLoop) == 0x4B8, "m_bLoop in C_INIT_CreateSequentialPathV2 should be at offset 0x4B8");
		static_assert(offsetof(CS2::particles::C_INIT_CreateSequentialPathV2, m_bCPPairs) == 0x4B9, "m_bCPPairs in C_INIT_CreateSequentialPathV2 should be at offset 0x4B9");
		static_assert(offsetof(CS2::particles::C_INIT_CreateSequentialPathV2, m_bSaveOffset) == 0x4BA, "m_bSaveOffset in C_INIT_CreateSequentialPathV2 should be at offset 0x4BA");
		static_assert(offsetof(CS2::particles::C_INIT_CreateSequentialPathV2, m_PathParams) == 0x4C0, "m_PathParams in C_INIT_CreateSequentialPathV2 should be at offset 0x4C0");
		static_assert(sizeof(CS2::particles::C_INIT_CreateSequentialPathV2) == 0x510, "C_INIT_CreateSequentialPathV2 size should be 0x510");
	}
}
