// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#include <SDK/GlobalTypes.hpp>

#include <SDK/particles/CParticleFunctionInitializer.hpp>
#include <SDK/particleslib/CParticleTransformInput.hpp>
#include <SDK/particles/ParticleAttributeIndex_t.hpp>



namespace CS2 {
	namespace particles {
		class C_INIT_RemapInitialTransformDirectionToRotation : public CS2::particles::CParticleFunctionInitializer {
		public:
			particleslib::CParticleTransformInput m_TransformInput; // 0x1c8 | Schema_DeclaredClass | Size: 0x68
			particles::ParticleAttributeIndex_t m_nFieldOutput; // 0x230 | Schema_DeclaredClass | Size: 0x4
			float32 m_flOffsetRot; // 0x234 | Schema_Builtin | Size: 0x4
			int32_t m_nComponent; // 0x238 | Schema_Builtin | Size: 0x4
			S2_PAD(0x4); // End padding
		};
		static_assert(offsetof(CS2::particles::C_INIT_RemapInitialTransformDirectionToRotation, m_TransformInput) == 0x1C8, "m_TransformInput in C_INIT_RemapInitialTransformDirectionToRotation should be at offset 0x1C8");
		static_assert(offsetof(CS2::particles::C_INIT_RemapInitialTransformDirectionToRotation, m_nFieldOutput) == 0x230, "m_nFieldOutput in C_INIT_RemapInitialTransformDirectionToRotation should be at offset 0x230");
		static_assert(offsetof(CS2::particles::C_INIT_RemapInitialTransformDirectionToRotation, m_flOffsetRot) == 0x234, "m_flOffsetRot in C_INIT_RemapInitialTransformDirectionToRotation should be at offset 0x234");
		static_assert(offsetof(CS2::particles::C_INIT_RemapInitialTransformDirectionToRotation, m_nComponent) == 0x238, "m_nComponent in C_INIT_RemapInitialTransformDirectionToRotation should be at offset 0x238");
		static_assert(sizeof(CS2::particles::C_INIT_RemapInitialTransformDirectionToRotation) == 0x240, "C_INIT_RemapInitialTransformDirectionToRotation size should be 0x240");
	}
}
