// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#ifndef CUSTOM_GLOBAL_TYPES
	#include <SDK/GlobalTypes.hpp>
#else
	#include <Custom/GlobalTypes.hpp>
#endif


#include <SDK/particles/CParticleFunctionInitializer.hpp>
#include <SDK/particles/ParticleAttributeIndex_t.hpp>



namespace CS2 {
	namespace particles {
		class C_INIT_InheritFromParentParticles : public CS2::particles::CParticleFunctionInitializer {
		public:
			float32 m_flScale; // 0x1d8 | Schema_Builtin | Size: 0x4
			particles::ParticleAttributeIndex_t m_nFieldOutput; // 0x1dc | Schema_DeclaredClass | Size: 0x4
			int32_t m_nIncrement; // 0x1e0 | Schema_Builtin | Size: 0x4
			bool m_bRandomDistribution; // 0x1e4 | Schema_Builtin | Size: 0x1
			S2_PAD(0x3);
			int32_t m_nRandomSeed; // 0x1e8 | Schema_Builtin | Size: 0x4
			S2_PAD(0x4); // End padding
		};
		static_assert(offsetof(CS2::particles::C_INIT_InheritFromParentParticles, m_flScale) == 0x1D8, "m_flScale in C_INIT_InheritFromParentParticles should be at offset 0x1D8");
		static_assert(offsetof(CS2::particles::C_INIT_InheritFromParentParticles, m_nFieldOutput) == 0x1DC, "m_nFieldOutput in C_INIT_InheritFromParentParticles should be at offset 0x1DC");
		static_assert(offsetof(CS2::particles::C_INIT_InheritFromParentParticles, m_nIncrement) == 0x1E0, "m_nIncrement in C_INIT_InheritFromParentParticles should be at offset 0x1E0");
		static_assert(offsetof(CS2::particles::C_INIT_InheritFromParentParticles, m_bRandomDistribution) == 0x1E4, "m_bRandomDistribution in C_INIT_InheritFromParentParticles should be at offset 0x1E4");
		static_assert(offsetof(CS2::particles::C_INIT_InheritFromParentParticles, m_nRandomSeed) == 0x1E8, "m_nRandomSeed in C_INIT_InheritFromParentParticles should be at offset 0x1E8");
		static_assert(sizeof(CS2::particles::C_INIT_InheritFromParentParticles) == 0x1F0, "C_INIT_InheritFromParentParticles size should be 0x1F0");
	}
}
