// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#include <SDK/GlobalTypes.hpp>

#include <SDK/particles/CParticleFunctionInitializer.hpp>
#include <SDK/particleslib/CParticleCollectionFloatInput.hpp>



namespace CS2 {
	namespace particles {
		class C_INIT_CreateOnGrid : public CS2::particles::CParticleFunctionInitializer {
		public:
			particleslib::CParticleCollectionFloatInput m_nXCount; // 0x1c8 | Schema_DeclaredClass | Size: 0x160
			particleslib::CParticleCollectionFloatInput m_nYCount; // 0x328 | Schema_DeclaredClass | Size: 0x160
			particleslib::CParticleCollectionFloatInput m_nZCount; // 0x488 | Schema_DeclaredClass | Size: 0x160
			particleslib::CParticleCollectionFloatInput m_nXSpacing; // 0x5e8 | Schema_DeclaredClass | Size: 0x160
			particleslib::CParticleCollectionFloatInput m_nYSpacing; // 0x748 | Schema_DeclaredClass | Size: 0x160
			particleslib::CParticleCollectionFloatInput m_nZSpacing; // 0x8a8 | Schema_DeclaredClass | Size: 0x160
			int32_t m_nControlPointNumber; // 0xa08 | Schema_Builtin | Size: 0x4
			bool m_bLocalSpace; // 0xa0c | Schema_Builtin | Size: 0x1
			bool m_bCenter; // 0xa0d | Schema_Builtin | Size: 0x1
			bool m_bHollow; // 0xa0e | Schema_Builtin | Size: 0x1
			S2_PAD(0x1); // End padding
		};
		static_assert(offsetof(CS2::particles::C_INIT_CreateOnGrid, m_nXCount) == 0x1C8, "m_nXCount in C_INIT_CreateOnGrid should be at offset 0x1C8");
		static_assert(offsetof(CS2::particles::C_INIT_CreateOnGrid, m_nYCount) == 0x328, "m_nYCount in C_INIT_CreateOnGrid should be at offset 0x328");
		static_assert(offsetof(CS2::particles::C_INIT_CreateOnGrid, m_nZCount) == 0x488, "m_nZCount in C_INIT_CreateOnGrid should be at offset 0x488");
		static_assert(offsetof(CS2::particles::C_INIT_CreateOnGrid, m_nXSpacing) == 0x5E8, "m_nXSpacing in C_INIT_CreateOnGrid should be at offset 0x5E8");
		static_assert(offsetof(CS2::particles::C_INIT_CreateOnGrid, m_nYSpacing) == 0x748, "m_nYSpacing in C_INIT_CreateOnGrid should be at offset 0x748");
		static_assert(offsetof(CS2::particles::C_INIT_CreateOnGrid, m_nZSpacing) == 0x8A8, "m_nZSpacing in C_INIT_CreateOnGrid should be at offset 0x8A8");
		static_assert(offsetof(CS2::particles::C_INIT_CreateOnGrid, m_nControlPointNumber) == 0xA08, "m_nControlPointNumber in C_INIT_CreateOnGrid should be at offset 0xA08");
		static_assert(offsetof(CS2::particles::C_INIT_CreateOnGrid, m_bLocalSpace) == 0xA0C, "m_bLocalSpace in C_INIT_CreateOnGrid should be at offset 0xA0C");
		static_assert(offsetof(CS2::particles::C_INIT_CreateOnGrid, m_bCenter) == 0xA0D, "m_bCenter in C_INIT_CreateOnGrid should be at offset 0xA0D");
		static_assert(offsetof(CS2::particles::C_INIT_CreateOnGrid, m_bHollow) == 0xA0E, "m_bHollow in C_INIT_CreateOnGrid should be at offset 0xA0E");
		static_assert(sizeof(CS2::particles::C_INIT_CreateOnGrid) == 0xA10, "C_INIT_CreateOnGrid size should be 0xA10");
	}
}
