// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#include <SDK/GlobalTypes.hpp>

#include <SDK/particles/CParticleFunctionInitializer.hpp>
#include <SDK/particles/ParticleAttributeIndex_t.hpp>



namespace CS2 {
	namespace particles {
		class C_INIT_RemapInitialVisibilityScalar : public CS2::particles::CParticleFunctionInitializer {
		public:
			S2_PAD(0x4);
			particles::ParticleAttributeIndex_t m_nFieldOutput; // 0x1cc | Schema_DeclaredClass | Size: 0x4
			float32 m_flInputMin; // 0x1d0 | Schema_Builtin | Size: 0x4
			float32 m_flInputMax; // 0x1d4 | Schema_Builtin | Size: 0x4
			float32 m_flOutputMin; // 0x1d8 | Schema_Builtin | Size: 0x4
			float32 m_flOutputMax; // 0x1dc | Schema_Builtin | Size: 0x4
		};
		static_assert(offsetof(CS2::particles::C_INIT_RemapInitialVisibilityScalar, m_nFieldOutput) == 0x1CC, "m_nFieldOutput in C_INIT_RemapInitialVisibilityScalar should be at offset 0x1CC");
		static_assert(offsetof(CS2::particles::C_INIT_RemapInitialVisibilityScalar, m_flInputMin) == 0x1D0, "m_flInputMin in C_INIT_RemapInitialVisibilityScalar should be at offset 0x1D0");
		static_assert(offsetof(CS2::particles::C_INIT_RemapInitialVisibilityScalar, m_flInputMax) == 0x1D4, "m_flInputMax in C_INIT_RemapInitialVisibilityScalar should be at offset 0x1D4");
		static_assert(offsetof(CS2::particles::C_INIT_RemapInitialVisibilityScalar, m_flOutputMin) == 0x1D8, "m_flOutputMin in C_INIT_RemapInitialVisibilityScalar should be at offset 0x1D8");
		static_assert(offsetof(CS2::particles::C_INIT_RemapInitialVisibilityScalar, m_flOutputMax) == 0x1DC, "m_flOutputMax in C_INIT_RemapInitialVisibilityScalar should be at offset 0x1DC");
		static_assert(sizeof(CS2::particles::C_INIT_RemapInitialVisibilityScalar) == 0x1E0, "C_INIT_RemapInitialVisibilityScalar size should be 0x1E0");
	}
}
