// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#ifndef CUSTOM_GLOBAL_TYPES
	#include <SDK/GlobalTypes.hpp>
#else
	#include <Custom/GlobalTypes.hpp>
#endif


#include <SDK/particles/CParticleFunctionInitializer.hpp>
#include <SDK/particles/CPathParameters.hpp>





using namespace GlobalTypes;
namespace CS2 {
	namespace particles {
		class C_INIT_CreateSequentialPath : public CS2::particles::CParticleFunctionInitializer {
		public:
			float32 m_fMaxDistance; // 0x1d8 | Schema_Builtin | Size: 0x4
			float32 m_flNumToAssign; // 0x1dc | Schema_Builtin | Size: 0x4
			bool m_bLoop; // 0x1e0 | Schema_Builtin | Size: 0x1
			bool m_bCPPairs; // 0x1e1 | Schema_Builtin | Size: 0x1
			bool m_bSaveOffset; // 0x1e2 | Schema_Builtin | Size: 0x1
			S2_PAD(0xd);
			particles::CPathParameters m_PathParams; // 0x1f0 | Schema_DeclaredClass | Size: 0x40
		};
		static_assert(offsetof(CS2::particles::C_INIT_CreateSequentialPath, m_fMaxDistance) == 0x1D8, "m_fMaxDistance in C_INIT_CreateSequentialPath should be at offset 0x1D8");
		static_assert(offsetof(CS2::particles::C_INIT_CreateSequentialPath, m_flNumToAssign) == 0x1DC, "m_flNumToAssign in C_INIT_CreateSequentialPath should be at offset 0x1DC");
		static_assert(offsetof(CS2::particles::C_INIT_CreateSequentialPath, m_bLoop) == 0x1E0, "m_bLoop in C_INIT_CreateSequentialPath should be at offset 0x1E0");
		static_assert(offsetof(CS2::particles::C_INIT_CreateSequentialPath, m_bCPPairs) == 0x1E1, "m_bCPPairs in C_INIT_CreateSequentialPath should be at offset 0x1E1");
		static_assert(offsetof(CS2::particles::C_INIT_CreateSequentialPath, m_bSaveOffset) == 0x1E2, "m_bSaveOffset in C_INIT_CreateSequentialPath should be at offset 0x1E2");
		static_assert(offsetof(CS2::particles::C_INIT_CreateSequentialPath, m_PathParams) == 0x1F0, "m_PathParams in C_INIT_CreateSequentialPath should be at offset 0x1F0");
		static_assert(sizeof(CS2::particles::C_INIT_CreateSequentialPath) == 0x230, "C_INIT_CreateSequentialPath size should be 0x230");
	}
}
