// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#ifndef CUSTOM_GLOBAL_TYPES
	#include <SDK/GlobalTypes.hpp>
#else
	#include <Custom/GlobalTypes.hpp>
#endif


#include <SDK/particles/CParticleFunctionInitializer.hpp>
#include <SDK/particleslib/CPerParticleFloatInput.hpp>
#include <SDK/particles/ParticleAttributeIndex_t.hpp>
#include <SDK/particleslib/CParticleRemapFloatInput.hpp>
#include <SDK/particles/ParticleSetMethod_t.hpp>



namespace CS2 {
	namespace particles {
		class C_INIT_CheckParticleForWater : public CS2::particles::CParticleFunctionInitializer {
		public:
			particleslib::CPerParticleFloatInput m_flRadius; // 0x1d8 | Schema_DeclaredClass | Size: 0x170
			particles::ParticleAttributeIndex_t m_nFieldOutput; // 0x348 | Schema_DeclaredClass | Size: 0x4
			S2_PAD(0x4);
			particleslib::CParticleRemapFloatInput m_flOutputRemap; // 0x350 | Schema_DeclaredClass | Size: 0x170
			particles::ParticleSetMethod_t m_nSetMethod; // 0x4c0 | Schema_DeclaredEnum | Size: 0x4
			S2_PAD(0x4); // End padding
		};
		static_assert(offsetof(CS2::particles::C_INIT_CheckParticleForWater, m_flRadius) == 0x1D8, "m_flRadius in C_INIT_CheckParticleForWater should be at offset 0x1D8");
		static_assert(offsetof(CS2::particles::C_INIT_CheckParticleForWater, m_nFieldOutput) == 0x348, "m_nFieldOutput in C_INIT_CheckParticleForWater should be at offset 0x348");
		static_assert(offsetof(CS2::particles::C_INIT_CheckParticleForWater, m_flOutputRemap) == 0x350, "m_flOutputRemap in C_INIT_CheckParticleForWater should be at offset 0x350");
		static_assert(offsetof(CS2::particles::C_INIT_CheckParticleForWater, m_nSetMethod) == 0x4C0, "m_nSetMethod in C_INIT_CheckParticleForWater should be at offset 0x4C0");
		static_assert(sizeof(CS2::particles::C_INIT_CheckParticleForWater) == 0x4C8, "C_INIT_CheckParticleForWater size should be 0x4C8");
	}
}
