// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#include <SDK/GlobalTypes.hpp>

#include <SDK/particles/CParticleFunctionInitializer.hpp>
#include <SDK/particleslib/CParticleCollectionFloatInput.hpp>



namespace CS2 {
	namespace particles {
		class C_INIT_CreateOnGrid : public CS2::particles::CParticleFunctionInitializer {
		public:
			particleslib::CParticleCollectionFloatInput m_nXCount; // 0x1d8 | Schema_DeclaredClass | Size: 0x170
			particleslib::CParticleCollectionFloatInput m_nYCount; // 0x348 | Schema_DeclaredClass | Size: 0x170
			particleslib::CParticleCollectionFloatInput m_nZCount; // 0x4b8 | Schema_DeclaredClass | Size: 0x170
			particleslib::CParticleCollectionFloatInput m_nXSpacing; // 0x628 | Schema_DeclaredClass | Size: 0x170
			particleslib::CParticleCollectionFloatInput m_nYSpacing; // 0x798 | Schema_DeclaredClass | Size: 0x170
			particleslib::CParticleCollectionFloatInput m_nZSpacing; // 0x908 | Schema_DeclaredClass | Size: 0x170
			int32_t m_nControlPointNumber; // 0xa78 | Schema_Builtin | Size: 0x4
			bool m_bLocalSpace; // 0xa7c | Schema_Builtin | Size: 0x1
			bool m_bCenter; // 0xa7d | Schema_Builtin | Size: 0x1
			bool m_bHollow; // 0xa7e | Schema_Builtin | Size: 0x1
			S2_PAD(0x1); // End padding
		};
		static_assert(offsetof(CS2::particles::C_INIT_CreateOnGrid, m_nXCount) == 0x1D8, "m_nXCount in C_INIT_CreateOnGrid should be at offset 0x1D8");
		static_assert(offsetof(CS2::particles::C_INIT_CreateOnGrid, m_nYCount) == 0x348, "m_nYCount in C_INIT_CreateOnGrid should be at offset 0x348");
		static_assert(offsetof(CS2::particles::C_INIT_CreateOnGrid, m_nZCount) == 0x4B8, "m_nZCount in C_INIT_CreateOnGrid should be at offset 0x4B8");
		static_assert(offsetof(CS2::particles::C_INIT_CreateOnGrid, m_nXSpacing) == 0x628, "m_nXSpacing in C_INIT_CreateOnGrid should be at offset 0x628");
		static_assert(offsetof(CS2::particles::C_INIT_CreateOnGrid, m_nYSpacing) == 0x798, "m_nYSpacing in C_INIT_CreateOnGrid should be at offset 0x798");
		static_assert(offsetof(CS2::particles::C_INIT_CreateOnGrid, m_nZSpacing) == 0x908, "m_nZSpacing in C_INIT_CreateOnGrid should be at offset 0x908");
		static_assert(offsetof(CS2::particles::C_INIT_CreateOnGrid, m_nControlPointNumber) == 0xA78, "m_nControlPointNumber in C_INIT_CreateOnGrid should be at offset 0xA78");
		static_assert(offsetof(CS2::particles::C_INIT_CreateOnGrid, m_bLocalSpace) == 0xA7C, "m_bLocalSpace in C_INIT_CreateOnGrid should be at offset 0xA7C");
		static_assert(offsetof(CS2::particles::C_INIT_CreateOnGrid, m_bCenter) == 0xA7D, "m_bCenter in C_INIT_CreateOnGrid should be at offset 0xA7D");
		static_assert(offsetof(CS2::particles::C_INIT_CreateOnGrid, m_bHollow) == 0xA7E, "m_bHollow in C_INIT_CreateOnGrid should be at offset 0xA7E");
		static_assert(sizeof(CS2::particles::C_INIT_CreateOnGrid) == 0xA80, "C_INIT_CreateOnGrid size should be 0xA80");
	}
}
