// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#include <SDK/GlobalTypes.hpp>

#include <SDK/particles/CParticleFunctionInitializer.hpp>
#include <SDK/particles/ParticleAttributeIndex_t.hpp>
#include <SDK/particles/ParticleSetMethod_t.hpp>



namespace CS2 {
	namespace particles {
		class C_INIT_InitialSequenceFromModel : public CS2::particles::CParticleFunctionInitializer {
		public:
			int32_t m_nControlPointNumber; // 0x1d8 | Schema_Builtin | Size: 0x4
			particles::ParticleAttributeIndex_t m_nFieldOutput; // 0x1dc | Schema_DeclaredClass | Size: 0x4
			particles::ParticleAttributeIndex_t m_nFieldOutputAnim; // 0x1e0 | Schema_DeclaredClass | Size: 0x4
			float32 m_flInputMin; // 0x1e4 | Schema_Builtin | Size: 0x4
			float32 m_flInputMax; // 0x1e8 | Schema_Builtin | Size: 0x4
			float32 m_flOutputMin; // 0x1ec | Schema_Builtin | Size: 0x4
			float32 m_flOutputMax; // 0x1f0 | Schema_Builtin | Size: 0x4
			particles::ParticleSetMethod_t m_nSetMethod; // 0x1f4 | Schema_DeclaredEnum | Size: 0x4
		};
		static_assert(offsetof(CS2::particles::C_INIT_InitialSequenceFromModel, m_nControlPointNumber) == 0x1D8, "m_nControlPointNumber in C_INIT_InitialSequenceFromModel should be at offset 0x1D8");
		static_assert(offsetof(CS2::particles::C_INIT_InitialSequenceFromModel, m_nFieldOutput) == 0x1DC, "m_nFieldOutput in C_INIT_InitialSequenceFromModel should be at offset 0x1DC");
		static_assert(offsetof(CS2::particles::C_INIT_InitialSequenceFromModel, m_nFieldOutputAnim) == 0x1E0, "m_nFieldOutputAnim in C_INIT_InitialSequenceFromModel should be at offset 0x1E0");
		static_assert(offsetof(CS2::particles::C_INIT_InitialSequenceFromModel, m_flInputMin) == 0x1E4, "m_flInputMin in C_INIT_InitialSequenceFromModel should be at offset 0x1E4");
		static_assert(offsetof(CS2::particles::C_INIT_InitialSequenceFromModel, m_flInputMax) == 0x1E8, "m_flInputMax in C_INIT_InitialSequenceFromModel should be at offset 0x1E8");
		static_assert(offsetof(CS2::particles::C_INIT_InitialSequenceFromModel, m_flOutputMin) == 0x1EC, "m_flOutputMin in C_INIT_InitialSequenceFromModel should be at offset 0x1EC");
		static_assert(offsetof(CS2::particles::C_INIT_InitialSequenceFromModel, m_flOutputMax) == 0x1F0, "m_flOutputMax in C_INIT_InitialSequenceFromModel should be at offset 0x1F0");
		static_assert(offsetof(CS2::particles::C_INIT_InitialSequenceFromModel, m_nSetMethod) == 0x1F4, "m_nSetMethod in C_INIT_InitialSequenceFromModel should be at offset 0x1F4");
		static_assert(sizeof(CS2::particles::C_INIT_InitialSequenceFromModel) == 0x1F8, "C_INIT_InitialSequenceFromModel size should be 0x1F8");
	}
}
