// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#ifndef CUSTOM_GLOBAL_TYPES
	#include <SDK/GlobalTypes.hpp>
#else
	#include <Custom/GlobalTypes.hpp>
#endif


#include <SDK/particles/CParticleFunctionInitializer.hpp>
#include <SDK/particleslib/CPerParticleFloatInput.hpp>
#include <SDK/particles/ParticleFalloffFunction_t.hpp>
#include <SDK/particles/ParticleImpulseType_t.hpp>





using namespace GlobalTypes;
namespace CS2 {
	namespace particles {
		class C_INIT_CreateParticleImpulse : public CS2::particles::CParticleFunctionInitializer {
		public:
			particleslib::CPerParticleFloatInput m_InputRadius; // 0x1d8 | Schema_DeclaredClass | Size: 0x170
			particleslib::CPerParticleFloatInput m_InputMagnitude; // 0x348 | Schema_DeclaredClass | Size: 0x170
			particles::ParticleFalloffFunction_t m_nFalloffFunction; // 0x4b8 | Schema_DeclaredEnum | Size: 0x4
			S2_PAD(0x4);
			particleslib::CPerParticleFloatInput m_InputFalloffExp; // 0x4c0 | Schema_DeclaredClass | Size: 0x170
			particles::ParticleImpulseType_t m_nImpulseType; // 0x630 | Schema_DeclaredEnum | Size: 0x4
			S2_PAD(0x4); // End padding
		};
		static_assert(offsetof(CS2::particles::C_INIT_CreateParticleImpulse, m_InputRadius) == 0x1D8, "m_InputRadius in C_INIT_CreateParticleImpulse should be at offset 0x1D8");
		static_assert(offsetof(CS2::particles::C_INIT_CreateParticleImpulse, m_InputMagnitude) == 0x348, "m_InputMagnitude in C_INIT_CreateParticleImpulse should be at offset 0x348");
		static_assert(offsetof(CS2::particles::C_INIT_CreateParticleImpulse, m_nFalloffFunction) == 0x4B8, "m_nFalloffFunction in C_INIT_CreateParticleImpulse should be at offset 0x4B8");
		static_assert(offsetof(CS2::particles::C_INIT_CreateParticleImpulse, m_InputFalloffExp) == 0x4C0, "m_InputFalloffExp in C_INIT_CreateParticleImpulse should be at offset 0x4C0");
		static_assert(offsetof(CS2::particles::C_INIT_CreateParticleImpulse, m_nImpulseType) == 0x630, "m_nImpulseType in C_INIT_CreateParticleImpulse should be at offset 0x630");
		static_assert(sizeof(CS2::particles::C_INIT_CreateParticleImpulse) == 0x638, "C_INIT_CreateParticleImpulse size should be 0x638");
	}
}
