// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#include <SDK/GlobalTypes.hpp>

#include <SDK/particles/C_INIT_RemapParticleCountToScalar.hpp>



namespace CS2 {
	namespace particles {
		class C_INIT_RemapParticleCountToNamedModelElementScalar : public CS2::particles::C_INIT_RemapParticleCountToScalar {
		public:
			// GlobalTypes::CStrongHandle< resourcesystem::InfoForResourceTypeCModel > m_hModel; // 0x208 | Schema_Atomic | Size: 0x8
			char  m_hModel[0x8]; // 0x208 | Schema_Atomic | Size: 0x8
			GlobalTypes::CUtlString m_outputMinName; // 0x210 | Schema_Atomic | Size: 0x8
			GlobalTypes::CUtlString m_outputMaxName; // 0x218 | Schema_Atomic | Size: 0x8
			bool m_bModelFromRenderer; // 0x220 | Schema_Builtin | Size: 0x1
			S2_PAD(0x7); // End padding
		};
		static_assert(offsetof(CS2::particles::C_INIT_RemapParticleCountToNamedModelElementScalar, m_hModel) == 0x208, "m_hModel in C_INIT_RemapParticleCountToNamedModelElementScalar should be at offset 0x208");
		static_assert(offsetof(CS2::particles::C_INIT_RemapParticleCountToNamedModelElementScalar, m_outputMinName) == 0x210, "m_outputMinName in C_INIT_RemapParticleCountToNamedModelElementScalar should be at offset 0x210");
		static_assert(offsetof(CS2::particles::C_INIT_RemapParticleCountToNamedModelElementScalar, m_outputMaxName) == 0x218, "m_outputMaxName in C_INIT_RemapParticleCountToNamedModelElementScalar should be at offset 0x218");
		static_assert(offsetof(CS2::particles::C_INIT_RemapParticleCountToNamedModelElementScalar, m_bModelFromRenderer) == 0x220, "m_bModelFromRenderer in C_INIT_RemapParticleCountToNamedModelElementScalar should be at offset 0x220");
		static_assert(sizeof(CS2::particles::C_INIT_RemapParticleCountToNamedModelElementScalar) == 0x228, "C_INIT_RemapParticleCountToNamedModelElementScalar size should be 0x228");
	}
}
