// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#include <SDK/GlobalTypes.hpp>

#include <SDK/particles/CParticleFunctionInitializer.hpp>
#include <SDK/particles/ParticleAttributeIndex_t.hpp>



namespace CS2 {
	namespace particles {
		class C_INIT_RandomAlpha : public CS2::particles::CParticleFunctionInitializer {
		public:
			particles::ParticleAttributeIndex_t m_nFieldOutput; // 0x1c8 | Schema_DeclaredClass | Size: 0x4
			int32_t m_nAlphaMin; // 0x1cc | Schema_Builtin | Size: 0x4
			int32_t m_nAlphaMax; // 0x1d0 | Schema_Builtin | Size: 0x4
			S2_PAD(0x8);
			float32 m_flAlphaRandExponent; // 0x1dc | Schema_Builtin | Size: 0x4
		};
		static_assert(offsetof(CS2::particles::C_INIT_RandomAlpha, m_nFieldOutput) == 0x1C8, "m_nFieldOutput in C_INIT_RandomAlpha should be at offset 0x1C8");
		static_assert(offsetof(CS2::particles::C_INIT_RandomAlpha, m_nAlphaMin) == 0x1CC, "m_nAlphaMin in C_INIT_RandomAlpha should be at offset 0x1CC");
		static_assert(offsetof(CS2::particles::C_INIT_RandomAlpha, m_nAlphaMax) == 0x1D0, "m_nAlphaMax in C_INIT_RandomAlpha should be at offset 0x1D0");
		static_assert(offsetof(CS2::particles::C_INIT_RandomAlpha, m_flAlphaRandExponent) == 0x1DC, "m_flAlphaRandExponent in C_INIT_RandomAlpha should be at offset 0x1DC");
		static_assert(sizeof(CS2::particles::C_INIT_RandomAlpha) == 0x1E0, "C_INIT_RandomAlpha size should be 0x1E0");
	}
}
