// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#ifndef CUSTOM_GLOBAL_TYPES
	#include <SDK/GlobalTypes.hpp>
#else
	#include <Custom/GlobalTypes.hpp>
#endif


#include <SDK/particles/CParticleFunctionInitializer.hpp>
#include <SDK/particleslib/CParticleTransformInput.hpp>
#include <SDK/particles/ParticleAttributeIndex_t.hpp>



namespace CS2 {
	namespace particles {
		class C_INIT_RemapInitialTransformDirectionToRotation : public CS2::particles::CParticleFunctionInitializer {
		public:
			particleslib::CParticleTransformInput m_TransformInput; // 0x1d8 | Schema_DeclaredClass | Size: 0x68
			particles::ParticleAttributeIndex_t m_nFieldOutput; // 0x240 | Schema_DeclaredClass | Size: 0x4
			float32 m_flOffsetRot; // 0x244 | Schema_Builtin | Size: 0x4
			int32_t m_nComponent; // 0x248 | Schema_Builtin | Size: 0x4
			S2_PAD(0x4); // End padding
		};
		static_assert(offsetof(CS2::particles::C_INIT_RemapInitialTransformDirectionToRotation, m_TransformInput) == 0x1D8, "m_TransformInput in C_INIT_RemapInitialTransformDirectionToRotation should be at offset 0x1D8");
		static_assert(offsetof(CS2::particles::C_INIT_RemapInitialTransformDirectionToRotation, m_nFieldOutput) == 0x240, "m_nFieldOutput in C_INIT_RemapInitialTransformDirectionToRotation should be at offset 0x240");
		static_assert(offsetof(CS2::particles::C_INIT_RemapInitialTransformDirectionToRotation, m_flOffsetRot) == 0x244, "m_flOffsetRot in C_INIT_RemapInitialTransformDirectionToRotation should be at offset 0x244");
		static_assert(offsetof(CS2::particles::C_INIT_RemapInitialTransformDirectionToRotation, m_nComponent) == 0x248, "m_nComponent in C_INIT_RemapInitialTransformDirectionToRotation should be at offset 0x248");
		static_assert(sizeof(CS2::particles::C_INIT_RemapInitialTransformDirectionToRotation) == 0x250, "C_INIT_RemapInitialTransformDirectionToRotation size should be 0x250");
	}
}
