// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#ifndef CUSTOM_GLOBAL_TYPES
	#include <SDK/GlobalTypes.hpp>
#else
	#include <Custom/GlobalTypes.hpp>
#endif


#include <SDK/particles/CParticleFunctionInitializer.hpp>
#include <SDK/particles/ParticleAttributeIndex_t.hpp>
#include <SDK/particles/ParticleSetMethod_t.hpp>



namespace CS2 {
	namespace particles {
		class C_INIT_RemapScalarToVector : public CS2::particles::CParticleFunctionInitializer {
		public:
			particles::ParticleAttributeIndex_t m_nFieldInput; // 0x1d8 | Schema_DeclaredClass | Size: 0x4
			particles::ParticleAttributeIndex_t m_nFieldOutput; // 0x1dc | Schema_DeclaredClass | Size: 0x4
			float32 m_flInputMin; // 0x1e0 | Schema_Builtin | Size: 0x4
			float32 m_flInputMax; // 0x1e4 | Schema_Builtin | Size: 0x4
			GlobalTypes::Vector m_vecOutputMin; // 0x1e8 | Schema_Atomic | Size: 0xc
			GlobalTypes::Vector m_vecOutputMax; // 0x1f4 | Schema_Atomic | Size: 0xc
			float32 m_flStartTime; // 0x200 | Schema_Builtin | Size: 0x4
			float32 m_flEndTime; // 0x204 | Schema_Builtin | Size: 0x4
			particles::ParticleSetMethod_t m_nSetMethod; // 0x208 | Schema_DeclaredEnum | Size: 0x4
			int32_t m_nControlPointNumber; // 0x20c | Schema_Builtin | Size: 0x4
			bool m_bLocalCoords; // 0x210 | Schema_Builtin | Size: 0x1
			S2_PAD(0x3);
			float32 m_flRemapBias; // 0x214 | Schema_Builtin | Size: 0x4
			S2_PAD(0x8); // End padding
		};
		static_assert(offsetof(CS2::particles::C_INIT_RemapScalarToVector, m_nFieldInput) == 0x1D8, "m_nFieldInput in C_INIT_RemapScalarToVector should be at offset 0x1D8");
		static_assert(offsetof(CS2::particles::C_INIT_RemapScalarToVector, m_nFieldOutput) == 0x1DC, "m_nFieldOutput in C_INIT_RemapScalarToVector should be at offset 0x1DC");
		static_assert(offsetof(CS2::particles::C_INIT_RemapScalarToVector, m_flInputMin) == 0x1E0, "m_flInputMin in C_INIT_RemapScalarToVector should be at offset 0x1E0");
		static_assert(offsetof(CS2::particles::C_INIT_RemapScalarToVector, m_flInputMax) == 0x1E4, "m_flInputMax in C_INIT_RemapScalarToVector should be at offset 0x1E4");
		static_assert(offsetof(CS2::particles::C_INIT_RemapScalarToVector, m_vecOutputMin) == 0x1E8, "m_vecOutputMin in C_INIT_RemapScalarToVector should be at offset 0x1E8");
		static_assert(offsetof(CS2::particles::C_INIT_RemapScalarToVector, m_vecOutputMax) == 0x1F4, "m_vecOutputMax in C_INIT_RemapScalarToVector should be at offset 0x1F4");
		static_assert(offsetof(CS2::particles::C_INIT_RemapScalarToVector, m_flStartTime) == 0x200, "m_flStartTime in C_INIT_RemapScalarToVector should be at offset 0x200");
		static_assert(offsetof(CS2::particles::C_INIT_RemapScalarToVector, m_flEndTime) == 0x204, "m_flEndTime in C_INIT_RemapScalarToVector should be at offset 0x204");
		static_assert(offsetof(CS2::particles::C_INIT_RemapScalarToVector, m_nSetMethod) == 0x208, "m_nSetMethod in C_INIT_RemapScalarToVector should be at offset 0x208");
		static_assert(offsetof(CS2::particles::C_INIT_RemapScalarToVector, m_nControlPointNumber) == 0x20C, "m_nControlPointNumber in C_INIT_RemapScalarToVector should be at offset 0x20C");
		static_assert(offsetof(CS2::particles::C_INIT_RemapScalarToVector, m_bLocalCoords) == 0x210, "m_bLocalCoords in C_INIT_RemapScalarToVector should be at offset 0x210");
		static_assert(offsetof(CS2::particles::C_INIT_RemapScalarToVector, m_flRemapBias) == 0x214, "m_flRemapBias in C_INIT_RemapScalarToVector should be at offset 0x214");
		static_assert(sizeof(CS2::particles::C_INIT_RemapScalarToVector) == 0x220, "C_INIT_RemapScalarToVector size should be 0x220");
	}
}
