// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#include <SDK/GlobalTypes.hpp>

#include <SDK/particles/CParticleFunctionInitializer.hpp>
#include <SDK/particles/ParticleTraceSet_t.hpp>



namespace CS2 {
	namespace particles {
		class C_INIT_InitialRepulsionVelocity : public CS2::particles::CParticleFunctionInitializer {
		public:
			char m_CollisionGroupName[128]; // 0x1c8 | Schema_FixedArray | Size: 0x80
			particles::ParticleTraceSet_t m_nTraceSet; // 0x248 | Schema_DeclaredEnum | Size: 0x4
			GlobalTypes::Vector m_vecOutputMin; // 0x24c | Schema_Atomic | Size: 0xc
			GlobalTypes::Vector m_vecOutputMax; // 0x258 | Schema_Atomic | Size: 0xc
			int32_t m_nControlPointNumber; // 0x264 | Schema_Builtin | Size: 0x4
			bool m_bPerParticle; // 0x268 | Schema_Builtin | Size: 0x1
			bool m_bTranslate; // 0x269 | Schema_Builtin | Size: 0x1
			bool m_bProportional; // 0x26a | Schema_Builtin | Size: 0x1
			S2_PAD(0x1);
			float32 m_flTraceLength; // 0x26c | Schema_Builtin | Size: 0x4
			bool m_bPerParticleTR; // 0x270 | Schema_Builtin | Size: 0x1
			bool m_bInherit; // 0x271 | Schema_Builtin | Size: 0x1
			S2_PAD(0x2);
			int32_t m_nChildCP; // 0x274 | Schema_Builtin | Size: 0x4
			int32_t m_nChildGroupID; // 0x278 | Schema_Builtin | Size: 0x4
			S2_PAD(0x4); // End padding
		};
		static_assert(offsetof(CS2::particles::C_INIT_InitialRepulsionVelocity, m_CollisionGroupName) == 0x1C8, "m_CollisionGroupName in C_INIT_InitialRepulsionVelocity should be at offset 0x1C8");
		static_assert(offsetof(CS2::particles::C_INIT_InitialRepulsionVelocity, m_nTraceSet) == 0x248, "m_nTraceSet in C_INIT_InitialRepulsionVelocity should be at offset 0x248");
		static_assert(offsetof(CS2::particles::C_INIT_InitialRepulsionVelocity, m_vecOutputMin) == 0x24C, "m_vecOutputMin in C_INIT_InitialRepulsionVelocity should be at offset 0x24C");
		static_assert(offsetof(CS2::particles::C_INIT_InitialRepulsionVelocity, m_vecOutputMax) == 0x258, "m_vecOutputMax in C_INIT_InitialRepulsionVelocity should be at offset 0x258");
		static_assert(offsetof(CS2::particles::C_INIT_InitialRepulsionVelocity, m_nControlPointNumber) == 0x264, "m_nControlPointNumber in C_INIT_InitialRepulsionVelocity should be at offset 0x264");
		static_assert(offsetof(CS2::particles::C_INIT_InitialRepulsionVelocity, m_bPerParticle) == 0x268, "m_bPerParticle in C_INIT_InitialRepulsionVelocity should be at offset 0x268");
		static_assert(offsetof(CS2::particles::C_INIT_InitialRepulsionVelocity, m_bTranslate) == 0x269, "m_bTranslate in C_INIT_InitialRepulsionVelocity should be at offset 0x269");
		static_assert(offsetof(CS2::particles::C_INIT_InitialRepulsionVelocity, m_bProportional) == 0x26A, "m_bProportional in C_INIT_InitialRepulsionVelocity should be at offset 0x26A");
		static_assert(offsetof(CS2::particles::C_INIT_InitialRepulsionVelocity, m_flTraceLength) == 0x26C, "m_flTraceLength in C_INIT_InitialRepulsionVelocity should be at offset 0x26C");
		static_assert(offsetof(CS2::particles::C_INIT_InitialRepulsionVelocity, m_bPerParticleTR) == 0x270, "m_bPerParticleTR in C_INIT_InitialRepulsionVelocity should be at offset 0x270");
		static_assert(offsetof(CS2::particles::C_INIT_InitialRepulsionVelocity, m_bInherit) == 0x271, "m_bInherit in C_INIT_InitialRepulsionVelocity should be at offset 0x271");
		static_assert(offsetof(CS2::particles::C_INIT_InitialRepulsionVelocity, m_nChildCP) == 0x274, "m_nChildCP in C_INIT_InitialRepulsionVelocity should be at offset 0x274");
		static_assert(offsetof(CS2::particles::C_INIT_InitialRepulsionVelocity, m_nChildGroupID) == 0x278, "m_nChildGroupID in C_INIT_InitialRepulsionVelocity should be at offset 0x278");
		static_assert(sizeof(CS2::particles::C_INIT_InitialRepulsionVelocity) == 0x280, "C_INIT_InitialRepulsionVelocity size should be 0x280");
	}
}
