// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#include <SDK/GlobalTypes.hpp>

#include <SDK/particles/CParticleFunctionInitializer.hpp>
#include <SDK/particleslib/CPerParticleVecInput.hpp>
#include <SDK/particleslib/CPerParticleFloatInput.hpp>
#include <SDK/particleslib/CParticleTransformInput.hpp>



namespace CS2 {
	namespace particles {
		class C_INIT_InitialVelocityNoise : public CS2::particles::CParticleFunctionInitializer {
		public:
			GlobalTypes::Vector m_vecAbsVal; // 0x1c8 | Schema_Atomic | Size: 0xc
			GlobalTypes::Vector m_vecAbsValInv; // 0x1d4 | Schema_Atomic | Size: 0xc
			particleslib::CPerParticleVecInput m_vecOffsetLoc; // 0x1e0 | Schema_DeclaredClass | Size: 0x678
			particleslib::CPerParticleFloatInput m_flOffset; // 0x858 | Schema_DeclaredClass | Size: 0x160
			particleslib::CPerParticleVecInput m_vecOutputMin; // 0x9b8 | Schema_DeclaredClass | Size: 0x678
			particleslib::CPerParticleVecInput m_vecOutputMax; // 0x1030 | Schema_DeclaredClass | Size: 0x678
			particleslib::CPerParticleFloatInput m_flNoiseScale; // 0x16a8 | Schema_DeclaredClass | Size: 0x160
			particleslib::CPerParticleFloatInput m_flNoiseScaleLoc; // 0x1808 | Schema_DeclaredClass | Size: 0x160
			particleslib::CParticleTransformInput m_TransformInput; // 0x1968 | Schema_DeclaredClass | Size: 0x68
			bool m_bIgnoreDt; // 0x19d0 | Schema_Builtin | Size: 0x1
			S2_PAD(0x7); // End padding
		};
		static_assert(offsetof(CS2::particles::C_INIT_InitialVelocityNoise, m_vecAbsVal) == 0x1C8, "m_vecAbsVal in C_INIT_InitialVelocityNoise should be at offset 0x1C8");
		static_assert(offsetof(CS2::particles::C_INIT_InitialVelocityNoise, m_vecAbsValInv) == 0x1D4, "m_vecAbsValInv in C_INIT_InitialVelocityNoise should be at offset 0x1D4");
		static_assert(offsetof(CS2::particles::C_INIT_InitialVelocityNoise, m_vecOffsetLoc) == 0x1E0, "m_vecOffsetLoc in C_INIT_InitialVelocityNoise should be at offset 0x1E0");
		static_assert(offsetof(CS2::particles::C_INIT_InitialVelocityNoise, m_flOffset) == 0x858, "m_flOffset in C_INIT_InitialVelocityNoise should be at offset 0x858");
		static_assert(offsetof(CS2::particles::C_INIT_InitialVelocityNoise, m_vecOutputMin) == 0x9B8, "m_vecOutputMin in C_INIT_InitialVelocityNoise should be at offset 0x9B8");
		static_assert(offsetof(CS2::particles::C_INIT_InitialVelocityNoise, m_vecOutputMax) == 0x1030, "m_vecOutputMax in C_INIT_InitialVelocityNoise should be at offset 0x1030");
		static_assert(offsetof(CS2::particles::C_INIT_InitialVelocityNoise, m_flNoiseScale) == 0x16A8, "m_flNoiseScale in C_INIT_InitialVelocityNoise should be at offset 0x16A8");
		static_assert(offsetof(CS2::particles::C_INIT_InitialVelocityNoise, m_flNoiseScaleLoc) == 0x1808, "m_flNoiseScaleLoc in C_INIT_InitialVelocityNoise should be at offset 0x1808");
		static_assert(offsetof(CS2::particles::C_INIT_InitialVelocityNoise, m_TransformInput) == 0x1968, "m_TransformInput in C_INIT_InitialVelocityNoise should be at offset 0x1968");
		static_assert(offsetof(CS2::particles::C_INIT_InitialVelocityNoise, m_bIgnoreDt) == 0x19D0, "m_bIgnoreDt in C_INIT_InitialVelocityNoise should be at offset 0x19D0");
		static_assert(sizeof(CS2::particles::C_INIT_InitialVelocityNoise) == 0x19D8, "C_INIT_InitialVelocityNoise size should be 0x19D8");
	}
}
