// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#ifndef CUSTOM_GLOBAL_TYPES
	#include <SDK/GlobalTypes.hpp>
#else
	#include <Custom/GlobalTypes.hpp>
#endif


#include <SDK/particles/CParticleFunctionInitializer.hpp>
#include <SDK/particles/ParticleAttributeIndex_t.hpp>





using namespace GlobalTypes;
namespace CS2 {
	namespace particles {
		class C_INIT_RandomScalar : public CS2::particles::CParticleFunctionInitializer {
		public:
			float32 m_flMin; // 0x1d8 | Schema_Builtin | Size: 0x4
			float32 m_flMax; // 0x1dc | Schema_Builtin | Size: 0x4
			float32 m_flExponent; // 0x1e0 | Schema_Builtin | Size: 0x4
			particles::ParticleAttributeIndex_t m_nFieldOutput; // 0x1e4 | Schema_DeclaredClass | Size: 0x4
		};
		static_assert(offsetof(CS2::particles::C_INIT_RandomScalar, m_flMin) == 0x1D8, "m_flMin in C_INIT_RandomScalar should be at offset 0x1D8");
		static_assert(offsetof(CS2::particles::C_INIT_RandomScalar, m_flMax) == 0x1DC, "m_flMax in C_INIT_RandomScalar should be at offset 0x1DC");
		static_assert(offsetof(CS2::particles::C_INIT_RandomScalar, m_flExponent) == 0x1E0, "m_flExponent in C_INIT_RandomScalar should be at offset 0x1E0");
		static_assert(offsetof(CS2::particles::C_INIT_RandomScalar, m_nFieldOutput) == 0x1E4, "m_nFieldOutput in C_INIT_RandomScalar should be at offset 0x1E4");
		static_assert(sizeof(CS2::particles::C_INIT_RandomScalar) == 0x1E8, "C_INIT_RandomScalar size should be 0x1E8");
	}
}
