// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#include <SDK/GlobalTypes.hpp>

#include <SDK/particles/CParticleFunctionInitializer.hpp>
#include <SDK/particleslib/CPerParticleFloatInput.hpp>
#include <SDK/particles/ParticleTraceSet_t.hpp>
#include <SDK/particles/ParticleTraceMissBehavior_t.hpp>
#include <SDK/particles/ParticleAttributeIndex_t.hpp>



namespace CS2 {
	namespace particles {
		class C_INIT_PositionPlaceOnGround : public CS2::particles::CParticleFunctionInitializer {
		public:
			particleslib::CPerParticleFloatInput m_flOffset; // 0x1d8 | Schema_DeclaredClass | Size: 0x170
			particleslib::CPerParticleFloatInput m_flMaxTraceLength; // 0x348 | Schema_DeclaredClass | Size: 0x170
			char m_CollisionGroupName[128]; // 0x4b8 | Schema_FixedArray | Size: 0x80
			particles::ParticleTraceSet_t m_nTraceSet; // 0x538 | Schema_DeclaredEnum | Size: 0x4
			S2_PAD(0xc);
			particles::ParticleTraceMissBehavior_t m_nTraceMissBehavior; // 0x548 | Schema_DeclaredEnum | Size: 0x4
			bool m_bIncludeWater; // 0x54c | Schema_Builtin | Size: 0x1
			bool m_bSetNormal; // 0x54d | Schema_Builtin | Size: 0x1
			S2_PAD(0x2);
			particles::ParticleAttributeIndex_t m_nAttribute; // 0x550 | Schema_DeclaredClass | Size: 0x4
			bool m_bSetPXYZOnly; // 0x554 | Schema_Builtin | Size: 0x1
			bool m_bTraceAlongNormal; // 0x555 | Schema_Builtin | Size: 0x1
			S2_PAD(0x2);
			particles::ParticleAttributeIndex_t m_nTraceDirectionAttribute; // 0x558 | Schema_DeclaredClass | Size: 0x4
			bool m_bOffsetonColOnly; // 0x55c | Schema_Builtin | Size: 0x1
			S2_PAD(0x3);
			float32 m_flOffsetByRadiusFactor; // 0x560 | Schema_Builtin | Size: 0x4
			int32_t m_nPreserveOffsetCP; // 0x564 | Schema_Builtin | Size: 0x4
			int32_t m_nIgnoreCP; // 0x568 | Schema_Builtin | Size: 0x4
			S2_PAD(0x4); // End padding
		};
		static_assert(offsetof(CS2::particles::C_INIT_PositionPlaceOnGround, m_flOffset) == 0x1D8, "m_flOffset in C_INIT_PositionPlaceOnGround should be at offset 0x1D8");
		static_assert(offsetof(CS2::particles::C_INIT_PositionPlaceOnGround, m_flMaxTraceLength) == 0x348, "m_flMaxTraceLength in C_INIT_PositionPlaceOnGround should be at offset 0x348");
		static_assert(offsetof(CS2::particles::C_INIT_PositionPlaceOnGround, m_CollisionGroupName) == 0x4B8, "m_CollisionGroupName in C_INIT_PositionPlaceOnGround should be at offset 0x4B8");
		static_assert(offsetof(CS2::particles::C_INIT_PositionPlaceOnGround, m_nTraceSet) == 0x538, "m_nTraceSet in C_INIT_PositionPlaceOnGround should be at offset 0x538");
		static_assert(offsetof(CS2::particles::C_INIT_PositionPlaceOnGround, m_nTraceMissBehavior) == 0x548, "m_nTraceMissBehavior in C_INIT_PositionPlaceOnGround should be at offset 0x548");
		static_assert(offsetof(CS2::particles::C_INIT_PositionPlaceOnGround, m_bIncludeWater) == 0x54C, "m_bIncludeWater in C_INIT_PositionPlaceOnGround should be at offset 0x54C");
		static_assert(offsetof(CS2::particles::C_INIT_PositionPlaceOnGround, m_bSetNormal) == 0x54D, "m_bSetNormal in C_INIT_PositionPlaceOnGround should be at offset 0x54D");
		static_assert(offsetof(CS2::particles::C_INIT_PositionPlaceOnGround, m_nAttribute) == 0x550, "m_nAttribute in C_INIT_PositionPlaceOnGround should be at offset 0x550");
		static_assert(offsetof(CS2::particles::C_INIT_PositionPlaceOnGround, m_bSetPXYZOnly) == 0x554, "m_bSetPXYZOnly in C_INIT_PositionPlaceOnGround should be at offset 0x554");
		static_assert(offsetof(CS2::particles::C_INIT_PositionPlaceOnGround, m_bTraceAlongNormal) == 0x555, "m_bTraceAlongNormal in C_INIT_PositionPlaceOnGround should be at offset 0x555");
		static_assert(offsetof(CS2::particles::C_INIT_PositionPlaceOnGround, m_nTraceDirectionAttribute) == 0x558, "m_nTraceDirectionAttribute in C_INIT_PositionPlaceOnGround should be at offset 0x558");
		static_assert(offsetof(CS2::particles::C_INIT_PositionPlaceOnGround, m_bOffsetonColOnly) == 0x55C, "m_bOffsetonColOnly in C_INIT_PositionPlaceOnGround should be at offset 0x55C");
		static_assert(offsetof(CS2::particles::C_INIT_PositionPlaceOnGround, m_flOffsetByRadiusFactor) == 0x560, "m_flOffsetByRadiusFactor in C_INIT_PositionPlaceOnGround should be at offset 0x560");
		static_assert(offsetof(CS2::particles::C_INIT_PositionPlaceOnGround, m_nPreserveOffsetCP) == 0x564, "m_nPreserveOffsetCP in C_INIT_PositionPlaceOnGround should be at offset 0x564");
		static_assert(offsetof(CS2::particles::C_INIT_PositionPlaceOnGround, m_nIgnoreCP) == 0x568, "m_nIgnoreCP in C_INIT_PositionPlaceOnGround should be at offset 0x568");
		static_assert(sizeof(CS2::particles::C_INIT_PositionPlaceOnGround) == 0x570, "C_INIT_PositionPlaceOnGround size should be 0x570");
	}
}
