// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#include <SDK/GlobalTypes.hpp>

#include <SDK/particles/CParticleFunctionInitializer.hpp>
#include <SDK/particleslib/CPerParticleFloatInput.hpp>
#include <SDK/particles/ParticleAttributeIndex_t.hpp>
#include <SDK/particleslib/CParticleRemapFloatInput.hpp>
#include <SDK/particles/ParticleSetMethod_t.hpp>



namespace CS2 {
	namespace particles {
		class C_INIT_CheckParticleForWater : public CS2::particles::CParticleFunctionInitializer {
		public:
			particleslib::CPerParticleFloatInput m_flRadius; // 0x1c8 | Schema_DeclaredClass | Size: 0x160
			particles::ParticleAttributeIndex_t m_nFieldOutput; // 0x328 | Schema_DeclaredClass | Size: 0x4
			S2_PAD(0x4);
			particleslib::CParticleRemapFloatInput m_flOutputRemap; // 0x330 | Schema_DeclaredClass | Size: 0x160
			particles::ParticleSetMethod_t m_nSetMethod; // 0x490 | Schema_DeclaredEnum | Size: 0x4
			S2_PAD(0x4); // End padding
		};
		static_assert(offsetof(CS2::particles::C_INIT_CheckParticleForWater, m_flRadius) == 0x1C8, "m_flRadius in C_INIT_CheckParticleForWater should be at offset 0x1C8");
		static_assert(offsetof(CS2::particles::C_INIT_CheckParticleForWater, m_nFieldOutput) == 0x328, "m_nFieldOutput in C_INIT_CheckParticleForWater should be at offset 0x328");
		static_assert(offsetof(CS2::particles::C_INIT_CheckParticleForWater, m_flOutputRemap) == 0x330, "m_flOutputRemap in C_INIT_CheckParticleForWater should be at offset 0x330");
		static_assert(offsetof(CS2::particles::C_INIT_CheckParticleForWater, m_nSetMethod) == 0x490, "m_nSetMethod in C_INIT_CheckParticleForWater should be at offset 0x490");
		static_assert(sizeof(CS2::particles::C_INIT_CheckParticleForWater) == 0x498, "C_INIT_CheckParticleForWater size should be 0x498");
	}
}
