// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#include <SDK/GlobalTypes.hpp>

#include <SDK/particles/CParticleFunctionInitializer.hpp>
#include <SDK/particles/ParticleAttributeIndex_t.hpp>
#include <SDK/particles/ParticleSetMethod_t.hpp>



namespace CS2 {
	namespace particles {
		class C_INIT_RemapScalar : public CS2::particles::CParticleFunctionInitializer {
		public:
			particles::ParticleAttributeIndex_t m_nFieldInput; // 0x1c8 | Schema_DeclaredClass | Size: 0x4
			particles::ParticleAttributeIndex_t m_nFieldOutput; // 0x1cc | Schema_DeclaredClass | Size: 0x4
			float32 m_flInputMin; // 0x1d0 | Schema_Builtin | Size: 0x4
			float32 m_flInputMax; // 0x1d4 | Schema_Builtin | Size: 0x4
			float32 m_flOutputMin; // 0x1d8 | Schema_Builtin | Size: 0x4
			float32 m_flOutputMax; // 0x1dc | Schema_Builtin | Size: 0x4
			float32 m_flStartTime; // 0x1e0 | Schema_Builtin | Size: 0x4
			float32 m_flEndTime; // 0x1e4 | Schema_Builtin | Size: 0x4
			particles::ParticleSetMethod_t m_nSetMethod; // 0x1e8 | Schema_DeclaredEnum | Size: 0x4
			bool m_bActiveRange; // 0x1ec | Schema_Builtin | Size: 0x1
			S2_PAD(0x3);
			float32 m_flRemapBias; // 0x1f0 | Schema_Builtin | Size: 0x4
			S2_PAD(0x4); // End padding
		};
		static_assert(offsetof(CS2::particles::C_INIT_RemapScalar, m_nFieldInput) == 0x1C8, "m_nFieldInput in C_INIT_RemapScalar should be at offset 0x1C8");
		static_assert(offsetof(CS2::particles::C_INIT_RemapScalar, m_nFieldOutput) == 0x1CC, "m_nFieldOutput in C_INIT_RemapScalar should be at offset 0x1CC");
		static_assert(offsetof(CS2::particles::C_INIT_RemapScalar, m_flInputMin) == 0x1D0, "m_flInputMin in C_INIT_RemapScalar should be at offset 0x1D0");
		static_assert(offsetof(CS2::particles::C_INIT_RemapScalar, m_flInputMax) == 0x1D4, "m_flInputMax in C_INIT_RemapScalar should be at offset 0x1D4");
		static_assert(offsetof(CS2::particles::C_INIT_RemapScalar, m_flOutputMin) == 0x1D8, "m_flOutputMin in C_INIT_RemapScalar should be at offset 0x1D8");
		static_assert(offsetof(CS2::particles::C_INIT_RemapScalar, m_flOutputMax) == 0x1DC, "m_flOutputMax in C_INIT_RemapScalar should be at offset 0x1DC");
		static_assert(offsetof(CS2::particles::C_INIT_RemapScalar, m_flStartTime) == 0x1E0, "m_flStartTime in C_INIT_RemapScalar should be at offset 0x1E0");
		static_assert(offsetof(CS2::particles::C_INIT_RemapScalar, m_flEndTime) == 0x1E4, "m_flEndTime in C_INIT_RemapScalar should be at offset 0x1E4");
		static_assert(offsetof(CS2::particles::C_INIT_RemapScalar, m_nSetMethod) == 0x1E8, "m_nSetMethod in C_INIT_RemapScalar should be at offset 0x1E8");
		static_assert(offsetof(CS2::particles::C_INIT_RemapScalar, m_bActiveRange) == 0x1EC, "m_bActiveRange in C_INIT_RemapScalar should be at offset 0x1EC");
		static_assert(offsetof(CS2::particles::C_INIT_RemapScalar, m_flRemapBias) == 0x1F0, "m_flRemapBias in C_INIT_RemapScalar should be at offset 0x1F0");
		static_assert(sizeof(CS2::particles::C_INIT_RemapScalar) == 0x1F8, "C_INIT_RemapScalar size should be 0x1F8");
	}
}
