// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#ifndef CUSTOM_GLOBAL_TYPES
	#include <SDK/GlobalTypes.hpp>
#else
	#include <Custom/GlobalTypes.hpp>
#endif


#include <SDK/particles/CParticleFunctionInitializer.hpp>
#include <SDK/particles/ParticleAttributeIndex_t.hpp>



namespace CS2 {
	namespace particles {
		class C_INIT_PointList : public CS2::particles::CParticleFunctionInitializer {
		public:
			particles::ParticleAttributeIndex_t m_nFieldOutput; // 0x1d8 | Schema_DeclaredClass | Size: 0x4
			S2_PAD(0x4);
			// GlobalTypes::CUtlVector< particles::PointDefinition_t > m_pointList; // 0x1e0 | Schema_Atomic | Size: 0x18
			char  m_pointList[0x18]; // 0x1e0 | Schema_Atomic | Size: 0x18
			bool m_bPlaceAlongPath; // 0x1f8 | Schema_Builtin | Size: 0x1
			bool m_bClosedLoop; // 0x1f9 | Schema_Builtin | Size: 0x1
			S2_PAD(0x2);
			int32_t m_nNumPointsAlongPath; // 0x1fc | Schema_Builtin | Size: 0x4
		};
		static_assert(offsetof(CS2::particles::C_INIT_PointList, m_nFieldOutput) == 0x1D8, "m_nFieldOutput in C_INIT_PointList should be at offset 0x1D8");
		static_assert(offsetof(CS2::particles::C_INIT_PointList, m_pointList) == 0x1E0, "m_pointList in C_INIT_PointList should be at offset 0x1E0");
		static_assert(offsetof(CS2::particles::C_INIT_PointList, m_bPlaceAlongPath) == 0x1F8, "m_bPlaceAlongPath in C_INIT_PointList should be at offset 0x1F8");
		static_assert(offsetof(CS2::particles::C_INIT_PointList, m_bClosedLoop) == 0x1F9, "m_bClosedLoop in C_INIT_PointList should be at offset 0x1F9");
		static_assert(offsetof(CS2::particles::C_INIT_PointList, m_nNumPointsAlongPath) == 0x1FC, "m_nNumPointsAlongPath in C_INIT_PointList should be at offset 0x1FC");
		static_assert(sizeof(CS2::particles::C_INIT_PointList) == 0x200, "C_INIT_PointList size should be 0x200");
	}
}
