// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#ifndef CUSTOM_GLOBAL_TYPES
	#include <SDK/GlobalTypes.hpp>
#else
	#include <Custom/GlobalTypes.hpp>
#endif


#include <SDK/particles/CParticleFunctionInitializer.hpp>



namespace CS2 {
	namespace particles {
		class C_INIT_InitialVelocityFromHitbox : public CS2::particles::CParticleFunctionInitializer {
		public:
			float32 m_flVelocityMin; // 0x1d8 | Schema_Builtin | Size: 0x4
			float32 m_flVelocityMax; // 0x1dc | Schema_Builtin | Size: 0x4
			int32_t m_nControlPointNumber; // 0x1e0 | Schema_Builtin | Size: 0x4
			char m_HitboxSetName[128]; // 0x1e4 | Schema_FixedArray | Size: 0x80
			bool m_bUseBones; // 0x264 | Schema_Builtin | Size: 0x1
			S2_PAD(0x3); // End padding
		};
		static_assert(offsetof(CS2::particles::C_INIT_InitialVelocityFromHitbox, m_flVelocityMin) == 0x1D8, "m_flVelocityMin in C_INIT_InitialVelocityFromHitbox should be at offset 0x1D8");
		static_assert(offsetof(CS2::particles::C_INIT_InitialVelocityFromHitbox, m_flVelocityMax) == 0x1DC, "m_flVelocityMax in C_INIT_InitialVelocityFromHitbox should be at offset 0x1DC");
		static_assert(offsetof(CS2::particles::C_INIT_InitialVelocityFromHitbox, m_nControlPointNumber) == 0x1E0, "m_nControlPointNumber in C_INIT_InitialVelocityFromHitbox should be at offset 0x1E0");
		static_assert(offsetof(CS2::particles::C_INIT_InitialVelocityFromHitbox, m_HitboxSetName) == 0x1E4, "m_HitboxSetName in C_INIT_InitialVelocityFromHitbox should be at offset 0x1E4");
		static_assert(offsetof(CS2::particles::C_INIT_InitialVelocityFromHitbox, m_bUseBones) == 0x264, "m_bUseBones in C_INIT_InitialVelocityFromHitbox should be at offset 0x264");
		static_assert(sizeof(CS2::particles::C_INIT_InitialVelocityFromHitbox) == 0x268, "C_INIT_InitialVelocityFromHitbox size should be 0x268");
	}
}
