// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#include <SDK/GlobalTypes.hpp>

#include <SDK/particles/CParticleFunctionInitializer.hpp>
#include <SDK/particleslib/CParticleTransformInput.hpp>



namespace CS2 {
	namespace particles {
		class C_INIT_RemapTransformOrientationToRotations : public CS2::particles::CParticleFunctionInitializer {
		public:
			particleslib::CParticleTransformInput m_TransformInput; // 0x1d8 | Schema_DeclaredClass | Size: 0x68
			GlobalTypes::Vector m_vecRotation; // 0x240 | Schema_Atomic | Size: 0xc
			bool m_bUseQuat; // 0x24c | Schema_Builtin | Size: 0x1
			bool m_bWriteNormal; // 0x24d | Schema_Builtin | Size: 0x1
			S2_PAD(0x2); // End padding
		};
		static_assert(offsetof(CS2::particles::C_INIT_RemapTransformOrientationToRotations, m_TransformInput) == 0x1D8, "m_TransformInput in C_INIT_RemapTransformOrientationToRotations should be at offset 0x1D8");
		static_assert(offsetof(CS2::particles::C_INIT_RemapTransformOrientationToRotations, m_vecRotation) == 0x240, "m_vecRotation in C_INIT_RemapTransformOrientationToRotations should be at offset 0x240");
		static_assert(offsetof(CS2::particles::C_INIT_RemapTransformOrientationToRotations, m_bUseQuat) == 0x24C, "m_bUseQuat in C_INIT_RemapTransformOrientationToRotations should be at offset 0x24C");
		static_assert(offsetof(CS2::particles::C_INIT_RemapTransformOrientationToRotations, m_bWriteNormal) == 0x24D, "m_bWriteNormal in C_INIT_RemapTransformOrientationToRotations should be at offset 0x24D");
		static_assert(sizeof(CS2::particles::C_INIT_RemapTransformOrientationToRotations) == 0x250, "C_INIT_RemapTransformOrientationToRotations size should be 0x250");
	}
}
