// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#include <SDK/GlobalTypes.hpp>

#include <SDK/particles/CParticleFunctionInitializer.hpp>



namespace CS2 {
	namespace particles {
		class C_INIT_RandomSequence : public CS2::particles::CParticleFunctionInitializer {
		public:
			int32_t m_nSequenceMin; // 0x1c8 | Schema_Builtin | Size: 0x4
			int32_t m_nSequenceMax; // 0x1cc | Schema_Builtin | Size: 0x4
			bool m_bShuffle; // 0x1d0 | Schema_Builtin | Size: 0x1
			bool m_bLinear; // 0x1d1 | Schema_Builtin | Size: 0x1
			S2_PAD(0x6);
			// GlobalTypes::CUtlVector< particles::SequenceWeightedList_t > m_WeightedList; // 0x1d8 | Schema_Atomic | Size: 0x18
			char  m_WeightedList[0x18]; // 0x1d8 | Schema_Atomic | Size: 0x18
			S2_PAD(0x8); // End padding
		};
		static_assert(offsetof(CS2::particles::C_INIT_RandomSequence, m_nSequenceMin) == 0x1C8, "m_nSequenceMin in C_INIT_RandomSequence should be at offset 0x1C8");
		static_assert(offsetof(CS2::particles::C_INIT_RandomSequence, m_nSequenceMax) == 0x1CC, "m_nSequenceMax in C_INIT_RandomSequence should be at offset 0x1CC");
		static_assert(offsetof(CS2::particles::C_INIT_RandomSequence, m_bShuffle) == 0x1D0, "m_bShuffle in C_INIT_RandomSequence should be at offset 0x1D0");
		static_assert(offsetof(CS2::particles::C_INIT_RandomSequence, m_bLinear) == 0x1D1, "m_bLinear in C_INIT_RandomSequence should be at offset 0x1D1");
		static_assert(offsetof(CS2::particles::C_INIT_RandomSequence, m_WeightedList) == 0x1D8, "m_WeightedList in C_INIT_RandomSequence should be at offset 0x1D8");
		static_assert(sizeof(CS2::particles::C_INIT_RandomSequence) == 0x1F8, "C_INIT_RandomSequence size should be 0x1F8");
	}
}
