// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#include <SDK/GlobalTypes.hpp>

#include <SDK/particles/CParticleFunctionInitializer.hpp>
#include <SDK/particleslib/CPerParticleFloatInput.hpp>
#include <SDK/particleslib/CParticleCollectionFloatInput.hpp>
#include <SDK/particles/CPathParameters.hpp>



namespace CS2 {
	namespace particles {
		class C_INIT_CreateSequentialPathV2 : public CS2::particles::CParticleFunctionInitializer {
		public:
			particleslib::CPerParticleFloatInput m_fMaxDistance; // 0x1c8 | Schema_DeclaredClass | Size: 0x160
			particleslib::CParticleCollectionFloatInput m_flNumToAssign; // 0x328 | Schema_DeclaredClass | Size: 0x160
			bool m_bLoop; // 0x488 | Schema_Builtin | Size: 0x1
			bool m_bCPPairs; // 0x489 | Schema_Builtin | Size: 0x1
			bool m_bSaveOffset; // 0x48a | Schema_Builtin | Size: 0x1
			S2_PAD(0x5);
			particles::CPathParameters m_PathParams; // 0x490 | Schema_DeclaredClass | Size: 0x40
			S2_PAD(0x10); // End padding
		};
		static_assert(offsetof(CS2::particles::C_INIT_CreateSequentialPathV2, m_fMaxDistance) == 0x1C8, "m_fMaxDistance in C_INIT_CreateSequentialPathV2 should be at offset 0x1C8");
		static_assert(offsetof(CS2::particles::C_INIT_CreateSequentialPathV2, m_flNumToAssign) == 0x328, "m_flNumToAssign in C_INIT_CreateSequentialPathV2 should be at offset 0x328");
		static_assert(offsetof(CS2::particles::C_INIT_CreateSequentialPathV2, m_bLoop) == 0x488, "m_bLoop in C_INIT_CreateSequentialPathV2 should be at offset 0x488");
		static_assert(offsetof(CS2::particles::C_INIT_CreateSequentialPathV2, m_bCPPairs) == 0x489, "m_bCPPairs in C_INIT_CreateSequentialPathV2 should be at offset 0x489");
		static_assert(offsetof(CS2::particles::C_INIT_CreateSequentialPathV2, m_bSaveOffset) == 0x48A, "m_bSaveOffset in C_INIT_CreateSequentialPathV2 should be at offset 0x48A");
		static_assert(offsetof(CS2::particles::C_INIT_CreateSequentialPathV2, m_PathParams) == 0x490, "m_PathParams in C_INIT_CreateSequentialPathV2 should be at offset 0x490");
		static_assert(sizeof(CS2::particles::C_INIT_CreateSequentialPathV2) == 0x4E0, "C_INIT_CreateSequentialPathV2 size should be 0x4E0");
	}
}
