// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#include <SDK/GlobalTypes.hpp>

#include <SDK/particles/CParticleFunctionOperator.hpp>
#include <SDK/particles/ParticleAttributeIndex_t.hpp>
#include <SDK/particleslib/CParticleCollectionFloatInput.hpp>
#include <SDK/particles/ParticleSetMethod_t.hpp>



namespace CS2 {
	namespace particles {
		class C_OP_RemapParticleCountToScalar : public CS2::particles::CParticleFunctionOperator {
		public:
			particles::ParticleAttributeIndex_t m_nFieldOutput; // 0x1d0 | Schema_DeclaredClass | Size: 0x4
			S2_PAD(0x4);
			particleslib::CParticleCollectionFloatInput m_nInputMin; // 0x1d8 | Schema_DeclaredClass | Size: 0x170
			particleslib::CParticleCollectionFloatInput m_nInputMax; // 0x348 | Schema_DeclaredClass | Size: 0x170
			particleslib::CParticleCollectionFloatInput m_flOutputMin; // 0x4b8 | Schema_DeclaredClass | Size: 0x170
			particleslib::CParticleCollectionFloatInput m_flOutputMax; // 0x628 | Schema_DeclaredClass | Size: 0x170
			bool m_bActiveRange; // 0x798 | Schema_Builtin | Size: 0x1
			S2_PAD(0x3);
			particles::ParticleSetMethod_t m_nSetMethod; // 0x79c | Schema_DeclaredEnum | Size: 0x4
		};
		static_assert(offsetof(CS2::particles::C_OP_RemapParticleCountToScalar, m_nFieldOutput) == 0x1D0, "m_nFieldOutput in C_OP_RemapParticleCountToScalar should be at offset 0x1D0");
		static_assert(offsetof(CS2::particles::C_OP_RemapParticleCountToScalar, m_nInputMin) == 0x1D8, "m_nInputMin in C_OP_RemapParticleCountToScalar should be at offset 0x1D8");
		static_assert(offsetof(CS2::particles::C_OP_RemapParticleCountToScalar, m_nInputMax) == 0x348, "m_nInputMax in C_OP_RemapParticleCountToScalar should be at offset 0x348");
		static_assert(offsetof(CS2::particles::C_OP_RemapParticleCountToScalar, m_flOutputMin) == 0x4B8, "m_flOutputMin in C_OP_RemapParticleCountToScalar should be at offset 0x4B8");
		static_assert(offsetof(CS2::particles::C_OP_RemapParticleCountToScalar, m_flOutputMax) == 0x628, "m_flOutputMax in C_OP_RemapParticleCountToScalar should be at offset 0x628");
		static_assert(offsetof(CS2::particles::C_OP_RemapParticleCountToScalar, m_bActiveRange) == 0x798, "m_bActiveRange in C_OP_RemapParticleCountToScalar should be at offset 0x798");
		static_assert(offsetof(CS2::particles::C_OP_RemapParticleCountToScalar, m_nSetMethod) == 0x79C, "m_nSetMethod in C_OP_RemapParticleCountToScalar should be at offset 0x79C");
		static_assert(sizeof(CS2::particles::C_OP_RemapParticleCountToScalar) == 0x7A0, "C_OP_RemapParticleCountToScalar size should be 0x7A0");
	}
}
