// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#include <SDK/GlobalTypes.hpp>

#include <SDK/particles/CParticleFunctionOperator.hpp>
#include <SDK/particles/ParticleAttributeIndex_t.hpp>
#include <SDK/particles/ParticleSetMethod_t.hpp>



namespace CS2 {
	namespace particles {
		class C_OP_SequenceFromModel : public CS2::particles::CParticleFunctionOperator {
		public:
			int32_t m_nControlPointNumber; // 0x1c0 | Schema_Builtin | Size: 0x4
			particles::ParticleAttributeIndex_t m_nFieldOutput; // 0x1c4 | Schema_DeclaredClass | Size: 0x4
			particles::ParticleAttributeIndex_t m_nFieldOutputAnim; // 0x1c8 | Schema_DeclaredClass | Size: 0x4
			float32 m_flInputMin; // 0x1cc | Schema_Builtin | Size: 0x4
			float32 m_flInputMax; // 0x1d0 | Schema_Builtin | Size: 0x4
			float32 m_flOutputMin; // 0x1d4 | Schema_Builtin | Size: 0x4
			float32 m_flOutputMax; // 0x1d8 | Schema_Builtin | Size: 0x4
			particles::ParticleSetMethod_t m_nSetMethod; // 0x1dc | Schema_DeclaredEnum | Size: 0x4
		};
		static_assert(offsetof(CS2::particles::C_OP_SequenceFromModel, m_nControlPointNumber) == 0x1C0, "m_nControlPointNumber in C_OP_SequenceFromModel should be at offset 0x1C0");
		static_assert(offsetof(CS2::particles::C_OP_SequenceFromModel, m_nFieldOutput) == 0x1C4, "m_nFieldOutput in C_OP_SequenceFromModel should be at offset 0x1C4");
		static_assert(offsetof(CS2::particles::C_OP_SequenceFromModel, m_nFieldOutputAnim) == 0x1C8, "m_nFieldOutputAnim in C_OP_SequenceFromModel should be at offset 0x1C8");
		static_assert(offsetof(CS2::particles::C_OP_SequenceFromModel, m_flInputMin) == 0x1CC, "m_flInputMin in C_OP_SequenceFromModel should be at offset 0x1CC");
		static_assert(offsetof(CS2::particles::C_OP_SequenceFromModel, m_flInputMax) == 0x1D0, "m_flInputMax in C_OP_SequenceFromModel should be at offset 0x1D0");
		static_assert(offsetof(CS2::particles::C_OP_SequenceFromModel, m_flOutputMin) == 0x1D4, "m_flOutputMin in C_OP_SequenceFromModel should be at offset 0x1D4");
		static_assert(offsetof(CS2::particles::C_OP_SequenceFromModel, m_flOutputMax) == 0x1D8, "m_flOutputMax in C_OP_SequenceFromModel should be at offset 0x1D8");
		static_assert(offsetof(CS2::particles::C_OP_SequenceFromModel, m_nSetMethod) == 0x1DC, "m_nSetMethod in C_OP_SequenceFromModel should be at offset 0x1DC");
		static_assert(sizeof(CS2::particles::C_OP_SequenceFromModel) == 0x1E0, "C_OP_SequenceFromModel size should be 0x1E0");
	}
}
