// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#ifndef CUSTOM_GLOBAL_TYPES
	#include <SDK/GlobalTypes.hpp>
#else
	#include <Custom/GlobalTypes.hpp>
#endif


#include <SDK/particles/CParticleFunctionOperator.hpp>
#include <SDK/particleslib/CParticleCollectionVecInput.hpp>





using namespace GlobalTypes;
namespace CS2 {
	namespace particles {
		class C_OP_PlaneCull : public CS2::particles::CParticleFunctionOperator {
		public:
			int32_t m_nPlaneControlPoint; // 0x1d0 | Schema_Builtin | Size: 0x4
			S2_PAD(0x4);
			particleslib::CParticleCollectionVecInput m_vecPlaneDirection; // 0x1d8 | Schema_DeclaredClass | Size: 0x6b8
			bool m_bLocalSpace; // 0x890 | Schema_Builtin | Size: 0x1
			S2_PAD(0x3);
			float32 m_flPlaneOffset; // 0x894 | Schema_Builtin | Size: 0x4
		};
		static_assert(offsetof(CS2::particles::C_OP_PlaneCull, m_nPlaneControlPoint) == 0x1D0, "m_nPlaneControlPoint in C_OP_PlaneCull should be at offset 0x1D0");
		static_assert(offsetof(CS2::particles::C_OP_PlaneCull, m_vecPlaneDirection) == 0x1D8, "m_vecPlaneDirection in C_OP_PlaneCull should be at offset 0x1D8");
		static_assert(offsetof(CS2::particles::C_OP_PlaneCull, m_bLocalSpace) == 0x890, "m_bLocalSpace in C_OP_PlaneCull should be at offset 0x890");
		static_assert(offsetof(CS2::particles::C_OP_PlaneCull, m_flPlaneOffset) == 0x894, "m_flPlaneOffset in C_OP_PlaneCull should be at offset 0x894");
		static_assert(sizeof(CS2::particles::C_OP_PlaneCull) == 0x898, "C_OP_PlaneCull size should be 0x898");
	}
}
