// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#include <SDK/GlobalTypes.hpp>

#include <SDK/particles/CParticleFunctionOperator.hpp>
#include <SDK/particles/ParticleAttributeIndex_t.hpp>



namespace CS2 {
	namespace particles {
		class C_OP_SetPerChildControlPointFromAttribute : public CS2::particles::CParticleFunctionOperator {
		public:
			int32_t m_nChildGroupID; // 0x1c0 | Schema_Builtin | Size: 0x4
			int32_t m_nFirstControlPoint; // 0x1c4 | Schema_Builtin | Size: 0x4
			int32_t m_nNumControlPoints; // 0x1c8 | Schema_Builtin | Size: 0x4
			int32_t m_nParticleIncrement; // 0x1cc | Schema_Builtin | Size: 0x4
			int32_t m_nFirstSourcePoint; // 0x1d0 | Schema_Builtin | Size: 0x4
			bool m_bNumBasedOnParticleCount; // 0x1d4 | Schema_Builtin | Size: 0x1
			S2_PAD(0x3);
			particles::ParticleAttributeIndex_t m_nAttributeToRead; // 0x1d8 | Schema_DeclaredClass | Size: 0x4
			int32_t m_nCPField; // 0x1dc | Schema_Builtin | Size: 0x4
		};
		static_assert(offsetof(CS2::particles::C_OP_SetPerChildControlPointFromAttribute, m_nChildGroupID) == 0x1C0, "m_nChildGroupID in C_OP_SetPerChildControlPointFromAttribute should be at offset 0x1C0");
		static_assert(offsetof(CS2::particles::C_OP_SetPerChildControlPointFromAttribute, m_nFirstControlPoint) == 0x1C4, "m_nFirstControlPoint in C_OP_SetPerChildControlPointFromAttribute should be at offset 0x1C4");
		static_assert(offsetof(CS2::particles::C_OP_SetPerChildControlPointFromAttribute, m_nNumControlPoints) == 0x1C8, "m_nNumControlPoints in C_OP_SetPerChildControlPointFromAttribute should be at offset 0x1C8");
		static_assert(offsetof(CS2::particles::C_OP_SetPerChildControlPointFromAttribute, m_nParticleIncrement) == 0x1CC, "m_nParticleIncrement in C_OP_SetPerChildControlPointFromAttribute should be at offset 0x1CC");
		static_assert(offsetof(CS2::particles::C_OP_SetPerChildControlPointFromAttribute, m_nFirstSourcePoint) == 0x1D0, "m_nFirstSourcePoint in C_OP_SetPerChildControlPointFromAttribute should be at offset 0x1D0");
		static_assert(offsetof(CS2::particles::C_OP_SetPerChildControlPointFromAttribute, m_bNumBasedOnParticleCount) == 0x1D4, "m_bNumBasedOnParticleCount in C_OP_SetPerChildControlPointFromAttribute should be at offset 0x1D4");
		static_assert(offsetof(CS2::particles::C_OP_SetPerChildControlPointFromAttribute, m_nAttributeToRead) == 0x1D8, "m_nAttributeToRead in C_OP_SetPerChildControlPointFromAttribute should be at offset 0x1D8");
		static_assert(offsetof(CS2::particles::C_OP_SetPerChildControlPointFromAttribute, m_nCPField) == 0x1DC, "m_nCPField in C_OP_SetPerChildControlPointFromAttribute should be at offset 0x1DC");
		static_assert(sizeof(CS2::particles::C_OP_SetPerChildControlPointFromAttribute) == 0x1E0, "C_OP_SetPerChildControlPointFromAttribute size should be 0x1E0");
	}
}
