// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#include <SDK/GlobalTypes.hpp>

#include <SDK/particles/CParticleFunctionPreEmission.hpp>
#include <SDK/particles/ScalarExpressionType_t.hpp>
#include <SDK/particleslib/CParticleCollectionFloatInput.hpp>
#include <SDK/particleslib/CParticleRemapFloatInput.hpp>



namespace CS2 {
	namespace particles {
		class C_OP_SetControlPointFieldToScalarExpression : public CS2::particles::CParticleFunctionPreEmission {
		public:
			particles::ScalarExpressionType_t m_nExpression; // 0x1c8 | Schema_DeclaredEnum | Size: 0x4
			S2_PAD(0x4);
			particleslib::CParticleCollectionFloatInput m_flInput1; // 0x1d0 | Schema_DeclaredClass | Size: 0x160
			particleslib::CParticleCollectionFloatInput m_flInput2; // 0x330 | Schema_DeclaredClass | Size: 0x160
			particleslib::CParticleRemapFloatInput m_flOutputRemap; // 0x490 | Schema_DeclaredClass | Size: 0x160
			int32_t m_nOutputCP; // 0x5f0 | Schema_Builtin | Size: 0x4
			int32_t m_nOutVectorField; // 0x5f4 | Schema_Builtin | Size: 0x4
		};
		static_assert(offsetof(CS2::particles::C_OP_SetControlPointFieldToScalarExpression, m_nExpression) == 0x1C8, "m_nExpression in C_OP_SetControlPointFieldToScalarExpression should be at offset 0x1C8");
		static_assert(offsetof(CS2::particles::C_OP_SetControlPointFieldToScalarExpression, m_flInput1) == 0x1D0, "m_flInput1 in C_OP_SetControlPointFieldToScalarExpression should be at offset 0x1D0");
		static_assert(offsetof(CS2::particles::C_OP_SetControlPointFieldToScalarExpression, m_flInput2) == 0x330, "m_flInput2 in C_OP_SetControlPointFieldToScalarExpression should be at offset 0x330");
		static_assert(offsetof(CS2::particles::C_OP_SetControlPointFieldToScalarExpression, m_flOutputRemap) == 0x490, "m_flOutputRemap in C_OP_SetControlPointFieldToScalarExpression should be at offset 0x490");
		static_assert(offsetof(CS2::particles::C_OP_SetControlPointFieldToScalarExpression, m_nOutputCP) == 0x5F0, "m_nOutputCP in C_OP_SetControlPointFieldToScalarExpression should be at offset 0x5F0");
		static_assert(offsetof(CS2::particles::C_OP_SetControlPointFieldToScalarExpression, m_nOutVectorField) == 0x5F4, "m_nOutVectorField in C_OP_SetControlPointFieldToScalarExpression should be at offset 0x5F4");
		static_assert(sizeof(CS2::particles::C_OP_SetControlPointFieldToScalarExpression) == 0x5F8, "C_OP_SetControlPointFieldToScalarExpression size should be 0x5F8");
	}
}
