// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#include <SDK/GlobalTypes.hpp>

#include <SDK/particles/CParticleFunctionOperator.hpp>
#include <SDK/particleslib/CPerParticleFloatInput.hpp>
#include <SDK/particles/ParticleAttributeIndex_t.hpp>



namespace CS2 {
	namespace particles {
		class C_OP_LerpToOtherAttribute : public CS2::particles::CParticleFunctionOperator {
		public:
			particleslib::CPerParticleFloatInput m_flInterpolation; // 0x1c0 | Schema_DeclaredClass | Size: 0x160
			particles::ParticleAttributeIndex_t m_nFieldInputFrom; // 0x320 | Schema_DeclaredClass | Size: 0x4
			particles::ParticleAttributeIndex_t m_nFieldInput; // 0x324 | Schema_DeclaredClass | Size: 0x4
			particles::ParticleAttributeIndex_t m_nFieldOutput; // 0x328 | Schema_DeclaredClass | Size: 0x4
			S2_PAD(0x24); // End padding
		};
		static_assert(offsetof(CS2::particles::C_OP_LerpToOtherAttribute, m_flInterpolation) == 0x1C0, "m_flInterpolation in C_OP_LerpToOtherAttribute should be at offset 0x1C0");
		static_assert(offsetof(CS2::particles::C_OP_LerpToOtherAttribute, m_nFieldInputFrom) == 0x320, "m_nFieldInputFrom in C_OP_LerpToOtherAttribute should be at offset 0x320");
		static_assert(offsetof(CS2::particles::C_OP_LerpToOtherAttribute, m_nFieldInput) == 0x324, "m_nFieldInput in C_OP_LerpToOtherAttribute should be at offset 0x324");
		static_assert(offsetof(CS2::particles::C_OP_LerpToOtherAttribute, m_nFieldOutput) == 0x328, "m_nFieldOutput in C_OP_LerpToOtherAttribute should be at offset 0x328");
		static_assert(sizeof(CS2::particles::C_OP_LerpToOtherAttribute) == 0x350, "C_OP_LerpToOtherAttribute size should be 0x350");
	}
}
