// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#include <SDK/GlobalTypes.hpp>

#include <SDK/particles/CParticleFunctionRenderer.hpp>
#include <SDK/particleslib/CParticleCollectionVecInput.hpp>
#include <SDK/particles/ParticleColorBlendType_t.hpp>
#include <SDK/particleslib/CParticleCollectionFloatInput.hpp>



namespace CS2 {
	namespace particles {
		class C_OP_RenderLightBeam : public CS2::particles::CParticleFunctionRenderer {
		public:
			particleslib::CParticleCollectionVecInput m_vColorBlend; // 0x210 | Schema_DeclaredClass | Size: 0x678
			particles::ParticleColorBlendType_t m_nColorBlendType; // 0x888 | Schema_DeclaredEnum | Size: 0x4
			S2_PAD(0x4);
			particleslib::CParticleCollectionFloatInput m_flBrightnessLumensPerMeter; // 0x890 | Schema_DeclaredClass | Size: 0x160
			bool m_bCastShadows; // 0x9f0 | Schema_Builtin | Size: 0x1
			S2_PAD(0x7);
			particleslib::CParticleCollectionFloatInput m_flSkirt; // 0x9f8 | Schema_DeclaredClass | Size: 0x160
			particleslib::CParticleCollectionFloatInput m_flRange; // 0xb58 | Schema_DeclaredClass | Size: 0x160
			particleslib::CParticleCollectionFloatInput m_flThickness; // 0xcb8 | Schema_DeclaredClass | Size: 0x160
		};
		static_assert(offsetof(CS2::particles::C_OP_RenderLightBeam, m_vColorBlend) == 0x210, "m_vColorBlend in C_OP_RenderLightBeam should be at offset 0x210");
		static_assert(offsetof(CS2::particles::C_OP_RenderLightBeam, m_nColorBlendType) == 0x888, "m_nColorBlendType in C_OP_RenderLightBeam should be at offset 0x888");
		static_assert(offsetof(CS2::particles::C_OP_RenderLightBeam, m_flBrightnessLumensPerMeter) == 0x890, "m_flBrightnessLumensPerMeter in C_OP_RenderLightBeam should be at offset 0x890");
		static_assert(offsetof(CS2::particles::C_OP_RenderLightBeam, m_bCastShadows) == 0x9F0, "m_bCastShadows in C_OP_RenderLightBeam should be at offset 0x9F0");
		static_assert(offsetof(CS2::particles::C_OP_RenderLightBeam, m_flSkirt) == 0x9F8, "m_flSkirt in C_OP_RenderLightBeam should be at offset 0x9F8");
		static_assert(offsetof(CS2::particles::C_OP_RenderLightBeam, m_flRange) == 0xB58, "m_flRange in C_OP_RenderLightBeam should be at offset 0xB58");
		static_assert(offsetof(CS2::particles::C_OP_RenderLightBeam, m_flThickness) == 0xCB8, "m_flThickness in C_OP_RenderLightBeam should be at offset 0xCB8");
		static_assert(sizeof(CS2::particles::C_OP_RenderLightBeam) == 0xE18, "C_OP_RenderLightBeam size should be 0xE18");
	}
}
