// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#include <SDK/GlobalTypes.hpp>

#include <SDK/particles/CParticleFunctionOperator.hpp>
#include <SDK/particles/ParticleAttributeIndex_t.hpp>
#include <SDK/particleslib/CParticleCollectionFloatInput.hpp>
#include <SDK/particles/ParticleSetMethod_t.hpp>



namespace CS2 {
	namespace particles {
		class C_OP_RemapParticleCountToScalar : public CS2::particles::CParticleFunctionOperator {
		public:
			particles::ParticleAttributeIndex_t m_nFieldOutput; // 0x1c0 | Schema_DeclaredClass | Size: 0x4
			S2_PAD(0x4);
			particleslib::CParticleCollectionFloatInput m_nInputMin; // 0x1c8 | Schema_DeclaredClass | Size: 0x160
			particleslib::CParticleCollectionFloatInput m_nInputMax; // 0x328 | Schema_DeclaredClass | Size: 0x160
			particleslib::CParticleCollectionFloatInput m_flOutputMin; // 0x488 | Schema_DeclaredClass | Size: 0x160
			particleslib::CParticleCollectionFloatInput m_flOutputMax; // 0x5e8 | Schema_DeclaredClass | Size: 0x160
			bool m_bActiveRange; // 0x748 | Schema_Builtin | Size: 0x1
			S2_PAD(0x3);
			particles::ParticleSetMethod_t m_nSetMethod; // 0x74c | Schema_DeclaredEnum | Size: 0x4
		};
		static_assert(offsetof(CS2::particles::C_OP_RemapParticleCountToScalar, m_nFieldOutput) == 0x1C0, "m_nFieldOutput in C_OP_RemapParticleCountToScalar should be at offset 0x1C0");
		static_assert(offsetof(CS2::particles::C_OP_RemapParticleCountToScalar, m_nInputMin) == 0x1C8, "m_nInputMin in C_OP_RemapParticleCountToScalar should be at offset 0x1C8");
		static_assert(offsetof(CS2::particles::C_OP_RemapParticleCountToScalar, m_nInputMax) == 0x328, "m_nInputMax in C_OP_RemapParticleCountToScalar should be at offset 0x328");
		static_assert(offsetof(CS2::particles::C_OP_RemapParticleCountToScalar, m_flOutputMin) == 0x488, "m_flOutputMin in C_OP_RemapParticleCountToScalar should be at offset 0x488");
		static_assert(offsetof(CS2::particles::C_OP_RemapParticleCountToScalar, m_flOutputMax) == 0x5E8, "m_flOutputMax in C_OP_RemapParticleCountToScalar should be at offset 0x5E8");
		static_assert(offsetof(CS2::particles::C_OP_RemapParticleCountToScalar, m_bActiveRange) == 0x748, "m_bActiveRange in C_OP_RemapParticleCountToScalar should be at offset 0x748");
		static_assert(offsetof(CS2::particles::C_OP_RemapParticleCountToScalar, m_nSetMethod) == 0x74C, "m_nSetMethod in C_OP_RemapParticleCountToScalar should be at offset 0x74C");
		static_assert(sizeof(CS2::particles::C_OP_RemapParticleCountToScalar) == 0x750, "C_OP_RemapParticleCountToScalar size should be 0x750");
	}
}
