// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#include <SDK/GlobalTypes.hpp>

#include <SDK/particles/CParticleFunctionOperator.hpp>
#include <SDK/particles/ParticleAttributeIndex_t.hpp>
#include <SDK/particles/ParticleSetMethod_t.hpp>



namespace CS2 {
	namespace particles {
		class C_OP_DifferencePreviousParticle : public CS2::particles::CParticleFunctionOperator {
		public:
			particles::ParticleAttributeIndex_t m_nFieldInput; // 0x1c0 | Schema_DeclaredClass | Size: 0x4
			particles::ParticleAttributeIndex_t m_nFieldOutput; // 0x1c4 | Schema_DeclaredClass | Size: 0x4
			float32 m_flInputMin; // 0x1c8 | Schema_Builtin | Size: 0x4
			float32 m_flInputMax; // 0x1cc | Schema_Builtin | Size: 0x4
			float32 m_flOutputMin; // 0x1d0 | Schema_Builtin | Size: 0x4
			float32 m_flOutputMax; // 0x1d4 | Schema_Builtin | Size: 0x4
			particles::ParticleSetMethod_t m_nSetMethod; // 0x1d8 | Schema_DeclaredEnum | Size: 0x4
			bool m_bActiveRange; // 0x1dc | Schema_Builtin | Size: 0x1
			bool m_bSetPreviousParticle; // 0x1dd | Schema_Builtin | Size: 0x1
			S2_PAD(0x2); // End padding
		};
		static_assert(offsetof(CS2::particles::C_OP_DifferencePreviousParticle, m_nFieldInput) == 0x1C0, "m_nFieldInput in C_OP_DifferencePreviousParticle should be at offset 0x1C0");
		static_assert(offsetof(CS2::particles::C_OP_DifferencePreviousParticle, m_nFieldOutput) == 0x1C4, "m_nFieldOutput in C_OP_DifferencePreviousParticle should be at offset 0x1C4");
		static_assert(offsetof(CS2::particles::C_OP_DifferencePreviousParticle, m_flInputMin) == 0x1C8, "m_flInputMin in C_OP_DifferencePreviousParticle should be at offset 0x1C8");
		static_assert(offsetof(CS2::particles::C_OP_DifferencePreviousParticle, m_flInputMax) == 0x1CC, "m_flInputMax in C_OP_DifferencePreviousParticle should be at offset 0x1CC");
		static_assert(offsetof(CS2::particles::C_OP_DifferencePreviousParticle, m_flOutputMin) == 0x1D0, "m_flOutputMin in C_OP_DifferencePreviousParticle should be at offset 0x1D0");
		static_assert(offsetof(CS2::particles::C_OP_DifferencePreviousParticle, m_flOutputMax) == 0x1D4, "m_flOutputMax in C_OP_DifferencePreviousParticle should be at offset 0x1D4");
		static_assert(offsetof(CS2::particles::C_OP_DifferencePreviousParticle, m_nSetMethod) == 0x1D8, "m_nSetMethod in C_OP_DifferencePreviousParticle should be at offset 0x1D8");
		static_assert(offsetof(CS2::particles::C_OP_DifferencePreviousParticle, m_bActiveRange) == 0x1DC, "m_bActiveRange in C_OP_DifferencePreviousParticle should be at offset 0x1DC");
		static_assert(offsetof(CS2::particles::C_OP_DifferencePreviousParticle, m_bSetPreviousParticle) == 0x1DD, "m_bSetPreviousParticle in C_OP_DifferencePreviousParticle should be at offset 0x1DD");
		static_assert(sizeof(CS2::particles::C_OP_DifferencePreviousParticle) == 0x1E0, "C_OP_DifferencePreviousParticle size should be 0x1E0");
	}
}
