// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#include <SDK/GlobalTypes.hpp>

#include <SDK/particles/CParticleFunctionPreEmission.hpp>
#include <SDK/particleslib/CParticleCollectionFloatInput.hpp>



namespace CS2 {
	namespace particles {
		class C_OP_SetCPOrientationToPointAtCP : public CS2::particles::CParticleFunctionPreEmission {
		public:
			int32_t m_nInputCP; // 0x1c8 | Schema_Builtin | Size: 0x4
			int32_t m_nOutputCP; // 0x1cc | Schema_Builtin | Size: 0x4
			particleslib::CParticleCollectionFloatInput m_flInterpolation; // 0x1d0 | Schema_DeclaredClass | Size: 0x160
			bool m_b2DOrientation; // 0x330 | Schema_Builtin | Size: 0x1
			bool m_bAvoidSingularity; // 0x331 | Schema_Builtin | Size: 0x1
			bool m_bPointAway; // 0x332 | Schema_Builtin | Size: 0x1
			S2_PAD(0x5); // End padding
		};
		static_assert(offsetof(CS2::particles::C_OP_SetCPOrientationToPointAtCP, m_nInputCP) == 0x1C8, "m_nInputCP in C_OP_SetCPOrientationToPointAtCP should be at offset 0x1C8");
		static_assert(offsetof(CS2::particles::C_OP_SetCPOrientationToPointAtCP, m_nOutputCP) == 0x1CC, "m_nOutputCP in C_OP_SetCPOrientationToPointAtCP should be at offset 0x1CC");
		static_assert(offsetof(CS2::particles::C_OP_SetCPOrientationToPointAtCP, m_flInterpolation) == 0x1D0, "m_flInterpolation in C_OP_SetCPOrientationToPointAtCP should be at offset 0x1D0");
		static_assert(offsetof(CS2::particles::C_OP_SetCPOrientationToPointAtCP, m_b2DOrientation) == 0x330, "m_b2DOrientation in C_OP_SetCPOrientationToPointAtCP should be at offset 0x330");
		static_assert(offsetof(CS2::particles::C_OP_SetCPOrientationToPointAtCP, m_bAvoidSingularity) == 0x331, "m_bAvoidSingularity in C_OP_SetCPOrientationToPointAtCP should be at offset 0x331");
		static_assert(offsetof(CS2::particles::C_OP_SetCPOrientationToPointAtCP, m_bPointAway) == 0x332, "m_bPointAway in C_OP_SetCPOrientationToPointAtCP should be at offset 0x332");
		static_assert(sizeof(CS2::particles::C_OP_SetCPOrientationToPointAtCP) == 0x338, "C_OP_SetCPOrientationToPointAtCP size should be 0x338");
	}
}
