// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#include <SDK/GlobalTypes.hpp>

#include <SDK/particles/CParticleFunctionOperator.hpp>
#include <SDK/particleslib/CParticleCollectionVecInput.hpp>
#include <SDK/particleslib/CParticleCollectionFloatInput.hpp>
#include <SDK/particles/CParticleMassCalculationParameters.hpp>



namespace CS2 {
	namespace particles {
		class C_OP_BasicMovement : public CS2::particles::CParticleFunctionOperator {
		public:
			particleslib::CParticleCollectionVecInput m_Gravity; // 0x1c0 | Schema_DeclaredClass | Size: 0x678
			particleslib::CParticleCollectionFloatInput m_fDrag; // 0x838 | Schema_DeclaredClass | Size: 0x160
			particles::CParticleMassCalculationParameters m_massControls; // 0x998 | Schema_DeclaredClass | Size: 0x428
			int32_t m_nMaxConstraintPasses; // 0xdc0 | Schema_Builtin | Size: 0x4
			bool m_bUseNewCode; // 0xdc4 | Schema_Builtin | Size: 0x1
			S2_PAD(0x3); // End padding
		};
		static_assert(offsetof(CS2::particles::C_OP_BasicMovement, m_Gravity) == 0x1C0, "m_Gravity in C_OP_BasicMovement should be at offset 0x1C0");
		static_assert(offsetof(CS2::particles::C_OP_BasicMovement, m_fDrag) == 0x838, "m_fDrag in C_OP_BasicMovement should be at offset 0x838");
		static_assert(offsetof(CS2::particles::C_OP_BasicMovement, m_massControls) == 0x998, "m_massControls in C_OP_BasicMovement should be at offset 0x998");
		static_assert(offsetof(CS2::particles::C_OP_BasicMovement, m_nMaxConstraintPasses) == 0xDC0, "m_nMaxConstraintPasses in C_OP_BasicMovement should be at offset 0xDC0");
		static_assert(offsetof(CS2::particles::C_OP_BasicMovement, m_bUseNewCode) == 0xDC4, "m_bUseNewCode in C_OP_BasicMovement should be at offset 0xDC4");
		static_assert(sizeof(CS2::particles::C_OP_BasicMovement) == 0xDC8, "C_OP_BasicMovement size should be 0xDC8");
	}
}
