// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#include <SDK/GlobalTypes.hpp>

#include <SDK/particles/CParticleFunctionOperator.hpp>
#include <SDK/particleslib/CPerParticleFloatInput.hpp>
#include <SDK/particles/ParticleAttributeIndex_t.hpp>
#include <SDK/particles/ParticleSetMethod_t.hpp>



namespace CS2 {
	namespace particles {
		class C_OP_SetFloat : public CS2::particles::CParticleFunctionOperator {
		public:
			particleslib::CPerParticleFloatInput m_InputValue; // 0x1c0 | Schema_DeclaredClass | Size: 0x160
			particles::ParticleAttributeIndex_t m_nOutputField; // 0x320 | Schema_DeclaredClass | Size: 0x4
			particles::ParticleSetMethod_t m_nSetMethod; // 0x324 | Schema_DeclaredEnum | Size: 0x4
			particleslib::CPerParticleFloatInput m_Lerp; // 0x328 | Schema_DeclaredClass | Size: 0x160
			S2_PAD(0x28); // End padding
		};
		static_assert(offsetof(CS2::particles::C_OP_SetFloat, m_InputValue) == 0x1C0, "m_InputValue in C_OP_SetFloat should be at offset 0x1C0");
		static_assert(offsetof(CS2::particles::C_OP_SetFloat, m_nOutputField) == 0x320, "m_nOutputField in C_OP_SetFloat should be at offset 0x320");
		static_assert(offsetof(CS2::particles::C_OP_SetFloat, m_nSetMethod) == 0x324, "m_nSetMethod in C_OP_SetFloat should be at offset 0x324");
		static_assert(offsetof(CS2::particles::C_OP_SetFloat, m_Lerp) == 0x328, "m_Lerp in C_OP_SetFloat should be at offset 0x328");
		static_assert(sizeof(CS2::particles::C_OP_SetFloat) == 0x4B0, "C_OP_SetFloat size should be 0x4B0");
	}
}
