// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#include <SDK/GlobalTypes.hpp>

#include <SDK/particles/CParticleFunctionOperator.hpp>
#include <SDK/particleslib/CParticleCollectionFloatInput.hpp>
#include <SDK/particles/ParticleOrientationType_t.hpp>



namespace CS2 {
	namespace particles {
		class C_OP_SetChildControlPoints : public CS2::particles::CParticleFunctionOperator {
		public:
			int32_t m_nChildGroupID; // 0x1c0 | Schema_Builtin | Size: 0x4
			int32_t m_nFirstControlPoint; // 0x1c4 | Schema_Builtin | Size: 0x4
			int32_t m_nNumControlPoints; // 0x1c8 | Schema_Builtin | Size: 0x4
			S2_PAD(0x4);
			particleslib::CParticleCollectionFloatInput m_nFirstSourcePoint; // 0x1d0 | Schema_DeclaredClass | Size: 0x160
			bool m_bReverse; // 0x330 | Schema_Builtin | Size: 0x1
			bool m_bSetOrientation; // 0x331 | Schema_Builtin | Size: 0x1
			S2_PAD(0x2);
			particles::ParticleOrientationType_t m_nOrientation; // 0x334 | Schema_DeclaredEnum | Size: 0x4
		};
		static_assert(offsetof(CS2::particles::C_OP_SetChildControlPoints, m_nChildGroupID) == 0x1C0, "m_nChildGroupID in C_OP_SetChildControlPoints should be at offset 0x1C0");
		static_assert(offsetof(CS2::particles::C_OP_SetChildControlPoints, m_nFirstControlPoint) == 0x1C4, "m_nFirstControlPoint in C_OP_SetChildControlPoints should be at offset 0x1C4");
		static_assert(offsetof(CS2::particles::C_OP_SetChildControlPoints, m_nNumControlPoints) == 0x1C8, "m_nNumControlPoints in C_OP_SetChildControlPoints should be at offset 0x1C8");
		static_assert(offsetof(CS2::particles::C_OP_SetChildControlPoints, m_nFirstSourcePoint) == 0x1D0, "m_nFirstSourcePoint in C_OP_SetChildControlPoints should be at offset 0x1D0");
		static_assert(offsetof(CS2::particles::C_OP_SetChildControlPoints, m_bReverse) == 0x330, "m_bReverse in C_OP_SetChildControlPoints should be at offset 0x330");
		static_assert(offsetof(CS2::particles::C_OP_SetChildControlPoints, m_bSetOrientation) == 0x331, "m_bSetOrientation in C_OP_SetChildControlPoints should be at offset 0x331");
		static_assert(offsetof(CS2::particles::C_OP_SetChildControlPoints, m_nOrientation) == 0x334, "m_nOrientation in C_OP_SetChildControlPoints should be at offset 0x334");
		static_assert(sizeof(CS2::particles::C_OP_SetChildControlPoints) == 0x338, "C_OP_SetChildControlPoints size should be 0x338");
	}
}
