// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#ifndef CUSTOM_GLOBAL_TYPES
	#include <SDK/GlobalTypes.hpp>
#else
	#include <Custom/GlobalTypes.hpp>
#endif


#include <SDK/particles/CParticleFunctionOperator.hpp>
#include <SDK/particleslib/CParticleCollectionFloatInput.hpp>
#include <SDK/particles/ParticleAttributeIndex_t.hpp>





using namespace GlobalTypes;
namespace CS2 {
	namespace particles {
		class C_OP_SetPerChildControlPoint : public CS2::particles::CParticleFunctionOperator {
		public:
			int32_t m_nChildGroupID; // 0x1d0 | Schema_Builtin | Size: 0x4
			int32_t m_nFirstControlPoint; // 0x1d4 | Schema_Builtin | Size: 0x4
			int32_t m_nNumControlPoints; // 0x1d8 | Schema_Builtin | Size: 0x4
			S2_PAD(0x4);
			particleslib::CParticleCollectionFloatInput m_nParticleIncrement; // 0x1e0 | Schema_DeclaredClass | Size: 0x170
			particleslib::CParticleCollectionFloatInput m_nFirstSourcePoint; // 0x350 | Schema_DeclaredClass | Size: 0x170
			bool m_bSetOrientation; // 0x4c0 | Schema_Builtin | Size: 0x1
			S2_PAD(0x3);
			particles::ParticleAttributeIndex_t m_nOrientationField; // 0x4c4 | Schema_DeclaredClass | Size: 0x4
			bool m_bNumBasedOnParticleCount; // 0x4c8 | Schema_Builtin | Size: 0x1
			S2_PAD(0x7); // End padding
		};
		static_assert(offsetof(CS2::particles::C_OP_SetPerChildControlPoint, m_nChildGroupID) == 0x1D0, "m_nChildGroupID in C_OP_SetPerChildControlPoint should be at offset 0x1D0");
		static_assert(offsetof(CS2::particles::C_OP_SetPerChildControlPoint, m_nFirstControlPoint) == 0x1D4, "m_nFirstControlPoint in C_OP_SetPerChildControlPoint should be at offset 0x1D4");
		static_assert(offsetof(CS2::particles::C_OP_SetPerChildControlPoint, m_nNumControlPoints) == 0x1D8, "m_nNumControlPoints in C_OP_SetPerChildControlPoint should be at offset 0x1D8");
		static_assert(offsetof(CS2::particles::C_OP_SetPerChildControlPoint, m_nParticleIncrement) == 0x1E0, "m_nParticleIncrement in C_OP_SetPerChildControlPoint should be at offset 0x1E0");
		static_assert(offsetof(CS2::particles::C_OP_SetPerChildControlPoint, m_nFirstSourcePoint) == 0x350, "m_nFirstSourcePoint in C_OP_SetPerChildControlPoint should be at offset 0x350");
		static_assert(offsetof(CS2::particles::C_OP_SetPerChildControlPoint, m_bSetOrientation) == 0x4C0, "m_bSetOrientation in C_OP_SetPerChildControlPoint should be at offset 0x4C0");
		static_assert(offsetof(CS2::particles::C_OP_SetPerChildControlPoint, m_nOrientationField) == 0x4C4, "m_nOrientationField in C_OP_SetPerChildControlPoint should be at offset 0x4C4");
		static_assert(offsetof(CS2::particles::C_OP_SetPerChildControlPoint, m_bNumBasedOnParticleCount) == 0x4C8, "m_bNumBasedOnParticleCount in C_OP_SetPerChildControlPoint should be at offset 0x4C8");
		static_assert(sizeof(CS2::particles::C_OP_SetPerChildControlPoint) == 0x4D0, "C_OP_SetPerChildControlPoint size should be 0x4D0");
	}
}
