// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#include <SDK/GlobalTypes.hpp>

#include <SDK/particles/CParticleFunctionPreEmission.hpp>



namespace CS2 {
	namespace particles {
		class C_OP_DriveCPFromGlobalSoundFloat : public CS2::particles::CParticleFunctionPreEmission {
		public:
			int32_t m_nOutputControlPoint; // 0x1c8 | Schema_Builtin | Size: 0x4
			int32_t m_nOutputField; // 0x1cc | Schema_Builtin | Size: 0x4
			float32 m_flInputMin; // 0x1d0 | Schema_Builtin | Size: 0x4
			float32 m_flInputMax; // 0x1d4 | Schema_Builtin | Size: 0x4
			float32 m_flOutputMin; // 0x1d8 | Schema_Builtin | Size: 0x4
			float32 m_flOutputMax; // 0x1dc | Schema_Builtin | Size: 0x4
			GlobalTypes::CUtlString m_StackName; // 0x1e0 | Schema_Atomic | Size: 0x8
			GlobalTypes::CUtlString m_OperatorName; // 0x1e8 | Schema_Atomic | Size: 0x8
			GlobalTypes::CUtlString m_FieldName; // 0x1f0 | Schema_Atomic | Size: 0x8
			S2_PAD(0x8); // End padding
		};
		static_assert(offsetof(CS2::particles::C_OP_DriveCPFromGlobalSoundFloat, m_nOutputControlPoint) == 0x1C8, "m_nOutputControlPoint in C_OP_DriveCPFromGlobalSoundFloat should be at offset 0x1C8");
		static_assert(offsetof(CS2::particles::C_OP_DriveCPFromGlobalSoundFloat, m_nOutputField) == 0x1CC, "m_nOutputField in C_OP_DriveCPFromGlobalSoundFloat should be at offset 0x1CC");
		static_assert(offsetof(CS2::particles::C_OP_DriveCPFromGlobalSoundFloat, m_flInputMin) == 0x1D0, "m_flInputMin in C_OP_DriveCPFromGlobalSoundFloat should be at offset 0x1D0");
		static_assert(offsetof(CS2::particles::C_OP_DriveCPFromGlobalSoundFloat, m_flInputMax) == 0x1D4, "m_flInputMax in C_OP_DriveCPFromGlobalSoundFloat should be at offset 0x1D4");
		static_assert(offsetof(CS2::particles::C_OP_DriveCPFromGlobalSoundFloat, m_flOutputMin) == 0x1D8, "m_flOutputMin in C_OP_DriveCPFromGlobalSoundFloat should be at offset 0x1D8");
		static_assert(offsetof(CS2::particles::C_OP_DriveCPFromGlobalSoundFloat, m_flOutputMax) == 0x1DC, "m_flOutputMax in C_OP_DriveCPFromGlobalSoundFloat should be at offset 0x1DC");
		static_assert(offsetof(CS2::particles::C_OP_DriveCPFromGlobalSoundFloat, m_StackName) == 0x1E0, "m_StackName in C_OP_DriveCPFromGlobalSoundFloat should be at offset 0x1E0");
		static_assert(offsetof(CS2::particles::C_OP_DriveCPFromGlobalSoundFloat, m_OperatorName) == 0x1E8, "m_OperatorName in C_OP_DriveCPFromGlobalSoundFloat should be at offset 0x1E8");
		static_assert(offsetof(CS2::particles::C_OP_DriveCPFromGlobalSoundFloat, m_FieldName) == 0x1F0, "m_FieldName in C_OP_DriveCPFromGlobalSoundFloat should be at offset 0x1F0");
		static_assert(sizeof(CS2::particles::C_OP_DriveCPFromGlobalSoundFloat) == 0x200, "C_OP_DriveCPFromGlobalSoundFloat size should be 0x200");
	}
}
