// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#include <SDK/GlobalTypes.hpp>

#include <SDK/particles/CParticleFunctionOperator.hpp>
#include <SDK/particleslib/CPerParticleFloatInput.hpp>
#include <SDK/particles/ParticleAttributeIndex_t.hpp>
#include <SDK/particles/MissingParentInheritBehavior_t.hpp>



namespace CS2 {
	namespace particles {
		class C_OP_InheritFromParentParticlesV2 : public CS2::particles::CParticleFunctionOperator {
		public:
			particleslib::CPerParticleFloatInput m_flScale; // 0x1c0 | Schema_DeclaredClass | Size: 0x160
			particles::ParticleAttributeIndex_t m_nFieldOutput; // 0x320 | Schema_DeclaredClass | Size: 0x4
			S2_PAD(0x4);
			particleslib::CPerParticleFloatInput m_nIncrement; // 0x328 | Schema_DeclaredClass | Size: 0x160
			bool m_bRandomDistribution; // 0x488 | Schema_Builtin | Size: 0x1
			bool m_bReverse; // 0x489 | Schema_Builtin | Size: 0x1
			S2_PAD(0x2);
			particles::MissingParentInheritBehavior_t m_nMissingParentBehavior; // 0x48c | Schema_DeclaredEnum | Size: 0x4
			particleslib::CPerParticleFloatInput m_flInterpolation; // 0x490 | Schema_DeclaredClass | Size: 0x160
		};
		static_assert(offsetof(CS2::particles::C_OP_InheritFromParentParticlesV2, m_flScale) == 0x1C0, "m_flScale in C_OP_InheritFromParentParticlesV2 should be at offset 0x1C0");
		static_assert(offsetof(CS2::particles::C_OP_InheritFromParentParticlesV2, m_nFieldOutput) == 0x320, "m_nFieldOutput in C_OP_InheritFromParentParticlesV2 should be at offset 0x320");
		static_assert(offsetof(CS2::particles::C_OP_InheritFromParentParticlesV2, m_nIncrement) == 0x328, "m_nIncrement in C_OP_InheritFromParentParticlesV2 should be at offset 0x328");
		static_assert(offsetof(CS2::particles::C_OP_InheritFromParentParticlesV2, m_bRandomDistribution) == 0x488, "m_bRandomDistribution in C_OP_InheritFromParentParticlesV2 should be at offset 0x488");
		static_assert(offsetof(CS2::particles::C_OP_InheritFromParentParticlesV2, m_bReverse) == 0x489, "m_bReverse in C_OP_InheritFromParentParticlesV2 should be at offset 0x489");
		static_assert(offsetof(CS2::particles::C_OP_InheritFromParentParticlesV2, m_nMissingParentBehavior) == 0x48C, "m_nMissingParentBehavior in C_OP_InheritFromParentParticlesV2 should be at offset 0x48C");
		static_assert(offsetof(CS2::particles::C_OP_InheritFromParentParticlesV2, m_flInterpolation) == 0x490, "m_flInterpolation in C_OP_InheritFromParentParticlesV2 should be at offset 0x490");
		static_assert(sizeof(CS2::particles::C_OP_InheritFromParentParticlesV2) == 0x5F0, "C_OP_InheritFromParentParticlesV2 size should be 0x5F0");
	}
}
