// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#include <SDK/GlobalTypes.hpp>

#include <SDK/particles/CParticleFunctionPreEmission.hpp>
#include <SDK/particleslib/CParticleCollectionFloatInput.hpp>



namespace CS2 {
	namespace particles {
		class C_OP_SetControlPointToWaterSurface : public CS2::particles::CParticleFunctionPreEmission {
		public:
			int32_t m_nSourceCP; // 0x1c8 | Schema_Builtin | Size: 0x4
			int32_t m_nDestCP; // 0x1cc | Schema_Builtin | Size: 0x4
			int32_t m_nFlowCP; // 0x1d0 | Schema_Builtin | Size: 0x4
			int32_t m_nActiveCP; // 0x1d4 | Schema_Builtin | Size: 0x4
			int32_t m_nActiveCPField; // 0x1d8 | Schema_Builtin | Size: 0x4
			S2_PAD(0x4);
			particleslib::CParticleCollectionFloatInput m_flRetestRate; // 0x1e0 | Schema_DeclaredClass | Size: 0x160
			bool m_bAdaptiveThreshold; // 0x340 | Schema_Builtin | Size: 0x1
			S2_PAD(0x7); // End padding
		};
		static_assert(offsetof(CS2::particles::C_OP_SetControlPointToWaterSurface, m_nSourceCP) == 0x1C8, "m_nSourceCP in C_OP_SetControlPointToWaterSurface should be at offset 0x1C8");
		static_assert(offsetof(CS2::particles::C_OP_SetControlPointToWaterSurface, m_nDestCP) == 0x1CC, "m_nDestCP in C_OP_SetControlPointToWaterSurface should be at offset 0x1CC");
		static_assert(offsetof(CS2::particles::C_OP_SetControlPointToWaterSurface, m_nFlowCP) == 0x1D0, "m_nFlowCP in C_OP_SetControlPointToWaterSurface should be at offset 0x1D0");
		static_assert(offsetof(CS2::particles::C_OP_SetControlPointToWaterSurface, m_nActiveCP) == 0x1D4, "m_nActiveCP in C_OP_SetControlPointToWaterSurface should be at offset 0x1D4");
		static_assert(offsetof(CS2::particles::C_OP_SetControlPointToWaterSurface, m_nActiveCPField) == 0x1D8, "m_nActiveCPField in C_OP_SetControlPointToWaterSurface should be at offset 0x1D8");
		static_assert(offsetof(CS2::particles::C_OP_SetControlPointToWaterSurface, m_flRetestRate) == 0x1E0, "m_flRetestRate in C_OP_SetControlPointToWaterSurface should be at offset 0x1E0");
		static_assert(offsetof(CS2::particles::C_OP_SetControlPointToWaterSurface, m_bAdaptiveThreshold) == 0x340, "m_bAdaptiveThreshold in C_OP_SetControlPointToWaterSurface should be at offset 0x340");
		static_assert(sizeof(CS2::particles::C_OP_SetControlPointToWaterSurface) == 0x348, "C_OP_SetControlPointToWaterSurface size should be 0x348");
	}
}
