// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#include <SDK/GlobalTypes.hpp>

#include <SDK/particles/CParticleFunctionOperator.hpp>
#include <SDK/particleslib/CParticleCollectionFloatInput.hpp>
#include <SDK/particles/ParticleAttributeIndex_t.hpp>



namespace CS2 {
	namespace particles {
		class C_OP_SetPerChildControlPoint : public CS2::particles::CParticleFunctionOperator {
		public:
			int32_t m_nChildGroupID; // 0x1c0 | Schema_Builtin | Size: 0x4
			int32_t m_nFirstControlPoint; // 0x1c4 | Schema_Builtin | Size: 0x4
			int32_t m_nNumControlPoints; // 0x1c8 | Schema_Builtin | Size: 0x4
			S2_PAD(0x4);
			particleslib::CParticleCollectionFloatInput m_nParticleIncrement; // 0x1d0 | Schema_DeclaredClass | Size: 0x160
			particleslib::CParticleCollectionFloatInput m_nFirstSourcePoint; // 0x330 | Schema_DeclaredClass | Size: 0x160
			bool m_bSetOrientation; // 0x490 | Schema_Builtin | Size: 0x1
			S2_PAD(0x3);
			particles::ParticleAttributeIndex_t m_nOrientationField; // 0x494 | Schema_DeclaredClass | Size: 0x4
			bool m_bNumBasedOnParticleCount; // 0x498 | Schema_Builtin | Size: 0x1
			S2_PAD(0x7); // End padding
		};
		static_assert(offsetof(CS2::particles::C_OP_SetPerChildControlPoint, m_nChildGroupID) == 0x1C0, "m_nChildGroupID in C_OP_SetPerChildControlPoint should be at offset 0x1C0");
		static_assert(offsetof(CS2::particles::C_OP_SetPerChildControlPoint, m_nFirstControlPoint) == 0x1C4, "m_nFirstControlPoint in C_OP_SetPerChildControlPoint should be at offset 0x1C4");
		static_assert(offsetof(CS2::particles::C_OP_SetPerChildControlPoint, m_nNumControlPoints) == 0x1C8, "m_nNumControlPoints in C_OP_SetPerChildControlPoint should be at offset 0x1C8");
		static_assert(offsetof(CS2::particles::C_OP_SetPerChildControlPoint, m_nParticleIncrement) == 0x1D0, "m_nParticleIncrement in C_OP_SetPerChildControlPoint should be at offset 0x1D0");
		static_assert(offsetof(CS2::particles::C_OP_SetPerChildControlPoint, m_nFirstSourcePoint) == 0x330, "m_nFirstSourcePoint in C_OP_SetPerChildControlPoint should be at offset 0x330");
		static_assert(offsetof(CS2::particles::C_OP_SetPerChildControlPoint, m_bSetOrientation) == 0x490, "m_bSetOrientation in C_OP_SetPerChildControlPoint should be at offset 0x490");
		static_assert(offsetof(CS2::particles::C_OP_SetPerChildControlPoint, m_nOrientationField) == 0x494, "m_nOrientationField in C_OP_SetPerChildControlPoint should be at offset 0x494");
		static_assert(offsetof(CS2::particles::C_OP_SetPerChildControlPoint, m_bNumBasedOnParticleCount) == 0x498, "m_bNumBasedOnParticleCount in C_OP_SetPerChildControlPoint should be at offset 0x498");
		static_assert(sizeof(CS2::particles::C_OP_SetPerChildControlPoint) == 0x4A0, "C_OP_SetPerChildControlPoint size should be 0x4A0");
	}
}
