// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#include <SDK/GlobalTypes.hpp>

#include <SDK/particles/CParticleFunctionOperator.hpp>
#include <SDK/particleslib/CParticleTransformInput.hpp>
#include <SDK/particles/ParticleAttributeIndex_t.hpp>



namespace CS2 {
	namespace particles {
		class C_OP_RemapTransformOrientationToYaw : public CS2::particles::CParticleFunctionOperator {
		public:
			particleslib::CParticleTransformInput m_TransformInput; // 0x1c0 | Schema_DeclaredClass | Size: 0x68
			particles::ParticleAttributeIndex_t m_nFieldOutput; // 0x228 | Schema_DeclaredClass | Size: 0x4
			float32 m_flRotOffset; // 0x22c | Schema_Builtin | Size: 0x4
			float32 m_flSpinStrength; // 0x230 | Schema_Builtin | Size: 0x4
			S2_PAD(0x4); // End padding
		};
		static_assert(offsetof(CS2::particles::C_OP_RemapTransformOrientationToYaw, m_TransformInput) == 0x1C0, "m_TransformInput in C_OP_RemapTransformOrientationToYaw should be at offset 0x1C0");
		static_assert(offsetof(CS2::particles::C_OP_RemapTransformOrientationToYaw, m_nFieldOutput) == 0x228, "m_nFieldOutput in C_OP_RemapTransformOrientationToYaw should be at offset 0x228");
		static_assert(offsetof(CS2::particles::C_OP_RemapTransformOrientationToYaw, m_flRotOffset) == 0x22C, "m_flRotOffset in C_OP_RemapTransformOrientationToYaw should be at offset 0x22C");
		static_assert(offsetof(CS2::particles::C_OP_RemapTransformOrientationToYaw, m_flSpinStrength) == 0x230, "m_flSpinStrength in C_OP_RemapTransformOrientationToYaw should be at offset 0x230");
		static_assert(sizeof(CS2::particles::C_OP_RemapTransformOrientationToYaw) == 0x238, "C_OP_RemapTransformOrientationToYaw size should be 0x238");
	}
}
