// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#include <SDK/GlobalTypes.hpp>

#include <SDK/particles/CParticleFunctionPreEmission.hpp>



namespace CS2 {
	namespace particles {
		class C_OP_RemapCPtoCP : public CS2::particles::CParticleFunctionPreEmission {
		public:
			int32_t m_nInputControlPoint; // 0x1c8 | Schema_Builtin | Size: 0x4
			int32_t m_nOutputControlPoint; // 0x1cc | Schema_Builtin | Size: 0x4
			int32_t m_nInputField; // 0x1d0 | Schema_Builtin | Size: 0x4
			int32_t m_nOutputField; // 0x1d4 | Schema_Builtin | Size: 0x4
			float32 m_flInputMin; // 0x1d8 | Schema_Builtin | Size: 0x4
			float32 m_flInputMax; // 0x1dc | Schema_Builtin | Size: 0x4
			float32 m_flOutputMin; // 0x1e0 | Schema_Builtin | Size: 0x4
			float32 m_flOutputMax; // 0x1e4 | Schema_Builtin | Size: 0x4
			bool m_bDerivative; // 0x1e8 | Schema_Builtin | Size: 0x1
			S2_PAD(0x3);
			float32 m_flInterpRate; // 0x1ec | Schema_Builtin | Size: 0x4
		};
		static_assert(offsetof(CS2::particles::C_OP_RemapCPtoCP, m_nInputControlPoint) == 0x1C8, "m_nInputControlPoint in C_OP_RemapCPtoCP should be at offset 0x1C8");
		static_assert(offsetof(CS2::particles::C_OP_RemapCPtoCP, m_nOutputControlPoint) == 0x1CC, "m_nOutputControlPoint in C_OP_RemapCPtoCP should be at offset 0x1CC");
		static_assert(offsetof(CS2::particles::C_OP_RemapCPtoCP, m_nInputField) == 0x1D0, "m_nInputField in C_OP_RemapCPtoCP should be at offset 0x1D0");
		static_assert(offsetof(CS2::particles::C_OP_RemapCPtoCP, m_nOutputField) == 0x1D4, "m_nOutputField in C_OP_RemapCPtoCP should be at offset 0x1D4");
		static_assert(offsetof(CS2::particles::C_OP_RemapCPtoCP, m_flInputMin) == 0x1D8, "m_flInputMin in C_OP_RemapCPtoCP should be at offset 0x1D8");
		static_assert(offsetof(CS2::particles::C_OP_RemapCPtoCP, m_flInputMax) == 0x1DC, "m_flInputMax in C_OP_RemapCPtoCP should be at offset 0x1DC");
		static_assert(offsetof(CS2::particles::C_OP_RemapCPtoCP, m_flOutputMin) == 0x1E0, "m_flOutputMin in C_OP_RemapCPtoCP should be at offset 0x1E0");
		static_assert(offsetof(CS2::particles::C_OP_RemapCPtoCP, m_flOutputMax) == 0x1E4, "m_flOutputMax in C_OP_RemapCPtoCP should be at offset 0x1E4");
		static_assert(offsetof(CS2::particles::C_OP_RemapCPtoCP, m_bDerivative) == 0x1E8, "m_bDerivative in C_OP_RemapCPtoCP should be at offset 0x1E8");
		static_assert(offsetof(CS2::particles::C_OP_RemapCPtoCP, m_flInterpRate) == 0x1EC, "m_flInterpRate in C_OP_RemapCPtoCP should be at offset 0x1EC");
		static_assert(sizeof(CS2::particles::C_OP_RemapCPtoCP) == 0x1F0, "C_OP_RemapCPtoCP size should be 0x1F0");
	}
}
