// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#include <SDK/GlobalTypes.hpp>

#include <SDK/particles/CParticleFunctionPreEmission.hpp>



namespace CS2 {
	namespace particles {
		class C_OP_ControlPointToRadialScreenSpace : public CS2::particles::CParticleFunctionPreEmission {
		public:
			int32_t m_nCPIn; // 0x1c8 | Schema_Builtin | Size: 0x4
			GlobalTypes::Vector m_vecCP1Pos; // 0x1cc | Schema_Atomic | Size: 0xc
			int32_t m_nCPOut; // 0x1d8 | Schema_Builtin | Size: 0x4
			int32_t m_nCPOutField; // 0x1dc | Schema_Builtin | Size: 0x4
			int32_t m_nCPSSPosOut; // 0x1e0 | Schema_Builtin | Size: 0x4
			S2_PAD(0x4); // End padding
		};
		static_assert(offsetof(CS2::particles::C_OP_ControlPointToRadialScreenSpace, m_nCPIn) == 0x1C8, "m_nCPIn in C_OP_ControlPointToRadialScreenSpace should be at offset 0x1C8");
		static_assert(offsetof(CS2::particles::C_OP_ControlPointToRadialScreenSpace, m_vecCP1Pos) == 0x1CC, "m_vecCP1Pos in C_OP_ControlPointToRadialScreenSpace should be at offset 0x1CC");
		static_assert(offsetof(CS2::particles::C_OP_ControlPointToRadialScreenSpace, m_nCPOut) == 0x1D8, "m_nCPOut in C_OP_ControlPointToRadialScreenSpace should be at offset 0x1D8");
		static_assert(offsetof(CS2::particles::C_OP_ControlPointToRadialScreenSpace, m_nCPOutField) == 0x1DC, "m_nCPOutField in C_OP_ControlPointToRadialScreenSpace should be at offset 0x1DC");
		static_assert(offsetof(CS2::particles::C_OP_ControlPointToRadialScreenSpace, m_nCPSSPosOut) == 0x1E0, "m_nCPSSPosOut in C_OP_ControlPointToRadialScreenSpace should be at offset 0x1E0");
		static_assert(sizeof(CS2::particles::C_OP_ControlPointToRadialScreenSpace) == 0x1E8, "C_OP_ControlPointToRadialScreenSpace size should be 0x1E8");
	}
}
