// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#include <SDK/GlobalTypes.hpp>

#include <SDK/particles/CParticleFunctionOperator.hpp>
#include <SDK/particleslib/CParticleCollectionVecInput.hpp>
#include <SDK/particleslib/CParticleCollectionFloatInput.hpp>
#include <SDK/particleslib/CParticleTransformInput.hpp>



namespace CS2 {
	namespace particles {
		class C_OP_MovementRotateParticleAroundAxis : public CS2::particles::CParticleFunctionOperator {
		public:
			particleslib::CParticleCollectionVecInput m_vecRotAxis; // 0x1c0 | Schema_DeclaredClass | Size: 0x678
			particleslib::CParticleCollectionFloatInput m_flRotRate; // 0x838 | Schema_DeclaredClass | Size: 0x160
			particleslib::CParticleTransformInput m_TransformInput; // 0x998 | Schema_DeclaredClass | Size: 0x68
			bool m_bLocalSpace; // 0xa00 | Schema_Builtin | Size: 0x1
			S2_PAD(0x7); // End padding
		};
		static_assert(offsetof(CS2::particles::C_OP_MovementRotateParticleAroundAxis, m_vecRotAxis) == 0x1C0, "m_vecRotAxis in C_OP_MovementRotateParticleAroundAxis should be at offset 0x1C0");
		static_assert(offsetof(CS2::particles::C_OP_MovementRotateParticleAroundAxis, m_flRotRate) == 0x838, "m_flRotRate in C_OP_MovementRotateParticleAroundAxis should be at offset 0x838");
		static_assert(offsetof(CS2::particles::C_OP_MovementRotateParticleAroundAxis, m_TransformInput) == 0x998, "m_TransformInput in C_OP_MovementRotateParticleAroundAxis should be at offset 0x998");
		static_assert(offsetof(CS2::particles::C_OP_MovementRotateParticleAroundAxis, m_bLocalSpace) == 0xA00, "m_bLocalSpace in C_OP_MovementRotateParticleAroundAxis should be at offset 0xA00");
		static_assert(sizeof(CS2::particles::C_OP_MovementRotateParticleAroundAxis) == 0xA08, "C_OP_MovementRotateParticleAroundAxis size should be 0xA08");
	}
}
