// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#include <SDK/GlobalTypes.hpp>

#include <SDK/particles/CParticleFunctionConstraint.hpp>
#include <SDK/particleslib/CPerParticleFloatInput.hpp>
#include <SDK/particleslib/CParticleCollectionFloatInput.hpp>



namespace CS2 {
	namespace particles {
		class C_OP_PlanarConstraint : public CS2::particles::CParticleFunctionConstraint {
		public:
			GlobalTypes::Vector m_PointOnPlane; // 0x1c0 | Schema_Atomic | Size: 0xc
			GlobalTypes::Vector m_PlaneNormal; // 0x1cc | Schema_Atomic | Size: 0xc
			int32_t m_nControlPointNumber; // 0x1d8 | Schema_Builtin | Size: 0x4
			bool m_bGlobalOrigin; // 0x1dc | Schema_Builtin | Size: 0x1
			bool m_bGlobalNormal; // 0x1dd | Schema_Builtin | Size: 0x1
			S2_PAD(0x2);
			particleslib::CPerParticleFloatInput m_flRadiusScale; // 0x1e0 | Schema_DeclaredClass | Size: 0x160
			particleslib::CParticleCollectionFloatInput m_flMaximumDistanceToCP; // 0x340 | Schema_DeclaredClass | Size: 0x160
			bool m_bUseOldCode; // 0x4a0 | Schema_Builtin | Size: 0x1
			S2_PAD(0x7); // End padding
		};
		static_assert(offsetof(CS2::particles::C_OP_PlanarConstraint, m_PointOnPlane) == 0x1C0, "m_PointOnPlane in C_OP_PlanarConstraint should be at offset 0x1C0");
		static_assert(offsetof(CS2::particles::C_OP_PlanarConstraint, m_PlaneNormal) == 0x1CC, "m_PlaneNormal in C_OP_PlanarConstraint should be at offset 0x1CC");
		static_assert(offsetof(CS2::particles::C_OP_PlanarConstraint, m_nControlPointNumber) == 0x1D8, "m_nControlPointNumber in C_OP_PlanarConstraint should be at offset 0x1D8");
		static_assert(offsetof(CS2::particles::C_OP_PlanarConstraint, m_bGlobalOrigin) == 0x1DC, "m_bGlobalOrigin in C_OP_PlanarConstraint should be at offset 0x1DC");
		static_assert(offsetof(CS2::particles::C_OP_PlanarConstraint, m_bGlobalNormal) == 0x1DD, "m_bGlobalNormal in C_OP_PlanarConstraint should be at offset 0x1DD");
		static_assert(offsetof(CS2::particles::C_OP_PlanarConstraint, m_flRadiusScale) == 0x1E0, "m_flRadiusScale in C_OP_PlanarConstraint should be at offset 0x1E0");
		static_assert(offsetof(CS2::particles::C_OP_PlanarConstraint, m_flMaximumDistanceToCP) == 0x340, "m_flMaximumDistanceToCP in C_OP_PlanarConstraint should be at offset 0x340");
		static_assert(offsetof(CS2::particles::C_OP_PlanarConstraint, m_bUseOldCode) == 0x4A0, "m_bUseOldCode in C_OP_PlanarConstraint should be at offset 0x4A0");
		static_assert(sizeof(CS2::particles::C_OP_PlanarConstraint) == 0x4A8, "C_OP_PlanarConstraint size should be 0x4A8");
	}
}
