// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#include <SDK/GlobalTypes.hpp>

#include <SDK/particles/CParticleFunctionOperator.hpp>
#include <SDK/particleslib/CParticleCollectionVecInput.hpp>
#include <SDK/particleslib/CParticleCollectionFloatInput.hpp>
#include <SDK/particles/CParticleMassCalculationParameters.hpp>



namespace CS2 {
	namespace particles {
		class C_OP_BasicMovement : public CS2::particles::CParticleFunctionOperator {
		public:
			particleslib::CParticleCollectionVecInput m_Gravity; // 0x1d0 | Schema_DeclaredClass | Size: 0x6b8
			particleslib::CParticleCollectionFloatInput m_fDrag; // 0x888 | Schema_DeclaredClass | Size: 0x170
			particles::CParticleMassCalculationParameters m_massControls; // 0x9f8 | Schema_DeclaredClass | Size: 0x458
			int32_t m_nMaxConstraintPasses; // 0xe50 | Schema_Builtin | Size: 0x4
			bool m_bUseNewCode; // 0xe54 | Schema_Builtin | Size: 0x1
			S2_PAD(0x3); // End padding
		};
		static_assert(offsetof(CS2::particles::C_OP_BasicMovement, m_Gravity) == 0x1D0, "m_Gravity in C_OP_BasicMovement should be at offset 0x1D0");
		static_assert(offsetof(CS2::particles::C_OP_BasicMovement, m_fDrag) == 0x888, "m_fDrag in C_OP_BasicMovement should be at offset 0x888");
		static_assert(offsetof(CS2::particles::C_OP_BasicMovement, m_massControls) == 0x9F8, "m_massControls in C_OP_BasicMovement should be at offset 0x9F8");
		static_assert(offsetof(CS2::particles::C_OP_BasicMovement, m_nMaxConstraintPasses) == 0xE50, "m_nMaxConstraintPasses in C_OP_BasicMovement should be at offset 0xE50");
		static_assert(offsetof(CS2::particles::C_OP_BasicMovement, m_bUseNewCode) == 0xE54, "m_bUseNewCode in C_OP_BasicMovement should be at offset 0xE54");
		static_assert(sizeof(CS2::particles::C_OP_BasicMovement) == 0xE58, "C_OP_BasicMovement size should be 0xE58");
	}
}
