// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#ifndef CUSTOM_GLOBAL_TYPES
	#include <SDK/GlobalTypes.hpp>
#else
	#include <Custom/GlobalTypes.hpp>
#endif


#include <SDK/particles/CParticleFunctionOperator.hpp>
#include <SDK/particleslib/CPerParticleVecInput.hpp>
#include <SDK/particles/ParticleAttributeIndex_t.hpp>
#include <SDK/particleslib/CParticleRemapFloatInput.hpp>
#include <SDK/particles/ParticleSetMethod_t.hpp>



namespace CS2 {
	namespace particles {
		class C_OP_ScreenSpacePositionOfTarget : public CS2::particles::CParticleFunctionOperator {
		public:
			particleslib::CPerParticleVecInput m_vecTargetPosition; // 0x1d0 | Schema_DeclaredClass | Size: 0x6b8
			bool m_bOututBehindness; // 0x888 | Schema_Builtin | Size: 0x1
			S2_PAD(0x3);
			particles::ParticleAttributeIndex_t m_nBehindFieldOutput; // 0x88c | Schema_DeclaredClass | Size: 0x4
			particleslib::CParticleRemapFloatInput m_flBehindOutputRemap; // 0x890 | Schema_DeclaredClass | Size: 0x170
			particles::ParticleSetMethod_t m_nBehindSetMethod; // 0xa00 | Schema_DeclaredEnum | Size: 0x4
			S2_PAD(0x4); // End padding
		};
		static_assert(offsetof(CS2::particles::C_OP_ScreenSpacePositionOfTarget, m_vecTargetPosition) == 0x1D0, "m_vecTargetPosition in C_OP_ScreenSpacePositionOfTarget should be at offset 0x1D0");
		static_assert(offsetof(CS2::particles::C_OP_ScreenSpacePositionOfTarget, m_bOututBehindness) == 0x888, "m_bOututBehindness in C_OP_ScreenSpacePositionOfTarget should be at offset 0x888");
		static_assert(offsetof(CS2::particles::C_OP_ScreenSpacePositionOfTarget, m_nBehindFieldOutput) == 0x88C, "m_nBehindFieldOutput in C_OP_ScreenSpacePositionOfTarget should be at offset 0x88C");
		static_assert(offsetof(CS2::particles::C_OP_ScreenSpacePositionOfTarget, m_flBehindOutputRemap) == 0x890, "m_flBehindOutputRemap in C_OP_ScreenSpacePositionOfTarget should be at offset 0x890");
		static_assert(offsetof(CS2::particles::C_OP_ScreenSpacePositionOfTarget, m_nBehindSetMethod) == 0xA00, "m_nBehindSetMethod in C_OP_ScreenSpacePositionOfTarget should be at offset 0xA00");
		static_assert(sizeof(CS2::particles::C_OP_ScreenSpacePositionOfTarget) == 0xA08, "C_OP_ScreenSpacePositionOfTarget size should be 0xA08");
	}
}
