// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#include <SDK/GlobalTypes.hpp>

#include <SDK/particles/CParticleFunctionOperator.hpp>
#include <SDK/particles/ParticleAttributeIndex_t.hpp>
#include <SDK/particleslib/CPerParticleFloatInput.hpp>
#include <SDK/particleslib/CParticleRemapFloatInput.hpp>
#include <SDK/particles/ParticleSetMethod_t.hpp>



namespace CS2 {
	namespace particles {
		class C_OP_ScreenSpaceDistanceToEdge : public CS2::particles::CParticleFunctionOperator {
		public:
			particles::ParticleAttributeIndex_t m_nFieldOutput; // 0x1c0 | Schema_DeclaredClass | Size: 0x4
			S2_PAD(0x4);
			particleslib::CPerParticleFloatInput m_flMaxDistFromEdge; // 0x1c8 | Schema_DeclaredClass | Size: 0x160
			particleslib::CParticleRemapFloatInput m_flOutputRemap; // 0x328 | Schema_DeclaredClass | Size: 0x160
			particles::ParticleSetMethod_t m_nSetMethod; // 0x488 | Schema_DeclaredEnum | Size: 0x4
			S2_PAD(0x24); // End padding
		};
		static_assert(offsetof(CS2::particles::C_OP_ScreenSpaceDistanceToEdge, m_nFieldOutput) == 0x1C0, "m_nFieldOutput in C_OP_ScreenSpaceDistanceToEdge should be at offset 0x1C0");
		static_assert(offsetof(CS2::particles::C_OP_ScreenSpaceDistanceToEdge, m_flMaxDistFromEdge) == 0x1C8, "m_flMaxDistFromEdge in C_OP_ScreenSpaceDistanceToEdge should be at offset 0x1C8");
		static_assert(offsetof(CS2::particles::C_OP_ScreenSpaceDistanceToEdge, m_flOutputRemap) == 0x328, "m_flOutputRemap in C_OP_ScreenSpaceDistanceToEdge should be at offset 0x328");
		static_assert(offsetof(CS2::particles::C_OP_ScreenSpaceDistanceToEdge, m_nSetMethod) == 0x488, "m_nSetMethod in C_OP_ScreenSpaceDistanceToEdge should be at offset 0x488");
		static_assert(sizeof(CS2::particles::C_OP_ScreenSpaceDistanceToEdge) == 0x4B0, "C_OP_ScreenSpaceDistanceToEdge size should be 0x4B0");
	}
}
