// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#ifndef CUSTOM_GLOBAL_TYPES
	#include <SDK/GlobalTypes.hpp>
#else
	#include <Custom/GlobalTypes.hpp>
#endif


#include <SDK/particles/CParticleFunctionPreEmission.hpp>
#include <SDK/particleslib/CParticleCollectionFloatInput.hpp>





using namespace GlobalTypes;
namespace CS2 {
	namespace particles {
		class C_OP_EnableChildrenFromParentParticleCount : public CS2::particles::CParticleFunctionPreEmission {
		public:
			int32_t m_nChildGroupID; // 0x1d8 | Schema_Builtin | Size: 0x4
			int32_t m_nFirstChild; // 0x1dc | Schema_Builtin | Size: 0x4
			particleslib::CParticleCollectionFloatInput m_nNumChildrenToEnable; // 0x1e0 | Schema_DeclaredClass | Size: 0x170
			bool m_bDisableChildren; // 0x350 | Schema_Builtin | Size: 0x1
			bool m_bPlayEndcapOnStop; // 0x351 | Schema_Builtin | Size: 0x1
			bool m_bDestroyImmediately; // 0x352 | Schema_Builtin | Size: 0x1
			S2_PAD(0x5); // End padding
		};
		static_assert(offsetof(CS2::particles::C_OP_EnableChildrenFromParentParticleCount, m_nChildGroupID) == 0x1D8, "m_nChildGroupID in C_OP_EnableChildrenFromParentParticleCount should be at offset 0x1D8");
		static_assert(offsetof(CS2::particles::C_OP_EnableChildrenFromParentParticleCount, m_nFirstChild) == 0x1DC, "m_nFirstChild in C_OP_EnableChildrenFromParentParticleCount should be at offset 0x1DC");
		static_assert(offsetof(CS2::particles::C_OP_EnableChildrenFromParentParticleCount, m_nNumChildrenToEnable) == 0x1E0, "m_nNumChildrenToEnable in C_OP_EnableChildrenFromParentParticleCount should be at offset 0x1E0");
		static_assert(offsetof(CS2::particles::C_OP_EnableChildrenFromParentParticleCount, m_bDisableChildren) == 0x350, "m_bDisableChildren in C_OP_EnableChildrenFromParentParticleCount should be at offset 0x350");
		static_assert(offsetof(CS2::particles::C_OP_EnableChildrenFromParentParticleCount, m_bPlayEndcapOnStop) == 0x351, "m_bPlayEndcapOnStop in C_OP_EnableChildrenFromParentParticleCount should be at offset 0x351");
		static_assert(offsetof(CS2::particles::C_OP_EnableChildrenFromParentParticleCount, m_bDestroyImmediately) == 0x352, "m_bDestroyImmediately in C_OP_EnableChildrenFromParentParticleCount should be at offset 0x352");
		static_assert(sizeof(CS2::particles::C_OP_EnableChildrenFromParentParticleCount) == 0x358, "C_OP_EnableChildrenFromParentParticleCount size should be 0x358");
	}
}
