// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#include <SDK/GlobalTypes.hpp>

#include <SDK/particles/CParticleFunctionOperator.hpp>
#include <SDK/particles/ParticleAttributeIndex_t.hpp>



namespace CS2 {
	namespace particles {
		class C_OP_RemapNamedModelElementEndCap : public CS2::particles::CParticleFunctionOperator {
		public:
			// GlobalTypes::CStrongHandle< resourcesystem::InfoForResourceTypeCModel > m_hModel; // 0x1c0 | Schema_Atomic | Size: 0x8
			char  m_hModel[0x8]; // 0x1c0 | Schema_Atomic | Size: 0x8
			// GlobalTypes::CUtlVector< GlobalTypes::CUtlString > m_inNames; // 0x1c8 | Schema_Atomic | Size: 0x18
			char  m_inNames[0x18]; // 0x1c8 | Schema_Atomic | Size: 0x18
			// GlobalTypes::CUtlVector< GlobalTypes::CUtlString > m_outNames; // 0x1e0 | Schema_Atomic | Size: 0x18
			char  m_outNames[0x18]; // 0x1e0 | Schema_Atomic | Size: 0x18
			// GlobalTypes::CUtlVector< GlobalTypes::CUtlString > m_fallbackNames; // 0x1f8 | Schema_Atomic | Size: 0x18
			char  m_fallbackNames[0x18]; // 0x1f8 | Schema_Atomic | Size: 0x18
			bool m_bModelFromRenderer; // 0x210 | Schema_Builtin | Size: 0x1
			S2_PAD(0x3);
			particles::ParticleAttributeIndex_t m_nFieldInput; // 0x214 | Schema_DeclaredClass | Size: 0x4
			particles::ParticleAttributeIndex_t m_nFieldOutput; // 0x218 | Schema_DeclaredClass | Size: 0x4
			S2_PAD(0x4); // End padding
		};
		static_assert(offsetof(CS2::particles::C_OP_RemapNamedModelElementEndCap, m_hModel) == 0x1C0, "m_hModel in C_OP_RemapNamedModelElementEndCap should be at offset 0x1C0");
		static_assert(offsetof(CS2::particles::C_OP_RemapNamedModelElementEndCap, m_inNames) == 0x1C8, "m_inNames in C_OP_RemapNamedModelElementEndCap should be at offset 0x1C8");
		static_assert(offsetof(CS2::particles::C_OP_RemapNamedModelElementEndCap, m_outNames) == 0x1E0, "m_outNames in C_OP_RemapNamedModelElementEndCap should be at offset 0x1E0");
		static_assert(offsetof(CS2::particles::C_OP_RemapNamedModelElementEndCap, m_fallbackNames) == 0x1F8, "m_fallbackNames in C_OP_RemapNamedModelElementEndCap should be at offset 0x1F8");
		static_assert(offsetof(CS2::particles::C_OP_RemapNamedModelElementEndCap, m_bModelFromRenderer) == 0x210, "m_bModelFromRenderer in C_OP_RemapNamedModelElementEndCap should be at offset 0x210");
		static_assert(offsetof(CS2::particles::C_OP_RemapNamedModelElementEndCap, m_nFieldInput) == 0x214, "m_nFieldInput in C_OP_RemapNamedModelElementEndCap should be at offset 0x214");
		static_assert(offsetof(CS2::particles::C_OP_RemapNamedModelElementEndCap, m_nFieldOutput) == 0x218, "m_nFieldOutput in C_OP_RemapNamedModelElementEndCap should be at offset 0x218");
		static_assert(sizeof(CS2::particles::C_OP_RemapNamedModelElementEndCap) == 0x220, "C_OP_RemapNamedModelElementEndCap size should be 0x220");
	}
}
