// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#ifndef CUSTOM_GLOBAL_TYPES
	#include <SDK/GlobalTypes.hpp>
#else
	#include <Custom/GlobalTypes.hpp>
#endif


#include <SDK/particles/CParticleFunctionOperator.hpp>
#include <SDK/particleslib/CPerParticleFloatInput.hpp>
#include <SDK/particles/ParticleAttributeIndex_t.hpp>
#include <SDK/particles/MissingParentInheritBehavior_t.hpp>



namespace CS2 {
	namespace particles {
		class C_OP_InheritFromParentParticlesV2 : public CS2::particles::CParticleFunctionOperator {
		public:
			particleslib::CPerParticleFloatInput m_flScale; // 0x1d0 | Schema_DeclaredClass | Size: 0x170
			particles::ParticleAttributeIndex_t m_nFieldOutput; // 0x340 | Schema_DeclaredClass | Size: 0x4
			S2_PAD(0x4);
			particleslib::CPerParticleFloatInput m_nIncrement; // 0x348 | Schema_DeclaredClass | Size: 0x170
			bool m_bRandomDistribution; // 0x4b8 | Schema_Builtin | Size: 0x1
			bool m_bReverse; // 0x4b9 | Schema_Builtin | Size: 0x1
			S2_PAD(0x2);
			particles::MissingParentInheritBehavior_t m_nMissingParentBehavior; // 0x4bc | Schema_DeclaredEnum | Size: 0x4
			particleslib::CPerParticleFloatInput m_flInterpolation; // 0x4c0 | Schema_DeclaredClass | Size: 0x170
		};
		static_assert(offsetof(CS2::particles::C_OP_InheritFromParentParticlesV2, m_flScale) == 0x1D0, "m_flScale in C_OP_InheritFromParentParticlesV2 should be at offset 0x1D0");
		static_assert(offsetof(CS2::particles::C_OP_InheritFromParentParticlesV2, m_nFieldOutput) == 0x340, "m_nFieldOutput in C_OP_InheritFromParentParticlesV2 should be at offset 0x340");
		static_assert(offsetof(CS2::particles::C_OP_InheritFromParentParticlesV2, m_nIncrement) == 0x348, "m_nIncrement in C_OP_InheritFromParentParticlesV2 should be at offset 0x348");
		static_assert(offsetof(CS2::particles::C_OP_InheritFromParentParticlesV2, m_bRandomDistribution) == 0x4B8, "m_bRandomDistribution in C_OP_InheritFromParentParticlesV2 should be at offset 0x4B8");
		static_assert(offsetof(CS2::particles::C_OP_InheritFromParentParticlesV2, m_bReverse) == 0x4B9, "m_bReverse in C_OP_InheritFromParentParticlesV2 should be at offset 0x4B9");
		static_assert(offsetof(CS2::particles::C_OP_InheritFromParentParticlesV2, m_nMissingParentBehavior) == 0x4BC, "m_nMissingParentBehavior in C_OP_InheritFromParentParticlesV2 should be at offset 0x4BC");
		static_assert(offsetof(CS2::particles::C_OP_InheritFromParentParticlesV2, m_flInterpolation) == 0x4C0, "m_flInterpolation in C_OP_InheritFromParentParticlesV2 should be at offset 0x4C0");
		static_assert(sizeof(CS2::particles::C_OP_InheritFromParentParticlesV2) == 0x630, "C_OP_InheritFromParentParticlesV2 size should be 0x630");
	}
}
