// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#ifndef CUSTOM_GLOBAL_TYPES
	#include <SDK/GlobalTypes.hpp>
#else
	#include <Custom/GlobalTypes.hpp>
#endif


#include <SDK/particles/CParticleFunctionOperator.hpp>
#include <SDK/particles/ParticleAttributeIndex_t.hpp>
#include <SDK/particles/ParticleSetMethod_t.hpp>





using namespace GlobalTypes;
namespace CS2 {
	namespace particles {
		class C_OP_RemapDotProductToScalar : public CS2::particles::CParticleFunctionOperator {
		public:
			int32_t m_nInputCP1; // 0x1d0 | Schema_Builtin | Size: 0x4
			int32_t m_nInputCP2; // 0x1d4 | Schema_Builtin | Size: 0x4
			particles::ParticleAttributeIndex_t m_nFieldOutput; // 0x1d8 | Schema_DeclaredClass | Size: 0x4
			float32 m_flInputMin; // 0x1dc | Schema_Builtin | Size: 0x4
			float32 m_flInputMax; // 0x1e0 | Schema_Builtin | Size: 0x4
			float32 m_flOutputMin; // 0x1e4 | Schema_Builtin | Size: 0x4
			float32 m_flOutputMax; // 0x1e8 | Schema_Builtin | Size: 0x4
			bool m_bUseParticleVelocity; // 0x1ec | Schema_Builtin | Size: 0x1
			S2_PAD(0x3);
			particles::ParticleSetMethod_t m_nSetMethod; // 0x1f0 | Schema_DeclaredEnum | Size: 0x4
			bool m_bActiveRange; // 0x1f4 | Schema_Builtin | Size: 0x1
			bool m_bUseParticleNormal; // 0x1f5 | Schema_Builtin | Size: 0x1
			S2_PAD(0x2); // End padding
		};
		static_assert(offsetof(CS2::particles::C_OP_RemapDotProductToScalar, m_nInputCP1) == 0x1D0, "m_nInputCP1 in C_OP_RemapDotProductToScalar should be at offset 0x1D0");
		static_assert(offsetof(CS2::particles::C_OP_RemapDotProductToScalar, m_nInputCP2) == 0x1D4, "m_nInputCP2 in C_OP_RemapDotProductToScalar should be at offset 0x1D4");
		static_assert(offsetof(CS2::particles::C_OP_RemapDotProductToScalar, m_nFieldOutput) == 0x1D8, "m_nFieldOutput in C_OP_RemapDotProductToScalar should be at offset 0x1D8");
		static_assert(offsetof(CS2::particles::C_OP_RemapDotProductToScalar, m_flInputMin) == 0x1DC, "m_flInputMin in C_OP_RemapDotProductToScalar should be at offset 0x1DC");
		static_assert(offsetof(CS2::particles::C_OP_RemapDotProductToScalar, m_flInputMax) == 0x1E0, "m_flInputMax in C_OP_RemapDotProductToScalar should be at offset 0x1E0");
		static_assert(offsetof(CS2::particles::C_OP_RemapDotProductToScalar, m_flOutputMin) == 0x1E4, "m_flOutputMin in C_OP_RemapDotProductToScalar should be at offset 0x1E4");
		static_assert(offsetof(CS2::particles::C_OP_RemapDotProductToScalar, m_flOutputMax) == 0x1E8, "m_flOutputMax in C_OP_RemapDotProductToScalar should be at offset 0x1E8");
		static_assert(offsetof(CS2::particles::C_OP_RemapDotProductToScalar, m_bUseParticleVelocity) == 0x1EC, "m_bUseParticleVelocity in C_OP_RemapDotProductToScalar should be at offset 0x1EC");
		static_assert(offsetof(CS2::particles::C_OP_RemapDotProductToScalar, m_nSetMethod) == 0x1F0, "m_nSetMethod in C_OP_RemapDotProductToScalar should be at offset 0x1F0");
		static_assert(offsetof(CS2::particles::C_OP_RemapDotProductToScalar, m_bActiveRange) == 0x1F4, "m_bActiveRange in C_OP_RemapDotProductToScalar should be at offset 0x1F4");
		static_assert(offsetof(CS2::particles::C_OP_RemapDotProductToScalar, m_bUseParticleNormal) == 0x1F5, "m_bUseParticleNormal in C_OP_RemapDotProductToScalar should be at offset 0x1F5");
		static_assert(sizeof(CS2::particles::C_OP_RemapDotProductToScalar) == 0x1F8, "C_OP_RemapDotProductToScalar size should be 0x1F8");
	}
}
