// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#include <SDK/GlobalTypes.hpp>

#include <SDK/particles/CParticleFunctionPreEmission.hpp>
#include <SDK/particles/VectorExpressionType_t.hpp>
#include <SDK/particleslib/CParticleCollectionVecInput.hpp>
#include <SDK/particleslib/CPerParticleFloatInput.hpp>



namespace CS2 {
	namespace particles {
		class C_OP_SetControlPointToVectorExpression : public CS2::particles::CParticleFunctionPreEmission {
		public:
			particles::VectorExpressionType_t m_nExpression; // 0x1c8 | Schema_DeclaredEnum | Size: 0x4
			int32_t m_nOutputCP; // 0x1cc | Schema_Builtin | Size: 0x4
			particleslib::CParticleCollectionVecInput m_vInput1; // 0x1d0 | Schema_DeclaredClass | Size: 0x678
			particleslib::CParticleCollectionVecInput m_vInput2; // 0x848 | Schema_DeclaredClass | Size: 0x678
			particleslib::CPerParticleFloatInput m_flLerp; // 0xec0 | Schema_DeclaredClass | Size: 0x160
			bool m_bNormalizedOutput; // 0x1020 | Schema_Builtin | Size: 0x1
			S2_PAD(0x7); // End padding
		};
		static_assert(offsetof(CS2::particles::C_OP_SetControlPointToVectorExpression, m_nExpression) == 0x1C8, "m_nExpression in C_OP_SetControlPointToVectorExpression should be at offset 0x1C8");
		static_assert(offsetof(CS2::particles::C_OP_SetControlPointToVectorExpression, m_nOutputCP) == 0x1CC, "m_nOutputCP in C_OP_SetControlPointToVectorExpression should be at offset 0x1CC");
		static_assert(offsetof(CS2::particles::C_OP_SetControlPointToVectorExpression, m_vInput1) == 0x1D0, "m_vInput1 in C_OP_SetControlPointToVectorExpression should be at offset 0x1D0");
		static_assert(offsetof(CS2::particles::C_OP_SetControlPointToVectorExpression, m_vInput2) == 0x848, "m_vInput2 in C_OP_SetControlPointToVectorExpression should be at offset 0x848");
		static_assert(offsetof(CS2::particles::C_OP_SetControlPointToVectorExpression, m_flLerp) == 0xEC0, "m_flLerp in C_OP_SetControlPointToVectorExpression should be at offset 0xEC0");
		static_assert(offsetof(CS2::particles::C_OP_SetControlPointToVectorExpression, m_bNormalizedOutput) == 0x1020, "m_bNormalizedOutput in C_OP_SetControlPointToVectorExpression should be at offset 0x1020");
		static_assert(sizeof(CS2::particles::C_OP_SetControlPointToVectorExpression) == 0x1028, "C_OP_SetControlPointToVectorExpression size should be 0x1028");
	}
}
