// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#ifndef CUSTOM_GLOBAL_TYPES
	#include <SDK/GlobalTypes.hpp>
#else
	#include <Custom/GlobalTypes.hpp>
#endif


#include <SDK/particles/CParticleFunctionOperator.hpp>
#include <SDK/particles/VectorFloatExpressionType_t.hpp>
#include <SDK/particleslib/CPerParticleVecInput.hpp>
#include <SDK/particleslib/CParticleRemapFloatInput.hpp>
#include <SDK/particles/ParticleAttributeIndex_t.hpp>
#include <SDK/particles/ParticleSetMethod_t.hpp>



namespace CS2 {
	namespace particles {
		class C_OP_SetFloatAttributeToVectorExpression : public CS2::particles::CParticleFunctionOperator {
		public:
			particles::VectorFloatExpressionType_t m_nExpression; // 0x1d0 | Schema_DeclaredEnum | Size: 0x4
			S2_PAD(0x4);
			particleslib::CPerParticleVecInput m_vInput1; // 0x1d8 | Schema_DeclaredClass | Size: 0x6b8
			particleslib::CPerParticleVecInput m_vInput2; // 0x890 | Schema_DeclaredClass | Size: 0x6b8
			particleslib::CParticleRemapFloatInput m_flOutputRemap; // 0xf48 | Schema_DeclaredClass | Size: 0x170
			particles::ParticleAttributeIndex_t m_nOutputField; // 0x10b8 | Schema_DeclaredClass | Size: 0x4
			particles::ParticleSetMethod_t m_nSetMethod; // 0x10bc | Schema_DeclaredEnum | Size: 0x4
		};
		static_assert(offsetof(CS2::particles::C_OP_SetFloatAttributeToVectorExpression, m_nExpression) == 0x1D0, "m_nExpression in C_OP_SetFloatAttributeToVectorExpression should be at offset 0x1D0");
		static_assert(offsetof(CS2::particles::C_OP_SetFloatAttributeToVectorExpression, m_vInput1) == 0x1D8, "m_vInput1 in C_OP_SetFloatAttributeToVectorExpression should be at offset 0x1D8");
		static_assert(offsetof(CS2::particles::C_OP_SetFloatAttributeToVectorExpression, m_vInput2) == 0x890, "m_vInput2 in C_OP_SetFloatAttributeToVectorExpression should be at offset 0x890");
		static_assert(offsetof(CS2::particles::C_OP_SetFloatAttributeToVectorExpression, m_flOutputRemap) == 0xF48, "m_flOutputRemap in C_OP_SetFloatAttributeToVectorExpression should be at offset 0xF48");
		static_assert(offsetof(CS2::particles::C_OP_SetFloatAttributeToVectorExpression, m_nOutputField) == 0x10B8, "m_nOutputField in C_OP_SetFloatAttributeToVectorExpression should be at offset 0x10B8");
		static_assert(offsetof(CS2::particles::C_OP_SetFloatAttributeToVectorExpression, m_nSetMethod) == 0x10BC, "m_nSetMethod in C_OP_SetFloatAttributeToVectorExpression should be at offset 0x10BC");
		static_assert(sizeof(CS2::particles::C_OP_SetFloatAttributeToVectorExpression) == 0x10C0, "C_OP_SetFloatAttributeToVectorExpression size should be 0x10C0");
	}
}
