// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#include <SDK/GlobalTypes.hpp>

#include <SDK/particles/CParticleFunctionOperator.hpp>



namespace CS2 {
	namespace particles {
		class C_OP_ModelCull : public CS2::particles::CParticleFunctionOperator {
		public:
			int32_t m_nControlPointNumber; // 0x1c0 | Schema_Builtin | Size: 0x4
			bool m_bBoundBox; // 0x1c4 | Schema_Builtin | Size: 0x1
			bool m_bCullOutside; // 0x1c5 | Schema_Builtin | Size: 0x1
			bool m_bUseBones; // 0x1c6 | Schema_Builtin | Size: 0x1
			char m_HitboxSetName[128]; // 0x1c7 | Schema_FixedArray | Size: 0x80
			S2_PAD(0x1); // End padding
		};
		static_assert(offsetof(CS2::particles::C_OP_ModelCull, m_nControlPointNumber) == 0x1C0, "m_nControlPointNumber in C_OP_ModelCull should be at offset 0x1C0");
		static_assert(offsetof(CS2::particles::C_OP_ModelCull, m_bBoundBox) == 0x1C4, "m_bBoundBox in C_OP_ModelCull should be at offset 0x1C4");
		static_assert(offsetof(CS2::particles::C_OP_ModelCull, m_bCullOutside) == 0x1C5, "m_bCullOutside in C_OP_ModelCull should be at offset 0x1C5");
		static_assert(offsetof(CS2::particles::C_OP_ModelCull, m_bUseBones) == 0x1C6, "m_bUseBones in C_OP_ModelCull should be at offset 0x1C6");
		static_assert(offsetof(CS2::particles::C_OP_ModelCull, m_HitboxSetName) == 0x1C7, "m_HitboxSetName in C_OP_ModelCull should be at offset 0x1C7");
		static_assert(sizeof(CS2::particles::C_OP_ModelCull) == 0x248, "C_OP_ModelCull size should be 0x248");
	}
}
