// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#ifndef CUSTOM_GLOBAL_TYPES
	#include "../GlobalTypes.hpp"
#else
	#include "../Custom/GlobalTypes.hpp"
#endif


#include "CParticleFunctionPreEmission.hpp"
#include "../particleslib/CParticleModelInput.hpp"
#include "../particleslib/CParticleCollectionFloatInput.hpp"





using namespace GlobalTypes;
namespace CS2 {
	namespace particles {
		class C_OP_ModelSurfaceSnapshotGenerator : public CS2::particles::CParticleFunctionPreEmission {
		public:
			int32_t m_nCPSnapshot; // 0x1d8 | Schema_Builtin | Size: 0x4
			S2_PAD(0x4);
			particleslib::CParticleModelInput m_modelInput; // 0x1e0 | Schema_DeclaredClass | Size: 0x60
			particleslib::CParticleCollectionFloatInput m_flRecalcRate; // 0x240 | Schema_DeclaredClass | Size: 0x170
			particleslib::CParticleCollectionFloatInput m_flUSpacing; // 0x3b0 | Schema_DeclaredClass | Size: 0x170
			particleslib::CParticleCollectionFloatInput m_flVSpacing; // 0x520 | Schema_DeclaredClass | Size: 0x170
			particleslib::CParticleCollectionFloatInput m_flSurfaceOffset; // 0x690 | Schema_DeclaredClass | Size: 0x170
			bool m_bSetNormal; // 0x800 | Schema_Builtin | Size: 0x1
			bool m_bSetUp; // 0x801 | Schema_Builtin | Size: 0x1
			bool m_bSetGravity; // 0x802 | Schema_Builtin | Size: 0x1
			bool m_bSetUV; // 0x803 | Schema_Builtin | Size: 0x1
			S2_PAD(0x4); // End padding
		};
		static_assert(offsetof(CS2::particles::C_OP_ModelSurfaceSnapshotGenerator, m_nCPSnapshot) == 0x1D8, "m_nCPSnapshot in C_OP_ModelSurfaceSnapshotGenerator should be at offset 0x1D8");
		static_assert(offsetof(CS2::particles::C_OP_ModelSurfaceSnapshotGenerator, m_modelInput) == 0x1E0, "m_modelInput in C_OP_ModelSurfaceSnapshotGenerator should be at offset 0x1E0");
		static_assert(offsetof(CS2::particles::C_OP_ModelSurfaceSnapshotGenerator, m_flRecalcRate) == 0x240, "m_flRecalcRate in C_OP_ModelSurfaceSnapshotGenerator should be at offset 0x240");
		static_assert(offsetof(CS2::particles::C_OP_ModelSurfaceSnapshotGenerator, m_flUSpacing) == 0x3B0, "m_flUSpacing in C_OP_ModelSurfaceSnapshotGenerator should be at offset 0x3B0");
		static_assert(offsetof(CS2::particles::C_OP_ModelSurfaceSnapshotGenerator, m_flVSpacing) == 0x520, "m_flVSpacing in C_OP_ModelSurfaceSnapshotGenerator should be at offset 0x520");
		static_assert(offsetof(CS2::particles::C_OP_ModelSurfaceSnapshotGenerator, m_flSurfaceOffset) == 0x690, "m_flSurfaceOffset in C_OP_ModelSurfaceSnapshotGenerator should be at offset 0x690");
		static_assert(offsetof(CS2::particles::C_OP_ModelSurfaceSnapshotGenerator, m_bSetNormal) == 0x800, "m_bSetNormal in C_OP_ModelSurfaceSnapshotGenerator should be at offset 0x800");
		static_assert(offsetof(CS2::particles::C_OP_ModelSurfaceSnapshotGenerator, m_bSetUp) == 0x801, "m_bSetUp in C_OP_ModelSurfaceSnapshotGenerator should be at offset 0x801");
		static_assert(offsetof(CS2::particles::C_OP_ModelSurfaceSnapshotGenerator, m_bSetGravity) == 0x802, "m_bSetGravity in C_OP_ModelSurfaceSnapshotGenerator should be at offset 0x802");
		static_assert(offsetof(CS2::particles::C_OP_ModelSurfaceSnapshotGenerator, m_bSetUV) == 0x803, "m_bSetUV in C_OP_ModelSurfaceSnapshotGenerator should be at offset 0x803");
		static_assert(sizeof(CS2::particles::C_OP_ModelSurfaceSnapshotGenerator) == 0x808, "C_OP_ModelSurfaceSnapshotGenerator size should be 0x808");
	}
}
