// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#include <SDK/GlobalTypes.hpp>

#include <SDK/particles/CParticleFunctionOperator.hpp>
#include <SDK/particles/ParticleAttributeIndex_t.hpp>
#include <SDK/particleslib/CPerParticleFloatInput.hpp>
#include <SDK/particleslib/CParticleRemapFloatInput.hpp>
#include <SDK/particles/ParticleSetMethod_t.hpp>



namespace CS2 {
	namespace particles {
		class C_OP_ScreenSpaceDistanceToEdge : public CS2::particles::CParticleFunctionOperator {
		public:
			particles::ParticleAttributeIndex_t m_nFieldOutput; // 0x1d0 | Schema_DeclaredClass | Size: 0x4
			S2_PAD(0x4);
			particleslib::CPerParticleFloatInput m_flMaxDistFromEdge; // 0x1d8 | Schema_DeclaredClass | Size: 0x170
			particleslib::CParticleRemapFloatInput m_flOutputRemap; // 0x348 | Schema_DeclaredClass | Size: 0x170
			particles::ParticleSetMethod_t m_nSetMethod; // 0x4b8 | Schema_DeclaredEnum | Size: 0x4
			S2_PAD(0x24); // End padding
		};
		static_assert(offsetof(CS2::particles::C_OP_ScreenSpaceDistanceToEdge, m_nFieldOutput) == 0x1D0, "m_nFieldOutput in C_OP_ScreenSpaceDistanceToEdge should be at offset 0x1D0");
		static_assert(offsetof(CS2::particles::C_OP_ScreenSpaceDistanceToEdge, m_flMaxDistFromEdge) == 0x1D8, "m_flMaxDistFromEdge in C_OP_ScreenSpaceDistanceToEdge should be at offset 0x1D8");
		static_assert(offsetof(CS2::particles::C_OP_ScreenSpaceDistanceToEdge, m_flOutputRemap) == 0x348, "m_flOutputRemap in C_OP_ScreenSpaceDistanceToEdge should be at offset 0x348");
		static_assert(offsetof(CS2::particles::C_OP_ScreenSpaceDistanceToEdge, m_nSetMethod) == 0x4B8, "m_nSetMethod in C_OP_ScreenSpaceDistanceToEdge should be at offset 0x4B8");
		static_assert(sizeof(CS2::particles::C_OP_ScreenSpaceDistanceToEdge) == 0x4E0, "C_OP_ScreenSpaceDistanceToEdge size should be 0x4E0");
	}
}
