// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#include <SDK/GlobalTypes.hpp>

#include <SDK/particles/CParticleFunctionOperator.hpp>
#include <SDK/particles/ParticleAttributeIndex_t.hpp>



namespace CS2 {
	namespace particles {
		class C_OP_Orient2DRelToCP : public CS2::particles::CParticleFunctionOperator {
		public:
			float32 m_flRotOffset; // 0x1c0 | Schema_Builtin | Size: 0x4
			float32 m_flSpinStrength; // 0x1c4 | Schema_Builtin | Size: 0x4
			int32_t m_nCP; // 0x1c8 | Schema_Builtin | Size: 0x4
			particles::ParticleAttributeIndex_t m_nFieldOutput; // 0x1cc | Schema_DeclaredClass | Size: 0x4
		};
		static_assert(offsetof(CS2::particles::C_OP_Orient2DRelToCP, m_flRotOffset) == 0x1C0, "m_flRotOffset in C_OP_Orient2DRelToCP should be at offset 0x1C0");
		static_assert(offsetof(CS2::particles::C_OP_Orient2DRelToCP, m_flSpinStrength) == 0x1C4, "m_flSpinStrength in C_OP_Orient2DRelToCP should be at offset 0x1C4");
		static_assert(offsetof(CS2::particles::C_OP_Orient2DRelToCP, m_nCP) == 0x1C8, "m_nCP in C_OP_Orient2DRelToCP should be at offset 0x1C8");
		static_assert(offsetof(CS2::particles::C_OP_Orient2DRelToCP, m_nFieldOutput) == 0x1CC, "m_nFieldOutput in C_OP_Orient2DRelToCP should be at offset 0x1CC");
		static_assert(sizeof(CS2::particles::C_OP_Orient2DRelToCP) == 0x1D0, "C_OP_Orient2DRelToCP size should be 0x1D0");
	}
}
