// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#include <SDK/GlobalTypes.hpp>

#include <SDK/particles/CParticleFunctionPreEmission.hpp>
#include <SDK/particleslib/CParticleCollectionVecInput.hpp>



namespace CS2 {
	namespace particles {
		class C_OP_RemapExternalWindToCP : public CS2::particles::CParticleFunctionPreEmission {
		public:
			int32_t m_nCP; // 0x1c8 | Schema_Builtin | Size: 0x4
			int32_t m_nCPOutput; // 0x1cc | Schema_Builtin | Size: 0x4
			particleslib::CParticleCollectionVecInput m_vecScale; // 0x1d0 | Schema_DeclaredClass | Size: 0x678
			bool m_bSetMagnitude; // 0x848 | Schema_Builtin | Size: 0x1
			S2_PAD(0x3);
			int32_t m_nOutVectorField; // 0x84c | Schema_Builtin | Size: 0x4
		};
		static_assert(offsetof(CS2::particles::C_OP_RemapExternalWindToCP, m_nCP) == 0x1C8, "m_nCP in C_OP_RemapExternalWindToCP should be at offset 0x1C8");
		static_assert(offsetof(CS2::particles::C_OP_RemapExternalWindToCP, m_nCPOutput) == 0x1CC, "m_nCPOutput in C_OP_RemapExternalWindToCP should be at offset 0x1CC");
		static_assert(offsetof(CS2::particles::C_OP_RemapExternalWindToCP, m_vecScale) == 0x1D0, "m_vecScale in C_OP_RemapExternalWindToCP should be at offset 0x1D0");
		static_assert(offsetof(CS2::particles::C_OP_RemapExternalWindToCP, m_bSetMagnitude) == 0x848, "m_bSetMagnitude in C_OP_RemapExternalWindToCP should be at offset 0x848");
		static_assert(offsetof(CS2::particles::C_OP_RemapExternalWindToCP, m_nOutVectorField) == 0x84C, "m_nOutVectorField in C_OP_RemapExternalWindToCP should be at offset 0x84C");
		static_assert(sizeof(CS2::particles::C_OP_RemapExternalWindToCP) == 0x850, "C_OP_RemapExternalWindToCP size should be 0x850");
	}
}
