// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#include <SDK/GlobalTypes.hpp>

#include <SDK/particles/CParticleFunctionPreEmission.hpp>
#include <SDK/particleslib/CParticleCollectionFloatInput.hpp>



namespace CS2 {
	namespace particles {
		class C_OP_EnableChildrenFromParentParticleCount : public CS2::particles::CParticleFunctionPreEmission {
		public:
			int32_t m_nChildGroupID; // 0x1c8 | Schema_Builtin | Size: 0x4
			int32_t m_nFirstChild; // 0x1cc | Schema_Builtin | Size: 0x4
			particleslib::CParticleCollectionFloatInput m_nNumChildrenToEnable; // 0x1d0 | Schema_DeclaredClass | Size: 0x160
			bool m_bDisableChildren; // 0x330 | Schema_Builtin | Size: 0x1
			bool m_bPlayEndcapOnStop; // 0x331 | Schema_Builtin | Size: 0x1
			bool m_bDestroyImmediately; // 0x332 | Schema_Builtin | Size: 0x1
			S2_PAD(0x5); // End padding
		};
		static_assert(offsetof(CS2::particles::C_OP_EnableChildrenFromParentParticleCount, m_nChildGroupID) == 0x1C8, "m_nChildGroupID in C_OP_EnableChildrenFromParentParticleCount should be at offset 0x1C8");
		static_assert(offsetof(CS2::particles::C_OP_EnableChildrenFromParentParticleCount, m_nFirstChild) == 0x1CC, "m_nFirstChild in C_OP_EnableChildrenFromParentParticleCount should be at offset 0x1CC");
		static_assert(offsetof(CS2::particles::C_OP_EnableChildrenFromParentParticleCount, m_nNumChildrenToEnable) == 0x1D0, "m_nNumChildrenToEnable in C_OP_EnableChildrenFromParentParticleCount should be at offset 0x1D0");
		static_assert(offsetof(CS2::particles::C_OP_EnableChildrenFromParentParticleCount, m_bDisableChildren) == 0x330, "m_bDisableChildren in C_OP_EnableChildrenFromParentParticleCount should be at offset 0x330");
		static_assert(offsetof(CS2::particles::C_OP_EnableChildrenFromParentParticleCount, m_bPlayEndcapOnStop) == 0x331, "m_bPlayEndcapOnStop in C_OP_EnableChildrenFromParentParticleCount should be at offset 0x331");
		static_assert(offsetof(CS2::particles::C_OP_EnableChildrenFromParentParticleCount, m_bDestroyImmediately) == 0x332, "m_bDestroyImmediately in C_OP_EnableChildrenFromParentParticleCount should be at offset 0x332");
		static_assert(sizeof(CS2::particles::C_OP_EnableChildrenFromParentParticleCount) == 0x338, "C_OP_EnableChildrenFromParentParticleCount size should be 0x338");
	}
}
