// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#include <SDK/GlobalTypes.hpp>

#include <SDK/particles/CParticleFunctionOperator.hpp>



namespace CS2 {
	namespace particles {
		class C_OP_SnapshotSkinToBones : public CS2::particles::CParticleFunctionOperator {
		public:
			bool m_bTransformNormals; // 0x1d0 | Schema_Builtin | Size: 0x1
			bool m_bTransformRadii; // 0x1d1 | Schema_Builtin | Size: 0x1
			S2_PAD(0x2);
			int32_t m_nControlPointNumber; // 0x1d4 | Schema_Builtin | Size: 0x4
			float32 m_flLifeTimeFadeStart; // 0x1d8 | Schema_Builtin | Size: 0x4
			float32 m_flLifeTimeFadeEnd; // 0x1dc | Schema_Builtin | Size: 0x4
			float32 m_flJumpThreshold; // 0x1e0 | Schema_Builtin | Size: 0x4
			float32 m_flPrevPosScale; // 0x1e4 | Schema_Builtin | Size: 0x4
		};
		static_assert(offsetof(CS2::particles::C_OP_SnapshotSkinToBones, m_bTransformNormals) == 0x1D0, "m_bTransformNormals in C_OP_SnapshotSkinToBones should be at offset 0x1D0");
		static_assert(offsetof(CS2::particles::C_OP_SnapshotSkinToBones, m_bTransformRadii) == 0x1D1, "m_bTransformRadii in C_OP_SnapshotSkinToBones should be at offset 0x1D1");
		static_assert(offsetof(CS2::particles::C_OP_SnapshotSkinToBones, m_nControlPointNumber) == 0x1D4, "m_nControlPointNumber in C_OP_SnapshotSkinToBones should be at offset 0x1D4");
		static_assert(offsetof(CS2::particles::C_OP_SnapshotSkinToBones, m_flLifeTimeFadeStart) == 0x1D8, "m_flLifeTimeFadeStart in C_OP_SnapshotSkinToBones should be at offset 0x1D8");
		static_assert(offsetof(CS2::particles::C_OP_SnapshotSkinToBones, m_flLifeTimeFadeEnd) == 0x1DC, "m_flLifeTimeFadeEnd in C_OP_SnapshotSkinToBones should be at offset 0x1DC");
		static_assert(offsetof(CS2::particles::C_OP_SnapshotSkinToBones, m_flJumpThreshold) == 0x1E0, "m_flJumpThreshold in C_OP_SnapshotSkinToBones should be at offset 0x1E0");
		static_assert(offsetof(CS2::particles::C_OP_SnapshotSkinToBones, m_flPrevPosScale) == 0x1E4, "m_flPrevPosScale in C_OP_SnapshotSkinToBones should be at offset 0x1E4");
		static_assert(sizeof(CS2::particles::C_OP_SnapshotSkinToBones) == 0x1E8, "C_OP_SnapshotSkinToBones size should be 0x1E8");
	}
}
