// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#include <SDK/GlobalTypes.hpp>

#include <SDK/particles/CParticleFunctionOperator.hpp>
#include <SDK/particles/CPathParameters.hpp>



namespace CS2 {
	namespace particles {
		class C_OP_LockToSavedSequentialPathV2 : public CS2::particles::CParticleFunctionOperator {
		public:
			float32 m_flFadeStart; // 0x1c0 | Schema_Builtin | Size: 0x4
			float32 m_flFadeEnd; // 0x1c4 | Schema_Builtin | Size: 0x4
			bool m_bCPPairs; // 0x1c8 | Schema_Builtin | Size: 0x1
			S2_PAD(0x7);
			particles::CPathParameters m_PathParams; // 0x1d0 | Schema_DeclaredClass | Size: 0x40
		};
		static_assert(offsetof(CS2::particles::C_OP_LockToSavedSequentialPathV2, m_flFadeStart) == 0x1C0, "m_flFadeStart in C_OP_LockToSavedSequentialPathV2 should be at offset 0x1C0");
		static_assert(offsetof(CS2::particles::C_OP_LockToSavedSequentialPathV2, m_flFadeEnd) == 0x1C4, "m_flFadeEnd in C_OP_LockToSavedSequentialPathV2 should be at offset 0x1C4");
		static_assert(offsetof(CS2::particles::C_OP_LockToSavedSequentialPathV2, m_bCPPairs) == 0x1C8, "m_bCPPairs in C_OP_LockToSavedSequentialPathV2 should be at offset 0x1C8");
		static_assert(offsetof(CS2::particles::C_OP_LockToSavedSequentialPathV2, m_PathParams) == 0x1D0, "m_PathParams in C_OP_LockToSavedSequentialPathV2 should be at offset 0x1D0");
		static_assert(sizeof(CS2::particles::C_OP_LockToSavedSequentialPathV2) == 0x210, "C_OP_LockToSavedSequentialPathV2 size should be 0x210");
	}
}
