// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#include <SDK/GlobalTypes.hpp>

#include <SDK/particles/CParticleFunctionOperator.hpp>
#include <SDK/particles/ParticleAttributeIndex_t.hpp>
#include <SDK/particleslib/CPerParticleFloatInput.hpp>



namespace CS2 {
	namespace particles {
		class C_OP_OscillateVector : public CS2::particles::CParticleFunctionOperator {
		public:
			GlobalTypes::Vector m_RateMin; // 0x1c0 | Schema_Atomic | Size: 0xc
			GlobalTypes::Vector m_RateMax; // 0x1cc | Schema_Atomic | Size: 0xc
			GlobalTypes::Vector m_FrequencyMin; // 0x1d8 | Schema_Atomic | Size: 0xc
			GlobalTypes::Vector m_FrequencyMax; // 0x1e4 | Schema_Atomic | Size: 0xc
			particles::ParticleAttributeIndex_t m_nField; // 0x1f0 | Schema_DeclaredClass | Size: 0x4
			bool m_bProportional; // 0x1f4 | Schema_Builtin | Size: 0x1
			bool m_bProportionalOp; // 0x1f5 | Schema_Builtin | Size: 0x1
			bool m_bOffset; // 0x1f6 | Schema_Builtin | Size: 0x1
			S2_PAD(0x1);
			float32 m_flStartTime_min; // 0x1f8 | Schema_Builtin | Size: 0x4
			float32 m_flStartTime_max; // 0x1fc | Schema_Builtin | Size: 0x4
			float32 m_flEndTime_min; // 0x200 | Schema_Builtin | Size: 0x4
			float32 m_flEndTime_max; // 0x204 | Schema_Builtin | Size: 0x4
			particleslib::CPerParticleFloatInput m_flOscMult; // 0x208 | Schema_DeclaredClass | Size: 0x160
			particleslib::CPerParticleFloatInput m_flOscAdd; // 0x368 | Schema_DeclaredClass | Size: 0x160
			particleslib::CPerParticleFloatInput m_flRateScale; // 0x4c8 | Schema_DeclaredClass | Size: 0x160
		};
		static_assert(offsetof(CS2::particles::C_OP_OscillateVector, m_RateMin) == 0x1C0, "m_RateMin in C_OP_OscillateVector should be at offset 0x1C0");
		static_assert(offsetof(CS2::particles::C_OP_OscillateVector, m_RateMax) == 0x1CC, "m_RateMax in C_OP_OscillateVector should be at offset 0x1CC");
		static_assert(offsetof(CS2::particles::C_OP_OscillateVector, m_FrequencyMin) == 0x1D8, "m_FrequencyMin in C_OP_OscillateVector should be at offset 0x1D8");
		static_assert(offsetof(CS2::particles::C_OP_OscillateVector, m_FrequencyMax) == 0x1E4, "m_FrequencyMax in C_OP_OscillateVector should be at offset 0x1E4");
		static_assert(offsetof(CS2::particles::C_OP_OscillateVector, m_nField) == 0x1F0, "m_nField in C_OP_OscillateVector should be at offset 0x1F0");
		static_assert(offsetof(CS2::particles::C_OP_OscillateVector, m_bProportional) == 0x1F4, "m_bProportional in C_OP_OscillateVector should be at offset 0x1F4");
		static_assert(offsetof(CS2::particles::C_OP_OscillateVector, m_bProportionalOp) == 0x1F5, "m_bProportionalOp in C_OP_OscillateVector should be at offset 0x1F5");
		static_assert(offsetof(CS2::particles::C_OP_OscillateVector, m_bOffset) == 0x1F6, "m_bOffset in C_OP_OscillateVector should be at offset 0x1F6");
		static_assert(offsetof(CS2::particles::C_OP_OscillateVector, m_flStartTime_min) == 0x1F8, "m_flStartTime_min in C_OP_OscillateVector should be at offset 0x1F8");
		static_assert(offsetof(CS2::particles::C_OP_OscillateVector, m_flStartTime_max) == 0x1FC, "m_flStartTime_max in C_OP_OscillateVector should be at offset 0x1FC");
		static_assert(offsetof(CS2::particles::C_OP_OscillateVector, m_flEndTime_min) == 0x200, "m_flEndTime_min in C_OP_OscillateVector should be at offset 0x200");
		static_assert(offsetof(CS2::particles::C_OP_OscillateVector, m_flEndTime_max) == 0x204, "m_flEndTime_max in C_OP_OscillateVector should be at offset 0x204");
		static_assert(offsetof(CS2::particles::C_OP_OscillateVector, m_flOscMult) == 0x208, "m_flOscMult in C_OP_OscillateVector should be at offset 0x208");
		static_assert(offsetof(CS2::particles::C_OP_OscillateVector, m_flOscAdd) == 0x368, "m_flOscAdd in C_OP_OscillateVector should be at offset 0x368");
		static_assert(offsetof(CS2::particles::C_OP_OscillateVector, m_flRateScale) == 0x4C8, "m_flRateScale in C_OP_OscillateVector should be at offset 0x4C8");
		static_assert(sizeof(CS2::particles::C_OP_OscillateVector) == 0x628, "C_OP_OscillateVector size should be 0x628");
	}
}
