// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#ifndef CUSTOM_GLOBAL_TYPES
	#include <SDK/GlobalTypes.hpp>
#else
	#include <Custom/GlobalTypes.hpp>
#endif


#include <SDK/particles/CParticleFunctionRenderer.hpp>
#include <SDK/particleslib/CParticleModelInput.hpp>
#include <SDK/particleslib/CParticleCollectionFloatInput.hpp>
#include <SDK/particleslib/CPerParticleFloatInput.hpp>
#include <SDK/particles/ParticleAttributeIndex_t.hpp>



namespace CS2 {
	namespace particles {
		class C_OP_RenderSimpleModelCollection : public CS2::particles::CParticleFunctionRenderer {
		public:
			bool m_bCenterOffset; // 0x220 | Schema_Builtin | Size: 0x1
			S2_PAD(0x7);
			// GlobalTypes::CStrongHandle< resourcesystem::InfoForResourceTypeCModel > m_hModel; // 0x228 | Schema_Atomic | Size: 0x8
			char  m_hModel[0x8]; // 0x228 | Schema_Atomic | Size: 0x8
			particleslib::CParticleModelInput m_modelInput; // 0x230 | Schema_DeclaredClass | Size: 0x60
			particleslib::CParticleCollectionFloatInput m_fSizeCullScale; // 0x290 | Schema_DeclaredClass | Size: 0x170
			bool m_bDisableShadows; // 0x400 | Schema_Builtin | Size: 0x1
			bool m_bDisableMotionBlur; // 0x401 | Schema_Builtin | Size: 0x1
			bool m_bAcceptsDecals; // 0x402 | Schema_Builtin | Size: 0x1
			S2_PAD(0x5);
			particleslib::CPerParticleFloatInput m_fDrawFilter; // 0x408 | Schema_DeclaredClass | Size: 0x170
			particles::ParticleAttributeIndex_t m_nAngularVelocityField; // 0x578 | Schema_DeclaredClass | Size: 0x4
			S2_PAD(0x14); // End padding
		};
		static_assert(offsetof(CS2::particles::C_OP_RenderSimpleModelCollection, m_bCenterOffset) == 0x220, "m_bCenterOffset in C_OP_RenderSimpleModelCollection should be at offset 0x220");
		static_assert(offsetof(CS2::particles::C_OP_RenderSimpleModelCollection, m_hModel) == 0x228, "m_hModel in C_OP_RenderSimpleModelCollection should be at offset 0x228");
		static_assert(offsetof(CS2::particles::C_OP_RenderSimpleModelCollection, m_modelInput) == 0x230, "m_modelInput in C_OP_RenderSimpleModelCollection should be at offset 0x230");
		static_assert(offsetof(CS2::particles::C_OP_RenderSimpleModelCollection, m_fSizeCullScale) == 0x290, "m_fSizeCullScale in C_OP_RenderSimpleModelCollection should be at offset 0x290");
		static_assert(offsetof(CS2::particles::C_OP_RenderSimpleModelCollection, m_bDisableShadows) == 0x400, "m_bDisableShadows in C_OP_RenderSimpleModelCollection should be at offset 0x400");
		static_assert(offsetof(CS2::particles::C_OP_RenderSimpleModelCollection, m_bDisableMotionBlur) == 0x401, "m_bDisableMotionBlur in C_OP_RenderSimpleModelCollection should be at offset 0x401");
		static_assert(offsetof(CS2::particles::C_OP_RenderSimpleModelCollection, m_bAcceptsDecals) == 0x402, "m_bAcceptsDecals in C_OP_RenderSimpleModelCollection should be at offset 0x402");
		static_assert(offsetof(CS2::particles::C_OP_RenderSimpleModelCollection, m_fDrawFilter) == 0x408, "m_fDrawFilter in C_OP_RenderSimpleModelCollection should be at offset 0x408");
		static_assert(offsetof(CS2::particles::C_OP_RenderSimpleModelCollection, m_nAngularVelocityField) == 0x578, "m_nAngularVelocityField in C_OP_RenderSimpleModelCollection should be at offset 0x578");
		static_assert(sizeof(CS2::particles::C_OP_RenderSimpleModelCollection) == 0x590, "C_OP_RenderSimpleModelCollection size should be 0x590");
	}
}
