// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#include <SDK/GlobalTypes.hpp>

#include <SDK/particles/CParticleFunctionConstraint.hpp>



namespace CS2 {
	namespace particles {
		class C_OP_ConstrainDistanceToUserSpecifiedPath : public CS2::particles::CParticleFunctionConstraint {
		public:
			float32 m_fMinDistance; // 0x1d0 | Schema_Builtin | Size: 0x4
			float32 m_flMaxDistance; // 0x1d4 | Schema_Builtin | Size: 0x4
			float32 m_flTimeScale; // 0x1d8 | Schema_Builtin | Size: 0x4
			bool m_bLoopedPath; // 0x1dc | Schema_Builtin | Size: 0x1
			S2_PAD(0x3);
			// GlobalTypes::CUtlVector< particles::PointDefinitionWithTimeValues_t > m_pointList; // 0x1e0 | Schema_Atomic | Size: 0x18
			char  m_pointList[0x18]; // 0x1e0 | Schema_Atomic | Size: 0x18
		};
		static_assert(offsetof(CS2::particles::C_OP_ConstrainDistanceToUserSpecifiedPath, m_fMinDistance) == 0x1D0, "m_fMinDistance in C_OP_ConstrainDistanceToUserSpecifiedPath should be at offset 0x1D0");
		static_assert(offsetof(CS2::particles::C_OP_ConstrainDistanceToUserSpecifiedPath, m_flMaxDistance) == 0x1D4, "m_flMaxDistance in C_OP_ConstrainDistanceToUserSpecifiedPath should be at offset 0x1D4");
		static_assert(offsetof(CS2::particles::C_OP_ConstrainDistanceToUserSpecifiedPath, m_flTimeScale) == 0x1D8, "m_flTimeScale in C_OP_ConstrainDistanceToUserSpecifiedPath should be at offset 0x1D8");
		static_assert(offsetof(CS2::particles::C_OP_ConstrainDistanceToUserSpecifiedPath, m_bLoopedPath) == 0x1DC, "m_bLoopedPath in C_OP_ConstrainDistanceToUserSpecifiedPath should be at offset 0x1DC");
		static_assert(offsetof(CS2::particles::C_OP_ConstrainDistanceToUserSpecifiedPath, m_pointList) == 0x1E0, "m_pointList in C_OP_ConstrainDistanceToUserSpecifiedPath should be at offset 0x1E0");
		static_assert(sizeof(CS2::particles::C_OP_ConstrainDistanceToUserSpecifiedPath) == 0x1F8, "C_OP_ConstrainDistanceToUserSpecifiedPath size should be 0x1F8");
	}
}
