// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#ifndef CUSTOM_GLOBAL_TYPES
	#include <SDK/GlobalTypes.hpp>
#else
	#include <Custom/GlobalTypes.hpp>
#endif


#include <SDK/particles/CParticleFunctionOperator.hpp>
#include <SDK/particles/ParticleAttributeIndex_t.hpp>



namespace CS2 {
	namespace particles {
		class C_OP_RemapScalar : public CS2::particles::CParticleFunctionOperator {
		public:
			particles::ParticleAttributeIndex_t m_nFieldInput; // 0x1d0 | Schema_DeclaredClass | Size: 0x4
			particles::ParticleAttributeIndex_t m_nFieldOutput; // 0x1d4 | Schema_DeclaredClass | Size: 0x4
			float32 m_flInputMin; // 0x1d8 | Schema_Builtin | Size: 0x4
			float32 m_flInputMax; // 0x1dc | Schema_Builtin | Size: 0x4
			float32 m_flOutputMin; // 0x1e0 | Schema_Builtin | Size: 0x4
			float32 m_flOutputMax; // 0x1e4 | Schema_Builtin | Size: 0x4
			bool m_bOldCode; // 0x1e8 | Schema_Builtin | Size: 0x1
			S2_PAD(0x7); // End padding
		};
		static_assert(offsetof(CS2::particles::C_OP_RemapScalar, m_nFieldInput) == 0x1D0, "m_nFieldInput in C_OP_RemapScalar should be at offset 0x1D0");
		static_assert(offsetof(CS2::particles::C_OP_RemapScalar, m_nFieldOutput) == 0x1D4, "m_nFieldOutput in C_OP_RemapScalar should be at offset 0x1D4");
		static_assert(offsetof(CS2::particles::C_OP_RemapScalar, m_flInputMin) == 0x1D8, "m_flInputMin in C_OP_RemapScalar should be at offset 0x1D8");
		static_assert(offsetof(CS2::particles::C_OP_RemapScalar, m_flInputMax) == 0x1DC, "m_flInputMax in C_OP_RemapScalar should be at offset 0x1DC");
		static_assert(offsetof(CS2::particles::C_OP_RemapScalar, m_flOutputMin) == 0x1E0, "m_flOutputMin in C_OP_RemapScalar should be at offset 0x1E0");
		static_assert(offsetof(CS2::particles::C_OP_RemapScalar, m_flOutputMax) == 0x1E4, "m_flOutputMax in C_OP_RemapScalar should be at offset 0x1E4");
		static_assert(offsetof(CS2::particles::C_OP_RemapScalar, m_bOldCode) == 0x1E8, "m_bOldCode in C_OP_RemapScalar should be at offset 0x1E8");
		static_assert(sizeof(CS2::particles::C_OP_RemapScalar) == 0x1F0, "C_OP_RemapScalar size should be 0x1F0");
	}
}
