// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#include <SDK/GlobalTypes.hpp>

#include <SDK/particles/CParticleFunctionPreEmission.hpp>
#include <SDK/particles/VectorFloatExpressionType_t.hpp>
#include <SDK/particleslib/CParticleCollectionVecInput.hpp>
#include <SDK/particleslib/CPerParticleFloatInput.hpp>
#include <SDK/particleslib/CParticleRemapFloatInput.hpp>



namespace CS2 {
	namespace particles {
		class C_OP_SetControlPointFieldFromVectorExpression : public CS2::particles::CParticleFunctionPreEmission {
		public:
			particles::VectorFloatExpressionType_t m_nExpression; // 0x1c8 | Schema_DeclaredEnum | Size: 0x4
			S2_PAD(0x4);
			particleslib::CParticleCollectionVecInput m_vecInput1; // 0x1d0 | Schema_DeclaredClass | Size: 0x678
			particleslib::CParticleCollectionVecInput m_vecInput2; // 0x848 | Schema_DeclaredClass | Size: 0x678
			particleslib::CPerParticleFloatInput m_flLerp; // 0xec0 | Schema_DeclaredClass | Size: 0x160
			particleslib::CParticleRemapFloatInput m_flOutputRemap; // 0x1020 | Schema_DeclaredClass | Size: 0x160
			int32_t m_nOutputCP; // 0x1180 | Schema_Builtin | Size: 0x4
			int32_t m_nOutVectorField; // 0x1184 | Schema_Builtin | Size: 0x4
		};
		static_assert(offsetof(CS2::particles::C_OP_SetControlPointFieldFromVectorExpression, m_nExpression) == 0x1C8, "m_nExpression in C_OP_SetControlPointFieldFromVectorExpression should be at offset 0x1C8");
		static_assert(offsetof(CS2::particles::C_OP_SetControlPointFieldFromVectorExpression, m_vecInput1) == 0x1D0, "m_vecInput1 in C_OP_SetControlPointFieldFromVectorExpression should be at offset 0x1D0");
		static_assert(offsetof(CS2::particles::C_OP_SetControlPointFieldFromVectorExpression, m_vecInput2) == 0x848, "m_vecInput2 in C_OP_SetControlPointFieldFromVectorExpression should be at offset 0x848");
		static_assert(offsetof(CS2::particles::C_OP_SetControlPointFieldFromVectorExpression, m_flLerp) == 0xEC0, "m_flLerp in C_OP_SetControlPointFieldFromVectorExpression should be at offset 0xEC0");
		static_assert(offsetof(CS2::particles::C_OP_SetControlPointFieldFromVectorExpression, m_flOutputRemap) == 0x1020, "m_flOutputRemap in C_OP_SetControlPointFieldFromVectorExpression should be at offset 0x1020");
		static_assert(offsetof(CS2::particles::C_OP_SetControlPointFieldFromVectorExpression, m_nOutputCP) == 0x1180, "m_nOutputCP in C_OP_SetControlPointFieldFromVectorExpression should be at offset 0x1180");
		static_assert(offsetof(CS2::particles::C_OP_SetControlPointFieldFromVectorExpression, m_nOutVectorField) == 0x1184, "m_nOutVectorField in C_OP_SetControlPointFieldFromVectorExpression should be at offset 0x1184");
		static_assert(sizeof(CS2::particles::C_OP_SetControlPointFieldFromVectorExpression) == 0x1188, "C_OP_SetControlPointFieldFromVectorExpression size should be 0x1188");
	}
}
