// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#ifndef CUSTOM_GLOBAL_TYPES
	#include <SDK/GlobalTypes.hpp>
#else
	#include <Custom/GlobalTypes.hpp>
#endif


#include <SDK/particles/CParticleFunctionConstraint.hpp>
#include <SDK/particles/ParticleCollisionMode_t.hpp>
#include <SDK/particles/ParticleTraceSet_t.hpp>
#include <SDK/particleslib/CPerParticleFloatInput.hpp>
#include <SDK/particles/ParticleAttributeIndex_t.hpp>



namespace CS2 {
	namespace particles {
		class C_OP_WorldTraceConstraint : public CS2::particles::CParticleFunctionConstraint {
		public:
			int32_t m_nCP; // 0x1d0 | Schema_Builtin | Size: 0x4
			GlobalTypes::Vector m_vecCpOffset; // 0x1d4 | Schema_Atomic | Size: 0xc
			particles::ParticleCollisionMode_t m_nCollisionMode; // 0x1e0 | Schema_DeclaredEnum | Size: 0x4
			particles::ParticleCollisionMode_t m_nCollisionModeMin; // 0x1e4 | Schema_DeclaredEnum | Size: 0x4
			particles::ParticleTraceSet_t m_nTraceSet; // 0x1e8 | Schema_DeclaredEnum | Size: 0x4
			char m_CollisionGroupName[128]; // 0x1ec | Schema_FixedArray | Size: 0x80
			bool m_bWorldOnly; // 0x26c | Schema_Builtin | Size: 0x1
			bool m_bBrushOnly; // 0x26d | Schema_Builtin | Size: 0x1
			bool m_bIncludeWater; // 0x26e | Schema_Builtin | Size: 0x1
			S2_PAD(0x1);
			int32_t m_nIgnoreCP; // 0x270 | Schema_Builtin | Size: 0x4
			float32 m_flCpMovementTolerance; // 0x274 | Schema_Builtin | Size: 0x4
			float32 m_flRetestRate; // 0x278 | Schema_Builtin | Size: 0x4
			float32 m_flTraceTolerance; // 0x27c | Schema_Builtin | Size: 0x4
			float32 m_flCollisionConfirmationSpeed; // 0x280 | Schema_Builtin | Size: 0x4
			float32 m_nMaxTracesPerFrame; // 0x284 | Schema_Builtin | Size: 0x4
			particleslib::CPerParticleFloatInput m_flRadiusScale; // 0x288 | Schema_DeclaredClass | Size: 0x170
			particleslib::CPerParticleFloatInput m_flBounceAmount; // 0x3f8 | Schema_DeclaredClass | Size: 0x170
			particleslib::CPerParticleFloatInput m_flSlideAmount; // 0x568 | Schema_DeclaredClass | Size: 0x170
			particleslib::CPerParticleFloatInput m_flRandomDirScale; // 0x6d8 | Schema_DeclaredClass | Size: 0x170
			bool m_bDecayBounce; // 0x848 | Schema_Builtin | Size: 0x1
			bool m_bKillonContact; // 0x849 | Schema_Builtin | Size: 0x1
			S2_PAD(0x2);
			float32 m_flMinSpeed; // 0x84c | Schema_Builtin | Size: 0x4
			bool m_bSetNormal; // 0x850 | Schema_Builtin | Size: 0x1
			S2_PAD(0x3);
			particles::ParticleAttributeIndex_t m_nStickOnCollisionField; // 0x854 | Schema_DeclaredClass | Size: 0x4
			particleslib::CPerParticleFloatInput m_flStopSpeed; // 0x858 | Schema_DeclaredClass | Size: 0x170
			particles::ParticleAttributeIndex_t m_nEntityStickDataField; // 0x9c8 | Schema_DeclaredClass | Size: 0x4
			particles::ParticleAttributeIndex_t m_nEntityStickNormalField; // 0x9cc | Schema_DeclaredClass | Size: 0x4
		};
		static_assert(offsetof(CS2::particles::C_OP_WorldTraceConstraint, m_nCP) == 0x1D0, "m_nCP in C_OP_WorldTraceConstraint should be at offset 0x1D0");
		static_assert(offsetof(CS2::particles::C_OP_WorldTraceConstraint, m_vecCpOffset) == 0x1D4, "m_vecCpOffset in C_OP_WorldTraceConstraint should be at offset 0x1D4");
		static_assert(offsetof(CS2::particles::C_OP_WorldTraceConstraint, m_nCollisionMode) == 0x1E0, "m_nCollisionMode in C_OP_WorldTraceConstraint should be at offset 0x1E0");
		static_assert(offsetof(CS2::particles::C_OP_WorldTraceConstraint, m_nCollisionModeMin) == 0x1E4, "m_nCollisionModeMin in C_OP_WorldTraceConstraint should be at offset 0x1E4");
		static_assert(offsetof(CS2::particles::C_OP_WorldTraceConstraint, m_nTraceSet) == 0x1E8, "m_nTraceSet in C_OP_WorldTraceConstraint should be at offset 0x1E8");
		static_assert(offsetof(CS2::particles::C_OP_WorldTraceConstraint, m_CollisionGroupName) == 0x1EC, "m_CollisionGroupName in C_OP_WorldTraceConstraint should be at offset 0x1EC");
		static_assert(offsetof(CS2::particles::C_OP_WorldTraceConstraint, m_bWorldOnly) == 0x26C, "m_bWorldOnly in C_OP_WorldTraceConstraint should be at offset 0x26C");
		static_assert(offsetof(CS2::particles::C_OP_WorldTraceConstraint, m_bBrushOnly) == 0x26D, "m_bBrushOnly in C_OP_WorldTraceConstraint should be at offset 0x26D");
		static_assert(offsetof(CS2::particles::C_OP_WorldTraceConstraint, m_bIncludeWater) == 0x26E, "m_bIncludeWater in C_OP_WorldTraceConstraint should be at offset 0x26E");
		static_assert(offsetof(CS2::particles::C_OP_WorldTraceConstraint, m_nIgnoreCP) == 0x270, "m_nIgnoreCP in C_OP_WorldTraceConstraint should be at offset 0x270");
		static_assert(offsetof(CS2::particles::C_OP_WorldTraceConstraint, m_flCpMovementTolerance) == 0x274, "m_flCpMovementTolerance in C_OP_WorldTraceConstraint should be at offset 0x274");
		static_assert(offsetof(CS2::particles::C_OP_WorldTraceConstraint, m_flRetestRate) == 0x278, "m_flRetestRate in C_OP_WorldTraceConstraint should be at offset 0x278");
		static_assert(offsetof(CS2::particles::C_OP_WorldTraceConstraint, m_flTraceTolerance) == 0x27C, "m_flTraceTolerance in C_OP_WorldTraceConstraint should be at offset 0x27C");
		static_assert(offsetof(CS2::particles::C_OP_WorldTraceConstraint, m_flCollisionConfirmationSpeed) == 0x280, "m_flCollisionConfirmationSpeed in C_OP_WorldTraceConstraint should be at offset 0x280");
		static_assert(offsetof(CS2::particles::C_OP_WorldTraceConstraint, m_nMaxTracesPerFrame) == 0x284, "m_nMaxTracesPerFrame in C_OP_WorldTraceConstraint should be at offset 0x284");
		static_assert(offsetof(CS2::particles::C_OP_WorldTraceConstraint, m_flRadiusScale) == 0x288, "m_flRadiusScale in C_OP_WorldTraceConstraint should be at offset 0x288");
		static_assert(offsetof(CS2::particles::C_OP_WorldTraceConstraint, m_flBounceAmount) == 0x3F8, "m_flBounceAmount in C_OP_WorldTraceConstraint should be at offset 0x3F8");
		static_assert(offsetof(CS2::particles::C_OP_WorldTraceConstraint, m_flSlideAmount) == 0x568, "m_flSlideAmount in C_OP_WorldTraceConstraint should be at offset 0x568");
		static_assert(offsetof(CS2::particles::C_OP_WorldTraceConstraint, m_flRandomDirScale) == 0x6D8, "m_flRandomDirScale in C_OP_WorldTraceConstraint should be at offset 0x6D8");
		static_assert(offsetof(CS2::particles::C_OP_WorldTraceConstraint, m_bDecayBounce) == 0x848, "m_bDecayBounce in C_OP_WorldTraceConstraint should be at offset 0x848");
		static_assert(offsetof(CS2::particles::C_OP_WorldTraceConstraint, m_bKillonContact) == 0x849, "m_bKillonContact in C_OP_WorldTraceConstraint should be at offset 0x849");
		static_assert(offsetof(CS2::particles::C_OP_WorldTraceConstraint, m_flMinSpeed) == 0x84C, "m_flMinSpeed in C_OP_WorldTraceConstraint should be at offset 0x84C");
		static_assert(offsetof(CS2::particles::C_OP_WorldTraceConstraint, m_bSetNormal) == 0x850, "m_bSetNormal in C_OP_WorldTraceConstraint should be at offset 0x850");
		static_assert(offsetof(CS2::particles::C_OP_WorldTraceConstraint, m_nStickOnCollisionField) == 0x854, "m_nStickOnCollisionField in C_OP_WorldTraceConstraint should be at offset 0x854");
		static_assert(offsetof(CS2::particles::C_OP_WorldTraceConstraint, m_flStopSpeed) == 0x858, "m_flStopSpeed in C_OP_WorldTraceConstraint should be at offset 0x858");
		static_assert(offsetof(CS2::particles::C_OP_WorldTraceConstraint, m_nEntityStickDataField) == 0x9C8, "m_nEntityStickDataField in C_OP_WorldTraceConstraint should be at offset 0x9C8");
		static_assert(offsetof(CS2::particles::C_OP_WorldTraceConstraint, m_nEntityStickNormalField) == 0x9CC, "m_nEntityStickNormalField in C_OP_WorldTraceConstraint should be at offset 0x9CC");
		static_assert(sizeof(CS2::particles::C_OP_WorldTraceConstraint) == 0x9D0, "C_OP_WorldTraceConstraint size should be 0x9D0");
	}
}
