// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#include <SDK/GlobalTypes.hpp>

#include <SDK/particles/CParticleFunctionOperator.hpp>
#include <SDK/particles/ParticleAttributeIndex_t.hpp>
#include <SDK/particleslib/CParticleCollectionFloatInput.hpp>



namespace CS2 {
	namespace particles {
		class C_OP_RemapSDFDistanceToScalarAttribute : public CS2::particles::CParticleFunctionOperator {
		public:
			particles::ParticleAttributeIndex_t m_nFieldOutput; // 0x1c0 | Schema_DeclaredClass | Size: 0x4
			particles::ParticleAttributeIndex_t m_nVectorFieldInput; // 0x1c4 | Schema_DeclaredClass | Size: 0x4
			particleslib::CParticleCollectionFloatInput m_flMinDistance; // 0x1c8 | Schema_DeclaredClass | Size: 0x160
			particleslib::CParticleCollectionFloatInput m_flMaxDistance; // 0x328 | Schema_DeclaredClass | Size: 0x160
			particleslib::CParticleCollectionFloatInput m_flValueBelowMin; // 0x488 | Schema_DeclaredClass | Size: 0x160
			particleslib::CParticleCollectionFloatInput m_flValueAtMin; // 0x5e8 | Schema_DeclaredClass | Size: 0x160
			particleslib::CParticleCollectionFloatInput m_flValueAtMax; // 0x748 | Schema_DeclaredClass | Size: 0x160
			particleslib::CParticleCollectionFloatInput m_flValueAboveMax; // 0x8a8 | Schema_DeclaredClass | Size: 0x160
		};
		static_assert(offsetof(CS2::particles::C_OP_RemapSDFDistanceToScalarAttribute, m_nFieldOutput) == 0x1C0, "m_nFieldOutput in C_OP_RemapSDFDistanceToScalarAttribute should be at offset 0x1C0");
		static_assert(offsetof(CS2::particles::C_OP_RemapSDFDistanceToScalarAttribute, m_nVectorFieldInput) == 0x1C4, "m_nVectorFieldInput in C_OP_RemapSDFDistanceToScalarAttribute should be at offset 0x1C4");
		static_assert(offsetof(CS2::particles::C_OP_RemapSDFDistanceToScalarAttribute, m_flMinDistance) == 0x1C8, "m_flMinDistance in C_OP_RemapSDFDistanceToScalarAttribute should be at offset 0x1C8");
		static_assert(offsetof(CS2::particles::C_OP_RemapSDFDistanceToScalarAttribute, m_flMaxDistance) == 0x328, "m_flMaxDistance in C_OP_RemapSDFDistanceToScalarAttribute should be at offset 0x328");
		static_assert(offsetof(CS2::particles::C_OP_RemapSDFDistanceToScalarAttribute, m_flValueBelowMin) == 0x488, "m_flValueBelowMin in C_OP_RemapSDFDistanceToScalarAttribute should be at offset 0x488");
		static_assert(offsetof(CS2::particles::C_OP_RemapSDFDistanceToScalarAttribute, m_flValueAtMin) == 0x5E8, "m_flValueAtMin in C_OP_RemapSDFDistanceToScalarAttribute should be at offset 0x5E8");
		static_assert(offsetof(CS2::particles::C_OP_RemapSDFDistanceToScalarAttribute, m_flValueAtMax) == 0x748, "m_flValueAtMax in C_OP_RemapSDFDistanceToScalarAttribute should be at offset 0x748");
		static_assert(offsetof(CS2::particles::C_OP_RemapSDFDistanceToScalarAttribute, m_flValueAboveMax) == 0x8A8, "m_flValueAboveMax in C_OP_RemapSDFDistanceToScalarAttribute should be at offset 0x8A8");
		static_assert(sizeof(CS2::particles::C_OP_RemapSDFDistanceToScalarAttribute) == 0xA08, "C_OP_RemapSDFDistanceToScalarAttribute size should be 0xA08");
	}
}
