// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#ifndef CUSTOM_GLOBAL_TYPES
	#include <SDK/GlobalTypes.hpp>
#else
	#include <Custom/GlobalTypes.hpp>
#endif


#include <SDK/particles/CParticleFunctionPreEmission.hpp>
#include <SDK/particleslib/CParticleCollectionFloatInput.hpp>





using namespace GlobalTypes;
namespace CS2 {
	namespace particles {
		class C_OP_SetCPOrientationToPointAtCP : public CS2::particles::CParticleFunctionPreEmission {
		public:
			int32_t m_nInputCP; // 0x1d8 | Schema_Builtin | Size: 0x4
			int32_t m_nOutputCP; // 0x1dc | Schema_Builtin | Size: 0x4
			particleslib::CParticleCollectionFloatInput m_flInterpolation; // 0x1e0 | Schema_DeclaredClass | Size: 0x170
			bool m_b2DOrientation; // 0x350 | Schema_Builtin | Size: 0x1
			bool m_bAvoidSingularity; // 0x351 | Schema_Builtin | Size: 0x1
			bool m_bPointAway; // 0x352 | Schema_Builtin | Size: 0x1
			S2_PAD(0x5); // End padding
		};
		static_assert(offsetof(CS2::particles::C_OP_SetCPOrientationToPointAtCP, m_nInputCP) == 0x1D8, "m_nInputCP in C_OP_SetCPOrientationToPointAtCP should be at offset 0x1D8");
		static_assert(offsetof(CS2::particles::C_OP_SetCPOrientationToPointAtCP, m_nOutputCP) == 0x1DC, "m_nOutputCP in C_OP_SetCPOrientationToPointAtCP should be at offset 0x1DC");
		static_assert(offsetof(CS2::particles::C_OP_SetCPOrientationToPointAtCP, m_flInterpolation) == 0x1E0, "m_flInterpolation in C_OP_SetCPOrientationToPointAtCP should be at offset 0x1E0");
		static_assert(offsetof(CS2::particles::C_OP_SetCPOrientationToPointAtCP, m_b2DOrientation) == 0x350, "m_b2DOrientation in C_OP_SetCPOrientationToPointAtCP should be at offset 0x350");
		static_assert(offsetof(CS2::particles::C_OP_SetCPOrientationToPointAtCP, m_bAvoidSingularity) == 0x351, "m_bAvoidSingularity in C_OP_SetCPOrientationToPointAtCP should be at offset 0x351");
		static_assert(offsetof(CS2::particles::C_OP_SetCPOrientationToPointAtCP, m_bPointAway) == 0x352, "m_bPointAway in C_OP_SetCPOrientationToPointAtCP should be at offset 0x352");
		static_assert(sizeof(CS2::particles::C_OP_SetCPOrientationToPointAtCP) == 0x358, "C_OP_SetCPOrientationToPointAtCP size should be 0x358");
	}
}
