// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#include <SDK/GlobalTypes.hpp>

#include <SDK/particles/CParticleFunctionOperator.hpp>
#include <SDK/particles/ParticleAttributeIndex_t.hpp>
#include <SDK/particleslib/CParticleCollectionFloatInput.hpp>



namespace CS2 {
	namespace particles {
		class C_OP_RemapSDFDistanceToVectorAttribute : public CS2::particles::CParticleFunctionOperator {
		public:
			particles::ParticleAttributeIndex_t m_nVectorFieldOutput; // 0x1c0 | Schema_DeclaredClass | Size: 0x4
			particles::ParticleAttributeIndex_t m_nVectorFieldInput; // 0x1c4 | Schema_DeclaredClass | Size: 0x4
			particleslib::CParticleCollectionFloatInput m_flMinDistance; // 0x1c8 | Schema_DeclaredClass | Size: 0x160
			particleslib::CParticleCollectionFloatInput m_flMaxDistance; // 0x328 | Schema_DeclaredClass | Size: 0x160
			GlobalTypes::Vector m_vValueBelowMin; // 0x488 | Schema_Atomic | Size: 0xc
			GlobalTypes::Vector m_vValueAtMin; // 0x494 | Schema_Atomic | Size: 0xc
			GlobalTypes::Vector m_vValueAtMax; // 0x4a0 | Schema_Atomic | Size: 0xc
			GlobalTypes::Vector m_vValueAboveMax; // 0x4ac | Schema_Atomic | Size: 0xc
		};
		static_assert(offsetof(CS2::particles::C_OP_RemapSDFDistanceToVectorAttribute, m_nVectorFieldOutput) == 0x1C0, "m_nVectorFieldOutput in C_OP_RemapSDFDistanceToVectorAttribute should be at offset 0x1C0");
		static_assert(offsetof(CS2::particles::C_OP_RemapSDFDistanceToVectorAttribute, m_nVectorFieldInput) == 0x1C4, "m_nVectorFieldInput in C_OP_RemapSDFDistanceToVectorAttribute should be at offset 0x1C4");
		static_assert(offsetof(CS2::particles::C_OP_RemapSDFDistanceToVectorAttribute, m_flMinDistance) == 0x1C8, "m_flMinDistance in C_OP_RemapSDFDistanceToVectorAttribute should be at offset 0x1C8");
		static_assert(offsetof(CS2::particles::C_OP_RemapSDFDistanceToVectorAttribute, m_flMaxDistance) == 0x328, "m_flMaxDistance in C_OP_RemapSDFDistanceToVectorAttribute should be at offset 0x328");
		static_assert(offsetof(CS2::particles::C_OP_RemapSDFDistanceToVectorAttribute, m_vValueBelowMin) == 0x488, "m_vValueBelowMin in C_OP_RemapSDFDistanceToVectorAttribute should be at offset 0x488");
		static_assert(offsetof(CS2::particles::C_OP_RemapSDFDistanceToVectorAttribute, m_vValueAtMin) == 0x494, "m_vValueAtMin in C_OP_RemapSDFDistanceToVectorAttribute should be at offset 0x494");
		static_assert(offsetof(CS2::particles::C_OP_RemapSDFDistanceToVectorAttribute, m_vValueAtMax) == 0x4A0, "m_vValueAtMax in C_OP_RemapSDFDistanceToVectorAttribute should be at offset 0x4A0");
		static_assert(offsetof(CS2::particles::C_OP_RemapSDFDistanceToVectorAttribute, m_vValueAboveMax) == 0x4AC, "m_vValueAboveMax in C_OP_RemapSDFDistanceToVectorAttribute should be at offset 0x4AC");
		static_assert(sizeof(CS2::particles::C_OP_RemapSDFDistanceToVectorAttribute) == 0x4B8, "C_OP_RemapSDFDistanceToVectorAttribute size should be 0x4B8");
	}
}
