// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#ifndef CUSTOM_GLOBAL_TYPES
	#include <SDK/GlobalTypes.hpp>
#else
	#include <Custom/GlobalTypes.hpp>
#endif


#include <SDK/particles/C_OP_RenderPoints.hpp>
#include <SDK/particles/AnimationType_t.hpp>





using namespace GlobalTypes;
namespace CS2 {
	namespace particles {
		class C_OP_RenderLights : public CS2::particles::C_OP_RenderPoints {
		public:
			float32 m_flAnimationRate; // 0x228 | Schema_Builtin | Size: 0x4
			particles::AnimationType_t m_nAnimationType; // 0x22c | Schema_DeclaredEnum | Size: 0x4
			bool m_bAnimateInFPS; // 0x230 | Schema_Builtin | Size: 0x1
			S2_PAD(0x3);
			float32 m_flMinSize; // 0x234 | Schema_Builtin | Size: 0x4
			float32 m_flMaxSize; // 0x238 | Schema_Builtin | Size: 0x4
			float32 m_flStartFadeSize; // 0x23c | Schema_Builtin | Size: 0x4
			float32 m_flEndFadeSize; // 0x240 | Schema_Builtin | Size: 0x4
			S2_PAD(0x4); // End padding
		};
		static_assert(offsetof(CS2::particles::C_OP_RenderLights, m_flAnimationRate) == 0x228, "m_flAnimationRate in C_OP_RenderLights should be at offset 0x228");
		static_assert(offsetof(CS2::particles::C_OP_RenderLights, m_nAnimationType) == 0x22C, "m_nAnimationType in C_OP_RenderLights should be at offset 0x22C");
		static_assert(offsetof(CS2::particles::C_OP_RenderLights, m_bAnimateInFPS) == 0x230, "m_bAnimateInFPS in C_OP_RenderLights should be at offset 0x230");
		static_assert(offsetof(CS2::particles::C_OP_RenderLights, m_flMinSize) == 0x234, "m_flMinSize in C_OP_RenderLights should be at offset 0x234");
		static_assert(offsetof(CS2::particles::C_OP_RenderLights, m_flMaxSize) == 0x238, "m_flMaxSize in C_OP_RenderLights should be at offset 0x238");
		static_assert(offsetof(CS2::particles::C_OP_RenderLights, m_flStartFadeSize) == 0x23C, "m_flStartFadeSize in C_OP_RenderLights should be at offset 0x23C");
		static_assert(offsetof(CS2::particles::C_OP_RenderLights, m_flEndFadeSize) == 0x240, "m_flEndFadeSize in C_OP_RenderLights should be at offset 0x240");
		static_assert(sizeof(CS2::particles::C_OP_RenderLights) == 0x248, "C_OP_RenderLights size should be 0x248");
	}
}
