// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#include <SDK/GlobalTypes.hpp>

#include <SDK/particles/CParticleFunctionPreEmission.hpp>
#include <SDK/particleslib/CParticleCollectionFloatInput.hpp>



namespace CS2 {
	namespace particles {
		class C_OP_SetControlPointPositionToRandomActiveCP : public CS2::particles::CParticleFunctionPreEmission {
		public:
			int32_t m_nCP1; // 0x1c8 | Schema_Builtin | Size: 0x4
			int32_t m_nHeadLocationMin; // 0x1cc | Schema_Builtin | Size: 0x4
			int32_t m_nHeadLocationMax; // 0x1d0 | Schema_Builtin | Size: 0x4
			S2_PAD(0x4);
			particleslib::CParticleCollectionFloatInput m_flResetRate; // 0x1d8 | Schema_DeclaredClass | Size: 0x160
		};
		static_assert(offsetof(CS2::particles::C_OP_SetControlPointPositionToRandomActiveCP, m_nCP1) == 0x1C8, "m_nCP1 in C_OP_SetControlPointPositionToRandomActiveCP should be at offset 0x1C8");
		static_assert(offsetof(CS2::particles::C_OP_SetControlPointPositionToRandomActiveCP, m_nHeadLocationMin) == 0x1CC, "m_nHeadLocationMin in C_OP_SetControlPointPositionToRandomActiveCP should be at offset 0x1CC");
		static_assert(offsetof(CS2::particles::C_OP_SetControlPointPositionToRandomActiveCP, m_nHeadLocationMax) == 0x1D0, "m_nHeadLocationMax in C_OP_SetControlPointPositionToRandomActiveCP should be at offset 0x1D0");
		static_assert(offsetof(CS2::particles::C_OP_SetControlPointPositionToRandomActiveCP, m_flResetRate) == 0x1D8, "m_flResetRate in C_OP_SetControlPointPositionToRandomActiveCP should be at offset 0x1D8");
		static_assert(sizeof(CS2::particles::C_OP_SetControlPointPositionToRandomActiveCP) == 0x338, "C_OP_SetControlPointPositionToRandomActiveCP size should be 0x338");
	}
}
