// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#include <SDK/GlobalTypes.hpp>

#include <SDK/particles/CParticleFunctionOperator.hpp>
#include <SDK/particleslib/CParticleCollectionFloatInput.hpp>



namespace CS2 {
	namespace particles {
		class C_OP_ConnectParentParticleToNearest : public CS2::particles::CParticleFunctionOperator {
		public:
			int32_t m_nFirstControlPoint; // 0x1c0 | Schema_Builtin | Size: 0x4
			int32_t m_nSecondControlPoint; // 0x1c4 | Schema_Builtin | Size: 0x4
			bool m_bUseRadius; // 0x1c8 | Schema_Builtin | Size: 0x1
			S2_PAD(0x7);
			particleslib::CParticleCollectionFloatInput m_flRadiusScale; // 0x1d0 | Schema_DeclaredClass | Size: 0x160
			particleslib::CParticleCollectionFloatInput m_flParentRadiusScale; // 0x330 | Schema_DeclaredClass | Size: 0x160
		};
		static_assert(offsetof(CS2::particles::C_OP_ConnectParentParticleToNearest, m_nFirstControlPoint) == 0x1C0, "m_nFirstControlPoint in C_OP_ConnectParentParticleToNearest should be at offset 0x1C0");
		static_assert(offsetof(CS2::particles::C_OP_ConnectParentParticleToNearest, m_nSecondControlPoint) == 0x1C4, "m_nSecondControlPoint in C_OP_ConnectParentParticleToNearest should be at offset 0x1C4");
		static_assert(offsetof(CS2::particles::C_OP_ConnectParentParticleToNearest, m_bUseRadius) == 0x1C8, "m_bUseRadius in C_OP_ConnectParentParticleToNearest should be at offset 0x1C8");
		static_assert(offsetof(CS2::particles::C_OP_ConnectParentParticleToNearest, m_flRadiusScale) == 0x1D0, "m_flRadiusScale in C_OP_ConnectParentParticleToNearest should be at offset 0x1D0");
		static_assert(offsetof(CS2::particles::C_OP_ConnectParentParticleToNearest, m_flParentRadiusScale) == 0x330, "m_flParentRadiusScale in C_OP_ConnectParentParticleToNearest should be at offset 0x330");
		static_assert(sizeof(CS2::particles::C_OP_ConnectParentParticleToNearest) == 0x490, "C_OP_ConnectParentParticleToNearest size should be 0x490");
	}
}
