// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#include <SDK/GlobalTypes.hpp>

#include <SDK/particles/CParticleFunctionOperator.hpp>
#include <SDK/particleslib/CParticleModelInput.hpp>
#include <SDK/particleslib/CParticleTransformInput.hpp>
#include <SDK/particles/HitboxLerpType_t.hpp>
#include <SDK/particleslib/CPerParticleFloatInput.hpp>



namespace CS2 {
	namespace particles {
		class C_OP_MoveToHitbox : public CS2::particles::CParticleFunctionOperator {
		public:
			particleslib::CParticleModelInput m_modelInput; // 0x1d0 | Schema_DeclaredClass | Size: 0x60
			particleslib::CParticleTransformInput m_transformInput; // 0x230 | Schema_DeclaredClass | Size: 0x68
			S2_PAD(0x4);
			float32 m_flLifeTimeLerpStart; // 0x29c | Schema_Builtin | Size: 0x4
			float32 m_flLifeTimeLerpEnd; // 0x2a0 | Schema_Builtin | Size: 0x4
			float32 m_flPrevPosScale; // 0x2a4 | Schema_Builtin | Size: 0x4
			char m_HitboxSetName[128]; // 0x2a8 | Schema_FixedArray | Size: 0x80
			bool m_bUseBones; // 0x328 | Schema_Builtin | Size: 0x1
			S2_PAD(0x3);
			particles::HitboxLerpType_t m_nLerpType; // 0x32c | Schema_DeclaredEnum | Size: 0x4
			particleslib::CPerParticleFloatInput m_flInterpolation; // 0x330 | Schema_DeclaredClass | Size: 0x170
		};
		static_assert(offsetof(CS2::particles::C_OP_MoveToHitbox, m_modelInput) == 0x1D0, "m_modelInput in C_OP_MoveToHitbox should be at offset 0x1D0");
		static_assert(offsetof(CS2::particles::C_OP_MoveToHitbox, m_transformInput) == 0x230, "m_transformInput in C_OP_MoveToHitbox should be at offset 0x230");
		static_assert(offsetof(CS2::particles::C_OP_MoveToHitbox, m_flLifeTimeLerpStart) == 0x29C, "m_flLifeTimeLerpStart in C_OP_MoveToHitbox should be at offset 0x29C");
		static_assert(offsetof(CS2::particles::C_OP_MoveToHitbox, m_flLifeTimeLerpEnd) == 0x2A0, "m_flLifeTimeLerpEnd in C_OP_MoveToHitbox should be at offset 0x2A0");
		static_assert(offsetof(CS2::particles::C_OP_MoveToHitbox, m_flPrevPosScale) == 0x2A4, "m_flPrevPosScale in C_OP_MoveToHitbox should be at offset 0x2A4");
		static_assert(offsetof(CS2::particles::C_OP_MoveToHitbox, m_HitboxSetName) == 0x2A8, "m_HitboxSetName in C_OP_MoveToHitbox should be at offset 0x2A8");
		static_assert(offsetof(CS2::particles::C_OP_MoveToHitbox, m_bUseBones) == 0x328, "m_bUseBones in C_OP_MoveToHitbox should be at offset 0x328");
		static_assert(offsetof(CS2::particles::C_OP_MoveToHitbox, m_nLerpType) == 0x32C, "m_nLerpType in C_OP_MoveToHitbox should be at offset 0x32C");
		static_assert(offsetof(CS2::particles::C_OP_MoveToHitbox, m_flInterpolation) == 0x330, "m_flInterpolation in C_OP_MoveToHitbox should be at offset 0x330");
		static_assert(sizeof(CS2::particles::C_OP_MoveToHitbox) == 0x4A0, "C_OP_MoveToHitbox size should be 0x4A0");
	}
}
