// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#include <SDK/GlobalTypes.hpp>

#include <SDK/particles/CParticleFunctionForce.hpp>
#include <SDK/particleslib/CPerParticleFloatInput.hpp>



namespace CS2 {
	namespace particles {
		class C_OP_ExternalGameImpulseForce : public CS2::particles::CParticleFunctionForce {
		public:
			particleslib::CPerParticleFloatInput m_flForceScale; // 0x1d0 | Schema_DeclaredClass | Size: 0x160
			bool m_bRopes; // 0x330 | Schema_Builtin | Size: 0x1
			bool m_bRopesZOnly; // 0x331 | Schema_Builtin | Size: 0x1
			bool m_bExplosions; // 0x332 | Schema_Builtin | Size: 0x1
			bool m_bParticles; // 0x333 | Schema_Builtin | Size: 0x1
			S2_PAD(0x4); // End padding
		};
		static_assert(offsetof(CS2::particles::C_OP_ExternalGameImpulseForce, m_flForceScale) == 0x1D0, "m_flForceScale in C_OP_ExternalGameImpulseForce should be at offset 0x1D0");
		static_assert(offsetof(CS2::particles::C_OP_ExternalGameImpulseForce, m_bRopes) == 0x330, "m_bRopes in C_OP_ExternalGameImpulseForce should be at offset 0x330");
		static_assert(offsetof(CS2::particles::C_OP_ExternalGameImpulseForce, m_bRopesZOnly) == 0x331, "m_bRopesZOnly in C_OP_ExternalGameImpulseForce should be at offset 0x331");
		static_assert(offsetof(CS2::particles::C_OP_ExternalGameImpulseForce, m_bExplosions) == 0x332, "m_bExplosions in C_OP_ExternalGameImpulseForce should be at offset 0x332");
		static_assert(offsetof(CS2::particles::C_OP_ExternalGameImpulseForce, m_bParticles) == 0x333, "m_bParticles in C_OP_ExternalGameImpulseForce should be at offset 0x333");
		static_assert(sizeof(CS2::particles::C_OP_ExternalGameImpulseForce) == 0x338, "C_OP_ExternalGameImpulseForce size should be 0x338");
	}
}
