// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#ifndef CUSTOM_GLOBAL_TYPES
	#include <SDK/GlobalTypes.hpp>
#else
	#include <Custom/GlobalTypes.hpp>
#endif





namespace CS2 {
	namespace particles {
		class CPathParameters  {
		public:
			int32_t m_nStartControlPointNumber; // 0x0 | Schema_Builtin | Size: 0x4
			int32_t m_nEndControlPointNumber; // 0x4 | Schema_Builtin | Size: 0x4
			int32_t m_nBulgeControl; // 0x8 | Schema_Builtin | Size: 0x4
			float32 m_flBulge; // 0xc | Schema_Builtin | Size: 0x4
			float32 m_flMidPoint; // 0x10 | Schema_Builtin | Size: 0x4
			GlobalTypes::Vector m_vStartPointOffset; // 0x14 | Schema_Atomic | Size: 0xc
			GlobalTypes::Vector m_vMidPointOffset; // 0x20 | Schema_Atomic | Size: 0xc
			GlobalTypes::Vector m_vEndOffset; // 0x2c | Schema_Atomic | Size: 0xc
			S2_PAD(0x8); // End padding
		};
		static_assert(offsetof(CS2::particles::CPathParameters, m_nStartControlPointNumber) == 0x0, "m_nStartControlPointNumber in CPathParameters should be at offset 0x0");
		static_assert(offsetof(CS2::particles::CPathParameters, m_nEndControlPointNumber) == 0x4, "m_nEndControlPointNumber in CPathParameters should be at offset 0x4");
		static_assert(offsetof(CS2::particles::CPathParameters, m_nBulgeControl) == 0x8, "m_nBulgeControl in CPathParameters should be at offset 0x8");
		static_assert(offsetof(CS2::particles::CPathParameters, m_flBulge) == 0xC, "m_flBulge in CPathParameters should be at offset 0xC");
		static_assert(offsetof(CS2::particles::CPathParameters, m_flMidPoint) == 0x10, "m_flMidPoint in CPathParameters should be at offset 0x10");
		static_assert(offsetof(CS2::particles::CPathParameters, m_vStartPointOffset) == 0x14, "m_vStartPointOffset in CPathParameters should be at offset 0x14");
		static_assert(offsetof(CS2::particles::CPathParameters, m_vMidPointOffset) == 0x20, "m_vMidPointOffset in CPathParameters should be at offset 0x20");
		static_assert(offsetof(CS2::particles::CPathParameters, m_vEndOffset) == 0x2C, "m_vEndOffset in CPathParameters should be at offset 0x2C");
		static_assert(sizeof(CS2::particles::CPathParameters) == 0x40, "CPathParameters size should be 0x40");
	}
}
