// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#ifndef CUSTOM_GLOBAL_TYPES
	#include "../GlobalTypes.hpp"
#else
	#include "../Custom/GlobalTypes.hpp"
#endif


#include "../animationsystem/ParticleAttachment_t.hpp"





using namespace GlobalTypes;
namespace CS2 {
	namespace particles {
		class ParticleControlPointDriver_t  {
		public:
			GlobalTypes::ParticleParamID_t m_iControlPoint; // 0x0 | Schema_Atomic | Size: 0x10
			animationsystem::ParticleAttachment_t m_iAttachType; // 0x10 | Schema_DeclaredEnum | Size: 0x4
			S2_PAD(0x4);
			GlobalTypes::CUtlString m_attachmentName; // 0x18 | Schema_Atomic | Size: 0x8
			GlobalTypes::Vector m_vecOffset; // 0x20 | Schema_Atomic | Size: 0xc
			GlobalTypes::QAngle m_angOffset; // 0x2c | Schema_Atomic | Size: 0xc
			GlobalTypes::CUtlString m_entityName; // 0x38 | Schema_Atomic | Size: 0x8
		};
		static_assert(offsetof(CS2::particles::ParticleControlPointDriver_t, m_iControlPoint) == 0x0, "m_iControlPoint in ParticleControlPointDriver_t should be at offset 0x0");
		static_assert(offsetof(CS2::particles::ParticleControlPointDriver_t, m_iAttachType) == 0x10, "m_iAttachType in ParticleControlPointDriver_t should be at offset 0x10");
		static_assert(offsetof(CS2::particles::ParticleControlPointDriver_t, m_attachmentName) == 0x18, "m_attachmentName in ParticleControlPointDriver_t should be at offset 0x18");
		static_assert(offsetof(CS2::particles::ParticleControlPointDriver_t, m_vecOffset) == 0x20, "m_vecOffset in ParticleControlPointDriver_t should be at offset 0x20");
		static_assert(offsetof(CS2::particles::ParticleControlPointDriver_t, m_angOffset) == 0x2C, "m_angOffset in ParticleControlPointDriver_t should be at offset 0x2C");
		static_assert(offsetof(CS2::particles::ParticleControlPointDriver_t, m_entityName) == 0x38, "m_entityName in ParticleControlPointDriver_t should be at offset 0x38");
		static_assert(sizeof(CS2::particles::ParticleControlPointDriver_t) == 0x40, "ParticleControlPointDriver_t size should be 0x40");
	}
}
