// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#ifndef CUSTOM_GLOBAL_TYPES
	#include <SDK/GlobalTypes.hpp>
#else
	#include <Custom/GlobalTypes.hpp>
#endif







using namespace GlobalTypes;
namespace CS2 {
	namespace smartprops {
		class Criteria_t  {
		public:
			float32 m_flLength; // 0x0 | Schema_Builtin | Size: 0x4
			bool m_bAllowScale; // 0x4 | Schema_Builtin | Size: 0x1
			S2_PAD(0x3);
			float32 m_flMinLength; // 0x8 | Schema_Builtin | Size: 0x4
			float32 m_flMaxLength; // 0xc | Schema_Builtin | Size: 0x4
		};
		static_assert(offsetof(CS2::smartprops::Criteria_t, m_flLength) == 0x0, "m_flLength in CSmartPropPulse_SelectionLinearLength::Criteria_t should be at offset 0x0");
		static_assert(offsetof(CS2::smartprops::Criteria_t, m_bAllowScale) == 0x4, "m_bAllowScale in CSmartPropPulse_SelectionLinearLength::Criteria_t should be at offset 0x4");
		static_assert(offsetof(CS2::smartprops::Criteria_t, m_flMinLength) == 0x8, "m_flMinLength in CSmartPropPulse_SelectionLinearLength::Criteria_t should be at offset 0x8");
		static_assert(offsetof(CS2::smartprops::Criteria_t, m_flMaxLength) == 0xC, "m_flMaxLength in CSmartPropPulse_SelectionLinearLength::Criteria_t should be at offset 0xC");
		static_assert(sizeof(CS2::smartprops::Criteria_t) == 0x10, "CSmartPropPulse_SelectionLinearLength::Criteria_t size should be 0x10");
	}
}
