// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#ifndef CUSTOM_GLOBAL_TYPES
	#include <SDK/GlobalTypes.hpp>
#else
	#include <Custom/GlobalTypes.hpp>
#endif


#include <SDK/smartprops/CSmartPropOperation.hpp>
#include <SDK/smartprops/CSmartPropAttributeChoiceSelectionMode.hpp>



namespace CS2 {
	namespace smartprops {
		class MaterialGroupChoice_t;
	}
}
namespace CS2 {
	namespace smartprops {
		class CSmartPropOperation_SetMateraialGroupChoice : public CS2::smartprops::CSmartPropOperation {
		public:
			GlobalTypes::CUtlString m_VariableName; // 0x50 | Schema_Atomic | Size: 0x8
			smartprops::CSmartPropAttributeChoiceSelectionMode m_SelectionMode; // 0x58 | Schema_DeclaredClass | Size: 0x40
			GlobalTypes::CSmartPropAttributeInt m_ChoiceSelection; // 0x98 | Schema_Atomic | Size: 0x40
			GlobalTypes::CUtlVector< smartprops::MaterialGroupChoice_t > m_MaterialGroupChoices; // 0xd8 | Schema_Atomic | Size: 0x18
			// char  m_MaterialGroupChoices[0x18]; // 0xd8 | Schema_Atomic | Size: 0x18
			// GlobalTypes::CUtlVector< smartprops::MaterialGroupChoice_t > m_MaterialGroupChoices; // 0xd8 | Schema_Atomic | Size: 0x18
		};
		static_assert(offsetof(CS2::smartprops::CSmartPropOperation_SetMateraialGroupChoice, m_VariableName) == 0x50, "m_VariableName in CSmartPropOperation_SetMateraialGroupChoice should be at offset 0x50");
		static_assert(offsetof(CS2::smartprops::CSmartPropOperation_SetMateraialGroupChoice, m_SelectionMode) == 0x58, "m_SelectionMode in CSmartPropOperation_SetMateraialGroupChoice should be at offset 0x58");
		static_assert(offsetof(CS2::smartprops::CSmartPropOperation_SetMateraialGroupChoice, m_ChoiceSelection) == 0x98, "m_ChoiceSelection in CSmartPropOperation_SetMateraialGroupChoice should be at offset 0x98");
		static_assert(offsetof(CS2::smartprops::CSmartPropOperation_SetMateraialGroupChoice, m_MaterialGroupChoices) == 0xD8, "m_MaterialGroupChoices in CSmartPropOperation_SetMateraialGroupChoice should be at offset 0xD8");
		static_assert(sizeof(CS2::smartprops::CSmartPropOperation_SetMateraialGroupChoice) == 0xF0, "CSmartPropOperation_SetMateraialGroupChoice size should be 0xF0");
	}
}
