// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#ifndef CUSTOM_GLOBAL_TYPES
	#include <SDK/GlobalTypes.hpp>
#else
	#include <Custom/GlobalTypes.hpp>
#endif


#include <SDK/smartprops/CSmartPropTransformOperation.hpp>





using namespace GlobalTypes;
namespace CS2 {
	namespace smartprops {
		class CSmartPropOperation_CreateSizer : public CS2::smartprops::CSmartPropTransformOperation {
		public:
			GlobalTypes::CUtlString m_Name; // 0x50 | Schema_Atomic | Size: 0x8
			GlobalTypes::CSmartPropAttributeBool m_bDisplayModel; // 0x58 | Schema_Atomic | Size: 0x40
			GlobalTypes::CSmartPropAttributeFloat m_flInitialMinX; // 0x98 | Schema_Atomic | Size: 0x40
			GlobalTypes::CSmartPropAttributeFloat m_flInitialMaxX; // 0xd8 | Schema_Atomic | Size: 0x40
			GlobalTypes::CSmartPropAttributeFloat m_flConstraintMinX; // 0x118 | Schema_Atomic | Size: 0x40
			GlobalTypes::CSmartPropAttributeFloat m_flConstraintMaxX; // 0x158 | Schema_Atomic | Size: 0x40
			GlobalTypes::CUtlString m_OutputVariableMinX; // 0x198 | Schema_Atomic | Size: 0x8
			GlobalTypes::CUtlString m_OutputVariableMaxX; // 0x1a0 | Schema_Atomic | Size: 0x8
			GlobalTypes::CSmartPropAttributeFloat m_flInitialMinY; // 0x1a8 | Schema_Atomic | Size: 0x40
			GlobalTypes::CSmartPropAttributeFloat m_flInitialMaxY; // 0x1e8 | Schema_Atomic | Size: 0x40
			GlobalTypes::CSmartPropAttributeFloat m_flConstraintMinY; // 0x228 | Schema_Atomic | Size: 0x40
			GlobalTypes::CSmartPropAttributeFloat m_flConstraintMaxY; // 0x268 | Schema_Atomic | Size: 0x40
			GlobalTypes::CUtlString m_OutputVariableMinY; // 0x2a8 | Schema_Atomic | Size: 0x8
			GlobalTypes::CUtlString m_OutputVariableMaxY; // 0x2b0 | Schema_Atomic | Size: 0x8
			GlobalTypes::CSmartPropAttributeFloat m_flInitialMinZ; // 0x2b8 | Schema_Atomic | Size: 0x40
			GlobalTypes::CSmartPropAttributeFloat m_flInitialMaxZ; // 0x2f8 | Schema_Atomic | Size: 0x40
			GlobalTypes::CSmartPropAttributeFloat m_flConstraintMinZ; // 0x338 | Schema_Atomic | Size: 0x40
			GlobalTypes::CSmartPropAttributeFloat m_flConstraintMaxZ; // 0x378 | Schema_Atomic | Size: 0x40
			GlobalTypes::CUtlString m_OutputVariableMinZ; // 0x3b8 | Schema_Atomic | Size: 0x8
			GlobalTypes::CUtlString m_OutputVariableMaxZ; // 0x3c0 | Schema_Atomic | Size: 0x8
		};
		static_assert(offsetof(CS2::smartprops::CSmartPropOperation_CreateSizer, m_Name) == 0x50, "m_Name in CSmartPropOperation_CreateSizer should be at offset 0x50");
		static_assert(offsetof(CS2::smartprops::CSmartPropOperation_CreateSizer, m_bDisplayModel) == 0x58, "m_bDisplayModel in CSmartPropOperation_CreateSizer should be at offset 0x58");
		static_assert(offsetof(CS2::smartprops::CSmartPropOperation_CreateSizer, m_flInitialMinX) == 0x98, "m_flInitialMinX in CSmartPropOperation_CreateSizer should be at offset 0x98");
		static_assert(offsetof(CS2::smartprops::CSmartPropOperation_CreateSizer, m_flInitialMaxX) == 0xD8, "m_flInitialMaxX in CSmartPropOperation_CreateSizer should be at offset 0xD8");
		static_assert(offsetof(CS2::smartprops::CSmartPropOperation_CreateSizer, m_flConstraintMinX) == 0x118, "m_flConstraintMinX in CSmartPropOperation_CreateSizer should be at offset 0x118");
		static_assert(offsetof(CS2::smartprops::CSmartPropOperation_CreateSizer, m_flConstraintMaxX) == 0x158, "m_flConstraintMaxX in CSmartPropOperation_CreateSizer should be at offset 0x158");
		static_assert(offsetof(CS2::smartprops::CSmartPropOperation_CreateSizer, m_OutputVariableMinX) == 0x198, "m_OutputVariableMinX in CSmartPropOperation_CreateSizer should be at offset 0x198");
		static_assert(offsetof(CS2::smartprops::CSmartPropOperation_CreateSizer, m_OutputVariableMaxX) == 0x1A0, "m_OutputVariableMaxX in CSmartPropOperation_CreateSizer should be at offset 0x1A0");
		static_assert(offsetof(CS2::smartprops::CSmartPropOperation_CreateSizer, m_flInitialMinY) == 0x1A8, "m_flInitialMinY in CSmartPropOperation_CreateSizer should be at offset 0x1A8");
		static_assert(offsetof(CS2::smartprops::CSmartPropOperation_CreateSizer, m_flInitialMaxY) == 0x1E8, "m_flInitialMaxY in CSmartPropOperation_CreateSizer should be at offset 0x1E8");
		static_assert(offsetof(CS2::smartprops::CSmartPropOperation_CreateSizer, m_flConstraintMinY) == 0x228, "m_flConstraintMinY in CSmartPropOperation_CreateSizer should be at offset 0x228");
		static_assert(offsetof(CS2::smartprops::CSmartPropOperation_CreateSizer, m_flConstraintMaxY) == 0x268, "m_flConstraintMaxY in CSmartPropOperation_CreateSizer should be at offset 0x268");
		static_assert(offsetof(CS2::smartprops::CSmartPropOperation_CreateSizer, m_OutputVariableMinY) == 0x2A8, "m_OutputVariableMinY in CSmartPropOperation_CreateSizer should be at offset 0x2A8");
		static_assert(offsetof(CS2::smartprops::CSmartPropOperation_CreateSizer, m_OutputVariableMaxY) == 0x2B0, "m_OutputVariableMaxY in CSmartPropOperation_CreateSizer should be at offset 0x2B0");
		static_assert(offsetof(CS2::smartprops::CSmartPropOperation_CreateSizer, m_flInitialMinZ) == 0x2B8, "m_flInitialMinZ in CSmartPropOperation_CreateSizer should be at offset 0x2B8");
		static_assert(offsetof(CS2::smartprops::CSmartPropOperation_CreateSizer, m_flInitialMaxZ) == 0x2F8, "m_flInitialMaxZ in CSmartPropOperation_CreateSizer should be at offset 0x2F8");
		static_assert(offsetof(CS2::smartprops::CSmartPropOperation_CreateSizer, m_flConstraintMinZ) == 0x338, "m_flConstraintMinZ in CSmartPropOperation_CreateSizer should be at offset 0x338");
		static_assert(offsetof(CS2::smartprops::CSmartPropOperation_CreateSizer, m_flConstraintMaxZ) == 0x378, "m_flConstraintMaxZ in CSmartPropOperation_CreateSizer should be at offset 0x378");
		static_assert(offsetof(CS2::smartprops::CSmartPropOperation_CreateSizer, m_OutputVariableMinZ) == 0x3B8, "m_OutputVariableMinZ in CSmartPropOperation_CreateSizer should be at offset 0x3B8");
		static_assert(offsetof(CS2::smartprops::CSmartPropOperation_CreateSizer, m_OutputVariableMaxZ) == 0x3C0, "m_OutputVariableMaxZ in CSmartPropOperation_CreateSizer should be at offset 0x3C0");
		static_assert(sizeof(CS2::smartprops::CSmartPropOperation_CreateSizer) == 0x3C8, "CSmartPropOperation_CreateSizer size should be 0x3C8");
	}
}
