// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#include <SDK/GlobalTypes.hpp>

#include <SDK/smartprops/CSmartPropElement_Group.hpp>
#include <SDK/smartprops/CSmartPropAttributeChoiceSelectionMode.hpp>
#include <SDK/smartprops/ConfigurationHandleShape_t.hpp>



namespace CS2 {
	namespace smartprops {
		class CSmartPropElement_PickOne : public CS2::smartprops::CSmartPropElement_Group {
		public:
			smartprops::CSmartPropAttributeChoiceSelectionMode m_SelectionMode; // 0xa0 | Schema_DeclaredClass | Size: 0x40
			GlobalTypes::CSmartPropAttributeInt m_SpecificChildIndex; // 0xe0 | Schema_Atomic | Size: 0x40
			GlobalTypes::CUtlString m_OutputChoiceVariableName; // 0x120 | Schema_Atomic | Size: 0x8
			GlobalTypes::CSmartPropAttributeBool m_bConfigurable; // 0x128 | Schema_Atomic | Size: 0x40
			GlobalTypes::CSmartPropAttributeVector m_vHandleOffset; // 0x168 | Schema_Atomic | Size: 0x40
			GlobalTypes::CSmartPropAttributeColor m_HandleColor; // 0x1a8 | Schema_Atomic | Size: 0x40
			GlobalTypes::CSmartPropAttributeInt m_HandleSize; // 0x1e8 | Schema_Atomic | Size: 0x40
			smartprops::ConfigurationHandleShape_t m_HandleShape; // 0x228 | Schema_DeclaredEnum | Size: 0x4
			S2_PAD(0x4); // End padding
		};
		static_assert(offsetof(CS2::smartprops::CSmartPropElement_PickOne, m_SelectionMode) == 0xA0, "m_SelectionMode in CSmartPropElement_PickOne should be at offset 0xA0");
		static_assert(offsetof(CS2::smartprops::CSmartPropElement_PickOne, m_SpecificChildIndex) == 0xE0, "m_SpecificChildIndex in CSmartPropElement_PickOne should be at offset 0xE0");
		static_assert(offsetof(CS2::smartprops::CSmartPropElement_PickOne, m_OutputChoiceVariableName) == 0x120, "m_OutputChoiceVariableName in CSmartPropElement_PickOne should be at offset 0x120");
		static_assert(offsetof(CS2::smartprops::CSmartPropElement_PickOne, m_bConfigurable) == 0x128, "m_bConfigurable in CSmartPropElement_PickOne should be at offset 0x128");
		static_assert(offsetof(CS2::smartprops::CSmartPropElement_PickOne, m_vHandleOffset) == 0x168, "m_vHandleOffset in CSmartPropElement_PickOne should be at offset 0x168");
		static_assert(offsetof(CS2::smartprops::CSmartPropElement_PickOne, m_HandleColor) == 0x1A8, "m_HandleColor in CSmartPropElement_PickOne should be at offset 0x1A8");
		static_assert(offsetof(CS2::smartprops::CSmartPropElement_PickOne, m_HandleSize) == 0x1E8, "m_HandleSize in CSmartPropElement_PickOne should be at offset 0x1E8");
		static_assert(offsetof(CS2::smartprops::CSmartPropElement_PickOne, m_HandleShape) == 0x228, "m_HandleShape in CSmartPropElement_PickOne should be at offset 0x228");
		static_assert(sizeof(CS2::smartprops::CSmartPropElement_PickOne) == 0x230, "CSmartPropElement_PickOne size should be 0x230");
	}
}
