// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#ifndef CUSTOM_GLOBAL_TYPES
	#include <SDK/GlobalTypes.hpp>
#else
	#include <Custom/GlobalTypes.hpp>
#endif


#include <SDK/smartprops/CSmartPropElement_Group.hpp>
#include <SDK/smartprops/CSmartPropAttributeCoordinateSpace.hpp>
#include <SDK/smartprops/CSmartPropAttributeScaleMode.hpp>
#include <SDK/smartprops/CSmartPropAttributePickMode.hpp>



namespace CS2 {
	namespace smartprops {
		class CSmartPropElement_FitOnLine : public CS2::smartprops::CSmartPropElement_Group {
		public:
			GlobalTypes::CSmartPropAttributeVector m_vStart; // 0xa0 | Schema_Atomic | Size: 0x40
			GlobalTypes::CSmartPropAttributeVector m_vEnd; // 0xe0 | Schema_Atomic | Size: 0x40
			smartprops::CSmartPropAttributeCoordinateSpace m_PointSpace; // 0x120 | Schema_DeclaredClass | Size: 0x40
			GlobalTypes::CSmartPropAttributeBool m_bOrientAlongLine; // 0x160 | Schema_Atomic | Size: 0x40
			GlobalTypes::CSmartPropAttributeVector m_vUpDirection; // 0x1a0 | Schema_Atomic | Size: 0x40
			smartprops::CSmartPropAttributeCoordinateSpace m_UpDirectionSpace; // 0x1e0 | Schema_DeclaredClass | Size: 0x40
			GlobalTypes::CSmartPropAttributeBool m_bPrioritizeUp; // 0x220 | Schema_Atomic | Size: 0x40
			smartprops::CSmartPropAttributeScaleMode m_nScaleMode; // 0x260 | Schema_DeclaredClass | Size: 0x40
			smartprops::CSmartPropAttributePickMode m_nPickMode; // 0x2a0 | Schema_DeclaredClass | Size: 0x40
		};
		static_assert(offsetof(CS2::smartprops::CSmartPropElement_FitOnLine, m_vStart) == 0xA0, "m_vStart in CSmartPropElement_FitOnLine should be at offset 0xA0");
		static_assert(offsetof(CS2::smartprops::CSmartPropElement_FitOnLine, m_vEnd) == 0xE0, "m_vEnd in CSmartPropElement_FitOnLine should be at offset 0xE0");
		static_assert(offsetof(CS2::smartprops::CSmartPropElement_FitOnLine, m_PointSpace) == 0x120, "m_PointSpace in CSmartPropElement_FitOnLine should be at offset 0x120");
		static_assert(offsetof(CS2::smartprops::CSmartPropElement_FitOnLine, m_bOrientAlongLine) == 0x160, "m_bOrientAlongLine in CSmartPropElement_FitOnLine should be at offset 0x160");
		static_assert(offsetof(CS2::smartprops::CSmartPropElement_FitOnLine, m_vUpDirection) == 0x1A0, "m_vUpDirection in CSmartPropElement_FitOnLine should be at offset 0x1A0");
		static_assert(offsetof(CS2::smartprops::CSmartPropElement_FitOnLine, m_UpDirectionSpace) == 0x1E0, "m_UpDirectionSpace in CSmartPropElement_FitOnLine should be at offset 0x1E0");
		static_assert(offsetof(CS2::smartprops::CSmartPropElement_FitOnLine, m_bPrioritizeUp) == 0x220, "m_bPrioritizeUp in CSmartPropElement_FitOnLine should be at offset 0x220");
		static_assert(offsetof(CS2::smartprops::CSmartPropElement_FitOnLine, m_nScaleMode) == 0x260, "m_nScaleMode in CSmartPropElement_FitOnLine should be at offset 0x260");
		static_assert(offsetof(CS2::smartprops::CSmartPropElement_FitOnLine, m_nPickMode) == 0x2A0, "m_nPickMode in CSmartPropElement_FitOnLine should be at offset 0x2A0");
		static_assert(sizeof(CS2::smartprops::CSmartPropElement_FitOnLine) == 0x2E0, "CSmartPropElement_FitOnLine size should be 0x2E0");
	}
}
