// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#ifndef CUSTOM_GLOBAL_TYPES
	#include <SDK/GlobalTypes.hpp>
#else
	#include <Custom/GlobalTypes.hpp>
#endif


#include <SDK/smartprops/CSmartPropElement_Deformer.hpp>





using namespace GlobalTypes;
namespace CS2 {
	namespace smartprops {
		class CSmartPropElement_BendDeformer : public CS2::smartprops::CSmartPropElement_Deformer {
		public:
			GlobalTypes::CSmartPropAttributeBool m_bDeformationEnabled; // 0xa0 | Schema_Atomic | Size: 0x40
			GlobalTypes::CSmartPropAttributeVector m_vOrigin; // 0xe0 | Schema_Atomic | Size: 0x40
			GlobalTypes::CSmartPropAttributeAngles m_vAngles; // 0x120 | Schema_Atomic | Size: 0x40
			GlobalTypes::CSmartPropAttributeVector m_vSize; // 0x160 | Schema_Atomic | Size: 0x40
			GlobalTypes::CSmartPropAttributeFloat m_flBendAngle; // 0x1a0 | Schema_Atomic | Size: 0x40
			GlobalTypes::CSmartPropAttributeFloat m_flBendPoint; // 0x1e0 | Schema_Atomic | Size: 0x40
			GlobalTypes::CSmartPropAttributeFloat m_flBendRadius; // 0x220 | Schema_Atomic | Size: 0x40
		};
		static_assert(offsetof(CS2::smartprops::CSmartPropElement_BendDeformer, m_bDeformationEnabled) == 0xA0, "m_bDeformationEnabled in CSmartPropElement_BendDeformer should be at offset 0xA0");
		static_assert(offsetof(CS2::smartprops::CSmartPropElement_BendDeformer, m_vOrigin) == 0xE0, "m_vOrigin in CSmartPropElement_BendDeformer should be at offset 0xE0");
		static_assert(offsetof(CS2::smartprops::CSmartPropElement_BendDeformer, m_vAngles) == 0x120, "m_vAngles in CSmartPropElement_BendDeformer should be at offset 0x120");
		static_assert(offsetof(CS2::smartprops::CSmartPropElement_BendDeformer, m_vSize) == 0x160, "m_vSize in CSmartPropElement_BendDeformer should be at offset 0x160");
		static_assert(offsetof(CS2::smartprops::CSmartPropElement_BendDeformer, m_flBendAngle) == 0x1A0, "m_flBendAngle in CSmartPropElement_BendDeformer should be at offset 0x1A0");
		static_assert(offsetof(CS2::smartprops::CSmartPropElement_BendDeformer, m_flBendPoint) == 0x1E0, "m_flBendPoint in CSmartPropElement_BendDeformer should be at offset 0x1E0");
		static_assert(offsetof(CS2::smartprops::CSmartPropElement_BendDeformer, m_flBendRadius) == 0x220, "m_flBendRadius in CSmartPropElement_BendDeformer should be at offset 0x220");
		static_assert(sizeof(CS2::smartprops::CSmartPropElement_BendDeformer) == 0x260, "CSmartPropElement_BendDeformer size should be 0x260");
	}
}
