// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#include <SDK/GlobalTypes.hpp>

#include <SDK/smartprops/CSmartPropTransformOperation.hpp>
#include <SDK/smartprops/CSmartPropAttributeCoordinateSpace.hpp>
#include <SDK/smartprops/CSmartPropAttributeTraceNoHit.hpp>



namespace CS2 {
	namespace smartprops {
		class CSmartPropOperation_Trace : public CS2::smartprops::CSmartPropTransformOperation {
		public:
			GlobalTypes::CSmartPropAttributeVector m_Origin; // 0x50 | Schema_Atomic | Size: 0x40
			smartprops::CSmartPropAttributeCoordinateSpace m_OriginSpace; // 0x90 | Schema_DeclaredClass | Size: 0x40
			GlobalTypes::CSmartPropAttributeFloat m_flOriginOffset; // 0xd0 | Schema_Atomic | Size: 0x40
			GlobalTypes::CSmartPropAttributeFloat m_flSurfaceUpInfluence; // 0x110 | Schema_Atomic | Size: 0x40
			smartprops::CSmartPropAttributeTraceNoHit m_nNoHitResult; // 0x150 | Schema_DeclaredClass | Size: 0x40
			GlobalTypes::CSmartPropAttributeBool m_bIgnoreToolMaterials; // 0x190 | Schema_Atomic | Size: 0x40
			GlobalTypes::CSmartPropAttributeBool m_bIgnoreSky; // 0x1d0 | Schema_Atomic | Size: 0x40
			GlobalTypes::CSmartPropAttributeBool m_bIgnoreNoDraw; // 0x210 | Schema_Atomic | Size: 0x40
			GlobalTypes::CSmartPropAttributeBool m_bIgnoreTranslucent; // 0x250 | Schema_Atomic | Size: 0x40
			GlobalTypes::CSmartPropAttributeBool m_bIgnoreModels; // 0x290 | Schema_Atomic | Size: 0x40
			GlobalTypes::CSmartPropAttributeBool m_bIgnoreEntities; // 0x2d0 | Schema_Atomic | Size: 0x40
			GlobalTypes::CSmartPropAttributeBool m_bIgnoreCables; // 0x310 | Schema_Atomic | Size: 0x40
		};
		static_assert(offsetof(CS2::smartprops::CSmartPropOperation_Trace, m_Origin) == 0x50, "m_Origin in CSmartPropOperation_Trace should be at offset 0x50");
		static_assert(offsetof(CS2::smartprops::CSmartPropOperation_Trace, m_OriginSpace) == 0x90, "m_OriginSpace in CSmartPropOperation_Trace should be at offset 0x90");
		static_assert(offsetof(CS2::smartprops::CSmartPropOperation_Trace, m_flOriginOffset) == 0xD0, "m_flOriginOffset in CSmartPropOperation_Trace should be at offset 0xD0");
		static_assert(offsetof(CS2::smartprops::CSmartPropOperation_Trace, m_flSurfaceUpInfluence) == 0x110, "m_flSurfaceUpInfluence in CSmartPropOperation_Trace should be at offset 0x110");
		static_assert(offsetof(CS2::smartprops::CSmartPropOperation_Trace, m_nNoHitResult) == 0x150, "m_nNoHitResult in CSmartPropOperation_Trace should be at offset 0x150");
		static_assert(offsetof(CS2::smartprops::CSmartPropOperation_Trace, m_bIgnoreToolMaterials) == 0x190, "m_bIgnoreToolMaterials in CSmartPropOperation_Trace should be at offset 0x190");
		static_assert(offsetof(CS2::smartprops::CSmartPropOperation_Trace, m_bIgnoreSky) == 0x1D0, "m_bIgnoreSky in CSmartPropOperation_Trace should be at offset 0x1D0");
		static_assert(offsetof(CS2::smartprops::CSmartPropOperation_Trace, m_bIgnoreNoDraw) == 0x210, "m_bIgnoreNoDraw in CSmartPropOperation_Trace should be at offset 0x210");
		static_assert(offsetof(CS2::smartprops::CSmartPropOperation_Trace, m_bIgnoreTranslucent) == 0x250, "m_bIgnoreTranslucent in CSmartPropOperation_Trace should be at offset 0x250");
		static_assert(offsetof(CS2::smartprops::CSmartPropOperation_Trace, m_bIgnoreModels) == 0x290, "m_bIgnoreModels in CSmartPropOperation_Trace should be at offset 0x290");
		static_assert(offsetof(CS2::smartprops::CSmartPropOperation_Trace, m_bIgnoreEntities) == 0x2D0, "m_bIgnoreEntities in CSmartPropOperation_Trace should be at offset 0x2D0");
		static_assert(offsetof(CS2::smartprops::CSmartPropOperation_Trace, m_bIgnoreCables) == 0x310, "m_bIgnoreCables in CSmartPropOperation_Trace should be at offset 0x310");
		static_assert(sizeof(CS2::smartprops::CSmartPropOperation_Trace) == 0x350, "CSmartPropOperation_Trace size should be 0x350");
	}
}
