// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#ifndef CUSTOM_GLOBAL_TYPES
	#include <SDK/GlobalTypes.hpp>
#else
	#include <Custom/GlobalTypes.hpp>
#endif


#include <SDK/smartprops/CSmartPropOperation.hpp>
#include <SDK/smartprops/CSmartPropAttributeCoordinateSpace.hpp>



namespace CS2 {
	namespace smartprops {
		class CSmartPropOperation_ComputeDistance3D : public CS2::smartprops::CSmartPropOperation {
		public:
			GlobalTypes::CUtlString m_OutputVariableName; // 0x50 | Schema_Atomic | Size: 0x8
			smartprops::CSmartPropAttributeCoordinateSpace m_OutputCoordinateSpace; // 0x58 | Schema_DeclaredClass | Size: 0x40
			GlobalTypes::CSmartPropAttributeVector m_InputPositionA; // 0x98 | Schema_Atomic | Size: 0x40
			smartprops::CSmartPropAttributeCoordinateSpace m_CoordinateSpaceA; // 0xd8 | Schema_DeclaredClass | Size: 0x40
			GlobalTypes::CSmartPropAttributeVector m_InputPositionB; // 0x118 | Schema_Atomic | Size: 0x40
			smartprops::CSmartPropAttributeCoordinateSpace m_CoordinateSpaceB; // 0x158 | Schema_DeclaredClass | Size: 0x40
		};
		static_assert(offsetof(CS2::smartprops::CSmartPropOperation_ComputeDistance3D, m_OutputVariableName) == 0x50, "m_OutputVariableName in CSmartPropOperation_ComputeDistance3D should be at offset 0x50");
		static_assert(offsetof(CS2::smartprops::CSmartPropOperation_ComputeDistance3D, m_OutputCoordinateSpace) == 0x58, "m_OutputCoordinateSpace in CSmartPropOperation_ComputeDistance3D should be at offset 0x58");
		static_assert(offsetof(CS2::smartprops::CSmartPropOperation_ComputeDistance3D, m_InputPositionA) == 0x98, "m_InputPositionA in CSmartPropOperation_ComputeDistance3D should be at offset 0x98");
		static_assert(offsetof(CS2::smartprops::CSmartPropOperation_ComputeDistance3D, m_CoordinateSpaceA) == 0xD8, "m_CoordinateSpaceA in CSmartPropOperation_ComputeDistance3D should be at offset 0xD8");
		static_assert(offsetof(CS2::smartprops::CSmartPropOperation_ComputeDistance3D, m_InputPositionB) == 0x118, "m_InputPositionB in CSmartPropOperation_ComputeDistance3D should be at offset 0x118");
		static_assert(offsetof(CS2::smartprops::CSmartPropOperation_ComputeDistance3D, m_CoordinateSpaceB) == 0x158, "m_CoordinateSpaceB in CSmartPropOperation_ComputeDistance3D should be at offset 0x158");
		static_assert(sizeof(CS2::smartprops::CSmartPropOperation_ComputeDistance3D) == 0x198, "CSmartPropOperation_ComputeDistance3D size should be 0x198");
	}
}
