// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#ifndef CUSTOM_GLOBAL_TYPES
	#include <SDK/GlobalTypes.hpp>
#else
	#include <Custom/GlobalTypes.hpp>
#endif


#include <SDK/pulse_runtime_lib/CPulseCell_BaseFlow.hpp>



namespace CS2 {
	namespace smartprops {
		class CSmartPropPulse_CreateSizer : public CS2::pulse_runtime_lib::CPulseCell_BaseFlow {
		public:
			GlobalTypes::CUtlString m_Name; // 0x48 | Schema_Atomic | Size: 0x8
			bool m_bHACK_ProvideResultMinX; // 0x50 | Schema_Builtin | Size: 0x1
			bool m_bHACK_ProvideResultMaxX; // 0x51 | Schema_Builtin | Size: 0x1
			bool m_bHACK_ProvideResultMinY; // 0x52 | Schema_Builtin | Size: 0x1
			bool m_bHACK_ProvideResultMaxY; // 0x53 | Schema_Builtin | Size: 0x1
			bool m_bHACK_ProvideResultMinZ; // 0x54 | Schema_Builtin | Size: 0x1
			bool m_bHACK_ProvideResultMaxZ; // 0x55 | Schema_Builtin | Size: 0x1
			S2_PAD(0x2); // End padding
		};
		static_assert(offsetof(CS2::smartprops::CSmartPropPulse_CreateSizer, m_Name) == 0x48, "m_Name in CSmartPropPulse_CreateSizer should be at offset 0x48");
		static_assert(offsetof(CS2::smartprops::CSmartPropPulse_CreateSizer, m_bHACK_ProvideResultMinX) == 0x50, "m_bHACK_ProvideResultMinX in CSmartPropPulse_CreateSizer should be at offset 0x50");
		static_assert(offsetof(CS2::smartprops::CSmartPropPulse_CreateSizer, m_bHACK_ProvideResultMaxX) == 0x51, "m_bHACK_ProvideResultMaxX in CSmartPropPulse_CreateSizer should be at offset 0x51");
		static_assert(offsetof(CS2::smartprops::CSmartPropPulse_CreateSizer, m_bHACK_ProvideResultMinY) == 0x52, "m_bHACK_ProvideResultMinY in CSmartPropPulse_CreateSizer should be at offset 0x52");
		static_assert(offsetof(CS2::smartprops::CSmartPropPulse_CreateSizer, m_bHACK_ProvideResultMaxY) == 0x53, "m_bHACK_ProvideResultMaxY in CSmartPropPulse_CreateSizer should be at offset 0x53");
		static_assert(offsetof(CS2::smartprops::CSmartPropPulse_CreateSizer, m_bHACK_ProvideResultMinZ) == 0x54, "m_bHACK_ProvideResultMinZ in CSmartPropPulse_CreateSizer should be at offset 0x54");
		static_assert(offsetof(CS2::smartprops::CSmartPropPulse_CreateSizer, m_bHACK_ProvideResultMaxZ) == 0x55, "m_bHACK_ProvideResultMaxZ in CSmartPropPulse_CreateSizer should be at offset 0x55");
		static_assert(sizeof(CS2::smartprops::CSmartPropPulse_CreateSizer) == 0x58, "CSmartPropPulse_CreateSizer size should be 0x58");
	}
}
