// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#ifndef CUSTOM_GLOBAL_TYPES
	#include <SDK/GlobalTypes.hpp>
#else
	#include <Custom/GlobalTypes.hpp>
#endif


#include <SDK/smartprops/CSmartPropElement_Deformer.hpp>





using namespace GlobalTypes;
namespace CS2 {
	namespace smartprops {
		class CSmartPropElement_MidpointDeformer : public CS2::smartprops::CSmartPropElement_Deformer {
		public:
			GlobalTypes::CSmartPropAttributeBool m_bDeformationEnabled; // 0xa0 | Schema_Atomic | Size: 0x40
			GlobalTypes::CSmartPropAttributeVector m_vStart; // 0xe0 | Schema_Atomic | Size: 0x40
			GlobalTypes::CSmartPropAttributeVector m_vEnd; // 0x120 | Schema_Atomic | Size: 0x40
			GlobalTypes::CSmartPropAttributeFloat m_fRadius; // 0x160 | Schema_Atomic | Size: 0x40
			GlobalTypes::CSmartPropAttributeBool m_bContinuousSpline; // 0x1a0 | Schema_Atomic | Size: 0x40
			GlobalTypes::CSmartPropAttributeVector m_vOffset; // 0x1e0 | Schema_Atomic | Size: 0x40
			GlobalTypes::CSmartPropAttributeAngles m_vAngles; // 0x220 | Schema_Atomic | Size: 0x40
			GlobalTypes::CSmartPropAttributeVector2D m_vScale; // 0x260 | Schema_Atomic | Size: 0x40
			GlobalTypes::CSmartPropAttributeFloat m_fFalloff; // 0x2a0 | Schema_Atomic | Size: 0x40
			GlobalTypes::CUtlString m_OutputVariable; // 0x2e0 | Schema_Atomic | Size: 0x8
		};
		static_assert(offsetof(CS2::smartprops::CSmartPropElement_MidpointDeformer, m_bDeformationEnabled) == 0xA0, "m_bDeformationEnabled in CSmartPropElement_MidpointDeformer should be at offset 0xA0");
		static_assert(offsetof(CS2::smartprops::CSmartPropElement_MidpointDeformer, m_vStart) == 0xE0, "m_vStart in CSmartPropElement_MidpointDeformer should be at offset 0xE0");
		static_assert(offsetof(CS2::smartprops::CSmartPropElement_MidpointDeformer, m_vEnd) == 0x120, "m_vEnd in CSmartPropElement_MidpointDeformer should be at offset 0x120");
		static_assert(offsetof(CS2::smartprops::CSmartPropElement_MidpointDeformer, m_fRadius) == 0x160, "m_fRadius in CSmartPropElement_MidpointDeformer should be at offset 0x160");
		static_assert(offsetof(CS2::smartprops::CSmartPropElement_MidpointDeformer, m_bContinuousSpline) == 0x1A0, "m_bContinuousSpline in CSmartPropElement_MidpointDeformer should be at offset 0x1A0");
		static_assert(offsetof(CS2::smartprops::CSmartPropElement_MidpointDeformer, m_vOffset) == 0x1E0, "m_vOffset in CSmartPropElement_MidpointDeformer should be at offset 0x1E0");
		static_assert(offsetof(CS2::smartprops::CSmartPropElement_MidpointDeformer, m_vAngles) == 0x220, "m_vAngles in CSmartPropElement_MidpointDeformer should be at offset 0x220");
		static_assert(offsetof(CS2::smartprops::CSmartPropElement_MidpointDeformer, m_vScale) == 0x260, "m_vScale in CSmartPropElement_MidpointDeformer should be at offset 0x260");
		static_assert(offsetof(CS2::smartprops::CSmartPropElement_MidpointDeformer, m_fFalloff) == 0x2A0, "m_fFalloff in CSmartPropElement_MidpointDeformer should be at offset 0x2A0");
		static_assert(offsetof(CS2::smartprops::CSmartPropElement_MidpointDeformer, m_OutputVariable) == 0x2E0, "m_OutputVariable in CSmartPropElement_MidpointDeformer should be at offset 0x2E0");
		static_assert(sizeof(CS2::smartprops::CSmartPropElement_MidpointDeformer) == 0x2E8, "CSmartPropElement_MidpointDeformer size should be 0x2E8");
	}
}
