// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#include <SDK/GlobalTypes.hpp>

#include <SDK/smartprops/CSmartPropOperation.hpp>
#include <SDK/smartprops/CSmartPropAttributeChoiceSelectionMode.hpp>
#include <SDK/smartprops/ApplyColorMode_t.hpp>



namespace CS2 {
	namespace smartprops {
		class CSmartPropOperation_RandomColorTintColor : public CS2::smartprops::CSmartPropOperation {
		public:
			smartprops::CSmartPropAttributeChoiceSelectionMode m_SelectionMode; // 0x50 | Schema_DeclaredClass | Size: 0x40
			GlobalTypes::CSmartPropAttributeFloat m_ColorPosition; // 0x90 | Schema_Atomic | Size: 0x40
			smartprops::ApplyColorMode_t m_Mode; // 0xd0 | Schema_DeclaredEnum | Size: 0x4
			S2_PAD(0x4);
			GlobalTypes::CColorGradient m_Gradient; // 0xd8 | Schema_Atomic | Size: 0x18
		};
		static_assert(offsetof(CS2::smartprops::CSmartPropOperation_RandomColorTintColor, m_SelectionMode) == 0x50, "m_SelectionMode in CSmartPropOperation_RandomColorTintColor should be at offset 0x50");
		static_assert(offsetof(CS2::smartprops::CSmartPropOperation_RandomColorTintColor, m_ColorPosition) == 0x90, "m_ColorPosition in CSmartPropOperation_RandomColorTintColor should be at offset 0x90");
		static_assert(offsetof(CS2::smartprops::CSmartPropOperation_RandomColorTintColor, m_Mode) == 0xD0, "m_Mode in CSmartPropOperation_RandomColorTintColor should be at offset 0xD0");
		static_assert(offsetof(CS2::smartprops::CSmartPropOperation_RandomColorTintColor, m_Gradient) == 0xD8, "m_Gradient in CSmartPropOperation_RandomColorTintColor should be at offset 0xD8");
		static_assert(sizeof(CS2::smartprops::CSmartPropOperation_RandomColorTintColor) == 0xF0, "CSmartPropOperation_RandomColorTintColor size should be 0xF0");
	}
}
