// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#ifndef CUSTOM_GLOBAL_TYPES
	#include <SDK/GlobalTypes.hpp>
#else
	#include <Custom/GlobalTypes.hpp>
#endif


#include <SDK/smartprops/CSmartPropSelectionCriteria.hpp>
#include <SDK/smartprops/CSmartPropAttributePathPositions.hpp>



namespace CS2 {
	namespace smartprops {
		class CSmartPropSelectionCriteria_PathPosition : public CS2::smartprops::CSmartPropSelectionCriteria {
		public:
			smartprops::CSmartPropAttributePathPositions m_PlaceAtPositions; // 0x48 | Schema_DeclaredClass | Size: 0x40
			GlobalTypes::CSmartPropAttributeInt m_nPlaceEveryNthPosition; // 0x88 | Schema_Atomic | Size: 0x40
			GlobalTypes::CSmartPropAttributeInt m_nNthPositionIndexOffset; // 0xc8 | Schema_Atomic | Size: 0x40
			GlobalTypes::CSmartPropAttributeBool m_bAllowAtStart; // 0x108 | Schema_Atomic | Size: 0x40
			GlobalTypes::CSmartPropAttributeBool m_bAllowAtEnd; // 0x148 | Schema_Atomic | Size: 0x40
		};
		static_assert(offsetof(CS2::smartprops::CSmartPropSelectionCriteria_PathPosition, m_PlaceAtPositions) == 0x48, "m_PlaceAtPositions in CSmartPropSelectionCriteria_PathPosition should be at offset 0x48");
		static_assert(offsetof(CS2::smartprops::CSmartPropSelectionCriteria_PathPosition, m_nPlaceEveryNthPosition) == 0x88, "m_nPlaceEveryNthPosition in CSmartPropSelectionCriteria_PathPosition should be at offset 0x88");
		static_assert(offsetof(CS2::smartprops::CSmartPropSelectionCriteria_PathPosition, m_nNthPositionIndexOffset) == 0xC8, "m_nNthPositionIndexOffset in CSmartPropSelectionCriteria_PathPosition should be at offset 0xC8");
		static_assert(offsetof(CS2::smartprops::CSmartPropSelectionCriteria_PathPosition, m_bAllowAtStart) == 0x108, "m_bAllowAtStart in CSmartPropSelectionCriteria_PathPosition should be at offset 0x108");
		static_assert(offsetof(CS2::smartprops::CSmartPropSelectionCriteria_PathPosition, m_bAllowAtEnd) == 0x148, "m_bAllowAtEnd in CSmartPropSelectionCriteria_PathPosition should be at offset 0x148");
		static_assert(sizeof(CS2::smartprops::CSmartPropSelectionCriteria_PathPosition) == 0x188, "CSmartPropSelectionCriteria_PathPosition size should be 0x188");
	}
}
