// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#ifndef CUSTOM_GLOBAL_TYPES
	#include <SDK/GlobalTypes.hpp>
#else
	#include <Custom/GlobalTypes.hpp>
#endif


#include <SDK/smartprops/CSmartPropOperation_Trace.hpp>
#include <SDK/smartprops/CSmartPropAttributeCoordinateSpace.hpp>



namespace CS2 {
	namespace smartprops {
		class CSmartPropOperation_TraceToLine : public CS2::smartprops::CSmartPropOperation_Trace {
		public:
			GlobalTypes::CSmartPropAttributeVector m_EndPointA; // 0x350 | Schema_Atomic | Size: 0x40
			smartprops::CSmartPropAttributeCoordinateSpace m_EndPointSpaceA; // 0x390 | Schema_DeclaredClass | Size: 0x40
			GlobalTypes::CSmartPropAttributeVector m_EndPointB; // 0x3d0 | Schema_Atomic | Size: 0x40
			smartprops::CSmartPropAttributeCoordinateSpace m_EndPointSpaceB; // 0x410 | Schema_DeclaredClass | Size: 0x40
			GlobalTypes::CSmartPropAttributeBool m_bTraceAway; // 0x450 | Schema_Atomic | Size: 0x40
			GlobalTypes::CSmartPropAttributeFloat m_flTraceLength; // 0x490 | Schema_Atomic | Size: 0x40
		};
		static_assert(offsetof(CS2::smartprops::CSmartPropOperation_TraceToLine, m_EndPointA) == 0x350, "m_EndPointA in CSmartPropOperation_TraceToLine should be at offset 0x350");
		static_assert(offsetof(CS2::smartprops::CSmartPropOperation_TraceToLine, m_EndPointSpaceA) == 0x390, "m_EndPointSpaceA in CSmartPropOperation_TraceToLine should be at offset 0x390");
		static_assert(offsetof(CS2::smartprops::CSmartPropOperation_TraceToLine, m_EndPointB) == 0x3D0, "m_EndPointB in CSmartPropOperation_TraceToLine should be at offset 0x3D0");
		static_assert(offsetof(CS2::smartprops::CSmartPropOperation_TraceToLine, m_EndPointSpaceB) == 0x410, "m_EndPointSpaceB in CSmartPropOperation_TraceToLine should be at offset 0x410");
		static_assert(offsetof(CS2::smartprops::CSmartPropOperation_TraceToLine, m_bTraceAway) == 0x450, "m_bTraceAway in CSmartPropOperation_TraceToLine should be at offset 0x450");
		static_assert(offsetof(CS2::smartprops::CSmartPropOperation_TraceToLine, m_flTraceLength) == 0x490, "m_flTraceLength in CSmartPropOperation_TraceToLine should be at offset 0x490");
		static_assert(sizeof(CS2::smartprops::CSmartPropOperation_TraceToLine) == 0x4D0, "CSmartPropOperation_TraceToLine size should be 0x4D0");
	}
}
