// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#include <SDK/GlobalTypes.hpp>

#include <SDK/smartprops/CSmartPropElement.hpp>
#include <SDK/smartprops/SmartPropDeformableAttachMode_t.hpp>
#include <SDK/smartprops/SmartPropDeformableOrientMode_t.hpp>



namespace CS2 {
	namespace smartprops {
		class CSmartPropElement_ModelEntity : public CS2::smartprops::CSmartPropElement {
		public:
			GlobalTypes::CSmartPropAttributeModelName m_sModelName; // 0x88 | Schema_Atomic | Size: 0x40
			GlobalTypes::CSmartPropAttributeMaterialGroup m_MaterialGroupName; // 0xc8 | Schema_Atomic | Size: 0x40
			GlobalTypes::CSmartPropAttributeBool m_bCastShadows; // 0x108 | Schema_Atomic | Size: 0x40
			GlobalTypes::CSmartPropAttributeBool m_bForceStatic; // 0x148 | Schema_Atomic | Size: 0x40
			smartprops::SmartPropDeformableAttachMode_t m_nDeformableAttachmentMode; // 0x188 | Schema_DeclaredEnum | Size: 0x4
			smartprops::SmartPropDeformableOrientMode_t m_nDeformableOrientationMode; // 0x18c | Schema_DeclaredEnum | Size: 0x4
		};
		static_assert(offsetof(CS2::smartprops::CSmartPropElement_ModelEntity, m_sModelName) == 0x88, "m_sModelName in CSmartPropElement_ModelEntity should be at offset 0x88");
		static_assert(offsetof(CS2::smartprops::CSmartPropElement_ModelEntity, m_MaterialGroupName) == 0xC8, "m_MaterialGroupName in CSmartPropElement_ModelEntity should be at offset 0xC8");
		static_assert(offsetof(CS2::smartprops::CSmartPropElement_ModelEntity, m_bCastShadows) == 0x108, "m_bCastShadows in CSmartPropElement_ModelEntity should be at offset 0x108");
		static_assert(offsetof(CS2::smartprops::CSmartPropElement_ModelEntity, m_bForceStatic) == 0x148, "m_bForceStatic in CSmartPropElement_ModelEntity should be at offset 0x148");
		static_assert(offsetof(CS2::smartprops::CSmartPropElement_ModelEntity, m_nDeformableAttachmentMode) == 0x188, "m_nDeformableAttachmentMode in CSmartPropElement_ModelEntity should be at offset 0x188");
		static_assert(offsetof(CS2::smartprops::CSmartPropElement_ModelEntity, m_nDeformableOrientationMode) == 0x18C, "m_nDeformableOrientationMode in CSmartPropElement_ModelEntity should be at offset 0x18C");
		static_assert(sizeof(CS2::smartprops::CSmartPropElement_ModelEntity) == 0x190, "CSmartPropElement_ModelEntity size should be 0x190");
	}
}
