// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#ifndef CUSTOM_GLOBAL_TYPES
	#include <SDK/GlobalTypes.hpp>
#else
	#include <Custom/GlobalTypes.hpp>
#endif


#include <SDK/smartprops/CSmartPropOperation.hpp>
#include <SDK/smartprops/CSmartPropAttributeChoiceSelectionMode.hpp>
#include <SDK/smartprops/CSmartPropAttributeApplyColorMode.hpp>



namespace CS2 {
	namespace smartprops {
		class ColorChoice_t;
	}
}


using namespace GlobalTypes;
namespace CS2 {
	namespace smartprops {
		class CSmartPropOperation_SetTintColor : public CS2::smartprops::CSmartPropOperation {
		public:
			smartprops::CSmartPropAttributeChoiceSelectionMode m_SelectionMode; // 0x50 | Schema_DeclaredClass | Size: 0x40
			GlobalTypes::CSmartPropAttributeInt m_ColorSelection; // 0x90 | Schema_Atomic | Size: 0x40
			smartprops::CSmartPropAttributeApplyColorMode m_Mode; // 0xd0 | Schema_DeclaredClass | Size: 0x40
			GlobalTypes::CUtlVector< smartprops::ColorChoice_t > m_ColorChoices; // 0x110 | Schema_Atomic | Size: 0x18
			// char  m_ColorChoices[0x18]; // 0x110 | Schema_Atomic | Size: 0x18
		};
		static_assert(offsetof(CS2::smartprops::CSmartPropOperation_SetTintColor, m_SelectionMode) == 0x50, "m_SelectionMode in CSmartPropOperation_SetTintColor should be at offset 0x50");
		static_assert(offsetof(CS2::smartprops::CSmartPropOperation_SetTintColor, m_ColorSelection) == 0x90, "m_ColorSelection in CSmartPropOperation_SetTintColor should be at offset 0x90");
		static_assert(offsetof(CS2::smartprops::CSmartPropOperation_SetTintColor, m_Mode) == 0xD0, "m_Mode in CSmartPropOperation_SetTintColor should be at offset 0xD0");
		static_assert(offsetof(CS2::smartprops::CSmartPropOperation_SetTintColor, m_ColorChoices) == 0x110, "m_ColorChoices in CSmartPropOperation_SetTintColor should be at offset 0x110");
		static_assert(sizeof(CS2::smartprops::CSmartPropOperation_SetTintColor) == 0x128, "CSmartPropOperation_SetTintColor size should be 0x128");
	}
}
