// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#ifndef CUSTOM_GLOBAL_TYPES
	#include <SDK/GlobalTypes.hpp>
#else
	#include <Custom/GlobalTypes.hpp>
#endif





namespace CS2 {
	namespace smartprops {
		class CSmartPropRoot  {
		public:
			int32_t m_nContentVersion; // 0x0 | Schema_Builtin | Size: 0x4
			S2_PAD(0x4);
			GlobalTypes::CSmartPropAttributeInt m_nMaxDepth; // 0x8 | Schema_Atomic | Size: 0x40
			// GlobalTypes::CUtlVector< CSmartPropVariable >* m_Variables; // 0x48 | Schema_Atomic | Size: 0x18
			char  m_Variables[0x18]; // 0x48 | Schema_Atomic | Size: 0x18
			// GlobalTypes::CUtlVector< CSmartPropChoice >* m_Choices; // 0x60 | Schema_Atomic | Size: 0x18
			char  m_Choices[0x18]; // 0x60 | Schema_Atomic | Size: 0x18
			// GlobalTypes::CUtlVector< CSmartPropElement >* m_Children; // 0x78 | Schema_Atomic | Size: 0x18
			char  m_Children[0x18]; // 0x78 | Schema_Atomic | Size: 0x18
			// GlobalTypes::CUtlVector< CSmartPropModifier >* m_Modifiers; // 0x90 | Schema_Atomic | Size: 0x18
			char  m_Modifiers[0x18]; // 0x90 | Schema_Atomic | Size: 0x18
			// GlobalTypes::CStrongHandle< resourcesystem::InfoForResourceTypeIPulseGraphDef > m_hPulseGraph; // 0xa8 | Schema_Atomic | Size: 0x8
			char  m_hPulseGraph[0x8]; // 0xa8 | Schema_Atomic | Size: 0x8
			S2_PAD(0x20); // End padding
		};
		static_assert(offsetof(CS2::smartprops::CSmartPropRoot, m_nContentVersion) == 0x0, "m_nContentVersion in CSmartPropRoot should be at offset 0x0");
		static_assert(offsetof(CS2::smartprops::CSmartPropRoot, m_nMaxDepth) == 0x8, "m_nMaxDepth in CSmartPropRoot should be at offset 0x8");
		static_assert(offsetof(CS2::smartprops::CSmartPropRoot, m_Variables) == 0x48, "m_Variables in CSmartPropRoot should be at offset 0x48");
		static_assert(offsetof(CS2::smartprops::CSmartPropRoot, m_Choices) == 0x60, "m_Choices in CSmartPropRoot should be at offset 0x60");
		static_assert(offsetof(CS2::smartprops::CSmartPropRoot, m_Children) == 0x78, "m_Children in CSmartPropRoot should be at offset 0x78");
		static_assert(offsetof(CS2::smartprops::CSmartPropRoot, m_Modifiers) == 0x90, "m_Modifiers in CSmartPropRoot should be at offset 0x90");
		static_assert(offsetof(CS2::smartprops::CSmartPropRoot, m_hPulseGraph) == 0xA8, "m_hPulseGraph in CSmartPropRoot should be at offset 0xA8");
		static_assert(sizeof(CS2::smartprops::CSmartPropRoot) == 0xD0, "CSmartPropRoot size should be 0xD0");
	}
}
