// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#include <SDK/GlobalTypes.hpp>

#include <SDK/smartprops/CSmartPropOperation_Trace.hpp>
#include <SDK/smartprops/CSmartPropAttributeCoordinateSpace.hpp>



namespace CS2 {
	namespace smartprops {
		class CSmartPropOperation_TraceToPoint : public CS2::smartprops::CSmartPropOperation_Trace {
		public:
			GlobalTypes::CSmartPropAttributeVector m_TargetPoint; // 0x350 | Schema_Atomic | Size: 0x40
			smartprops::CSmartPropAttributeCoordinateSpace m_TargetPointSpace; // 0x390 | Schema_DeclaredClass | Size: 0x40
			GlobalTypes::CSmartPropAttributeBool m_bTraceAway; // 0x3d0 | Schema_Atomic | Size: 0x40
			GlobalTypes::CSmartPropAttributeFloat m_flTraceLength; // 0x410 | Schema_Atomic | Size: 0x40
		};
		static_assert(offsetof(CS2::smartprops::CSmartPropOperation_TraceToPoint, m_TargetPoint) == 0x350, "m_TargetPoint in CSmartPropOperation_TraceToPoint should be at offset 0x350");
		static_assert(offsetof(CS2::smartprops::CSmartPropOperation_TraceToPoint, m_TargetPointSpace) == 0x390, "m_TargetPointSpace in CSmartPropOperation_TraceToPoint should be at offset 0x390");
		static_assert(offsetof(CS2::smartprops::CSmartPropOperation_TraceToPoint, m_bTraceAway) == 0x3D0, "m_bTraceAway in CSmartPropOperation_TraceToPoint should be at offset 0x3D0");
		static_assert(offsetof(CS2::smartprops::CSmartPropOperation_TraceToPoint, m_flTraceLength) == 0x410, "m_flTraceLength in CSmartPropOperation_TraceToPoint should be at offset 0x410");
		static_assert(sizeof(CS2::smartprops::CSmartPropOperation_TraceToPoint) == 0x450, "CSmartPropOperation_TraceToPoint size should be 0x450");
	}
}
