// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#ifndef CUSTOM_GLOBAL_TYPES
	#include <SDK/GlobalTypes.hpp>
#else
	#include <Custom/GlobalTypes.hpp>
#endif


#include <SDK/smartprops/CSmartPropElement.hpp>
#include <SDK/smartprops/SmartPropDetailFadeLevel_t.hpp>





using namespace GlobalTypes;
namespace CS2 {
	namespace smartprops {
		class CSmartPropElement_Model : public CS2::smartprops::CSmartPropElement {
		public:
			GlobalTypes::CSmartPropAttributeModelName m_sModelName; // 0x88 | Schema_Atomic | Size: 0x40
			GlobalTypes::CSmartPropAttributeMaterialGroup m_MaterialGroupName; // 0xc8 | Schema_Atomic | Size: 0x40
			GlobalTypes::CSmartPropAttributeBool m_bDetailObject; // 0x108 | Schema_Atomic | Size: 0x40
			GlobalTypes::CSmartPropAttributeVector m_vModelScale; // 0x148 | Schema_Atomic | Size: 0x40
			GlobalTypes::CSmartPropAttributeFloat m_flUniformModelScale; // 0x188 | Schema_Atomic | Size: 0x40
			GlobalTypes::CSmartPropAttributeInt m_nLodLevel; // 0x1c8 | Schema_Atomic | Size: 0x40
			GlobalTypes::CSmartPropAttributeSurfaceProperty m_SurfacePropertyOverride; // 0x208 | Schema_Atomic | Size: 0x40
			smartprops::SmartPropDetailFadeLevel_t m_nDetailObjectFadeLevel; // 0x248 | Schema_DeclaredEnum | Size: 0x4
			S2_PAD(0x4);
			GlobalTypes::CSmartPropAttributeBool m_bCastShadows; // 0x250 | Schema_Atomic | Size: 0x40
			GlobalTypes::CSmartPropAttributeBool m_bRigidDeformation; // 0x290 | Schema_Atomic | Size: 0x40
			GlobalTypes::CSmartPropAttributeBool m_bDisableDynamicDeformable; // 0x2d0 | Schema_Atomic | Size: 0x40
		};
		static_assert(offsetof(CS2::smartprops::CSmartPropElement_Model, m_sModelName) == 0x88, "m_sModelName in CSmartPropElement_Model should be at offset 0x88");
		static_assert(offsetof(CS2::smartprops::CSmartPropElement_Model, m_MaterialGroupName) == 0xC8, "m_MaterialGroupName in CSmartPropElement_Model should be at offset 0xC8");
		static_assert(offsetof(CS2::smartprops::CSmartPropElement_Model, m_bDetailObject) == 0x108, "m_bDetailObject in CSmartPropElement_Model should be at offset 0x108");
		static_assert(offsetof(CS2::smartprops::CSmartPropElement_Model, m_vModelScale) == 0x148, "m_vModelScale in CSmartPropElement_Model should be at offset 0x148");
		static_assert(offsetof(CS2::smartprops::CSmartPropElement_Model, m_flUniformModelScale) == 0x188, "m_flUniformModelScale in CSmartPropElement_Model should be at offset 0x188");
		static_assert(offsetof(CS2::smartprops::CSmartPropElement_Model, m_nLodLevel) == 0x1C8, "m_nLodLevel in CSmartPropElement_Model should be at offset 0x1C8");
		static_assert(offsetof(CS2::smartprops::CSmartPropElement_Model, m_SurfacePropertyOverride) == 0x208, "m_SurfacePropertyOverride in CSmartPropElement_Model should be at offset 0x208");
		static_assert(offsetof(CS2::smartprops::CSmartPropElement_Model, m_nDetailObjectFadeLevel) == 0x248, "m_nDetailObjectFadeLevel in CSmartPropElement_Model should be at offset 0x248");
		static_assert(offsetof(CS2::smartprops::CSmartPropElement_Model, m_bCastShadows) == 0x250, "m_bCastShadows in CSmartPropElement_Model should be at offset 0x250");
		static_assert(offsetof(CS2::smartprops::CSmartPropElement_Model, m_bRigidDeformation) == 0x290, "m_bRigidDeformation in CSmartPropElement_Model should be at offset 0x290");
		static_assert(offsetof(CS2::smartprops::CSmartPropElement_Model, m_bDisableDynamicDeformable) == 0x2D0, "m_bDisableDynamicDeformable in CSmartPropElement_Model should be at offset 0x2D0");
		static_assert(sizeof(CS2::smartprops::CSmartPropElement_Model) == 0x310, "CSmartPropElement_Model size should be 0x310");
	}
}
