// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#include <SDK/GlobalTypes.hpp>

#include <SDK/smartprops/CSmartPropOperation.hpp>
#include <SDK/smartprops/CSmartPropAttributeColorSelectionMode.hpp>



namespace CS2 {
	namespace smartprops {
		class CSmartPropOperation_MaterialTint : public CS2::smartprops::CSmartPropOperation {
		public:
			GlobalTypes::CSmartPropAttributeMaterialName m_Material; // 0x50 | Schema_Atomic | Size: 0x40
			smartprops::CSmartPropAttributeColorSelectionMode m_SelectionMode; // 0x90 | Schema_DeclaredClass | Size: 0x40
			GlobalTypes::CSmartPropAttributeColor m_Color; // 0xd0 | Schema_Atomic | Size: 0x40
			GlobalTypes::CColorGradient m_Gradient; // 0x110 | Schema_Atomic | Size: 0x18
			GlobalTypes::CSmartPropAttributeFloat m_ColorPosition; // 0x128 | Schema_Atomic | Size: 0x40
		};
		static_assert(offsetof(CS2::smartprops::CSmartPropOperation_MaterialTint, m_Material) == 0x50, "m_Material in CSmartPropOperation_MaterialTint should be at offset 0x50");
		static_assert(offsetof(CS2::smartprops::CSmartPropOperation_MaterialTint, m_SelectionMode) == 0x90, "m_SelectionMode in CSmartPropOperation_MaterialTint should be at offset 0x90");
		static_assert(offsetof(CS2::smartprops::CSmartPropOperation_MaterialTint, m_Color) == 0xD0, "m_Color in CSmartPropOperation_MaterialTint should be at offset 0xD0");
		static_assert(offsetof(CS2::smartprops::CSmartPropOperation_MaterialTint, m_Gradient) == 0x110, "m_Gradient in CSmartPropOperation_MaterialTint should be at offset 0x110");
		static_assert(offsetof(CS2::smartprops::CSmartPropOperation_MaterialTint, m_ColorPosition) == 0x128, "m_ColorPosition in CSmartPropOperation_MaterialTint should be at offset 0x128");
		static_assert(sizeof(CS2::smartprops::CSmartPropOperation_MaterialTint) == 0x168, "CSmartPropOperation_MaterialTint size should be 0x168");
	}
}
