// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#ifndef CUSTOM_GLOBAL_TYPES
	#include <SDK/GlobalTypes.hpp>
#else
	#include <Custom/GlobalTypes.hpp>
#endif


#include <SDK/smartprops/CSmartPropTransformOperation.hpp>
#include <SDK/smartprops/CSmartPropAttributeCoordinateSpace.hpp>



namespace CS2 {
	namespace smartprops {
		class CSmartPropOperation_RotateTowards : public CS2::smartprops::CSmartPropTransformOperation {
		public:
			GlobalTypes::CSmartPropAttributeVector m_vOriginPos; // 0x50 | Schema_Atomic | Size: 0x40
			GlobalTypes::CSmartPropAttributeVector m_vTargetPos; // 0x90 | Schema_Atomic | Size: 0x40
			GlobalTypes::CSmartPropAttributeVector m_vUpPos; // 0xd0 | Schema_Atomic | Size: 0x40
			GlobalTypes::CSmartPropAttributeFloat m_flWeight; // 0x110 | Schema_Atomic | Size: 0x40
			smartprops::CSmartPropAttributeCoordinateSpace m_OriginSpace; // 0x150 | Schema_DeclaredClass | Size: 0x40
			smartprops::CSmartPropAttributeCoordinateSpace m_TargetSpace; // 0x190 | Schema_DeclaredClass | Size: 0x40
			smartprops::CSmartPropAttributeCoordinateSpace m_UpSpace; // 0x1d0 | Schema_DeclaredClass | Size: 0x40
		};
		static_assert(offsetof(CS2::smartprops::CSmartPropOperation_RotateTowards, m_vOriginPos) == 0x50, "m_vOriginPos in CSmartPropOperation_RotateTowards should be at offset 0x50");
		static_assert(offsetof(CS2::smartprops::CSmartPropOperation_RotateTowards, m_vTargetPos) == 0x90, "m_vTargetPos in CSmartPropOperation_RotateTowards should be at offset 0x90");
		static_assert(offsetof(CS2::smartprops::CSmartPropOperation_RotateTowards, m_vUpPos) == 0xD0, "m_vUpPos in CSmartPropOperation_RotateTowards should be at offset 0xD0");
		static_assert(offsetof(CS2::smartprops::CSmartPropOperation_RotateTowards, m_flWeight) == 0x110, "m_flWeight in CSmartPropOperation_RotateTowards should be at offset 0x110");
		static_assert(offsetof(CS2::smartprops::CSmartPropOperation_RotateTowards, m_OriginSpace) == 0x150, "m_OriginSpace in CSmartPropOperation_RotateTowards should be at offset 0x150");
		static_assert(offsetof(CS2::smartprops::CSmartPropOperation_RotateTowards, m_TargetSpace) == 0x190, "m_TargetSpace in CSmartPropOperation_RotateTowards should be at offset 0x190");
		static_assert(offsetof(CS2::smartprops::CSmartPropOperation_RotateTowards, m_UpSpace) == 0x1D0, "m_UpSpace in CSmartPropOperation_RotateTowards should be at offset 0x1D0");
		static_assert(sizeof(CS2::smartprops::CSmartPropOperation_RotateTowards) == 0x210, "CSmartPropOperation_RotateTowards size should be 0x210");
	}
}
