// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#ifndef CUSTOM_GLOBAL_TYPES
	#include <SDK/GlobalTypes.hpp>
#else
	#include <Custom/GlobalTypes.hpp>
#endif


#include <SDK/smartprops/CSmartPropTransformOperation.hpp>
#include <SDK/smartprops/CSmartPropAttributeCoordinateSpace.hpp>





using namespace GlobalTypes;
namespace CS2 {
	namespace smartprops {
		class CSmartPropOperation_SetOrientation : public CS2::smartprops::CSmartPropTransformOperation {
		public:
			GlobalTypes::CSmartPropAttributeVector m_vForwardVector; // 0x50 | Schema_Atomic | Size: 0x40
			smartprops::CSmartPropAttributeCoordinateSpace m_ForwardDirectionSpace; // 0x90 | Schema_DeclaredClass | Size: 0x40
			GlobalTypes::CSmartPropAttributeVector m_vUpVector; // 0xd0 | Schema_Atomic | Size: 0x40
			smartprops::CSmartPropAttributeCoordinateSpace m_UpDirectionSpace; // 0x110 | Schema_DeclaredClass | Size: 0x40
			GlobalTypes::CSmartPropAttributeBool m_bPrioritizeUp; // 0x150 | Schema_Atomic | Size: 0x40
		};
		static_assert(offsetof(CS2::smartprops::CSmartPropOperation_SetOrientation, m_vForwardVector) == 0x50, "m_vForwardVector in CSmartPropOperation_SetOrientation should be at offset 0x50");
		static_assert(offsetof(CS2::smartprops::CSmartPropOperation_SetOrientation, m_ForwardDirectionSpace) == 0x90, "m_ForwardDirectionSpace in CSmartPropOperation_SetOrientation should be at offset 0x90");
		static_assert(offsetof(CS2::smartprops::CSmartPropOperation_SetOrientation, m_vUpVector) == 0xD0, "m_vUpVector in CSmartPropOperation_SetOrientation should be at offset 0xD0");
		static_assert(offsetof(CS2::smartprops::CSmartPropOperation_SetOrientation, m_UpDirectionSpace) == 0x110, "m_UpDirectionSpace in CSmartPropOperation_SetOrientation should be at offset 0x110");
		static_assert(offsetof(CS2::smartprops::CSmartPropOperation_SetOrientation, m_bPrioritizeUp) == 0x150, "m_bPrioritizeUp in CSmartPropOperation_SetOrientation should be at offset 0x150");
		static_assert(sizeof(CS2::smartprops::CSmartPropOperation_SetOrientation) == 0x190, "CSmartPropOperation_SetOrientation size should be 0x190");
	}
}
