// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#include <SDK/GlobalTypes.hpp>

#include <SDK/smartprops/CSmartPropTransformOperation.hpp>



namespace CS2 {
	namespace smartprops {
		class CSmartPropOperation_CreateLocator : public CS2::smartprops::CSmartPropTransformOperation {
		public:
			GlobalTypes::CUtlString m_LocatorName; // 0x50 | Schema_Atomic | Size: 0x8
			GlobalTypes::CSmartPropAttributeVector m_vOffset; // 0x58 | Schema_Atomic | Size: 0x40
			GlobalTypes::CSmartPropAttributeFloat m_flDisplayScale; // 0x98 | Schema_Atomic | Size: 0x40
			GlobalTypes::CSmartPropAttributeBool m_bConfigurable; // 0xd8 | Schema_Atomic | Size: 0x40
			GlobalTypes::CSmartPropAttributeBool m_bAllowTranslation; // 0x118 | Schema_Atomic | Size: 0x40
			GlobalTypes::CSmartPropAttributeBool m_bAllowRotation; // 0x158 | Schema_Atomic | Size: 0x40
			GlobalTypes::CSmartPropAttributeBool m_bAllowScale; // 0x198 | Schema_Atomic | Size: 0x40
		};
		static_assert(offsetof(CS2::smartprops::CSmartPropOperation_CreateLocator, m_LocatorName) == 0x50, "m_LocatorName in CSmartPropOperation_CreateLocator should be at offset 0x50");
		static_assert(offsetof(CS2::smartprops::CSmartPropOperation_CreateLocator, m_vOffset) == 0x58, "m_vOffset in CSmartPropOperation_CreateLocator should be at offset 0x58");
		static_assert(offsetof(CS2::smartprops::CSmartPropOperation_CreateLocator, m_flDisplayScale) == 0x98, "m_flDisplayScale in CSmartPropOperation_CreateLocator should be at offset 0x98");
		static_assert(offsetof(CS2::smartprops::CSmartPropOperation_CreateLocator, m_bConfigurable) == 0xD8, "m_bConfigurable in CSmartPropOperation_CreateLocator should be at offset 0xD8");
		static_assert(offsetof(CS2::smartprops::CSmartPropOperation_CreateLocator, m_bAllowTranslation) == 0x118, "m_bAllowTranslation in CSmartPropOperation_CreateLocator should be at offset 0x118");
		static_assert(offsetof(CS2::smartprops::CSmartPropOperation_CreateLocator, m_bAllowRotation) == 0x158, "m_bAllowRotation in CSmartPropOperation_CreateLocator should be at offset 0x158");
		static_assert(offsetof(CS2::smartprops::CSmartPropOperation_CreateLocator, m_bAllowScale) == 0x198, "m_bAllowScale in CSmartPropOperation_CreateLocator should be at offset 0x198");
		static_assert(sizeof(CS2::smartprops::CSmartPropOperation_CreateLocator) == 0x1D8, "CSmartPropOperation_CreateLocator size should be 0x1D8");
	}
}
