// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#include <SDK/GlobalTypes.hpp>




namespace CS2 {
	namespace smartprops {
		class CSmartPropElement  {
		public:
			S2_PAD(0x8);
			int32_t m_nElementID; // 0x8 | Schema_Builtin | Size: 0x4
			S2_PAD(0x4);
			GlobalTypes::CSmartPropAttributeBool m_bEnabled; // 0x10 | Schema_Atomic | Size: 0x40
			GlobalTypes::CUtlString m_sLabel; // 0x50 | Schema_Atomic | Size: 0x8
			// GlobalTypes::CUtlVector< CSmartPropSelectionCriteria >* m_SelectionCriteria; // 0x58 | Schema_Atomic | Size: 0x18
			char  m_SelectionCriteria[0x18]; // 0x58 | Schema_Atomic | Size: 0x18
			// GlobalTypes::CUtlVector< CSmartPropModifier >* m_Modifiers; // 0x70 | Schema_Atomic | Size: 0x18
			char  m_Modifiers[0x18]; // 0x70 | Schema_Atomic | Size: 0x18
		};
		static_assert(offsetof(CS2::smartprops::CSmartPropElement, m_nElementID) == 0x8, "m_nElementID in CSmartPropElement should be at offset 0x8");
		static_assert(offsetof(CS2::smartprops::CSmartPropElement, m_bEnabled) == 0x10, "m_bEnabled in CSmartPropElement should be at offset 0x10");
		static_assert(offsetof(CS2::smartprops::CSmartPropElement, m_sLabel) == 0x50, "m_sLabel in CSmartPropElement should be at offset 0x50");
		static_assert(offsetof(CS2::smartprops::CSmartPropElement, m_SelectionCriteria) == 0x58, "m_SelectionCriteria in CSmartPropElement should be at offset 0x58");
		static_assert(offsetof(CS2::smartprops::CSmartPropElement, m_Modifiers) == 0x70, "m_Modifiers in CSmartPropElement should be at offset 0x70");
		static_assert(sizeof(CS2::smartprops::CSmartPropElement) == 0x88, "CSmartPropElement size should be 0x88");
	}
}
