// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#ifndef CUSTOM_GLOBAL_TYPES
	#include <SDK/GlobalTypes.hpp>
#else
	#include <Custom/GlobalTypes.hpp>
#endif





namespace CS2 {
	namespace modellib {
		class CAnimAttachment  {
		public:
			GlobalTypes::Quaternion m_influenceRotations[3]; // 0x0 | Schema_FixedArray | Size: 0x30
			GlobalTypes::VectorAligned m_influenceOffsets[3]; // 0x30 | Schema_FixedArray | Size: 0x30
			int32_t m_influenceIndices[3]; // 0x60 | Schema_FixedArray | Size: 0xc
			float32 m_influenceWeights[3]; // 0x6c | Schema_FixedArray | Size: 0xc
			uint8_t m_numInfluences; // 0x78 | Schema_Builtin | Size: 0x1
			S2_PAD(0x7); // End padding
		};
		static_assert(offsetof(CS2::modellib::CAnimAttachment, m_influenceRotations) == 0x0, "m_influenceRotations in CAnimAttachment should be at offset 0x0");
		static_assert(offsetof(CS2::modellib::CAnimAttachment, m_influenceOffsets) == 0x30, "m_influenceOffsets in CAnimAttachment should be at offset 0x30");
		static_assert(offsetof(CS2::modellib::CAnimAttachment, m_influenceIndices) == 0x60, "m_influenceIndices in CAnimAttachment should be at offset 0x60");
		static_assert(offsetof(CS2::modellib::CAnimAttachment, m_influenceWeights) == 0x6C, "m_influenceWeights in CAnimAttachment should be at offset 0x6C");
		static_assert(offsetof(CS2::modellib::CAnimAttachment, m_numInfluences) == 0x78, "m_numInfluences in CAnimAttachment should be at offset 0x78");
		static_assert(sizeof(CS2::modellib::CAnimAttachment) == 0x80, "CAnimAttachment size should be 0x80");
	}
}
