// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#ifndef CUSTOM_GLOBAL_TYPES
	#include <SDK/GlobalTypes.hpp>
#else
	#include <Custom/GlobalTypes.hpp>
#endif





namespace CS2 {
	namespace modellib {
		class CAttachment  {
		public:
			GlobalTypes::CUtlString m_name; // 0x0 | Schema_Atomic | Size: 0x8
			GlobalTypes::CUtlString m_influenceNames[3]; // 0x8 | Schema_FixedArray | Size: 0x18
			GlobalTypes::Quaternion m_vInfluenceRotations[3]; // 0x20 | Schema_FixedArray | Size: 0x30
			GlobalTypes::Vector m_vInfluenceOffsets[3]; // 0x50 | Schema_FixedArray | Size: 0x24
			float32 m_influenceWeights[3]; // 0x74 | Schema_FixedArray | Size: 0xc
			bool m_bInfluenceRootTransform[3]; // 0x80 | Schema_FixedArray | Size: 0x3
			uint8_t m_nInfluences; // 0x83 | Schema_Builtin | Size: 0x1
			bool m_bIgnoreRotation; // 0x84 | Schema_Builtin | Size: 0x1
			S2_PAD(0xb); // End padding
		};
		static_assert(offsetof(CS2::modellib::CAttachment, m_name) == 0x0, "m_name in CAttachment should be at offset 0x0");
		static_assert(offsetof(CS2::modellib::CAttachment, m_influenceNames) == 0x8, "m_influenceNames in CAttachment should be at offset 0x8");
		static_assert(offsetof(CS2::modellib::CAttachment, m_vInfluenceRotations) == 0x20, "m_vInfluenceRotations in CAttachment should be at offset 0x20");
		static_assert(offsetof(CS2::modellib::CAttachment, m_vInfluenceOffsets) == 0x50, "m_vInfluenceOffsets in CAttachment should be at offset 0x50");
		static_assert(offsetof(CS2::modellib::CAttachment, m_influenceWeights) == 0x74, "m_influenceWeights in CAttachment should be at offset 0x74");
		static_assert(offsetof(CS2::modellib::CAttachment, m_bInfluenceRootTransform) == 0x80, "m_bInfluenceRootTransform in CAttachment should be at offset 0x80");
		static_assert(offsetof(CS2::modellib::CAttachment, m_nInfluences) == 0x83, "m_nInfluences in CAttachment should be at offset 0x83");
		static_assert(offsetof(CS2::modellib::CAttachment, m_bIgnoreRotation) == 0x84, "m_bIgnoreRotation in CAttachment should be at offset 0x84");
		static_assert(sizeof(CS2::modellib::CAttachment) == 0x90, "CAttachment size should be 0x90");
	}
}
