// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#ifndef CUSTOM_GLOBAL_TYPES
	#include <SDK/GlobalTypes.hpp>
#else
	#include <Custom/GlobalTypes.hpp>
#endif


#include <SDK/modellib/CBoneConstraintBase.hpp>



namespace CS2 {
	namespace modellib {
		class Input_t;
	}
}


using namespace GlobalTypes;
namespace CS2 {
	namespace modellib {
		class CBoneConstraintPoseSpaceMorph : public CS2::modellib::CBoneConstraintBase {
		public:
			GlobalTypes::CUtlString m_sBoneName; // 0x20 | Schema_Atomic | Size: 0x8
			GlobalTypes::CUtlString m_sAttachmentName; // 0x28 | Schema_Atomic | Size: 0x8
			GlobalTypes::CUtlVector< GlobalTypes::CUtlString > m_outputMorph; // 0x30 | Schema_Atomic | Size: 0x18
			// char  m_outputMorph[0x18]; // 0x30 | Schema_Atomic | Size: 0x18
			GlobalTypes::CUtlVector< modellib::Input_t > m_inputList; // 0x48 | Schema_Atomic | Size: 0x18
			// char  m_inputList[0x18]; // 0x48 | Schema_Atomic | Size: 0x18
			bool m_bClamp; // 0x60 | Schema_Builtin | Size: 0x1
			S2_PAD(0x3f); // End padding
		};
		static_assert(offsetof(CS2::modellib::CBoneConstraintPoseSpaceMorph, m_sBoneName) == 0x20, "m_sBoneName in CBoneConstraintPoseSpaceMorph should be at offset 0x20");
		static_assert(offsetof(CS2::modellib::CBoneConstraintPoseSpaceMorph, m_sAttachmentName) == 0x28, "m_sAttachmentName in CBoneConstraintPoseSpaceMorph should be at offset 0x28");
		static_assert(offsetof(CS2::modellib::CBoneConstraintPoseSpaceMorph, m_outputMorph) == 0x30, "m_outputMorph in CBoneConstraintPoseSpaceMorph should be at offset 0x30");
		static_assert(offsetof(CS2::modellib::CBoneConstraintPoseSpaceMorph, m_inputList) == 0x48, "m_inputList in CBoneConstraintPoseSpaceMorph should be at offset 0x48");
		static_assert(offsetof(CS2::modellib::CBoneConstraintPoseSpaceMorph, m_bClamp) == 0x60, "m_bClamp in CBoneConstraintPoseSpaceMorph should be at offset 0x60");
		static_assert(sizeof(CS2::modellib::CBoneConstraintPoseSpaceMorph) == 0xA0, "CBoneConstraintPoseSpaceMorph size should be 0xA0");
	}
}
