// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#include <SDK/GlobalTypes.hpp>

#include <SDK/modellib/CBoneConstraintBase.hpp>



namespace CS2 {
	namespace modellib {
		class CBoneConstraintDotToMorph : public CS2::modellib::CBoneConstraintBase {
		public:
			GlobalTypes::CUtlString m_sBoneName; // 0x20 | Schema_Atomic | Size: 0x8
			GlobalTypes::CUtlString m_sTargetBoneName; // 0x28 | Schema_Atomic | Size: 0x8
			GlobalTypes::CUtlString m_sMorphChannelName; // 0x30 | Schema_Atomic | Size: 0x8
			float32 m_flRemap[4]; // 0x38 | Schema_FixedArray | Size: 0x10
			S2_PAD(0x10); // End padding
		};
		static_assert(offsetof(CS2::modellib::CBoneConstraintDotToMorph, m_sBoneName) == 0x20, "m_sBoneName in CBoneConstraintDotToMorph should be at offset 0x20");
		static_assert(offsetof(CS2::modellib::CBoneConstraintDotToMorph, m_sTargetBoneName) == 0x28, "m_sTargetBoneName in CBoneConstraintDotToMorph should be at offset 0x28");
		static_assert(offsetof(CS2::modellib::CBoneConstraintDotToMorph, m_sMorphChannelName) == 0x30, "m_sMorphChannelName in CBoneConstraintDotToMorph should be at offset 0x30");
		static_assert(offsetof(CS2::modellib::CBoneConstraintDotToMorph, m_flRemap) == 0x38, "m_flRemap in CBoneConstraintDotToMorph should be at offset 0x38");
		static_assert(sizeof(CS2::modellib::CBoneConstraintDotToMorph) == 0x58, "CBoneConstraintDotToMorph size should be 0x58");
	}
}
