// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#include <SDK/GlobalTypes.hpp>

#include <SDK/modellib/CAnimCycle.hpp>
#include <SDK/modellib/CFootCycle.hpp>



namespace CS2 {
	namespace modellib {
		class CFootCycleDefinition  {
		public:
			GlobalTypes::Vector m_vStancePositionMS; // 0x0 | Schema_Atomic | Size: 0xc
			GlobalTypes::Vector m_vMidpointPositionMS; // 0xc | Schema_Atomic | Size: 0xc
			float32 m_flStanceDirectionMS; // 0x18 | Schema_Builtin | Size: 0x4
			GlobalTypes::Vector m_vToStrideStartPos; // 0x1c | Schema_Atomic | Size: 0xc
			modellib::CAnimCycle m_stanceCycle; // 0x28 | Schema_DeclaredClass | Size: 0x4
			modellib::CFootCycle m_footLiftCycle; // 0x2c | Schema_DeclaredClass | Size: 0x4
			modellib::CFootCycle m_footOffCycle; // 0x30 | Schema_DeclaredClass | Size: 0x4
			modellib::CFootCycle m_footStrikeCycle; // 0x34 | Schema_DeclaredClass | Size: 0x4
			modellib::CFootCycle m_footLandCycle; // 0x38 | Schema_DeclaredClass | Size: 0x4
		};
		static_assert(offsetof(CS2::modellib::CFootCycleDefinition, m_vStancePositionMS) == 0x0, "m_vStancePositionMS in CFootCycleDefinition should be at offset 0x0");
		static_assert(offsetof(CS2::modellib::CFootCycleDefinition, m_vMidpointPositionMS) == 0xC, "m_vMidpointPositionMS in CFootCycleDefinition should be at offset 0xC");
		static_assert(offsetof(CS2::modellib::CFootCycleDefinition, m_flStanceDirectionMS) == 0x18, "m_flStanceDirectionMS in CFootCycleDefinition should be at offset 0x18");
		static_assert(offsetof(CS2::modellib::CFootCycleDefinition, m_vToStrideStartPos) == 0x1C, "m_vToStrideStartPos in CFootCycleDefinition should be at offset 0x1C");
		static_assert(offsetof(CS2::modellib::CFootCycleDefinition, m_stanceCycle) == 0x28, "m_stanceCycle in CFootCycleDefinition should be at offset 0x28");
		static_assert(offsetof(CS2::modellib::CFootCycleDefinition, m_footLiftCycle) == 0x2C, "m_footLiftCycle in CFootCycleDefinition should be at offset 0x2C");
		static_assert(offsetof(CS2::modellib::CFootCycleDefinition, m_footOffCycle) == 0x30, "m_footOffCycle in CFootCycleDefinition should be at offset 0x30");
		static_assert(offsetof(CS2::modellib::CFootCycleDefinition, m_footStrikeCycle) == 0x34, "m_footStrikeCycle in CFootCycleDefinition should be at offset 0x34");
		static_assert(offsetof(CS2::modellib::CFootCycleDefinition, m_footLandCycle) == 0x38, "m_footLandCycle in CFootCycleDefinition should be at offset 0x38");
		static_assert(sizeof(CS2::modellib::CFootCycleDefinition) == 0x3C, "CFootCycleDefinition size should be 0x3C");
	}
}
