// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#ifndef CUSTOM_GLOBAL_TYPES
	#include <SDK/GlobalTypes.hpp>
#else
	#include <Custom/GlobalTypes.hpp>
#endif





namespace CS2 {
	namespace modellib {
		class CFootDefinition  {
		public:
			GlobalTypes::CUtlString m_name; // 0x0 | Schema_Atomic | Size: 0x8
			GlobalTypes::CUtlString m_ankleBoneName; // 0x8 | Schema_Atomic | Size: 0x8
			GlobalTypes::CUtlString m_toeBoneName; // 0x10 | Schema_Atomic | Size: 0x8
			GlobalTypes::Vector m_vBallOffset; // 0x18 | Schema_Atomic | Size: 0xc
			GlobalTypes::Vector m_vHeelOffset; // 0x24 | Schema_Atomic | Size: 0xc
			float32 m_flFootLength; // 0x30 | Schema_Builtin | Size: 0x4
			float32 m_flBindPoseDirectionMS; // 0x34 | Schema_Builtin | Size: 0x4
			float32 m_flTraceHeight; // 0x38 | Schema_Builtin | Size: 0x4
			float32 m_flTraceRadius; // 0x3c | Schema_Builtin | Size: 0x4
		};
		static_assert(offsetof(CS2::modellib::CFootDefinition, m_name) == 0x0, "m_name in CFootDefinition should be at offset 0x0");
		static_assert(offsetof(CS2::modellib::CFootDefinition, m_ankleBoneName) == 0x8, "m_ankleBoneName in CFootDefinition should be at offset 0x8");
		static_assert(offsetof(CS2::modellib::CFootDefinition, m_toeBoneName) == 0x10, "m_toeBoneName in CFootDefinition should be at offset 0x10");
		static_assert(offsetof(CS2::modellib::CFootDefinition, m_vBallOffset) == 0x18, "m_vBallOffset in CFootDefinition should be at offset 0x18");
		static_assert(offsetof(CS2::modellib::CFootDefinition, m_vHeelOffset) == 0x24, "m_vHeelOffset in CFootDefinition should be at offset 0x24");
		static_assert(offsetof(CS2::modellib::CFootDefinition, m_flFootLength) == 0x30, "m_flFootLength in CFootDefinition should be at offset 0x30");
		static_assert(offsetof(CS2::modellib::CFootDefinition, m_flBindPoseDirectionMS) == 0x34, "m_flBindPoseDirectionMS in CFootDefinition should be at offset 0x34");
		static_assert(offsetof(CS2::modellib::CFootDefinition, m_flTraceHeight) == 0x38, "m_flTraceHeight in CFootDefinition should be at offset 0x38");
		static_assert(offsetof(CS2::modellib::CFootDefinition, m_flTraceRadius) == 0x3C, "m_flTraceRadius in CFootDefinition should be at offset 0x3C");
		static_assert(sizeof(CS2::modellib::CFootDefinition) == 0x40, "CFootDefinition size should be 0x40");
	}
}
