// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#include <SDK/GlobalTypes.hpp>




namespace CS2 {
	namespace modellib {
		class CHitBoxSet  {
		public:
			GlobalTypes::CUtlString m_name; // 0x0 | Schema_Atomic | Size: 0x8
			uint32_t m_nNameHash; // 0x8 | Schema_Builtin | Size: 0x4
			S2_PAD(0x4);
			// GlobalTypes::CUtlVector< modellib::CHitBox > m_HitBoxes; // 0x10 | Schema_Atomic | Size: 0x18
			char  m_HitBoxes[0x18]; // 0x10 | Schema_Atomic | Size: 0x18
			GlobalTypes::CUtlString m_SourceFilename; // 0x28 | Schema_Atomic | Size: 0x8
		};
		static_assert(offsetof(CS2::modellib::CHitBoxSet, m_name) == 0x0, "m_name in CHitBoxSet should be at offset 0x0");
		static_assert(offsetof(CS2::modellib::CHitBoxSet, m_nNameHash) == 0x8, "m_nNameHash in CHitBoxSet should be at offset 0x8");
		static_assert(offsetof(CS2::modellib::CHitBoxSet, m_HitBoxes) == 0x10, "m_HitBoxes in CHitBoxSet should be at offset 0x10");
		static_assert(offsetof(CS2::modellib::CHitBoxSet, m_SourceFilename) == 0x28, "m_SourceFilename in CHitBoxSet should be at offset 0x28");
		static_assert(sizeof(CS2::modellib::CHitBoxSet) == 0x30, "CHitBoxSet size should be 0x30");
	}
}
