// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#ifndef CUSTOM_GLOBAL_TYPES
	#include <SDK/GlobalTypes.hpp>
#else
	#include <Custom/GlobalTypes.hpp>
#endif


#include <SDK/mathlib_extended/PackedAABB_t.hpp>
#include <SDK/modellib/CDrawCullingData.hpp>



namespace CS2 {
	namespace modellib {
		class CMeshletDescriptor  {
		public:
			mathlib_extended::PackedAABB_t m_PackedAABB; // 0x0 | Schema_DeclaredClass | Size: 0x8
			modellib::CDrawCullingData m_CullingData; // 0x8 | Schema_DeclaredClass | Size: 0x4
			uint32_t m_nVertexOffset; // 0xc | Schema_Builtin | Size: 0x4
			uint32_t m_nTriangleOffset; // 0x10 | Schema_Builtin | Size: 0x4
			uint8_t m_nVertexCount; // 0x14 | Schema_Builtin | Size: 0x1
			uint8_t m_nTriangleCount; // 0x15 | Schema_Builtin | Size: 0x1
			S2_PAD(0x2); // End padding
		};
		static_assert(offsetof(CS2::modellib::CMeshletDescriptor, m_PackedAABB) == 0x0, "m_PackedAABB in CMeshletDescriptor should be at offset 0x0");
		static_assert(offsetof(CS2::modellib::CMeshletDescriptor, m_CullingData) == 0x8, "m_CullingData in CMeshletDescriptor should be at offset 0x8");
		static_assert(offsetof(CS2::modellib::CMeshletDescriptor, m_nVertexOffset) == 0xC, "m_nVertexOffset in CMeshletDescriptor should be at offset 0xC");
		static_assert(offsetof(CS2::modellib::CMeshletDescriptor, m_nTriangleOffset) == 0x10, "m_nTriangleOffset in CMeshletDescriptor should be at offset 0x10");
		static_assert(offsetof(CS2::modellib::CMeshletDescriptor, m_nVertexCount) == 0x14, "m_nVertexCount in CMeshletDescriptor should be at offset 0x14");
		static_assert(offsetof(CS2::modellib::CMeshletDescriptor, m_nTriangleCount) == 0x15, "m_nTriangleCount in CMeshletDescriptor should be at offset 0x15");
		static_assert(sizeof(CS2::modellib::CMeshletDescriptor) == 0x18, "CMeshletDescriptor size should be 0x18");
	}
}
