// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#ifndef CUSTOM_GLOBAL_TYPES
	#include <SDK/GlobalTypes.hpp>
#else
	#include <Custom/GlobalTypes.hpp>
#endif


#include <SDK/modellib/CBaseConstraint.hpp>



namespace CS2 {
	namespace modellib {
		class CMorphConstraint : public CS2::modellib::CBaseConstraint {
		public:
			GlobalTypes::CUtlString m_sTargetMorph; // 0x60 | Schema_Atomic | Size: 0x8
			int32_t m_nSlaveChannel; // 0x68 | Schema_Builtin | Size: 0x4
			float32 m_flMin; // 0x6c | Schema_Builtin | Size: 0x4
			float32 m_flMax; // 0x70 | Schema_Builtin | Size: 0x4
			S2_PAD(0xc); // End padding
		};
		static_assert(offsetof(CS2::modellib::CMorphConstraint, m_sTargetMorph) == 0x60, "m_sTargetMorph in CMorphConstraint should be at offset 0x60");
		static_assert(offsetof(CS2::modellib::CMorphConstraint, m_nSlaveChannel) == 0x68, "m_nSlaveChannel in CMorphConstraint should be at offset 0x68");
		static_assert(offsetof(CS2::modellib::CMorphConstraint, m_flMin) == 0x6C, "m_flMin in CMorphConstraint should be at offset 0x6C");
		static_assert(offsetof(CS2::modellib::CMorphConstraint, m_flMax) == 0x70, "m_flMax in CMorphConstraint should be at offset 0x70");
		static_assert(sizeof(CS2::modellib::CMorphConstraint) == 0x80, "CMorphConstraint size should be 0x80");
	}
}
