// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#include <SDK/GlobalTypes.hpp>

#include <SDK/modellib/NPCPhysicsHullType_t.hpp>



namespace CS2 {
	namespace modellib {
		class CNPCPhysicsHull  {
		public:
			GlobalTypes::CGlobalSymbol m_sName; // 0x0 | Schema_Atomic | Size: 0x8
			modellib::NPCPhysicsHullType_t m_eType; // 0x8 | Schema_DeclaredEnum | Size: 0x4
			float32 m_flCapsuleHeight; // 0xc | Schema_Builtin | Size: 0x4
			float32 m_flCapsuleRadius; // 0x10 | Schema_Builtin | Size: 0x4
			GlobalTypes::Vector m_vCapsuleCenter1; // 0x14 | Schema_Atomic | Size: 0xc
			GlobalTypes::Vector m_vCapsuleCenter2; // 0x20 | Schema_Atomic | Size: 0xc
			float32 m_flGroundBoxHeight; // 0x2c | Schema_Builtin | Size: 0x4
			float32 m_flGroundBoxWidth; // 0x30 | Schema_Builtin | Size: 0x4
			S2_PAD(0x4); // End padding
		};
		static_assert(offsetof(CS2::modellib::CNPCPhysicsHull, m_sName) == 0x0, "m_sName in CNPCPhysicsHull should be at offset 0x0");
		static_assert(offsetof(CS2::modellib::CNPCPhysicsHull, m_eType) == 0x8, "m_eType in CNPCPhysicsHull should be at offset 0x8");
		static_assert(offsetof(CS2::modellib::CNPCPhysicsHull, m_flCapsuleHeight) == 0xC, "m_flCapsuleHeight in CNPCPhysicsHull should be at offset 0xC");
		static_assert(offsetof(CS2::modellib::CNPCPhysicsHull, m_flCapsuleRadius) == 0x10, "m_flCapsuleRadius in CNPCPhysicsHull should be at offset 0x10");
		static_assert(offsetof(CS2::modellib::CNPCPhysicsHull, m_vCapsuleCenter1) == 0x14, "m_vCapsuleCenter1 in CNPCPhysicsHull should be at offset 0x14");
		static_assert(offsetof(CS2::modellib::CNPCPhysicsHull, m_vCapsuleCenter2) == 0x20, "m_vCapsuleCenter2 in CNPCPhysicsHull should be at offset 0x20");
		static_assert(offsetof(CS2::modellib::CNPCPhysicsHull, m_flGroundBoxHeight) == 0x2C, "m_flGroundBoxHeight in CNPCPhysicsHull should be at offset 0x2C");
		static_assert(offsetof(CS2::modellib::CNPCPhysicsHull, m_flGroundBoxWidth) == 0x30, "m_flGroundBoxWidth in CNPCPhysicsHull should be at offset 0x30");
		static_assert(sizeof(CS2::modellib::CNPCPhysicsHull) == 0x38, "CNPCPhysicsHull size should be 0x38");
	}
}
