// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#include <SDK/GlobalTypes.hpp>

#include <SDK/modellib/CPhysSurfacePropertiesPhysics.hpp>
#include <SDK/modellib/CPhysSurfacePropertiesVehicle.hpp>
#include <SDK/modellib/CPhysSurfacePropertiesSoundNames.hpp>
#include <SDK/modellib/CPhysSurfacePropertiesAudio.hpp>



namespace CS2 {
	namespace modellib {
		class CPhysSurfaceProperties  {
		public:
			GlobalTypes::CUtlString m_name; // 0x0 | Schema_Atomic | Size: 0x8
			uint32_t m_nameHash; // 0x8 | Schema_Builtin | Size: 0x4
			uint32_t m_baseNameHash; // 0xc | Schema_Builtin | Size: 0x4
			S2_PAD(0x8);
			bool m_bHidden; // 0x18 | Schema_Builtin | Size: 0x1
			S2_PAD(0x7);
			GlobalTypes::CUtlString m_description; // 0x20 | Schema_Atomic | Size: 0x8
			modellib::CPhysSurfacePropertiesPhysics m_physics; // 0x28 | Schema_DeclaredClass | Size: 0x18
			modellib::CPhysSurfacePropertiesVehicle m_vehicleParams; // 0x40 | Schema_DeclaredClass | Size: 0x8
			modellib::CPhysSurfacePropertiesSoundNames m_audioSounds; // 0x48 | Schema_DeclaredClass | Size: 0x60
			modellib::CPhysSurfacePropertiesAudio m_audioParams; // 0xa8 | Schema_DeclaredClass | Size: 0x20
		};
		static_assert(offsetof(CS2::modellib::CPhysSurfaceProperties, m_name) == 0x0, "m_name in CPhysSurfaceProperties should be at offset 0x0");
		static_assert(offsetof(CS2::modellib::CPhysSurfaceProperties, m_nameHash) == 0x8, "m_nameHash in CPhysSurfaceProperties should be at offset 0x8");
		static_assert(offsetof(CS2::modellib::CPhysSurfaceProperties, m_baseNameHash) == 0xC, "m_baseNameHash in CPhysSurfaceProperties should be at offset 0xC");
		static_assert(offsetof(CS2::modellib::CPhysSurfaceProperties, m_bHidden) == 0x18, "m_bHidden in CPhysSurfaceProperties should be at offset 0x18");
		static_assert(offsetof(CS2::modellib::CPhysSurfaceProperties, m_description) == 0x20, "m_description in CPhysSurfaceProperties should be at offset 0x20");
		static_assert(offsetof(CS2::modellib::CPhysSurfaceProperties, m_physics) == 0x28, "m_physics in CPhysSurfaceProperties should be at offset 0x28");
		static_assert(offsetof(CS2::modellib::CPhysSurfaceProperties, m_vehicleParams) == 0x40, "m_vehicleParams in CPhysSurfaceProperties should be at offset 0x40");
		static_assert(offsetof(CS2::modellib::CPhysSurfaceProperties, m_audioSounds) == 0x48, "m_audioSounds in CPhysSurfaceProperties should be at offset 0x48");
		static_assert(offsetof(CS2::modellib::CPhysSurfaceProperties, m_audioParams) == 0xA8, "m_audioParams in CPhysSurfaceProperties should be at offset 0xA8");
		static_assert(sizeof(CS2::modellib::CPhysSurfaceProperties) == 0xC8, "CPhysSurfaceProperties size should be 0xC8");
	}
}
