// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#include <SDK/GlobalTypes.hpp>




namespace CS2 {
	namespace modellib {
		class CPhysSurfacePropertiesSoundNames  {
		public:
			GlobalTypes::CUtlString m_impactSoft; // 0x0 | Schema_Atomic | Size: 0x8
			GlobalTypes::CUtlString m_impactHard; // 0x8 | Schema_Atomic | Size: 0x8
			GlobalTypes::CUtlString m_scrapeSmooth; // 0x10 | Schema_Atomic | Size: 0x8
			GlobalTypes::CUtlString m_scrapeRough; // 0x18 | Schema_Atomic | Size: 0x8
			GlobalTypes::CUtlString m_bulletImpact; // 0x20 | Schema_Atomic | Size: 0x8
			GlobalTypes::CUtlString m_rolling; // 0x28 | Schema_Atomic | Size: 0x8
			GlobalTypes::CUtlString m_break; // 0x30 | Schema_Atomic | Size: 0x8
			GlobalTypes::CUtlString m_strain; // 0x38 | Schema_Atomic | Size: 0x8
			GlobalTypes::CUtlString m_meleeImpact; // 0x40 | Schema_Atomic | Size: 0x8
			GlobalTypes::CUtlString m_pushOff; // 0x48 | Schema_Atomic | Size: 0x8
			GlobalTypes::CUtlString m_skidStop; // 0x50 | Schema_Atomic | Size: 0x8
			GlobalTypes::CUtlString m_resonant; // 0x58 | Schema_Atomic | Size: 0x8
		};
		static_assert(offsetof(CS2::modellib::CPhysSurfacePropertiesSoundNames, m_impactSoft) == 0x0, "m_impactSoft in CPhysSurfacePropertiesSoundNames should be at offset 0x0");
		static_assert(offsetof(CS2::modellib::CPhysSurfacePropertiesSoundNames, m_impactHard) == 0x8, "m_impactHard in CPhysSurfacePropertiesSoundNames should be at offset 0x8");
		static_assert(offsetof(CS2::modellib::CPhysSurfacePropertiesSoundNames, m_scrapeSmooth) == 0x10, "m_scrapeSmooth in CPhysSurfacePropertiesSoundNames should be at offset 0x10");
		static_assert(offsetof(CS2::modellib::CPhysSurfacePropertiesSoundNames, m_scrapeRough) == 0x18, "m_scrapeRough in CPhysSurfacePropertiesSoundNames should be at offset 0x18");
		static_assert(offsetof(CS2::modellib::CPhysSurfacePropertiesSoundNames, m_bulletImpact) == 0x20, "m_bulletImpact in CPhysSurfacePropertiesSoundNames should be at offset 0x20");
		static_assert(offsetof(CS2::modellib::CPhysSurfacePropertiesSoundNames, m_rolling) == 0x28, "m_rolling in CPhysSurfacePropertiesSoundNames should be at offset 0x28");
		static_assert(offsetof(CS2::modellib::CPhysSurfacePropertiesSoundNames, m_break) == 0x30, "m_break in CPhysSurfacePropertiesSoundNames should be at offset 0x30");
		static_assert(offsetof(CS2::modellib::CPhysSurfacePropertiesSoundNames, m_strain) == 0x38, "m_strain in CPhysSurfacePropertiesSoundNames should be at offset 0x38");
		static_assert(offsetof(CS2::modellib::CPhysSurfacePropertiesSoundNames, m_meleeImpact) == 0x40, "m_meleeImpact in CPhysSurfacePropertiesSoundNames should be at offset 0x40");
		static_assert(offsetof(CS2::modellib::CPhysSurfacePropertiesSoundNames, m_pushOff) == 0x48, "m_pushOff in CPhysSurfacePropertiesSoundNames should be at offset 0x48");
		static_assert(offsetof(CS2::modellib::CPhysSurfacePropertiesSoundNames, m_skidStop) == 0x50, "m_skidStop in CPhysSurfacePropertiesSoundNames should be at offset 0x50");
		static_assert(offsetof(CS2::modellib::CPhysSurfacePropertiesSoundNames, m_resonant) == 0x58, "m_resonant in CPhysSurfacePropertiesSoundNames should be at offset 0x58");
		static_assert(sizeof(CS2::modellib::CPhysSurfacePropertiesSoundNames) == 0x60, "CPhysSurfacePropertiesSoundNames size should be 0x60");
	}
}
