// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#ifndef CUSTOM_GLOBAL_TYPES
	#include <SDK/GlobalTypes.hpp>
#else
	#include <Custom/GlobalTypes.hpp>
#endif







using namespace GlobalTypes;
namespace CS2 {
	namespace modellib {
		class CPhysSurfacePropertiesPhysics  {
		public:
			float32 m_friction; // 0x0 | Schema_Builtin | Size: 0x4
			float32 m_elasticity; // 0x4 | Schema_Builtin | Size: 0x4
			float32 m_density; // 0x8 | Schema_Builtin | Size: 0x4
			float32 m_thickness; // 0xc | Schema_Builtin | Size: 0x4
			float32 m_softContactFrequency; // 0x10 | Schema_Builtin | Size: 0x4
			float32 m_softContactDampingRatio; // 0x14 | Schema_Builtin | Size: 0x4
		};
		static_assert(offsetof(CS2::modellib::CPhysSurfacePropertiesPhysics, m_friction) == 0x0, "m_friction in CPhysSurfacePropertiesPhysics should be at offset 0x0");
		static_assert(offsetof(CS2::modellib::CPhysSurfacePropertiesPhysics, m_elasticity) == 0x4, "m_elasticity in CPhysSurfacePropertiesPhysics should be at offset 0x4");
		static_assert(offsetof(CS2::modellib::CPhysSurfacePropertiesPhysics, m_density) == 0x8, "m_density in CPhysSurfacePropertiesPhysics should be at offset 0x8");
		static_assert(offsetof(CS2::modellib::CPhysSurfacePropertiesPhysics, m_thickness) == 0xC, "m_thickness in CPhysSurfacePropertiesPhysics should be at offset 0xC");
		static_assert(offsetof(CS2::modellib::CPhysSurfacePropertiesPhysics, m_softContactFrequency) == 0x10, "m_softContactFrequency in CPhysSurfacePropertiesPhysics should be at offset 0x10");
		static_assert(offsetof(CS2::modellib::CPhysSurfacePropertiesPhysics, m_softContactDampingRatio) == 0x14, "m_softContactDampingRatio in CPhysSurfacePropertiesPhysics should be at offset 0x14");
		static_assert(sizeof(CS2::modellib::CPhysSurfacePropertiesPhysics) == 0x18, "CPhysSurfacePropertiesPhysics size should be 0x18");
	}
}
