// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#ifndef CUSTOM_GLOBAL_TYPES
	#include <SDK/GlobalTypes.hpp>
#else
	#include <Custom/GlobalTypes.hpp>
#endif







using namespace GlobalTypes;
namespace CS2 {
	namespace modellib {
		class FrameStamp_t  {
		public:
			float32 m_flTime; // 0x0 | Schema_Builtin | Size: 0x4
			float32 m_flEntitySimTime; // 0x4 | Schema_Builtin | Size: 0x4
			bool m_bTeleportTick; // 0x8 | Schema_Builtin | Size: 0x1
			bool m_bPredicted; // 0x9 | Schema_Builtin | Size: 0x1
			S2_PAD(0x2);
			float32 m_flCurTime; // 0xc | Schema_Builtin | Size: 0x4
			float32 m_flRealTime; // 0x10 | Schema_Builtin | Size: 0x4
			int32_t m_nFrameCount; // 0x14 | Schema_Builtin | Size: 0x4
			int32_t m_nTickCount; // 0x18 | Schema_Builtin | Size: 0x4
		};
		static_assert(offsetof(CS2::modellib::FrameStamp_t, m_flTime) == 0x0, "m_flTime in SkeletonAnimCapture_t::FrameStamp_t should be at offset 0x0");
		static_assert(offsetof(CS2::modellib::FrameStamp_t, m_flEntitySimTime) == 0x4, "m_flEntitySimTime in SkeletonAnimCapture_t::FrameStamp_t should be at offset 0x4");
		static_assert(offsetof(CS2::modellib::FrameStamp_t, m_bTeleportTick) == 0x8, "m_bTeleportTick in SkeletonAnimCapture_t::FrameStamp_t should be at offset 0x8");
		static_assert(offsetof(CS2::modellib::FrameStamp_t, m_bPredicted) == 0x9, "m_bPredicted in SkeletonAnimCapture_t::FrameStamp_t should be at offset 0x9");
		static_assert(offsetof(CS2::modellib::FrameStamp_t, m_flCurTime) == 0xC, "m_flCurTime in SkeletonAnimCapture_t::FrameStamp_t should be at offset 0xC");
		static_assert(offsetof(CS2::modellib::FrameStamp_t, m_flRealTime) == 0x10, "m_flRealTime in SkeletonAnimCapture_t::FrameStamp_t should be at offset 0x10");
		static_assert(offsetof(CS2::modellib::FrameStamp_t, m_nFrameCount) == 0x14, "m_nFrameCount in SkeletonAnimCapture_t::FrameStamp_t should be at offset 0x14");
		static_assert(offsetof(CS2::modellib::FrameStamp_t, m_nTickCount) == 0x18, "m_nTickCount in SkeletonAnimCapture_t::FrameStamp_t should be at offset 0x18");
		static_assert(sizeof(CS2::modellib::FrameStamp_t) == 0x1C, "SkeletonAnimCapture_t::FrameStamp_t size should be 0x1C");
	}
}
