// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#include <SDK/GlobalTypes.hpp>




namespace CS2 {
	namespace modellib {
		class ModelEmbeddedMesh_t  {
		public:
			GlobalTypes::CUtlString m_Name; // 0x0 | Schema_Atomic | Size: 0x8
			S2_PAD(0x8);
			int32_t m_nMeshIndex; // 0x10 | Schema_Builtin | Size: 0x4
			int32_t m_nDataBlock; // 0x14 | Schema_Builtin | Size: 0x4
			int32_t m_nMorphBlock; // 0x18 | Schema_Builtin | Size: 0x4
			S2_PAD(0x4);
			// GlobalTypes::CUtlVector< modellib::ModelMeshBufferData_t > m_vertexBuffers; // 0x20 | Schema_Atomic | Size: 0x18
			char  m_vertexBuffers[0x18]; // 0x20 | Schema_Atomic | Size: 0x18
			// GlobalTypes::CUtlVector< modellib::ModelMeshBufferData_t > m_indexBuffers; // 0x38 | Schema_Atomic | Size: 0x18
			char  m_indexBuffers[0x18]; // 0x38 | Schema_Atomic | Size: 0x18
			// GlobalTypes::CUtlVector< modellib::ModelMeshBufferData_t > m_toolsBuffers; // 0x50 | Schema_Atomic | Size: 0x18
			char  m_toolsBuffers[0x18]; // 0x50 | Schema_Atomic | Size: 0x18
			int32_t m_nVBIBBlock; // 0x68 | Schema_Builtin | Size: 0x4
			int32_t m_nToolsVBBlock; // 0x6c | Schema_Builtin | Size: 0x4
		};
		static_assert(offsetof(CS2::modellib::ModelEmbeddedMesh_t, m_Name) == 0x0, "m_Name in ModelEmbeddedMesh_t should be at offset 0x0");
		static_assert(offsetof(CS2::modellib::ModelEmbeddedMesh_t, m_nMeshIndex) == 0x10, "m_nMeshIndex in ModelEmbeddedMesh_t should be at offset 0x10");
		static_assert(offsetof(CS2::modellib::ModelEmbeddedMesh_t, m_nDataBlock) == 0x14, "m_nDataBlock in ModelEmbeddedMesh_t should be at offset 0x14");
		static_assert(offsetof(CS2::modellib::ModelEmbeddedMesh_t, m_nMorphBlock) == 0x18, "m_nMorphBlock in ModelEmbeddedMesh_t should be at offset 0x18");
		static_assert(offsetof(CS2::modellib::ModelEmbeddedMesh_t, m_vertexBuffers) == 0x20, "m_vertexBuffers in ModelEmbeddedMesh_t should be at offset 0x20");
		static_assert(offsetof(CS2::modellib::ModelEmbeddedMesh_t, m_indexBuffers) == 0x38, "m_indexBuffers in ModelEmbeddedMesh_t should be at offset 0x38");
		static_assert(offsetof(CS2::modellib::ModelEmbeddedMesh_t, m_toolsBuffers) == 0x50, "m_toolsBuffers in ModelEmbeddedMesh_t should be at offset 0x50");
		static_assert(offsetof(CS2::modellib::ModelEmbeddedMesh_t, m_nVBIBBlock) == 0x68, "m_nVBIBBlock in ModelEmbeddedMesh_t should be at offset 0x68");
		static_assert(offsetof(CS2::modellib::ModelEmbeddedMesh_t, m_nToolsVBBlock) == 0x6C, "m_nToolsVBBlock in ModelEmbeddedMesh_t should be at offset 0x6C");
		static_assert(sizeof(CS2::modellib::ModelEmbeddedMesh_t) == 0x70, "ModelEmbeddedMesh_t size should be 0x70");
	}
}
