// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#include <SDK/GlobalTypes.hpp>

#include <SDK/modellib/ModelBoneFlexComponent_t.hpp>



namespace CS2 {
	namespace modellib {
		class ModelBoneFlexDriverControl_t  {
		public:
			modellib::ModelBoneFlexComponent_t m_nBoneComponent; // 0x0 | Schema_DeclaredEnum | Size: 0x4
			S2_PAD(0x4);
			GlobalTypes::CUtlString m_flexController; // 0x8 | Schema_Atomic | Size: 0x8
			uint32_t m_flexControllerToken; // 0x10 | Schema_Builtin | Size: 0x4
			float32 m_flMin; // 0x14 | Schema_Builtin | Size: 0x4
			float32 m_flMax; // 0x18 | Schema_Builtin | Size: 0x4
			S2_PAD(0x4); // End padding
		};
		static_assert(offsetof(CS2::modellib::ModelBoneFlexDriverControl_t, m_nBoneComponent) == 0x0, "m_nBoneComponent in ModelBoneFlexDriverControl_t should be at offset 0x0");
		static_assert(offsetof(CS2::modellib::ModelBoneFlexDriverControl_t, m_flexController) == 0x8, "m_flexController in ModelBoneFlexDriverControl_t should be at offset 0x8");
		static_assert(offsetof(CS2::modellib::ModelBoneFlexDriverControl_t, m_flexControllerToken) == 0x10, "m_flexControllerToken in ModelBoneFlexDriverControl_t should be at offset 0x10");
		static_assert(offsetof(CS2::modellib::ModelBoneFlexDriverControl_t, m_flMin) == 0x14, "m_flMin in ModelBoneFlexDriverControl_t should be at offset 0x14");
		static_assert(offsetof(CS2::modellib::ModelBoneFlexDriverControl_t, m_flMax) == 0x18, "m_flMax in ModelBoneFlexDriverControl_t should be at offset 0x18");
		static_assert(sizeof(CS2::modellib::ModelBoneFlexDriverControl_t) == 0x20, "ModelBoneFlexDriverControl_t size should be 0x20");
	}
}
