// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#include <SDK/GlobalTypes.hpp>




namespace CS2 {
	namespace modellib {
		class PermModelInfo_t  {
		public:
			uint32_t m_nFlags; // 0x0 | Schema_Builtin | Size: 0x4
			GlobalTypes::Vector m_vHullMin; // 0x4 | Schema_Atomic | Size: 0xc
			GlobalTypes::Vector m_vHullMax; // 0x10 | Schema_Atomic | Size: 0xc
			GlobalTypes::Vector m_vViewMin; // 0x1c | Schema_Atomic | Size: 0xc
			GlobalTypes::Vector m_vViewMax; // 0x28 | Schema_Atomic | Size: 0xc
			float32 m_flMass; // 0x34 | Schema_Builtin | Size: 0x4
			GlobalTypes::Vector m_vEyePosition; // 0x38 | Schema_Atomic | Size: 0xc
			float32 m_flMaxEyeDeflection; // 0x44 | Schema_Builtin | Size: 0x4
			GlobalTypes::CUtlString m_sSurfaceProperty; // 0x48 | Schema_Atomic | Size: 0x8
			GlobalTypes::CUtlString m_keyValueText; // 0x50 | Schema_Atomic | Size: 0x8
		};
		static_assert(offsetof(CS2::modellib::PermModelInfo_t, m_nFlags) == 0x0, "m_nFlags in PermModelInfo_t should be at offset 0x0");
		static_assert(offsetof(CS2::modellib::PermModelInfo_t, m_vHullMin) == 0x4, "m_vHullMin in PermModelInfo_t should be at offset 0x4");
		static_assert(offsetof(CS2::modellib::PermModelInfo_t, m_vHullMax) == 0x10, "m_vHullMax in PermModelInfo_t should be at offset 0x10");
		static_assert(offsetof(CS2::modellib::PermModelInfo_t, m_vViewMin) == 0x1C, "m_vViewMin in PermModelInfo_t should be at offset 0x1C");
		static_assert(offsetof(CS2::modellib::PermModelInfo_t, m_vViewMax) == 0x28, "m_vViewMax in PermModelInfo_t should be at offset 0x28");
		static_assert(offsetof(CS2::modellib::PermModelInfo_t, m_flMass) == 0x34, "m_flMass in PermModelInfo_t should be at offset 0x34");
		static_assert(offsetof(CS2::modellib::PermModelInfo_t, m_vEyePosition) == 0x38, "m_vEyePosition in PermModelInfo_t should be at offset 0x38");
		static_assert(offsetof(CS2::modellib::PermModelInfo_t, m_flMaxEyeDeflection) == 0x44, "m_flMaxEyeDeflection in PermModelInfo_t should be at offset 0x44");
		static_assert(offsetof(CS2::modellib::PermModelInfo_t, m_sSurfaceProperty) == 0x48, "m_sSurfaceProperty in PermModelInfo_t should be at offset 0x48");
		static_assert(offsetof(CS2::modellib::PermModelInfo_t, m_keyValueText) == 0x50, "m_keyValueText in PermModelInfo_t should be at offset 0x50");
		static_assert(sizeof(CS2::modellib::PermModelInfo_t) == 0x58, "PermModelInfo_t size should be 0x58");
	}
}
