// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#include <SDK/GlobalTypes.hpp>




namespace CS2 {
	namespace modellib {
		class PermModelExtPart_t  {
		public:
			GlobalTypes::CTransform m_Transform; // 0x0 | Schema_Atomic | Size: 0x20
			GlobalTypes::CUtlString m_Name; // 0x20 | Schema_Atomic | Size: 0x8
			int32_t m_nParent; // 0x28 | Schema_Builtin | Size: 0x4
			S2_PAD(0x4);
			// GlobalTypes::CStrongHandle< resourcesystem::InfoForResourceTypeCModel > m_refModel; // 0x30 | Schema_Atomic | Size: 0x8
			char  m_refModel[0x8]; // 0x30 | Schema_Atomic | Size: 0x8
			S2_PAD(0x8); // End padding
		};
		static_assert(offsetof(CS2::modellib::PermModelExtPart_t, m_Transform) == 0x0, "m_Transform in PermModelExtPart_t should be at offset 0x0");
		static_assert(offsetof(CS2::modellib::PermModelExtPart_t, m_Name) == 0x20, "m_Name in PermModelExtPart_t should be at offset 0x20");
		static_assert(offsetof(CS2::modellib::PermModelExtPart_t, m_nParent) == 0x28, "m_nParent in PermModelExtPart_t should be at offset 0x28");
		static_assert(offsetof(CS2::modellib::PermModelExtPart_t, m_refModel) == 0x30, "m_refModel in PermModelExtPart_t should be at offset 0x30");
		static_assert(sizeof(CS2::modellib::PermModelExtPart_t) == 0x40, "PermModelExtPart_t size should be 0x40");
	}
}
