// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#ifndef CUSTOM_GLOBAL_TYPES
	#include <SDK/GlobalTypes.hpp>
#else
	#include <Custom/GlobalTypes.hpp>
#endif





namespace CS2 {
	namespace modellib {
		class PhysSoftbodyDesc_t  {
		public:
			// GlobalTypes::CUtlVector< uint32 > m_ParticleBoneHash; // 0x0 | Schema_Atomic | Size: 0x18
			char  m_ParticleBoneHash[0x18]; // 0x0 | Schema_Atomic | Size: 0x18
			// GlobalTypes::CUtlVector< physicslib::RnSoftbodyParticle_t > m_Particles; // 0x18 | Schema_Atomic | Size: 0x18
			char  m_Particles[0x18]; // 0x18 | Schema_Atomic | Size: 0x18
			// GlobalTypes::CUtlVector< physicslib::RnSoftbodySpring_t > m_Springs; // 0x30 | Schema_Atomic | Size: 0x18
			char  m_Springs[0x18]; // 0x30 | Schema_Atomic | Size: 0x18
			// GlobalTypes::CUtlVector< physicslib::RnSoftbodyCapsule_t > m_Capsules; // 0x48 | Schema_Atomic | Size: 0x18
			char  m_Capsules[0x18]; // 0x48 | Schema_Atomic | Size: 0x18
			// GlobalTypes::CUtlVector< GlobalTypes::CTransform > m_InitPose; // 0x60 | Schema_Atomic | Size: 0x18
			char  m_InitPose[0x18]; // 0x60 | Schema_Atomic | Size: 0x18
			// GlobalTypes::CUtlVector< GlobalTypes::CUtlString > m_ParticleBoneName; // 0x78 | Schema_Atomic | Size: 0x18
			char  m_ParticleBoneName[0x18]; // 0x78 | Schema_Atomic | Size: 0x18
		};
		static_assert(offsetof(CS2::modellib::PhysSoftbodyDesc_t, m_ParticleBoneHash) == 0x0, "m_ParticleBoneHash in PhysSoftbodyDesc_t should be at offset 0x0");
		static_assert(offsetof(CS2::modellib::PhysSoftbodyDesc_t, m_Particles) == 0x18, "m_Particles in PhysSoftbodyDesc_t should be at offset 0x18");
		static_assert(offsetof(CS2::modellib::PhysSoftbodyDesc_t, m_Springs) == 0x30, "m_Springs in PhysSoftbodyDesc_t should be at offset 0x30");
		static_assert(offsetof(CS2::modellib::PhysSoftbodyDesc_t, m_Capsules) == 0x48, "m_Capsules in PhysSoftbodyDesc_t should be at offset 0x48");
		static_assert(offsetof(CS2::modellib::PhysSoftbodyDesc_t, m_InitPose) == 0x60, "m_InitPose in PhysSoftbodyDesc_t should be at offset 0x60");
		static_assert(offsetof(CS2::modellib::PhysSoftbodyDesc_t, m_ParticleBoneName) == 0x78, "m_ParticleBoneName in PhysSoftbodyDesc_t should be at offset 0x78");
		static_assert(sizeof(CS2::modellib::PhysSoftbodyDesc_t) == 0x90, "PhysSoftbodyDesc_t size should be 0x90");
	}
}
