// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#ifndef CUSTOM_GLOBAL_TYPES
	#include <SDK/GlobalTypes.hpp>
#else
	#include <Custom/GlobalTypes.hpp>
#endif







using namespace GlobalTypes;
namespace CS2 {
	namespace modellib {
		class RenderHairStrandInfo_t  {
		public:
			uint32_t m_nGuideHairIndices_nSurfaceTriIndex[2]; // 0x0 | Schema_FixedArray | Size: 0x8
			uint16_t m_vGuideBary_vBaseBary[4]; // 0x8 | Schema_FixedArray | Size: 0x8
			uint16_t m_vRootOffset_flLengthScale[4]; // 0x10 | Schema_FixedArray | Size: 0x8
			uint16_t m_nPackedBaseUv[2]; // 0x18 | Schema_FixedArray | Size: 0x4
			uint32_t m_nPackedSurfaceNormalOs; // 0x1c | Schema_Builtin | Size: 0x4
			uint32_t m_nPackedSurfaceTangentOs; // 0x20 | Schema_Builtin | Size: 0x4
			uint32_t m_nDataOffset_Segments; // 0x24 | Schema_Builtin | Size: 0x4
		};
		static_assert(offsetof(CS2::modellib::RenderHairStrandInfo_t, m_nGuideHairIndices_nSurfaceTriIndex) == 0x0, "m_nGuideHairIndices_nSurfaceTriIndex in RenderHairStrandInfo_t should be at offset 0x0");
		static_assert(offsetof(CS2::modellib::RenderHairStrandInfo_t, m_vGuideBary_vBaseBary) == 0x8, "m_vGuideBary_vBaseBary in RenderHairStrandInfo_t should be at offset 0x8");
		static_assert(offsetof(CS2::modellib::RenderHairStrandInfo_t, m_vRootOffset_flLengthScale) == 0x10, "m_vRootOffset_flLengthScale in RenderHairStrandInfo_t should be at offset 0x10");
		static_assert(offsetof(CS2::modellib::RenderHairStrandInfo_t, m_nPackedBaseUv) == 0x18, "m_nPackedBaseUv in RenderHairStrandInfo_t should be at offset 0x18");
		static_assert(offsetof(CS2::modellib::RenderHairStrandInfo_t, m_nPackedSurfaceNormalOs) == 0x1C, "m_nPackedSurfaceNormalOs in RenderHairStrandInfo_t should be at offset 0x1C");
		static_assert(offsetof(CS2::modellib::RenderHairStrandInfo_t, m_nPackedSurfaceTangentOs) == 0x20, "m_nPackedSurfaceTangentOs in RenderHairStrandInfo_t should be at offset 0x20");
		static_assert(offsetof(CS2::modellib::RenderHairStrandInfo_t, m_nDataOffset_Segments) == 0x24, "m_nDataOffset_Segments in RenderHairStrandInfo_t should be at offset 0x24");
		static_assert(sizeof(CS2::modellib::RenderHairStrandInfo_t) == 0x28, "RenderHairStrandInfo_t size should be 0x28");
	}
}
