// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#ifndef CUSTOM_GLOBAL_TYPES
	#include <SDK/GlobalTypes.hpp>
#else
	#include <Custom/GlobalTypes.hpp>
#endif


#include <SDK/modellib/CMaterialDrawDescriptor.hpp>
#include <SDK/modellib/VertexAlbedoFormat_t.hpp>





using namespace GlobalTypes;
namespace CS2 {
	namespace modellib {
		class RTProxyDrawDescriptor_t  {
		public:
			modellib::CMaterialDrawDescriptor m_drawDesc; // 0x0 | Schema_DeclaredClass | Size: 0x108
			GlobalTypes::matrix3x4_t m_mWorldFromLocal; // 0x108 | Schema_Atomic | Size: 0x30
			modellib::VertexAlbedoFormat_t m_nVertexAlbedoFormat; // 0x138 | Schema_DeclaredEnum | Size: 0x1
			int8_t m_nVertexAlbedoVB; // 0x139 | Schema_Builtin | Size: 0x1
			uint16_t m_nVertexAlbedoOffset; // 0x13a | Schema_Builtin | Size: 0x2
			uint16_t m_nVertexAlbedoStride; // 0x13c | Schema_Builtin | Size: 0x2
			S2_PAD(0x2); // End padding
		};
		static_assert(offsetof(CS2::modellib::RTProxyDrawDescriptor_t, m_drawDesc) == 0x0, "m_drawDesc in CSceneObjectData::RTProxyDrawDescriptor_t should be at offset 0x0");
		static_assert(offsetof(CS2::modellib::RTProxyDrawDescriptor_t, m_mWorldFromLocal) == 0x108, "m_mWorldFromLocal in CSceneObjectData::RTProxyDrawDescriptor_t should be at offset 0x108");
		static_assert(offsetof(CS2::modellib::RTProxyDrawDescriptor_t, m_nVertexAlbedoFormat) == 0x138, "m_nVertexAlbedoFormat in CSceneObjectData::RTProxyDrawDescriptor_t should be at offset 0x138");
		static_assert(offsetof(CS2::modellib::RTProxyDrawDescriptor_t, m_nVertexAlbedoVB) == 0x139, "m_nVertexAlbedoVB in CSceneObjectData::RTProxyDrawDescriptor_t should be at offset 0x139");
		static_assert(offsetof(CS2::modellib::RTProxyDrawDescriptor_t, m_nVertexAlbedoOffset) == 0x13A, "m_nVertexAlbedoOffset in CSceneObjectData::RTProxyDrawDescriptor_t should be at offset 0x13A");
		static_assert(offsetof(CS2::modellib::RTProxyDrawDescriptor_t, m_nVertexAlbedoStride) == 0x13C, "m_nVertexAlbedoStride in CSceneObjectData::RTProxyDrawDescriptor_t should be at offset 0x13C");
		static_assert(sizeof(CS2::modellib::RTProxyDrawDescriptor_t) == 0x140, "CSceneObjectData::RTProxyDrawDescriptor_t size should be 0x140");
	}
}
