// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#ifndef CUSTOM_GLOBAL_TYPES
	#include "../GlobalTypes.hpp"
#else
	#include "../Custom/GlobalTypes.hpp"
#endif


#include "CNmPoseNode_CDefinition.hpp"





using namespace GlobalTypes;
namespace CS2 {
	namespace animlib {
		class CNmBlend2DNode_CDefinition : public CS2::animlib::CNmPoseNode_CDefinition {
		public:
			// GlobalTypes::CUtlVectorFixedGrowable< int16, 5 > m_sourceNodeIndices; // 0x10 | Schema_Atomic | Size: 0x28
			char m_sourceNodeIndices[0x28]; // 0x10 | Schema_Atomic | Size: 0x28
			int16_t m_nInputParameterNodeIdx0; // 0x38 | Schema_Builtin | Size: 0x2
			int16_t m_nInputParameterNodeIdx1; // 0x3a | Schema_Builtin | Size: 0x2
			S2_PAD(0x4);
			// GlobalTypes::CUtlVectorFixedGrowable<GlobalTypes::Vector2D> m_values; // 0x40 | Schema_Atomic | Size: 0x68
			char m_values[0x68]; // 0x40 | Schema_Atomic | Size: 0x68
			// GlobalTypes::CUtlVectorFixedGrowable< uint8, 30 > m_indices; // 0xa8 | Schema_Atomic | Size: 0x38
			char m_indices[0x38]; // 0xa8 | Schema_Atomic | Size: 0x38
			// GlobalTypes::CUtlVectorFixedGrowable< uint8, 10 > m_hullIndices; // 0xe0 | Schema_Atomic | Size: 0x28
			char m_hullIndices[0x28]; // 0xe0 | Schema_Atomic | Size: 0x28
			bool m_bAllowLooping; // 0x108 | Schema_Builtin | Size: 0x1
			S2_PAD(0x7); // End padding
		};
		static_assert(offsetof(CS2::animlib::CNmBlend2DNode_CDefinition, m_sourceNodeIndices) == 0x10, "m_sourceNodeIndices in CNmBlend2DNode::CDefinition should be at offset 0x10");
		static_assert(offsetof(CS2::animlib::CNmBlend2DNode_CDefinition, m_nInputParameterNodeIdx0) == 0x38, "m_nInputParameterNodeIdx0 in CNmBlend2DNode::CDefinition should be at offset 0x38");
		static_assert(offsetof(CS2::animlib::CNmBlend2DNode_CDefinition, m_nInputParameterNodeIdx1) == 0x3A, "m_nInputParameterNodeIdx1 in CNmBlend2DNode::CDefinition should be at offset 0x3A");
		static_assert(offsetof(CS2::animlib::CNmBlend2DNode_CDefinition, m_values) == 0x40, "m_values in CNmBlend2DNode::CDefinition should be at offset 0x40");
		static_assert(offsetof(CS2::animlib::CNmBlend2DNode_CDefinition, m_indices) == 0xA8, "m_indices in CNmBlend2DNode::CDefinition should be at offset 0xA8");
		static_assert(offsetof(CS2::animlib::CNmBlend2DNode_CDefinition, m_hullIndices) == 0xE0, "m_hullIndices in CNmBlend2DNode::CDefinition should be at offset 0xE0");
		static_assert(offsetof(CS2::animlib::CNmBlend2DNode_CDefinition, m_bAllowLooping) == 0x108, "m_bAllowLooping in CNmBlend2DNode::CDefinition should be at offset 0x108");
		static_assert(sizeof(CS2::animlib::CNmBlend2DNode_CDefinition) == 0x110, "CNmBlend2DNode::CDefinition size should be 0x110");
	}
}
