// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#ifndef CUSTOM_GLOBAL_TYPES
	#include "../GlobalTypes.hpp"
#else
	#include "../Custom/GlobalTypes.hpp"
#endif


#include "CNmBoneMaskValueNode_CDefinition.hpp"





using namespace GlobalTypes;
namespace CS2 {
	namespace animlib {
		class CNmBoneMaskSelectorNode_CDefinition : public CS2::animlib::CNmBoneMaskValueNode_CDefinition {
		public:
			int16_t m_defaultMaskNodeIdx; // 0x10 | Schema_Builtin | Size: 0x2
			int16_t m_parameterValueNodeIdx; // 0x12 | Schema_Builtin | Size: 0x2
			bool m_bSwitchDynamically; // 0x14 | Schema_Builtin | Size: 0x1
			S2_PAD(0x3);
			// GlobalTypes::CUtlVectorFixedGrowable< int16, 7 > m_maskNodeIndices; // 0x18 | Schema_Atomic | Size: 0x28
			char m_maskNodeIndices[0x28]; // 0x18 | Schema_Atomic | Size: 0x28
			// GlobalTypes::CUtlVectorFixedGrowable<GlobalTypes::CGlobalSymbol> m_parameterValues; // 0x40 | Schema_Atomic | Size: 0x50
			char m_parameterValues[0x50]; // 0x40 | Schema_Atomic | Size: 0x50
			float32 m_flBlendTimeSeconds; // 0x90 | Schema_Builtin | Size: 0x4
			S2_PAD(0x4); // End padding
		};
		static_assert(offsetof(CS2::animlib::CNmBoneMaskSelectorNode_CDefinition, m_defaultMaskNodeIdx) == 0x10, "m_defaultMaskNodeIdx in CNmBoneMaskSelectorNode::CDefinition should be at offset 0x10");
		static_assert(offsetof(CS2::animlib::CNmBoneMaskSelectorNode_CDefinition, m_parameterValueNodeIdx) == 0x12, "m_parameterValueNodeIdx in CNmBoneMaskSelectorNode::CDefinition should be at offset 0x12");
		static_assert(offsetof(CS2::animlib::CNmBoneMaskSelectorNode_CDefinition, m_bSwitchDynamically) == 0x14, "m_bSwitchDynamically in CNmBoneMaskSelectorNode::CDefinition should be at offset 0x14");
		static_assert(offsetof(CS2::animlib::CNmBoneMaskSelectorNode_CDefinition, m_maskNodeIndices) == 0x18, "m_maskNodeIndices in CNmBoneMaskSelectorNode::CDefinition should be at offset 0x18");
		static_assert(offsetof(CS2::animlib::CNmBoneMaskSelectorNode_CDefinition, m_parameterValues) == 0x40, "m_parameterValues in CNmBoneMaskSelectorNode::CDefinition should be at offset 0x40");
		static_assert(offsetof(CS2::animlib::CNmBoneMaskSelectorNode_CDefinition, m_flBlendTimeSeconds) == 0x90, "m_flBlendTimeSeconds in CNmBoneMaskSelectorNode::CDefinition should be at offset 0x90");
		static_assert(sizeof(CS2::animlib::CNmBoneMaskSelectorNode_CDefinition) == 0x98, "CNmBoneMaskSelectorNode::CDefinition size should be 0x98");
	}
}
