// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#ifndef CUSTOM_GLOBAL_TYPES
	#include "../GlobalTypes.hpp"
#else
	#include "../Custom/GlobalTypes.hpp"
#endif


#include "CNmBoneMaskValueNode_CDefinition.hpp"





using namespace GlobalTypes;
namespace CS2 {
	namespace animlib {
		class CNmBoneMaskSwitchNode_CDefinition : public CS2::animlib::CNmBoneMaskValueNode_CDefinition {
		public:
			int16_t m_nSwitchValueNodeIdx; // 0x10 | Schema_Builtin | Size: 0x2
			int16_t m_nTrueValueNodeIdx; // 0x12 | Schema_Builtin | Size: 0x2
			int16_t m_nFalseValueNodeIdx; // 0x14 | Schema_Builtin | Size: 0x2
			S2_PAD(0x2);
			float32 m_flBlendTimeSeconds; // 0x18 | Schema_Builtin | Size: 0x4
			bool m_bSwitchDynamically; // 0x1c | Schema_Builtin | Size: 0x1
			S2_PAD(0x3); // End padding
		};
		static_assert(offsetof(CS2::animlib::CNmBoneMaskSwitchNode_CDefinition, m_nSwitchValueNodeIdx) == 0x10, "m_nSwitchValueNodeIdx in CNmBoneMaskSwitchNode::CDefinition should be at offset 0x10");
		static_assert(offsetof(CS2::animlib::CNmBoneMaskSwitchNode_CDefinition, m_nTrueValueNodeIdx) == 0x12, "m_nTrueValueNodeIdx in CNmBoneMaskSwitchNode::CDefinition should be at offset 0x12");
		static_assert(offsetof(CS2::animlib::CNmBoneMaskSwitchNode_CDefinition, m_nFalseValueNodeIdx) == 0x14, "m_nFalseValueNodeIdx in CNmBoneMaskSwitchNode::CDefinition should be at offset 0x14");
		static_assert(offsetof(CS2::animlib::CNmBoneMaskSwitchNode_CDefinition, m_flBlendTimeSeconds) == 0x18, "m_flBlendTimeSeconds in CNmBoneMaskSwitchNode::CDefinition should be at offset 0x18");
		static_assert(offsetof(CS2::animlib::CNmBoneMaskSwitchNode_CDefinition, m_bSwitchDynamically) == 0x1C, "m_bSwitchDynamically in CNmBoneMaskSwitchNode::CDefinition should be at offset 0x1C");
		static_assert(sizeof(CS2::animlib::CNmBoneMaskSwitchNode_CDefinition) == 0x20, "CNmBoneMaskSwitchNode::CDefinition size should be 0x20");
	}
}
