// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#ifndef CUSTOM_GLOBAL_TYPES
	#include "../GlobalTypes.hpp"
#else
	#include "../Custom/GlobalTypes.hpp"
#endif


#include "CNmPassthroughNode_CDefinition.hpp"





using namespace GlobalTypes;
namespace CS2 {
	namespace animlib {
		class CNmChainLookatNode_CDefinition : public CS2::animlib::CNmPassthroughNode_CDefinition {
		public:
			GlobalTypes::CGlobalSymbol m_chainEndBoneID; // 0x18 | Schema_Atomic | Size: 0x8
			int16_t m_nLookatTargetNodeIdx; // 0x20 | Schema_Builtin | Size: 0x2
			int16_t m_nEnabledNodeIdx; // 0x22 | Schema_Builtin | Size: 0x2
			float32 m_flBlendTimeSeconds; // 0x24 | Schema_Builtin | Size: 0x4
			uint8_t m_nChainLength; // 0x28 | Schema_Builtin | Size: 0x1
			bool m_bIsTargetInWorldSpace; // 0x29 | Schema_Builtin | Size: 0x1
			S2_PAD(0x2);
			GlobalTypes::Vector m_chainForwardDir; // 0x2c | Schema_Atomic | Size: 0xc
		};
		static_assert(offsetof(CS2::animlib::CNmChainLookatNode_CDefinition, m_chainEndBoneID) == 0x18, "m_chainEndBoneID in CNmChainLookatNode::CDefinition should be at offset 0x18");
		static_assert(offsetof(CS2::animlib::CNmChainLookatNode_CDefinition, m_nLookatTargetNodeIdx) == 0x20, "m_nLookatTargetNodeIdx in CNmChainLookatNode::CDefinition should be at offset 0x20");
		static_assert(offsetof(CS2::animlib::CNmChainLookatNode_CDefinition, m_nEnabledNodeIdx) == 0x22, "m_nEnabledNodeIdx in CNmChainLookatNode::CDefinition should be at offset 0x22");
		static_assert(offsetof(CS2::animlib::CNmChainLookatNode_CDefinition, m_flBlendTimeSeconds) == 0x24, "m_flBlendTimeSeconds in CNmChainLookatNode::CDefinition should be at offset 0x24");
		static_assert(offsetof(CS2::animlib::CNmChainLookatNode_CDefinition, m_nChainLength) == 0x28, "m_nChainLength in CNmChainLookatNode::CDefinition should be at offset 0x28");
		static_assert(offsetof(CS2::animlib::CNmChainLookatNode_CDefinition, m_bIsTargetInWorldSpace) == 0x29, "m_bIsTargetInWorldSpace in CNmChainLookatNode::CDefinition should be at offset 0x29");
		static_assert(offsetof(CS2::animlib::CNmChainLookatNode_CDefinition, m_chainForwardDir) == 0x2C, "m_chainForwardDir in CNmChainLookatNode::CDefinition should be at offset 0x2C");
		static_assert(sizeof(CS2::animlib::CNmChainLookatNode_CDefinition) == 0x38, "CNmChainLookatNode::CDefinition size should be 0x38");
	}
}
