// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#ifndef CUSTOM_GLOBAL_TYPES
	#include "../GlobalTypes.hpp"
#else
	#include "../Custom/GlobalTypes.hpp"
#endif


#include "CNmClipReferenceNode_CDefinition.hpp"





using namespace GlobalTypes;
namespace CS2 {
	namespace animlib {
		class CNmClipNode_CDefinition : public CS2::animlib::CNmClipReferenceNode_CDefinition {
		public:
			int16_t m_nPlayInReverseValueNodeIdx; // 0x10 | Schema_Builtin | Size: 0x2
			int16_t m_nResetTimeValueNodeIdx; // 0x12 | Schema_Builtin | Size: 0x2
			bool m_bSampleRootMotion; // 0x14 | Schema_Builtin | Size: 0x1
			bool m_bAllowLooping; // 0x15 | Schema_Builtin | Size: 0x1
			int16_t m_nDataSlotIdx; // 0x16 | Schema_Builtin | Size: 0x2
			// GlobalTypes::CUtlVectorFixedGrowable<GlobalTypes::CGlobalSymbol> m_graphEvents; // 0x18 | Schema_Atomic | Size: 0x28
			char m_graphEvents[0x28]; // 0x18 | Schema_Atomic | Size: 0x28
			float32 m_flSpeedMultiplier; // 0x40 | Schema_Builtin | Size: 0x4
			int32_t m_nStartSyncEventOffset; // 0x44 | Schema_Builtin | Size: 0x4
		};
#ifdef USE_STATIC_ASSERTS
		static_assert(offsetof(CS2::animlib::CNmClipNode_CDefinition, m_nPlayInReverseValueNodeIdx) == 0x10, "m_nPlayInReverseValueNodeIdx in CNmClipNode::CDefinition should be at offset 0x10");
		static_assert(offsetof(CS2::animlib::CNmClipNode_CDefinition, m_nResetTimeValueNodeIdx) == 0x12, "m_nResetTimeValueNodeIdx in CNmClipNode::CDefinition should be at offset 0x12");
		static_assert(offsetof(CS2::animlib::CNmClipNode_CDefinition, m_bSampleRootMotion) == 0x14, "m_bSampleRootMotion in CNmClipNode::CDefinition should be at offset 0x14");
		static_assert(offsetof(CS2::animlib::CNmClipNode_CDefinition, m_bAllowLooping) == 0x15, "m_bAllowLooping in CNmClipNode::CDefinition should be at offset 0x15");
		static_assert(offsetof(CS2::animlib::CNmClipNode_CDefinition, m_nDataSlotIdx) == 0x16, "m_nDataSlotIdx in CNmClipNode::CDefinition should be at offset 0x16");
		static_assert(offsetof(CS2::animlib::CNmClipNode_CDefinition, m_graphEvents) == 0x18, "m_graphEvents in CNmClipNode::CDefinition should be at offset 0x18");
		static_assert(offsetof(CS2::animlib::CNmClipNode_CDefinition, m_flSpeedMultiplier) == 0x40, "m_flSpeedMultiplier in CNmClipNode::CDefinition should be at offset 0x40");
		static_assert(offsetof(CS2::animlib::CNmClipNode_CDefinition, m_nStartSyncEventOffset) == 0x44, "m_nStartSyncEventOffset in CNmClipNode::CDefinition should be at offset 0x44");
		static_assert(sizeof(CS2::animlib::CNmClipNode_CDefinition) == 0x48, "CNmClipNode::CDefinition size should be 0x48");

#endif
	}
}
