// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#include <SDK/GlobalTypes.hpp>

#include <SDK/animlib/CNmSyncTrack.hpp>
#include <SDK/animlib/CNmRootMotionData.hpp>



namespace CS2 {
	namespace animlib {
		class CNmClip  {
		public:
			public:
			// GlobalTypes::CStrongHandle< resourcesystem::InfoForResourceTypeCNmSkeleton > m_skeleton; // 0x0 | Schema_Atomic | Size: 0x8
			char  m_skeleton[0x8]; // 0x0 | Schema_Atomic | Size: 0x8
			uint32_t m_nNumFrames; // 0x8 | Schema_Builtin | Size: 0x4
			float32 m_flDuration; // 0xc | Schema_Builtin | Size: 0x4
			GlobalTypes::CUtlBinaryBlock m_compressedPoseData; // 0x10 | Schema_Atomic | Size: 0x10
			// GlobalTypes::CUtlVector< animlib::NmCompressionSettings_t > m_trackCompressionSettings; // 0x20 | Schema_Atomic | Size: 0x18
			char  m_trackCompressionSettings[0x18]; // 0x20 | Schema_Atomic | Size: 0x18
			// GlobalTypes::CUtlVector< uint32 > m_compressedPoseOffsets; // 0x38 | Schema_Atomic | Size: 0x18
			char  m_compressedPoseOffsets[0x18]; // 0x38 | Schema_Atomic | Size: 0x18
			S2_PAD(0x28);
			// GlobalTypes::CUtlVectorFixedGrowable< CNmClip, 1 >* m_secondaryAnimations; // 0x78 | Schema_Atomic | Size: 0x20
			char  m_secondaryAnimations[0x20]; // 0x78 | Schema_Atomic | Size: 0x20
			animlib::CNmSyncTrack m_syncTrack; // 0x98 | Schema_DeclaredClass | Size: 0xb0
			S2_PAD(0x8);
			animlib::CNmRootMotionData m_rootMotion; // 0x150 | Schema_DeclaredClass | Size: 0x50
			bool m_bIsAdditive; // 0x1a0 | Schema_Builtin | Size: 0x1
			S2_PAD(0x7);
			// GlobalTypes::ModelSpaceSamplingChainLink_t > m_modelSpaceSamplingChain; // 0x1a8 | Schema_Atomic | Size: 0x18
			char  m_modelSpaceSamplingChain[0x18]; // 0x1a8 | Schema_Atomic | Size: 0x18
			// GlobalTypes::CUtlVector< int32 > m_modelSpaceBoneSamplingIndices; // 0x1c0 | Schema_Atomic | Size: 0x18
			char  m_modelSpaceBoneSamplingIndices[0x18]; // 0x1c0 | Schema_Atomic | Size: 0x18
			S2_PAD(0x8); // End padding
		};
		static_assert(offsetof(CS2::animlib::CNmClip, m_skeleton) == 0x0, "m_skeleton in CNmClip should be at offset 0x0");
		static_assert(offsetof(CS2::animlib::CNmClip, m_nNumFrames) == 0x8, "m_nNumFrames in CNmClip should be at offset 0x8");
		static_assert(offsetof(CS2::animlib::CNmClip, m_flDuration) == 0xC, "m_flDuration in CNmClip should be at offset 0xC");
		static_assert(offsetof(CS2::animlib::CNmClip, m_compressedPoseData) == 0x10, "m_compressedPoseData in CNmClip should be at offset 0x10");
		static_assert(offsetof(CS2::animlib::CNmClip, m_trackCompressionSettings) == 0x20, "m_trackCompressionSettings in CNmClip should be at offset 0x20");
		static_assert(offsetof(CS2::animlib::CNmClip, m_compressedPoseOffsets) == 0x38, "m_compressedPoseOffsets in CNmClip should be at offset 0x38");
		static_assert(offsetof(CS2::animlib::CNmClip, m_secondaryAnimations) == 0x78, "m_secondaryAnimations in CNmClip should be at offset 0x78");
		static_assert(offsetof(CS2::animlib::CNmClip, m_syncTrack) == 0x98, "m_syncTrack in CNmClip should be at offset 0x98");
		static_assert(offsetof(CS2::animlib::CNmClip, m_rootMotion) == 0x150, "m_rootMotion in CNmClip should be at offset 0x150");
		static_assert(offsetof(CS2::animlib::CNmClip, m_bIsAdditive) == 0x1A0, "m_bIsAdditive in CNmClip should be at offset 0x1A0");
		static_assert(offsetof(CS2::animlib::CNmClip, m_modelSpaceSamplingChain) == 0x1A8, "m_modelSpaceSamplingChain in CNmClip should be at offset 0x1A8");
		static_assert(offsetof(CS2::animlib::CNmClip, m_modelSpaceBoneSamplingIndices) == 0x1C0, "m_modelSpaceBoneSamplingIndices in CNmClip should be at offset 0x1C0");
		static_assert(sizeof(CS2::animlib::CNmClip) == 0x1E0, "CNmClip size should be 0x1E0");
	}
}
