// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#ifndef CUSTOM_GLOBAL_TYPES
	#include "../GlobalTypes.hpp"
#else
	#include "../Custom/GlobalTypes.hpp"
#endif


#include "NmPercent_t.hpp"





using namespace GlobalTypes;
namespace CS2 {
	namespace animlib {
		class CNmEvent  {
		public:
			S2_PAD(0x8);
			animlib::NmPercent_t m_flStartTime; // 0x8 | Schema_DeclaredClass | Size: 0x4
			animlib::NmPercent_t m_flDuration; // 0xc | Schema_DeclaredClass | Size: 0x4
			GlobalTypes::CGlobalSymbol m_syncID; // 0x10 | Schema_Atomic | Size: 0x8
			bool m_bClientOnly; // 0x18 | Schema_Builtin | Size: 0x1
			S2_PAD(0x7); // End padding
		};
#ifdef USE_STATIC_ASSERTS
		static_assert(offsetof(CS2::animlib::CNmEvent, m_flStartTime) == 0x8, "m_flStartTime in CNmEvent should be at offset 0x8");
		static_assert(offsetof(CS2::animlib::CNmEvent, m_flDuration) == 0xC, "m_flDuration in CNmEvent should be at offset 0xC");
		static_assert(offsetof(CS2::animlib::CNmEvent, m_syncID) == 0x10, "m_syncID in CNmEvent should be at offset 0x10");
		static_assert(offsetof(CS2::animlib::CNmEvent, m_bClientOnly) == 0x18, "m_bClientOnly in CNmEvent should be at offset 0x18");
		static_assert(sizeof(CS2::animlib::CNmEvent) == 0x20, "CNmEvent size should be 0x20");

#endif
	}
}
