// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#ifndef CUSTOM_GLOBAL_TYPES
	#include "../GlobalTypes.hpp"
#else
	#include "../Custom/GlobalTypes.hpp"
#endif


#include "CNmFloatValueNode_CDefinition.hpp"
#include "CNmFloatMathNode_Operator_t.hpp"





using namespace GlobalTypes;
namespace CS2 {
	namespace animlib {
		class CNmFloatMathNode_CDefinition : public CS2::animlib::CNmFloatValueNode_CDefinition {
		public:
			int16_t m_nInputValueNodeIdxA; // 0x10 | Schema_Builtin | Size: 0x2
			int16_t m_nInputValueNodeIdxB; // 0x12 | Schema_Builtin | Size: 0x2
			bool m_bReturnAbsoluteResult; // 0x14 | Schema_Builtin | Size: 0x1
			bool m_bReturnNegatedResult; // 0x15 | Schema_Builtin | Size: 0x1
			animlib::CNmFloatMathNode_Operator_t m_operator; // 0x16 | Schema_DeclaredEnum | Size: 0x1
			S2_PAD(0x1);
			float32 m_flValueB; // 0x18 | Schema_Builtin | Size: 0x4
			S2_PAD(0x4); // End padding
		};
		static_assert(offsetof(CS2::animlib::CNmFloatMathNode_CDefinition, m_nInputValueNodeIdxA) == 0x10, "m_nInputValueNodeIdxA in CNmFloatMathNode::CDefinition should be at offset 0x10");
		static_assert(offsetof(CS2::animlib::CNmFloatMathNode_CDefinition, m_nInputValueNodeIdxB) == 0x12, "m_nInputValueNodeIdxB in CNmFloatMathNode::CDefinition should be at offset 0x12");
		static_assert(offsetof(CS2::animlib::CNmFloatMathNode_CDefinition, m_bReturnAbsoluteResult) == 0x14, "m_bReturnAbsoluteResult in CNmFloatMathNode::CDefinition should be at offset 0x14");
		static_assert(offsetof(CS2::animlib::CNmFloatMathNode_CDefinition, m_bReturnNegatedResult) == 0x15, "m_bReturnNegatedResult in CNmFloatMathNode::CDefinition should be at offset 0x15");
		static_assert(offsetof(CS2::animlib::CNmFloatMathNode_CDefinition, m_operator) == 0x16, "m_operator in CNmFloatMathNode::CDefinition should be at offset 0x16");
		static_assert(offsetof(CS2::animlib::CNmFloatMathNode_CDefinition, m_flValueB) == 0x18, "m_flValueB in CNmFloatMathNode::CDefinition should be at offset 0x18");
		static_assert(sizeof(CS2::animlib::CNmFloatMathNode_CDefinition) == 0x20, "CNmFloatMathNode::CDefinition size should be 0x20");
	}
}
