// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#ifndef CUSTOM_GLOBAL_TYPES
	#include "../GlobalTypes.hpp"
#else
	#include "../Custom/GlobalTypes.hpp"
#endif


#include "CNmPassthroughNode_CDefinition.hpp"
#include "NmFollowBoneMode_t.hpp"





using namespace GlobalTypes;
namespace CS2 {
	namespace animlib {
		class CNmFollowBoneNode_CDefinition : public CS2::animlib::CNmPassthroughNode_CDefinition {
		public:
			GlobalTypes::CGlobalSymbol m_bone; // 0x18 | Schema_Atomic | Size: 0x8
			GlobalTypes::CGlobalSymbol m_followTargetBone; // 0x20 | Schema_Atomic | Size: 0x8
			int16_t m_nEnabledNodeIdx; // 0x28 | Schema_Builtin | Size: 0x2
			animlib::NmFollowBoneMode_t m_mode; // 0x2a | Schema_DeclaredEnum | Size: 0x1
			S2_PAD(0x5); // End padding
		};
		static_assert(offsetof(CS2::animlib::CNmFollowBoneNode_CDefinition, m_bone) == 0x18, "m_bone in CNmFollowBoneNode::CDefinition should be at offset 0x18");
		static_assert(offsetof(CS2::animlib::CNmFollowBoneNode_CDefinition, m_followTargetBone) == 0x20, "m_followTargetBone in CNmFollowBoneNode::CDefinition should be at offset 0x20");
		static_assert(offsetof(CS2::animlib::CNmFollowBoneNode_CDefinition, m_nEnabledNodeIdx) == 0x28, "m_nEnabledNodeIdx in CNmFollowBoneNode::CDefinition should be at offset 0x28");
		static_assert(offsetof(CS2::animlib::CNmFollowBoneNode_CDefinition, m_mode) == 0x2A, "m_mode in CNmFollowBoneNode::CDefinition should be at offset 0x2A");
		static_assert(sizeof(CS2::animlib::CNmFollowBoneNode_CDefinition) == 0x30, "CNmFollowBoneNode::CDefinition size should be 0x30");
	}
}
