// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#ifndef CUSTOM_GLOBAL_TYPES
	#include "../GlobalTypes.hpp"
#else
	#include <Custom/GlobalTypes.hpp>
#endif


#include "CNmFloatValueNode_CDefinition.hpp"
#include "NmEasingOperation_t.hpp"





using namespace GlobalTypes;
namespace CS2 {
	namespace animlib {
		class CNmFloatSelectorNode_CDefinition : public CS2::animlib::CNmFloatValueNode_CDefinition {
		public:
			// GlobalTypes::CUtlVectorFixedGrowable< int16, 5 > m_conditionNodeIndices; // 0x10 | Schema_Atomic | Size: 0x28
			char m_conditionNodeIndices[0x28]; // 0x10 | Schema_Atomic | Size: 0x28
			// GlobalTypes::CUtlVectorFixedGrowable< float32, 5 > m_values; // 0x38 | Schema_Atomic | Size: 0x30
			char m_values[0x30]; // 0x38 | Schema_Atomic | Size: 0x30
			float32 m_flDefaultValue; // 0x68 | Schema_Builtin | Size: 0x4
			float32 m_flEaseTime; // 0x6c | Schema_Builtin | Size: 0x4
			animlib::NmEasingOperation_t m_easingOp; // 0x70 | Schema_DeclaredEnum | Size: 0x1
			S2_PAD(0x7); // End padding
		};
#ifdef USE_STATIC_ASSERTS
		static_assert(offsetof(CS2::animlib::CNmFloatSelectorNode_CDefinition, m_conditionNodeIndices) == 0x10, "m_conditionNodeIndices in CNmFloatSelectorNode::CDefinition should be at offset 0x10");
		static_assert(offsetof(CS2::animlib::CNmFloatSelectorNode_CDefinition, m_values) == 0x38, "m_values in CNmFloatSelectorNode::CDefinition should be at offset 0x38");
		static_assert(offsetof(CS2::animlib::CNmFloatSelectorNode_CDefinition, m_flDefaultValue) == 0x68, "m_flDefaultValue in CNmFloatSelectorNode::CDefinition should be at offset 0x68");
		static_assert(offsetof(CS2::animlib::CNmFloatSelectorNode_CDefinition, m_flEaseTime) == 0x6C, "m_flEaseTime in CNmFloatSelectorNode::CDefinition should be at offset 0x6C");
		static_assert(offsetof(CS2::animlib::CNmFloatSelectorNode_CDefinition, m_easingOp) == 0x70, "m_easingOp in CNmFloatSelectorNode::CDefinition should be at offset 0x70");
		static_assert(sizeof(CS2::animlib::CNmFloatSelectorNode_CDefinition) == 0x78, "CNmFloatSelectorNode::CDefinition size should be 0x78");

#endif
	}
}
