// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#ifndef CUSTOM_GLOBAL_TYPES
	#include "../GlobalTypes.hpp"
#else
	#include "../Custom/GlobalTypes.hpp"
#endif


#include "CNmBoolValueNode_CDefinition.hpp"
#include "CNmFloatComparisonNode_Comparison_t.hpp"





using namespace GlobalTypes;
namespace CS2 {
	namespace animlib {
		class CNmFloatComparisonNode_CDefinition : public CS2::animlib::CNmBoolValueNode_CDefinition {
		public:
			int16_t m_nInputValueNodeIdx; // 0x10 | Schema_Builtin | Size: 0x2
			int16_t m_nComparandValueNodeIdx; // 0x12 | Schema_Builtin | Size: 0x2
			animlib::CNmFloatComparisonNode_Comparison_t m_comparison; // 0x14 | Schema_DeclaredEnum | Size: 0x1
			S2_PAD(0x3);
			float32 m_flEpsilon; // 0x18 | Schema_Builtin | Size: 0x4
			float32 m_flComparisonValue; // 0x1c | Schema_Builtin | Size: 0x4
		};
		static_assert(offsetof(CS2::animlib::CNmFloatComparisonNode_CDefinition, m_nInputValueNodeIdx) == 0x10, "m_nInputValueNodeIdx in CNmFloatComparisonNode::CDefinition should be at offset 0x10");
		static_assert(offsetof(CS2::animlib::CNmFloatComparisonNode_CDefinition, m_nComparandValueNodeIdx) == 0x12, "m_nComparandValueNodeIdx in CNmFloatComparisonNode::CDefinition should be at offset 0x12");
		static_assert(offsetof(CS2::animlib::CNmFloatComparisonNode_CDefinition, m_comparison) == 0x14, "m_comparison in CNmFloatComparisonNode::CDefinition should be at offset 0x14");
		static_assert(offsetof(CS2::animlib::CNmFloatComparisonNode_CDefinition, m_flEpsilon) == 0x18, "m_flEpsilon in CNmFloatComparisonNode::CDefinition should be at offset 0x18");
		static_assert(offsetof(CS2::animlib::CNmFloatComparisonNode_CDefinition, m_flComparisonValue) == 0x1C, "m_flComparisonValue in CNmFloatComparisonNode::CDefinition should be at offset 0x1C");
		static_assert(sizeof(CS2::animlib::CNmFloatComparisonNode_CDefinition) == 0x20, "CNmFloatComparisonNode::CDefinition size should be 0x20");
	}
}
