// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#ifndef CUSTOM_GLOBAL_TYPES
	#include "../GlobalTypes.hpp"
#else
	#include "../Custom/GlobalTypes.hpp"
#endif


#include "CNmFloatValueNode_CDefinition.hpp"
#include "CNmBitFlags.hpp"





using namespace GlobalTypes;
namespace CS2 {
	namespace animlib {
		class CNmFloatCurveEventNode_CDefinition : public CS2::animlib::CNmFloatValueNode_CDefinition {
		public:
			GlobalTypes::CGlobalSymbol m_eventID; // 0x10 | Schema_Atomic | Size: 0x8
			int16_t m_nDefaultNodeIdx; // 0x18 | Schema_Builtin | Size: 0x2
			S2_PAD(0x2);
			float32 m_flDefaultValue; // 0x1c | Schema_Builtin | Size: 0x4
			animlib::CNmBitFlags m_eventConditionRules; // 0x20 | Schema_DeclaredClass | Size: 0x4
			S2_PAD(0x4); // End padding
		};
		static_assert(offsetof(CS2::animlib::CNmFloatCurveEventNode_CDefinition, m_eventID) == 0x10, "m_eventID in CNmFloatCurveEventNode::CDefinition should be at offset 0x10");
		static_assert(offsetof(CS2::animlib::CNmFloatCurveEventNode_CDefinition, m_nDefaultNodeIdx) == 0x18, "m_nDefaultNodeIdx in CNmFloatCurveEventNode::CDefinition should be at offset 0x18");
		static_assert(offsetof(CS2::animlib::CNmFloatCurveEventNode_CDefinition, m_flDefaultValue) == 0x1C, "m_flDefaultValue in CNmFloatCurveEventNode::CDefinition should be at offset 0x1C");
		static_assert(offsetof(CS2::animlib::CNmFloatCurveEventNode_CDefinition, m_eventConditionRules) == 0x20, "m_eventConditionRules in CNmFloatCurveEventNode::CDefinition should be at offset 0x20");
		static_assert(sizeof(CS2::animlib::CNmFloatCurveEventNode_CDefinition) == 0x28, "CNmFloatCurveEventNode::CDefinition size should be 0x28");
	}
}
