// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#ifndef CUSTOM_GLOBAL_TYPES
	#include "../GlobalTypes.hpp"
#else
	#include "../Custom/GlobalTypes.hpp"
#endif


#include "CNmFloatValueNode_CDefinition.hpp"
#include "NmEasingOperation_t.hpp"





using namespace GlobalTypes;
namespace CS2 {
	namespace animlib {
		class CNmFloatEaseNode_CDefinition : public CS2::animlib::CNmFloatValueNode_CDefinition {
		public:
			float32 m_flEaseTime; // 0x10 | Schema_Builtin | Size: 0x4
			float32 m_flStartValue; // 0x14 | Schema_Builtin | Size: 0x4
			int16_t m_nInputValueNodeIdx; // 0x18 | Schema_Builtin | Size: 0x2
			animlib::NmEasingOperation_t m_easingOp; // 0x1a | Schema_DeclaredEnum | Size: 0x1
			bool m_bUseStartValue; // 0x1b | Schema_Builtin | Size: 0x1
			S2_PAD(0x4); // End padding
		};
#ifdef USE_STATIC_ASSERTS
		static_assert(offsetof(CS2::animlib::CNmFloatEaseNode_CDefinition, m_flEaseTime) == 0x10, "m_flEaseTime in CNmFloatEaseNode::CDefinition should be at offset 0x10");
		static_assert(offsetof(CS2::animlib::CNmFloatEaseNode_CDefinition, m_flStartValue) == 0x14, "m_flStartValue in CNmFloatEaseNode::CDefinition should be at offset 0x14");
		static_assert(offsetof(CS2::animlib::CNmFloatEaseNode_CDefinition, m_nInputValueNodeIdx) == 0x18, "m_nInputValueNodeIdx in CNmFloatEaseNode::CDefinition should be at offset 0x18");
		static_assert(offsetof(CS2::animlib::CNmFloatEaseNode_CDefinition, m_easingOp) == 0x1A, "m_easingOp in CNmFloatEaseNode::CDefinition should be at offset 0x1A");
		static_assert(offsetof(CS2::animlib::CNmFloatEaseNode_CDefinition, m_bUseStartValue) == 0x1B, "m_bUseStartValue in CNmFloatEaseNode::CDefinition should be at offset 0x1B");
		static_assert(sizeof(CS2::animlib::CNmFloatEaseNode_CDefinition) == 0x20, "CNmFloatEaseNode::CDefinition size should be 0x20");

#endif
	}
}
