// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#ifndef CUSTOM_GLOBAL_TYPES
	#include "../GlobalTypes.hpp"
#else
	#include "../Custom/GlobalTypes.hpp"
#endif


#include "CNmGraphDefinition_ReferencedGraphSlot_t.hpp"
#include "CNmGraphDefinition_ExternalGraphSlot_t.hpp"
#include "CNmGraphDefinition_ExternalPoseSlot_t.hpp"



namespace CS2 {
	namespace animlib {
		class CNmGraphVariationUserData;
	}
}


using namespace GlobalTypes;
namespace CS2 {
	namespace animlib {
		class CNmGraphDefinition  {
		public:
			GlobalTypes::CGlobalSymbol m_variationID; // 0x0 | Schema_Atomic | Size: 0x8
			// GlobalTypes::CStrongHandle<resourcesystem::InfoForResourceTypeCNmSkeleton> m_skeleton; // 0x8 | Schema_Atomic | Size: 0x8
			char m_skeleton[0x8]; // 0x8 | Schema_Atomic | Size: 0x8
			animlib::CNmGraphVariationUserData* m_pUserData; // 0x10 | Schema_Ptr | Size: 0x8
			GlobalTypes::CUtlVector< int16 > m_persistentNodeIndices; // 0x18 | Schema_Atomic | Size: 0x18
			// char m_persistentNodeIndices[0x18]; // 0x18 | Schema_Atomic | Size: 0x18
			int16_t m_nRootNodeIdx; // 0x30 | Schema_Builtin | Size: 0x2
			S2_PAD(0x6);
			GlobalTypes::CUtlVector<GlobalTypes::CGlobalSymbol> m_controlParameterIDs; // 0x38 | Schema_Atomic | Size: 0x18
			// char m_controlParameterIDs[0x18]; // 0x38 | Schema_Atomic | Size: 0x18
			GlobalTypes::CUtlVector<GlobalTypes::CGlobalSymbol> m_virtualParameterIDs; // 0x50 | Schema_Atomic | Size: 0x18
			// char m_virtualParameterIDs[0x18]; // 0x50 | Schema_Atomic | Size: 0x18
			GlobalTypes::CUtlVector< int16 > m_virtualParameterNodeIndices; // 0x68 | Schema_Atomic | Size: 0x18
			// char m_virtualParameterNodeIndices[0x18]; // 0x68 | Schema_Atomic | Size: 0x18
			GlobalTypes::CUtlVector<animlib::CNmGraphDefinition_ReferencedGraphSlot_t> m_referencedGraphSlots; // 0x80 | Schema_Atomic | Size: 0x18
			// char m_referencedGraphSlots[0x18]; // 0x80 | Schema_Atomic | Size: 0x18
			GlobalTypes::CUtlVector<animlib::CNmGraphDefinition_ExternalGraphSlot_t> m_externalGraphSlots; // 0x98 | Schema_Atomic | Size: 0x18
			// char m_externalGraphSlots[0x18]; // 0x98 | Schema_Atomic | Size: 0x18
			GlobalTypes::CUtlVector<animlib::CNmGraphDefinition_ExternalPoseSlot_t> m_externalPoseSlots; // 0xb0 | Schema_Atomic | Size: 0x18
			// char m_externalPoseSlots[0x18]; // 0xb0 | Schema_Atomic | Size: 0x18
			S2_PAD(0x70);
			GlobalTypes::CUtlVector<GlobalTypes::CUtlString> m_nodePaths; // 0x138 | Schema_Atomic | Size: 0x18
			// char m_nodePaths[0x18]; // 0x138 | Schema_Atomic | Size: 0x18
			GlobalTypes::CUtlVector<GlobalTypes::CStrongHandleVoid> m_resources; // 0x150 | Schema_Atomic | Size: 0x18
			// char m_resources[0x18]; // 0x150 | Schema_Atomic | Size: 0x18
			S2_PAD(0x38); // End padding
		};
#ifdef USE_STATIC_ASSERTS
		static_assert(offsetof(CS2::animlib::CNmGraphDefinition, m_variationID) == 0x0, "m_variationID in CNmGraphDefinition should be at offset 0x0");
		static_assert(offsetof(CS2::animlib::CNmGraphDefinition, m_skeleton) == 0x8, "m_skeleton in CNmGraphDefinition should be at offset 0x8");
		static_assert(offsetof(CS2::animlib::CNmGraphDefinition, m_pUserData) == 0x10, "m_pUserData in CNmGraphDefinition should be at offset 0x10");
		static_assert(offsetof(CS2::animlib::CNmGraphDefinition, m_persistentNodeIndices) == 0x18, "m_persistentNodeIndices in CNmGraphDefinition should be at offset 0x18");
		static_assert(offsetof(CS2::animlib::CNmGraphDefinition, m_nRootNodeIdx) == 0x30, "m_nRootNodeIdx in CNmGraphDefinition should be at offset 0x30");
		static_assert(offsetof(CS2::animlib::CNmGraphDefinition, m_controlParameterIDs) == 0x38, "m_controlParameterIDs in CNmGraphDefinition should be at offset 0x38");
		static_assert(offsetof(CS2::animlib::CNmGraphDefinition, m_virtualParameterIDs) == 0x50, "m_virtualParameterIDs in CNmGraphDefinition should be at offset 0x50");
		static_assert(offsetof(CS2::animlib::CNmGraphDefinition, m_virtualParameterNodeIndices) == 0x68, "m_virtualParameterNodeIndices in CNmGraphDefinition should be at offset 0x68");
		static_assert(offsetof(CS2::animlib::CNmGraphDefinition, m_referencedGraphSlots) == 0x80, "m_referencedGraphSlots in CNmGraphDefinition should be at offset 0x80");
		static_assert(offsetof(CS2::animlib::CNmGraphDefinition, m_externalGraphSlots) == 0x98, "m_externalGraphSlots in CNmGraphDefinition should be at offset 0x98");
		static_assert(offsetof(CS2::animlib::CNmGraphDefinition, m_externalPoseSlots) == 0xB0, "m_externalPoseSlots in CNmGraphDefinition should be at offset 0xB0");
		static_assert(offsetof(CS2::animlib::CNmGraphDefinition, m_nodePaths) == 0x138, "m_nodePaths in CNmGraphDefinition should be at offset 0x138");
		static_assert(offsetof(CS2::animlib::CNmGraphDefinition, m_resources) == 0x150, "m_resources in CNmGraphDefinition should be at offset 0x150");
		static_assert(sizeof(CS2::animlib::CNmGraphDefinition) == 0x1A0, "CNmGraphDefinition size should be 0x1A0");

#endif
	}
}
