// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#ifndef CUSTOM_GLOBAL_TYPES
	#include <SDK/GlobalTypes.hpp>
#else
	#include <Custom/GlobalTypes.hpp>
#endif





namespace CS2 {
	namespace animlib {
		class CNmIKJoint  {
		public:
			int32_t m_nParentIndex; // 0x0 | Schema_Builtin | Size: 0x4
			int32_t m_nBodyIndex; // 0x4 | Schema_Builtin | Size: 0x4
			S2_PAD(0x8);
			GlobalTypes::CTransform m_xLocalFrame; // 0x10 | Schema_Atomic | Size: 0x20
			float32 m_flSwingLimit; // 0x30 | Schema_Builtin | Size: 0x4
			float32 m_flMinTwistLimit; // 0x34 | Schema_Builtin | Size: 0x4
			float32 m_flMaxTwistLimit; // 0x38 | Schema_Builtin | Size: 0x4
			float32 m_flWeight; // 0x3c | Schema_Builtin | Size: 0x4
		};
		static_assert(offsetof(CS2::animlib::CNmIKJoint, m_nParentIndex) == 0x0, "m_nParentIndex in CNmIKJoint should be at offset 0x0");
		static_assert(offsetof(CS2::animlib::CNmIKJoint, m_nBodyIndex) == 0x4, "m_nBodyIndex in CNmIKJoint should be at offset 0x4");
		static_assert(offsetof(CS2::animlib::CNmIKJoint, m_xLocalFrame) == 0x10, "m_xLocalFrame in CNmIKJoint should be at offset 0x10");
		static_assert(offsetof(CS2::animlib::CNmIKJoint, m_flSwingLimit) == 0x30, "m_flSwingLimit in CNmIKJoint should be at offset 0x30");
		static_assert(offsetof(CS2::animlib::CNmIKJoint, m_flMinTwistLimit) == 0x34, "m_flMinTwistLimit in CNmIKJoint should be at offset 0x34");
		static_assert(offsetof(CS2::animlib::CNmIKJoint, m_flMaxTwistLimit) == 0x38, "m_flMaxTwistLimit in CNmIKJoint should be at offset 0x38");
		static_assert(offsetof(CS2::animlib::CNmIKJoint, m_flWeight) == 0x3C, "m_flWeight in CNmIKJoint should be at offset 0x3C");
		static_assert(sizeof(CS2::animlib::CNmIKJoint) == 0x40, "CNmIKJoint size should be 0x40");
	}
}
