// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#ifndef CUSTOM_GLOBAL_TYPES
	#include "../GlobalTypes.hpp"
#else
	#include "../Custom/GlobalTypes.hpp"
#endif


#include "CNmFloatValueNode_CDefinition.hpp"





using namespace GlobalTypes;
namespace CS2 {
	namespace animlib {
		class CNmIDToFloatNode_CDefinition : public CS2::animlib::CNmFloatValueNode_CDefinition {
		public:
			int16_t m_nInputValueNodeIdx; // 0x10 | Schema_Builtin | Size: 0x2
			S2_PAD(0x2);
			float32 m_defaultValue; // 0x14 | Schema_Builtin | Size: 0x4
			// GlobalTypes::CUtlLeanVectorFixedGrowable<GlobalTypes::CGlobalSymbol> m_IDs; // 0x18 | Schema_Atomic | Size: 0x30
			char m_IDs[0x30]; // 0x18 | Schema_Atomic | Size: 0x30
			// GlobalTypes::CUtlLeanVectorFixedGrowable< float32, 5 > m_values; // 0x48 | Schema_Atomic | Size: 0x20
			char m_values[0x20]; // 0x48 | Schema_Atomic | Size: 0x20
		};
		static_assert(offsetof(CS2::animlib::CNmIDToFloatNode_CDefinition, m_nInputValueNodeIdx) == 0x10, "m_nInputValueNodeIdx in CNmIDToFloatNode::CDefinition should be at offset 0x10");
		static_assert(offsetof(CS2::animlib::CNmIDToFloatNode_CDefinition, m_defaultValue) == 0x14, "m_defaultValue in CNmIDToFloatNode::CDefinition should be at offset 0x14");
		static_assert(offsetof(CS2::animlib::CNmIDToFloatNode_CDefinition, m_IDs) == 0x18, "m_IDs in CNmIDToFloatNode::CDefinition should be at offset 0x18");
		static_assert(offsetof(CS2::animlib::CNmIDToFloatNode_CDefinition, m_values) == 0x48, "m_values in CNmIDToFloatNode::CDefinition should be at offset 0x48");
		static_assert(sizeof(CS2::animlib::CNmIDToFloatNode_CDefinition) == 0x68, "CNmIDToFloatNode::CDefinition size should be 0x68");
	}
}
