// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#ifndef CUSTOM_GLOBAL_TYPES
	#include "../GlobalTypes.hpp"
#else
	#include "../Custom/GlobalTypes.hpp"
#endif


#include "CNmIDValueNode_CDefinition.hpp"





using namespace GlobalTypes;
namespace CS2 {
	namespace animlib {
		class CNmIDSwitchNode_CDefinition : public CS2::animlib::CNmIDValueNode_CDefinition {
		public:
			int16_t m_nSwitchValueNodeIdx; // 0x10 | Schema_Builtin | Size: 0x2
			int16_t m_nTrueValueNodeIdx; // 0x12 | Schema_Builtin | Size: 0x2
			int16_t m_nFalseValueNodeIdx; // 0x14 | Schema_Builtin | Size: 0x2
			S2_PAD(0x2);
			GlobalTypes::CGlobalSymbol m_falseValue; // 0x18 | Schema_Atomic | Size: 0x8
			GlobalTypes::CGlobalSymbol m_trueValue; // 0x20 | Schema_Atomic | Size: 0x8
		};
		static_assert(offsetof(CS2::animlib::CNmIDSwitchNode_CDefinition, m_nSwitchValueNodeIdx) == 0x10, "m_nSwitchValueNodeIdx in CNmIDSwitchNode::CDefinition should be at offset 0x10");
		static_assert(offsetof(CS2::animlib::CNmIDSwitchNode_CDefinition, m_nTrueValueNodeIdx) == 0x12, "m_nTrueValueNodeIdx in CNmIDSwitchNode::CDefinition should be at offset 0x12");
		static_assert(offsetof(CS2::animlib::CNmIDSwitchNode_CDefinition, m_nFalseValueNodeIdx) == 0x14, "m_nFalseValueNodeIdx in CNmIDSwitchNode::CDefinition should be at offset 0x14");
		static_assert(offsetof(CS2::animlib::CNmIDSwitchNode_CDefinition, m_falseValue) == 0x18, "m_falseValue in CNmIDSwitchNode::CDefinition should be at offset 0x18");
		static_assert(offsetof(CS2::animlib::CNmIDSwitchNode_CDefinition, m_trueValue) == 0x20, "m_trueValue in CNmIDSwitchNode::CDefinition should be at offset 0x20");
		static_assert(sizeof(CS2::animlib::CNmIDSwitchNode_CDefinition) == 0x28, "CNmIDSwitchNode::CDefinition size should be 0x28");
	}
}
