// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#ifndef CUSTOM_GLOBAL_TYPES
	#include <SDK/GlobalTypes.hpp>
#else
	#include <Custom/GlobalTypes.hpp>
#endif







using namespace GlobalTypes;
namespace CS2 {
	namespace animlib {
		class CNmIKBody  {
		public:
			float32 m_flMass; // 0x0 | Schema_Builtin | Size: 0x4
			GlobalTypes::Vector m_vLocalMassCenter; // 0x4 | Schema_Atomic | Size: 0xc
			GlobalTypes::Vector m_vRadius; // 0x10 | Schema_Atomic | Size: 0xc
			float32 m_flResistance; // 0x1c | Schema_Builtin | Size: 0x4
		};
		static_assert(offsetof(CS2::animlib::CNmIKBody, m_flMass) == 0x0, "m_flMass in CNmIKBody should be at offset 0x0");
		static_assert(offsetof(CS2::animlib::CNmIKBody, m_vLocalMassCenter) == 0x4, "m_vLocalMassCenter in CNmIKBody should be at offset 0x4");
		static_assert(offsetof(CS2::animlib::CNmIKBody, m_vRadius) == 0x10, "m_vRadius in CNmIKBody should be at offset 0x10");
		static_assert(offsetof(CS2::animlib::CNmIKBody, m_flResistance) == 0x1C, "m_flResistance in CNmIKBody should be at offset 0x1C");
		static_assert(sizeof(CS2::animlib::CNmIKBody) == 0x20, "CNmIKBody size should be 0x20");
	}
}
