// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#ifndef CUSTOM_GLOBAL_TYPES
	#include <SDK/GlobalTypes.hpp>
#else
	#include <Custom/GlobalTypes.hpp>
#endif


#include <SDK/animlib/CNmEvent.hpp>



namespace CS2 {
	namespace animlib {
		class CNmMaterialAttributeEvent : public CS2::animlib::CNmEvent {
		public:
			GlobalTypes::CUtlString m_attributeName; // 0x20 | Schema_Atomic | Size: 0x8
			GlobalTypes::CUtlStringToken m_attributeNameToken; // 0x28 | Schema_Atomic | Size: 0x4
			S2_PAD(0x4);
			GlobalTypes::CPiecewiseCurve m_x; // 0x30 | Schema_Atomic | Size: 0x40
			GlobalTypes::CPiecewiseCurve m_y; // 0x70 | Schema_Atomic | Size: 0x40
			GlobalTypes::CPiecewiseCurve m_z; // 0xb0 | Schema_Atomic | Size: 0x40
			GlobalTypes::CPiecewiseCurve m_w; // 0xf0 | Schema_Atomic | Size: 0x40
		};
		static_assert(offsetof(CS2::animlib::CNmMaterialAttributeEvent, m_attributeName) == 0x20, "m_attributeName in CNmMaterialAttributeEvent should be at offset 0x20");
		static_assert(offsetof(CS2::animlib::CNmMaterialAttributeEvent, m_attributeNameToken) == 0x28, "m_attributeNameToken in CNmMaterialAttributeEvent should be at offset 0x28");
		static_assert(offsetof(CS2::animlib::CNmMaterialAttributeEvent, m_x) == 0x30, "m_x in CNmMaterialAttributeEvent should be at offset 0x30");
		static_assert(offsetof(CS2::animlib::CNmMaterialAttributeEvent, m_y) == 0x70, "m_y in CNmMaterialAttributeEvent should be at offset 0x70");
		static_assert(offsetof(CS2::animlib::CNmMaterialAttributeEvent, m_z) == 0xB0, "m_z in CNmMaterialAttributeEvent should be at offset 0xB0");
		static_assert(offsetof(CS2::animlib::CNmMaterialAttributeEvent, m_w) == 0xF0, "m_w in CNmMaterialAttributeEvent should be at offset 0xF0");
		static_assert(sizeof(CS2::animlib::CNmMaterialAttributeEvent) == 0x130, "CNmMaterialAttributeEvent size should be 0x130");
	}
}
