// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#ifndef CUSTOM_GLOBAL_TYPES
	#include "../GlobalTypes.hpp"
#else
	#include "../Custom/GlobalTypes.hpp"
#endif


#include "CNmPoseNode_CDefinition.hpp"
#include "CNmRootMotionData_SamplingMode_t.hpp"





using namespace GlobalTypes;
namespace CS2 {
	namespace animlib {
		class CNmOrientationWarpNode_CDefinition : public CS2::animlib::CNmPoseNode_CDefinition {
		public:
			int16_t m_nClipReferenceNodeIdx; // 0x10 | Schema_Builtin | Size: 0x2
			int16_t m_nTargetValueNodeIdx; // 0x12 | Schema_Builtin | Size: 0x2
			bool m_bIsOffsetNode; // 0x14 | Schema_Builtin | Size: 0x1
			bool m_bIsOffsetRelativeToCharacter; // 0x15 | Schema_Builtin | Size: 0x1
			bool m_bWarpTranslation; // 0x16 | Schema_Builtin | Size: 0x1
			animlib::CNmRootMotionData_SamplingMode_t m_samplingMode; // 0x17 | Schema_DeclaredEnum | Size: 0x1
		};
#ifdef USE_STATIC_ASSERTS
		static_assert(offsetof(CS2::animlib::CNmOrientationWarpNode_CDefinition, m_nClipReferenceNodeIdx) == 0x10, "m_nClipReferenceNodeIdx in CNmOrientationWarpNode::CDefinition should be at offset 0x10");
		static_assert(offsetof(CS2::animlib::CNmOrientationWarpNode_CDefinition, m_nTargetValueNodeIdx) == 0x12, "m_nTargetValueNodeIdx in CNmOrientationWarpNode::CDefinition should be at offset 0x12");
		static_assert(offsetof(CS2::animlib::CNmOrientationWarpNode_CDefinition, m_bIsOffsetNode) == 0x14, "m_bIsOffsetNode in CNmOrientationWarpNode::CDefinition should be at offset 0x14");
		static_assert(offsetof(CS2::animlib::CNmOrientationWarpNode_CDefinition, m_bIsOffsetRelativeToCharacter) == 0x15, "m_bIsOffsetRelativeToCharacter in CNmOrientationWarpNode::CDefinition should be at offset 0x15");
		static_assert(offsetof(CS2::animlib::CNmOrientationWarpNode_CDefinition, m_bWarpTranslation) == 0x16, "m_bWarpTranslation in CNmOrientationWarpNode::CDefinition should be at offset 0x16");
		static_assert(offsetof(CS2::animlib::CNmOrientationWarpNode_CDefinition, m_samplingMode) == 0x17, "m_samplingMode in CNmOrientationWarpNode::CDefinition should be at offset 0x17");
		static_assert(sizeof(CS2::animlib::CNmOrientationWarpNode_CDefinition) == 0x18, "CNmOrientationWarpNode::CDefinition size should be 0x18");

#endif
	}
}
