// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#ifndef CUSTOM_GLOBAL_TYPES
	#include "../GlobalTypes.hpp"
#else
	#include "../Custom/GlobalTypes.hpp"
#endif


#include "CNmClipReferenceNode_CDefinition.hpp"





using namespace GlobalTypes;
namespace CS2 {
	namespace animlib {
		class CNmParameterizedClipSelectorNode_CDefinition : public CS2::animlib::CNmClipReferenceNode_CDefinition {
		public:
			// GlobalTypes::CUtlLeanVectorFixedGrowable< int16, 5 > m_optionNodeIndices; // 0x10 | Schema_Atomic | Size: 0x18
			char m_optionNodeIndices[0x18]; // 0x10 | Schema_Atomic | Size: 0x18
			// GlobalTypes::CUtlLeanVectorFixedGrowable< uint8, 5 > m_optionWeights; // 0x28 | Schema_Atomic | Size: 0x10
			char m_optionWeights[0x10]; // 0x28 | Schema_Atomic | Size: 0x10
			int16_t m_parameterNodeIdx; // 0x38 | Schema_Builtin | Size: 0x2
			bool m_bIgnoreInvalidOptions; // 0x3a | Schema_Builtin | Size: 0x1
			bool m_bHasWeightsSet; // 0x3b | Schema_Builtin | Size: 0x1
			S2_PAD(0x4); // End padding
		};
		static_assert(offsetof(CS2::animlib::CNmParameterizedClipSelectorNode_CDefinition, m_optionNodeIndices) == 0x10, "m_optionNodeIndices in CNmParameterizedClipSelectorNode::CDefinition should be at offset 0x10");
		static_assert(offsetof(CS2::animlib::CNmParameterizedClipSelectorNode_CDefinition, m_optionWeights) == 0x28, "m_optionWeights in CNmParameterizedClipSelectorNode::CDefinition should be at offset 0x28");
		static_assert(offsetof(CS2::animlib::CNmParameterizedClipSelectorNode_CDefinition, m_parameterNodeIdx) == 0x38, "m_parameterNodeIdx in CNmParameterizedClipSelectorNode::CDefinition should be at offset 0x38");
		static_assert(offsetof(CS2::animlib::CNmParameterizedClipSelectorNode_CDefinition, m_bIgnoreInvalidOptions) == 0x3A, "m_bIgnoreInvalidOptions in CNmParameterizedClipSelectorNode::CDefinition should be at offset 0x3A");
		static_assert(offsetof(CS2::animlib::CNmParameterizedClipSelectorNode_CDefinition, m_bHasWeightsSet) == 0x3B, "m_bHasWeightsSet in CNmParameterizedClipSelectorNode::CDefinition should be at offset 0x3B");
		static_assert(sizeof(CS2::animlib::CNmParameterizedClipSelectorNode_CDefinition) == 0x40, "CNmParameterizedClipSelectorNode::CDefinition size should be 0x40");
	}
}
