// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#ifndef CUSTOM_GLOBAL_TYPES
	#include "../GlobalTypes.hpp"
#else
	#include "../Custom/GlobalTypes.hpp"
#endif


#include "CNmPassthroughNode_CDefinition.hpp"
#include "CNmBitFlags.hpp"





using namespace GlobalTypes;
namespace CS2 {
	namespace animlib {
		class CNmRootMotionOverrideNode_CDefinition : public CS2::animlib::CNmPassthroughNode_CDefinition {
		public:
			int16_t m_desiredMovingVelocityNodeIdx; // 0x18 | Schema_Builtin | Size: 0x2
			int16_t m_desiredFacingDirectionNodeIdx; // 0x1a | Schema_Builtin | Size: 0x2
			int16_t m_linearVelocityLimitNodeIdx; // 0x1c | Schema_Builtin | Size: 0x2
			int16_t m_angularVelocityLimitNodeIdx; // 0x1e | Schema_Builtin | Size: 0x2
			float32 m_maxLinearVelocity; // 0x20 | Schema_Builtin | Size: 0x4
			float32 m_maxAngularVelocityRadians; // 0x24 | Schema_Builtin | Size: 0x4
			animlib::CNmBitFlags m_overrideFlags; // 0x28 | Schema_DeclaredClass | Size: 0x4
			S2_PAD(0x4); // End padding
		};
		static_assert(offsetof(CS2::animlib::CNmRootMotionOverrideNode_CDefinition, m_desiredMovingVelocityNodeIdx) == 0x18, "m_desiredMovingVelocityNodeIdx in CNmRootMotionOverrideNode::CDefinition should be at offset 0x18");
		static_assert(offsetof(CS2::animlib::CNmRootMotionOverrideNode_CDefinition, m_desiredFacingDirectionNodeIdx) == 0x1A, "m_desiredFacingDirectionNodeIdx in CNmRootMotionOverrideNode::CDefinition should be at offset 0x1A");
		static_assert(offsetof(CS2::animlib::CNmRootMotionOverrideNode_CDefinition, m_linearVelocityLimitNodeIdx) == 0x1C, "m_linearVelocityLimitNodeIdx in CNmRootMotionOverrideNode::CDefinition should be at offset 0x1C");
		static_assert(offsetof(CS2::animlib::CNmRootMotionOverrideNode_CDefinition, m_angularVelocityLimitNodeIdx) == 0x1E, "m_angularVelocityLimitNodeIdx in CNmRootMotionOverrideNode::CDefinition should be at offset 0x1E");
		static_assert(offsetof(CS2::animlib::CNmRootMotionOverrideNode_CDefinition, m_maxLinearVelocity) == 0x20, "m_maxLinearVelocity in CNmRootMotionOverrideNode::CDefinition should be at offset 0x20");
		static_assert(offsetof(CS2::animlib::CNmRootMotionOverrideNode_CDefinition, m_maxAngularVelocityRadians) == 0x24, "m_maxAngularVelocityRadians in CNmRootMotionOverrideNode::CDefinition should be at offset 0x24");
		static_assert(offsetof(CS2::animlib::CNmRootMotionOverrideNode_CDefinition, m_overrideFlags) == 0x28, "m_overrideFlags in CNmRootMotionOverrideNode::CDefinition should be at offset 0x28");
		static_assert(sizeof(CS2::animlib::CNmRootMotionOverrideNode_CDefinition) == 0x30, "CNmRootMotionOverrideNode::CDefinition size should be 0x30");
	}
}
