// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#ifndef CUSTOM_GLOBAL_TYPES
	#include <SDK/GlobalTypes.hpp>
#else
	#include <Custom/GlobalTypes.hpp>
#endif







using namespace GlobalTypes;
namespace CS2 {
	namespace animlib {
		class CNmRootMotionData  {
		public:
			GlobalTypes::CUtlVector< GlobalTypes::CTransform > m_transforms; // 0x0 | Schema_Atomic | Size: 0x18
			// char  m_transforms[0x18]; // 0x0 | Schema_Atomic | Size: 0x18
			int32_t m_nNumFrames; // 0x18 | Schema_Builtin | Size: 0x4
			float32 m_flAverageLinearVelocity; // 0x1c | Schema_Builtin | Size: 0x4
			float32 m_flAverageAngularVelocityRadians; // 0x20 | Schema_Builtin | Size: 0x4
			S2_PAD(0xc);
			GlobalTypes::CTransform m_totalDelta; // 0x30 | Schema_Atomic | Size: 0x20
		};
		static_assert(offsetof(CS2::animlib::CNmRootMotionData, m_transforms) == 0x0, "m_transforms in CNmRootMotionData should be at offset 0x0");
		static_assert(offsetof(CS2::animlib::CNmRootMotionData, m_nNumFrames) == 0x18, "m_nNumFrames in CNmRootMotionData should be at offset 0x18");
		static_assert(offsetof(CS2::animlib::CNmRootMotionData, m_flAverageLinearVelocity) == 0x1C, "m_flAverageLinearVelocity in CNmRootMotionData should be at offset 0x1C");
		static_assert(offsetof(CS2::animlib::CNmRootMotionData, m_flAverageAngularVelocityRadians) == 0x20, "m_flAverageAngularVelocityRadians in CNmRootMotionData should be at offset 0x20");
		static_assert(offsetof(CS2::animlib::CNmRootMotionData, m_totalDelta) == 0x30, "m_totalDelta in CNmRootMotionData should be at offset 0x30");
		static_assert(sizeof(CS2::animlib::CNmRootMotionData) == 0x50, "CNmRootMotionData size should be 0x50");
	}
}
