// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#ifndef CUSTOM_GLOBAL_TYPES
	#include "../GlobalTypes.hpp"
#else
	#include "../Custom/GlobalTypes.hpp"
#endif


#include "CNmPoseNode_CDefinition.hpp"
#include "CNmStateNode_TimedEvent_t.hpp"





using namespace GlobalTypes;
namespace CS2 {
	namespace animlib {
		class CNmStateNode_CDefinition : public CS2::animlib::CNmPoseNode_CDefinition {
		public:
			int16_t m_nChildNodeIdx; // 0x10 | Schema_Builtin | Size: 0x2
			S2_PAD(0x6);
			// GlobalTypes::CUtlLeanVectorFixedGrowable<GlobalTypes::CGlobalSymbol> m_entryEvents; // 0x18 | Schema_Atomic | Size: 0x20
			char m_entryEvents[0x20]; // 0x18 | Schema_Atomic | Size: 0x20
			// GlobalTypes::CUtlLeanVectorFixedGrowable<GlobalTypes::CGlobalSymbol> m_executeEvents; // 0x38 | Schema_Atomic | Size: 0x20
			char m_executeEvents[0x20]; // 0x38 | Schema_Atomic | Size: 0x20
			// GlobalTypes::CUtlLeanVectorFixedGrowable<GlobalTypes::CGlobalSymbol> m_exitEvents; // 0x58 | Schema_Atomic | Size: 0x20
			char m_exitEvents[0x20]; // 0x58 | Schema_Atomic | Size: 0x20
			// GlobalTypes::CUtlLeanVectorFixedGrowable<animlib::CNmStateNode_TimedEvent_t> m_timedRemainingEvents; // 0x78 | Schema_Atomic | Size: 0x18
			char m_timedRemainingEvents[0x18]; // 0x78 | Schema_Atomic | Size: 0x18
			// GlobalTypes::CUtlLeanVectorFixedGrowable<animlib::CNmStateNode_TimedEvent_t> m_timedElapsedEvents; // 0x90 | Schema_Atomic | Size: 0x18
			char m_timedElapsedEvents[0x18]; // 0x90 | Schema_Atomic | Size: 0x18
			int16_t m_nLayerWeightNodeIdx; // 0xa8 | Schema_Builtin | Size: 0x2
			int16_t m_nLayerRootMotionWeightNodeIdx; // 0xaa | Schema_Builtin | Size: 0x2
			int16_t m_nLayerBoneMaskNodeIdx; // 0xac | Schema_Builtin | Size: 0x2
			bool m_bIsOffState; // 0xae | Schema_Builtin | Size: 0x1
			bool m_bUseActualElapsedTimeInStateForTimedEvents; // 0xaf | Schema_Builtin | Size: 0x1
		};
#ifdef USE_STATIC_ASSERTS
		static_assert(offsetof(CS2::animlib::CNmStateNode_CDefinition, m_nChildNodeIdx) == 0x10, "m_nChildNodeIdx in CNmStateNode::CDefinition should be at offset 0x10");
		static_assert(offsetof(CS2::animlib::CNmStateNode_CDefinition, m_entryEvents) == 0x18, "m_entryEvents in CNmStateNode::CDefinition should be at offset 0x18");
		static_assert(offsetof(CS2::animlib::CNmStateNode_CDefinition, m_executeEvents) == 0x38, "m_executeEvents in CNmStateNode::CDefinition should be at offset 0x38");
		static_assert(offsetof(CS2::animlib::CNmStateNode_CDefinition, m_exitEvents) == 0x58, "m_exitEvents in CNmStateNode::CDefinition should be at offset 0x58");
		static_assert(offsetof(CS2::animlib::CNmStateNode_CDefinition, m_timedRemainingEvents) == 0x78, "m_timedRemainingEvents in CNmStateNode::CDefinition should be at offset 0x78");
		static_assert(offsetof(CS2::animlib::CNmStateNode_CDefinition, m_timedElapsedEvents) == 0x90, "m_timedElapsedEvents in CNmStateNode::CDefinition should be at offset 0x90");
		static_assert(offsetof(CS2::animlib::CNmStateNode_CDefinition, m_nLayerWeightNodeIdx) == 0xA8, "m_nLayerWeightNodeIdx in CNmStateNode::CDefinition should be at offset 0xA8");
		static_assert(offsetof(CS2::animlib::CNmStateNode_CDefinition, m_nLayerRootMotionWeightNodeIdx) == 0xAA, "m_nLayerRootMotionWeightNodeIdx in CNmStateNode::CDefinition should be at offset 0xAA");
		static_assert(offsetof(CS2::animlib::CNmStateNode_CDefinition, m_nLayerBoneMaskNodeIdx) == 0xAC, "m_nLayerBoneMaskNodeIdx in CNmStateNode::CDefinition should be at offset 0xAC");
		static_assert(offsetof(CS2::animlib::CNmStateNode_CDefinition, m_bIsOffState) == 0xAE, "m_bIsOffState in CNmStateNode::CDefinition should be at offset 0xAE");
		static_assert(offsetof(CS2::animlib::CNmStateNode_CDefinition, m_bUseActualElapsedTimeInStateForTimedEvents) == 0xAF, "m_bUseActualElapsedTimeInStateForTimedEvents in CNmStateNode::CDefinition should be at offset 0xAF");
		static_assert(sizeof(CS2::animlib::CNmStateNode_CDefinition) == 0xB0, "CNmStateNode::CDefinition size should be 0xB0");

#endif
	}
}
