// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#ifndef CUSTOM_GLOBAL_TYPES
	#include <SDK/GlobalTypes.hpp>
#else
	#include <Custom/GlobalTypes.hpp>
#endif


#include <SDK/animlib/CNmEvent.hpp>
#include <SDK/animlib/CNmEventRelevance_t.hpp>
#include <SDK/animlib/Position_t.hpp>



namespace CS2 {
	namespace animlib {
		class CNmSoundEvent : public CS2::animlib::CNmEvent {
		public:
			animlib::CNmEventRelevance_t m_relevance; // 0x20 | Schema_DeclaredEnum | Size: 0x4
			S2_PAD(0x4);
			GlobalTypes::CUtlString m_name; // 0x28 | Schema_Atomic | Size: 0x8
			animlib::Position_t m_position; // 0x30 | Schema_DeclaredEnum | Size: 0x4
			S2_PAD(0x4);
			GlobalTypes::CUtlString m_attachmentName; // 0x38 | Schema_Atomic | Size: 0x8
			GlobalTypes::CUtlString m_tags; // 0x40 | Schema_Atomic | Size: 0x8
			bool m_bContinuePlayingSoundAtDurationEnd; // 0x48 | Schema_Builtin | Size: 0x1
			S2_PAD(0x3);
			float32 m_flDurationInterruptionThreshold; // 0x4c | Schema_Builtin | Size: 0x4
		};
		static_assert(offsetof(CS2::animlib::CNmSoundEvent, m_relevance) == 0x20, "m_relevance in CNmSoundEvent should be at offset 0x20");
		static_assert(offsetof(CS2::animlib::CNmSoundEvent, m_name) == 0x28, "m_name in CNmSoundEvent should be at offset 0x28");
		static_assert(offsetof(CS2::animlib::CNmSoundEvent, m_position) == 0x30, "m_position in CNmSoundEvent should be at offset 0x30");
		static_assert(offsetof(CS2::animlib::CNmSoundEvent, m_attachmentName) == 0x38, "m_attachmentName in CNmSoundEvent should be at offset 0x38");
		static_assert(offsetof(CS2::animlib::CNmSoundEvent, m_tags) == 0x40, "m_tags in CNmSoundEvent should be at offset 0x40");
		static_assert(offsetof(CS2::animlib::CNmSoundEvent, m_bContinuePlayingSoundAtDurationEnd) == 0x48, "m_bContinuePlayingSoundAtDurationEnd in CNmSoundEvent should be at offset 0x48");
		static_assert(offsetof(CS2::animlib::CNmSoundEvent, m_flDurationInterruptionThreshold) == 0x4C, "m_flDurationInterruptionThreshold in CNmSoundEvent should be at offset 0x4C");
		static_assert(sizeof(CS2::animlib::CNmSoundEvent) == 0x50, "CNmSoundEvent size should be 0x50");
	}
}
