// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#ifndef CUSTOM_GLOBAL_TYPES
	#include "../GlobalTypes.hpp"
#else
	#include "../Custom/GlobalTypes.hpp"
#endif


#include "CNmPassthroughNode_CDefinition.hpp"
#include "NmIKBlendMode_t.hpp"





using namespace GlobalTypes;
namespace CS2 {
	namespace animlib {
		class CNmTwoBoneIKNode_CDefinition : public CS2::animlib::CNmPassthroughNode_CDefinition {
		public:
			GlobalTypes::CGlobalSymbol m_effectorBoneID; // 0x18 | Schema_Atomic | Size: 0x8
			int16_t m_nEffectorTargetNodeIdx; // 0x20 | Schema_Builtin | Size: 0x2
			int16_t m_nEnabledNodeIdx; // 0x22 | Schema_Builtin | Size: 0x2
			float32 m_flBlendTimeSeconds; // 0x24 | Schema_Builtin | Size: 0x4
			animlib::NmIKBlendMode_t m_blendMode; // 0x28 | Schema_DeclaredEnum | Size: 0x1
			bool m_bIsTargetInWorldSpace; // 0x29 | Schema_Builtin | Size: 0x1
			S2_PAD(0x2);
			float32 m_flReferencePoseTwistWeight; // 0x2c | Schema_Builtin | Size: 0x4
		};
		static_assert(offsetof(CS2::animlib::CNmTwoBoneIKNode_CDefinition, m_effectorBoneID) == 0x18, "m_effectorBoneID in CNmTwoBoneIKNode::CDefinition should be at offset 0x18");
		static_assert(offsetof(CS2::animlib::CNmTwoBoneIKNode_CDefinition, m_nEffectorTargetNodeIdx) == 0x20, "m_nEffectorTargetNodeIdx in CNmTwoBoneIKNode::CDefinition should be at offset 0x20");
		static_assert(offsetof(CS2::animlib::CNmTwoBoneIKNode_CDefinition, m_nEnabledNodeIdx) == 0x22, "m_nEnabledNodeIdx in CNmTwoBoneIKNode::CDefinition should be at offset 0x22");
		static_assert(offsetof(CS2::animlib::CNmTwoBoneIKNode_CDefinition, m_flBlendTimeSeconds) == 0x24, "m_flBlendTimeSeconds in CNmTwoBoneIKNode::CDefinition should be at offset 0x24");
		static_assert(offsetof(CS2::animlib::CNmTwoBoneIKNode_CDefinition, m_blendMode) == 0x28, "m_blendMode in CNmTwoBoneIKNode::CDefinition should be at offset 0x28");
		static_assert(offsetof(CS2::animlib::CNmTwoBoneIKNode_CDefinition, m_bIsTargetInWorldSpace) == 0x29, "m_bIsTargetInWorldSpace in CNmTwoBoneIKNode::CDefinition should be at offset 0x29");
		static_assert(offsetof(CS2::animlib::CNmTwoBoneIKNode_CDefinition, m_flReferencePoseTwistWeight) == 0x2C, "m_flReferencePoseTwistWeight in CNmTwoBoneIKNode::CDefinition should be at offset 0x2C");
		static_assert(sizeof(CS2::animlib::CNmTwoBoneIKNode_CDefinition) == 0x30, "CNmTwoBoneIKNode::CDefinition size should be 0x30");
	}
}
