// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#ifndef CUSTOM_GLOBAL_TYPES
	#include "../GlobalTypes.hpp"
#else
	#include "../Custom/GlobalTypes.hpp"
#endif


#include "CNmBoolValueNode_CDefinition.hpp"
#include "CNmBitFlags.hpp"
#include "NmTransitionRuleCondition_t.hpp"





using namespace GlobalTypes;
namespace CS2 {
	namespace animlib {
		class CNmTransitionEventConditionNode_CDefinition : public CS2::animlib::CNmBoolValueNode_CDefinition {
		public:
			GlobalTypes::CGlobalSymbol m_requireRuleID; // 0x10 | Schema_Atomic | Size: 0x8
			animlib::CNmBitFlags m_eventConditionRules; // 0x18 | Schema_DeclaredClass | Size: 0x4
			int16_t m_nSourceStateNodeIdx; // 0x1c | Schema_Builtin | Size: 0x2
			animlib::NmTransitionRuleCondition_t m_ruleCondition; // 0x1e | Schema_DeclaredEnum | Size: 0x1
			S2_PAD(0x1); // End padding
		};
		static_assert(offsetof(CS2::animlib::CNmTransitionEventConditionNode_CDefinition, m_requireRuleID) == 0x10, "m_requireRuleID in CNmTransitionEventConditionNode::CDefinition should be at offset 0x10");
		static_assert(offsetof(CS2::animlib::CNmTransitionEventConditionNode_CDefinition, m_eventConditionRules) == 0x18, "m_eventConditionRules in CNmTransitionEventConditionNode::CDefinition should be at offset 0x18");
		static_assert(offsetof(CS2::animlib::CNmTransitionEventConditionNode_CDefinition, m_nSourceStateNodeIdx) == 0x1C, "m_nSourceStateNodeIdx in CNmTransitionEventConditionNode::CDefinition should be at offset 0x1C");
		static_assert(offsetof(CS2::animlib::CNmTransitionEventConditionNode_CDefinition, m_ruleCondition) == 0x1E, "m_ruleCondition in CNmTransitionEventConditionNode::CDefinition should be at offset 0x1E");
		static_assert(sizeof(CS2::animlib::CNmTransitionEventConditionNode_CDefinition) == 0x20, "CNmTransitionEventConditionNode::CDefinition size should be 0x20");
	}
}
