// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#ifndef CUSTOM_GLOBAL_TYPES
	#include "../GlobalTypes.hpp"
#else
	#include <Custom/GlobalTypes.hpp>
#endif


#include "CNmClipReferenceNode_CDefinition.hpp"





using namespace GlobalTypes;
namespace CS2 {
	namespace animlib {
		class CNmTargetSelectorNode_CDefinition : public CS2::animlib::CNmClipReferenceNode_CDefinition {
		public:
			// GlobalTypes::CUtlLeanVectorFixedGrowable< int16, 5 > m_optionNodeIndices; // 0x10 | Schema_Atomic | Size: 0x18
			char m_optionNodeIndices[0x18]; // 0x10 | Schema_Atomic | Size: 0x18
			float32 m_flOrientationScoreWeight; // 0x28 | Schema_Builtin | Size: 0x4
			float32 m_flPositionScoreWeight; // 0x2c | Schema_Builtin | Size: 0x4
			int16_t m_parameterNodeIdx; // 0x30 | Schema_Builtin | Size: 0x2
			bool m_bIgnoreInvalidOptions; // 0x32 | Schema_Builtin | Size: 0x1
			bool m_bIsWorldSpaceTarget; // 0x33 | Schema_Builtin | Size: 0x1
			S2_PAD(0x4); // End padding
		};
#ifdef USE_STATIC_ASSERTS
		static_assert(offsetof(CS2::animlib::CNmTargetSelectorNode_CDefinition, m_optionNodeIndices) == 0x10, "m_optionNodeIndices in CNmTargetSelectorNode::CDefinition should be at offset 0x10");
		static_assert(offsetof(CS2::animlib::CNmTargetSelectorNode_CDefinition, m_flOrientationScoreWeight) == 0x28, "m_flOrientationScoreWeight in CNmTargetSelectorNode::CDefinition should be at offset 0x28");
		static_assert(offsetof(CS2::animlib::CNmTargetSelectorNode_CDefinition, m_flPositionScoreWeight) == 0x2C, "m_flPositionScoreWeight in CNmTargetSelectorNode::CDefinition should be at offset 0x2C");
		static_assert(offsetof(CS2::animlib::CNmTargetSelectorNode_CDefinition, m_parameterNodeIdx) == 0x30, "m_parameterNodeIdx in CNmTargetSelectorNode::CDefinition should be at offset 0x30");
		static_assert(offsetof(CS2::animlib::CNmTargetSelectorNode_CDefinition, m_bIgnoreInvalidOptions) == 0x32, "m_bIgnoreInvalidOptions in CNmTargetSelectorNode::CDefinition should be at offset 0x32");
		static_assert(offsetof(CS2::animlib::CNmTargetSelectorNode_CDefinition, m_bIsWorldSpaceTarget) == 0x33, "m_bIsWorldSpaceTarget in CNmTargetSelectorNode::CDefinition should be at offset 0x33");
		static_assert(sizeof(CS2::animlib::CNmTargetSelectorNode_CDefinition) == 0x38, "CNmTargetSelectorNode::CDefinition size should be 0x38");

#endif
	}
}
