// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#ifndef CUSTOM_GLOBAL_TYPES
	#include "../GlobalTypes.hpp"
#else
	#include "../Custom/GlobalTypes.hpp"
#endif


#include "CNmBoolValueNode_CDefinition.hpp"
#include "CNmTimeConditionNode_ComparisonType_t.hpp"
#include "CNmTimeConditionNode_Operator_t.hpp"





using namespace GlobalTypes;
namespace CS2 {
	namespace animlib {
		class CNmTimeConditionNode_CDefinition : public CS2::animlib::CNmBoolValueNode_CDefinition {
		public:
			int16_t m_sourceStateNodeIdx; // 0x10 | Schema_Builtin | Size: 0x2
			int16_t m_nInputValueNodeIdx; // 0x12 | Schema_Builtin | Size: 0x2
			float32 m_flComparand; // 0x14 | Schema_Builtin | Size: 0x4
			animlib::CNmTimeConditionNode_ComparisonType_t m_type; // 0x18 | Schema_DeclaredEnum | Size: 0x1
			animlib::CNmTimeConditionNode_Operator_t m_operator; // 0x19 | Schema_DeclaredEnum | Size: 0x1
			S2_PAD(0x6); // End padding
		};
		static_assert(offsetof(CS2::animlib::CNmTimeConditionNode_CDefinition, m_sourceStateNodeIdx) == 0x10, "m_sourceStateNodeIdx in CNmTimeConditionNode::CDefinition should be at offset 0x10");
		static_assert(offsetof(CS2::animlib::CNmTimeConditionNode_CDefinition, m_nInputValueNodeIdx) == 0x12, "m_nInputValueNodeIdx in CNmTimeConditionNode::CDefinition should be at offset 0x12");
		static_assert(offsetof(CS2::animlib::CNmTimeConditionNode_CDefinition, m_flComparand) == 0x14, "m_flComparand in CNmTimeConditionNode::CDefinition should be at offset 0x14");
		static_assert(offsetof(CS2::animlib::CNmTimeConditionNode_CDefinition, m_type) == 0x18, "m_type in CNmTimeConditionNode::CDefinition should be at offset 0x18");
		static_assert(offsetof(CS2::animlib::CNmTimeConditionNode_CDefinition, m_operator) == 0x19, "m_operator in CNmTimeConditionNode::CDefinition should be at offset 0x19");
		static_assert(sizeof(CS2::animlib::CNmTimeConditionNode_CDefinition) == 0x20, "CNmTimeConditionNode::CDefinition size should be 0x20");
	}
}
