// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#ifndef CUSTOM_GLOBAL_TYPES
	#include "../GlobalTypes.hpp"
#else
	#include "../Custom/GlobalTypes.hpp"
#endif


#include "CNmTargetValueNode_CDefinition.hpp"





using namespace GlobalTypes;
namespace CS2 {
	namespace animlib {
		class CNmTargetOffsetNode_CDefinition : public CS2::animlib::CNmTargetValueNode_CDefinition {
		public:
			int16_t m_nInputValueNodeIdx; // 0x10 | Schema_Builtin | Size: 0x2
			bool m_bIsBoneSpaceOffset; // 0x12 | Schema_Builtin | Size: 0x1
			S2_PAD(0xd);
			GlobalTypes::Quaternion m_rotationOffset; // 0x20 | Schema_Atomic | Size: 0x10
			GlobalTypes::Vector m_translationOffset; // 0x30 | Schema_Atomic | Size: 0xc
			S2_PAD(0x4); // End padding
		};
#ifdef USE_STATIC_ASSERTS
		static_assert(offsetof(CS2::animlib::CNmTargetOffsetNode_CDefinition, m_nInputValueNodeIdx) == 0x10, "m_nInputValueNodeIdx in CNmTargetOffsetNode::CDefinition should be at offset 0x10");
		static_assert(offsetof(CS2::animlib::CNmTargetOffsetNode_CDefinition, m_bIsBoneSpaceOffset) == 0x12, "m_bIsBoneSpaceOffset in CNmTargetOffsetNode::CDefinition should be at offset 0x12");
		static_assert(offsetof(CS2::animlib::CNmTargetOffsetNode_CDefinition, m_rotationOffset) == 0x20, "m_rotationOffset in CNmTargetOffsetNode::CDefinition should be at offset 0x20");
		static_assert(offsetof(CS2::animlib::CNmTargetOffsetNode_CDefinition, m_translationOffset) == 0x30, "m_translationOffset in CNmTargetOffsetNode::CDefinition should be at offset 0x30");
		static_assert(sizeof(CS2::animlib::CNmTargetOffsetNode_CDefinition) == 0x40, "CNmTargetOffsetNode::CDefinition size should be 0x40");

#endif
	}
}
