// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#ifndef CUSTOM_GLOBAL_TYPES
	#include "../GlobalTypes.hpp"
#else
	#include "../Custom/GlobalTypes.hpp"
#endif


#include "CNmPoseNode_CDefinition.hpp"
#include "CNmRootMotionData_SamplingMode_t.hpp"





using namespace GlobalTypes;
namespace CS2 {
	namespace animlib {
		class CNmTargetWarpNode_CDefinition : public CS2::animlib::CNmPoseNode_CDefinition {
		public:
			int16_t m_nClipReferenceNodeIdx; // 0x10 | Schema_Builtin | Size: 0x2
			int16_t m_nTargetValueNodeIdx; // 0x12 | Schema_Builtin | Size: 0x2
			animlib::CNmRootMotionData_SamplingMode_t m_samplingMode; // 0x14 | Schema_DeclaredEnum | Size: 0x1
			bool m_bAllowTargetUpdate; // 0x15 | Schema_Builtin | Size: 0x1
			bool m_bAlignWithTargetAtLastWarpEvent; // 0x16 | Schema_Builtin | Size: 0x1
			S2_PAD(0x1);
			float32 m_flSamplingPositionErrorThresholdSq; // 0x18 | Schema_Builtin | Size: 0x4
			float32 m_flMaxTangentLength; // 0x1c | Schema_Builtin | Size: 0x4
			float32 m_flLerpFallbackDistanceThreshold; // 0x20 | Schema_Builtin | Size: 0x4
			float32 m_flTargetUpdateDistanceThreshold; // 0x24 | Schema_Builtin | Size: 0x4
			float32 m_flTargetUpdateAngleThresholdRadians; // 0x28 | Schema_Builtin | Size: 0x4
			S2_PAD(0x4); // End padding
		};
#ifdef USE_STATIC_ASSERTS
		static_assert(offsetof(CS2::animlib::CNmTargetWarpNode_CDefinition, m_nClipReferenceNodeIdx) == 0x10, "m_nClipReferenceNodeIdx in CNmTargetWarpNode::CDefinition should be at offset 0x10");
		static_assert(offsetof(CS2::animlib::CNmTargetWarpNode_CDefinition, m_nTargetValueNodeIdx) == 0x12, "m_nTargetValueNodeIdx in CNmTargetWarpNode::CDefinition should be at offset 0x12");
		static_assert(offsetof(CS2::animlib::CNmTargetWarpNode_CDefinition, m_samplingMode) == 0x14, "m_samplingMode in CNmTargetWarpNode::CDefinition should be at offset 0x14");
		static_assert(offsetof(CS2::animlib::CNmTargetWarpNode_CDefinition, m_bAllowTargetUpdate) == 0x15, "m_bAllowTargetUpdate in CNmTargetWarpNode::CDefinition should be at offset 0x15");
		static_assert(offsetof(CS2::animlib::CNmTargetWarpNode_CDefinition, m_bAlignWithTargetAtLastWarpEvent) == 0x16, "m_bAlignWithTargetAtLastWarpEvent in CNmTargetWarpNode::CDefinition should be at offset 0x16");
		static_assert(offsetof(CS2::animlib::CNmTargetWarpNode_CDefinition, m_flSamplingPositionErrorThresholdSq) == 0x18, "m_flSamplingPositionErrorThresholdSq in CNmTargetWarpNode::CDefinition should be at offset 0x18");
		static_assert(offsetof(CS2::animlib::CNmTargetWarpNode_CDefinition, m_flMaxTangentLength) == 0x1C, "m_flMaxTangentLength in CNmTargetWarpNode::CDefinition should be at offset 0x1C");
		static_assert(offsetof(CS2::animlib::CNmTargetWarpNode_CDefinition, m_flLerpFallbackDistanceThreshold) == 0x20, "m_flLerpFallbackDistanceThreshold in CNmTargetWarpNode::CDefinition should be at offset 0x20");
		static_assert(offsetof(CS2::animlib::CNmTargetWarpNode_CDefinition, m_flTargetUpdateDistanceThreshold) == 0x24, "m_flTargetUpdateDistanceThreshold in CNmTargetWarpNode::CDefinition should be at offset 0x24");
		static_assert(offsetof(CS2::animlib::CNmTargetWarpNode_CDefinition, m_flTargetUpdateAngleThresholdRadians) == 0x28, "m_flTargetUpdateAngleThresholdRadians in CNmTargetWarpNode::CDefinition should be at offset 0x28");
		static_assert(sizeof(CS2::animlib::CNmTargetWarpNode_CDefinition) == 0x30, "CNmTargetWarpNode::CDefinition size should be 0x30");

#endif
	}
}
