// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#ifndef CUSTOM_GLOBAL_TYPES
	#include "../GlobalTypes.hpp"
#else
	#include <Custom/GlobalTypes.hpp>
#endif


#include "CNmPoseNode_CDefinition.hpp"
#include "NmPercent_t.hpp"
#include "CNmBitFlags.hpp"
#include "NmEasingOperation_t.hpp"
#include "NmRootMotionBlendMode_t.hpp"





using namespace GlobalTypes;
namespace CS2 {
	namespace animlib {
		class CNmTransitionNode_CDefinition : public CS2::animlib::CNmPoseNode_CDefinition {
		public:
			int16_t m_nTargetStateNodeIdx; // 0x10 | Schema_Builtin | Size: 0x2
			int16_t m_nDurationOverrideNodeIdx; // 0x12 | Schema_Builtin | Size: 0x2
			int16_t m_timeOffsetOverrideNodeIdx; // 0x14 | Schema_Builtin | Size: 0x2
			int16_t m_startBoneMaskNodeIdx; // 0x16 | Schema_Builtin | Size: 0x2
			float32 m_flDuration; // 0x18 | Schema_Builtin | Size: 0x4
			animlib::NmPercent_t m_boneMaskBlendInTimePercentage; // 0x1c | Schema_DeclaredClass | Size: 0x4
			float32 m_flTimeOffset; // 0x20 | Schema_Builtin | Size: 0x4
			animlib::CNmBitFlags m_transitionOptions; // 0x24 | Schema_DeclaredClass | Size: 0x4
			int16_t m_targetSyncIDNodeIdx; // 0x28 | Schema_Builtin | Size: 0x2
			animlib::NmEasingOperation_t m_blendWeightEasing; // 0x2a | Schema_DeclaredEnum | Size: 0x1
			animlib::NmRootMotionBlendMode_t m_rootMotionBlend; // 0x2b | Schema_DeclaredEnum | Size: 0x1
			S2_PAD(0x4); // End padding
		};
#ifdef USE_STATIC_ASSERTS
		static_assert(offsetof(CS2::animlib::CNmTransitionNode_CDefinition, m_nTargetStateNodeIdx) == 0x10, "m_nTargetStateNodeIdx in CNmTransitionNode::CDefinition should be at offset 0x10");
		static_assert(offsetof(CS2::animlib::CNmTransitionNode_CDefinition, m_nDurationOverrideNodeIdx) == 0x12, "m_nDurationOverrideNodeIdx in CNmTransitionNode::CDefinition should be at offset 0x12");
		static_assert(offsetof(CS2::animlib::CNmTransitionNode_CDefinition, m_timeOffsetOverrideNodeIdx) == 0x14, "m_timeOffsetOverrideNodeIdx in CNmTransitionNode::CDefinition should be at offset 0x14");
		static_assert(offsetof(CS2::animlib::CNmTransitionNode_CDefinition, m_startBoneMaskNodeIdx) == 0x16, "m_startBoneMaskNodeIdx in CNmTransitionNode::CDefinition should be at offset 0x16");
		static_assert(offsetof(CS2::animlib::CNmTransitionNode_CDefinition, m_flDuration) == 0x18, "m_flDuration in CNmTransitionNode::CDefinition should be at offset 0x18");
		static_assert(offsetof(CS2::animlib::CNmTransitionNode_CDefinition, m_boneMaskBlendInTimePercentage) == 0x1C, "m_boneMaskBlendInTimePercentage in CNmTransitionNode::CDefinition should be at offset 0x1C");
		static_assert(offsetof(CS2::animlib::CNmTransitionNode_CDefinition, m_flTimeOffset) == 0x20, "m_flTimeOffset in CNmTransitionNode::CDefinition should be at offset 0x20");
		static_assert(offsetof(CS2::animlib::CNmTransitionNode_CDefinition, m_transitionOptions) == 0x24, "m_transitionOptions in CNmTransitionNode::CDefinition should be at offset 0x24");
		static_assert(offsetof(CS2::animlib::CNmTransitionNode_CDefinition, m_targetSyncIDNodeIdx) == 0x28, "m_targetSyncIDNodeIdx in CNmTransitionNode::CDefinition should be at offset 0x28");
		static_assert(offsetof(CS2::animlib::CNmTransitionNode_CDefinition, m_blendWeightEasing) == 0x2A, "m_blendWeightEasing in CNmTransitionNode::CDefinition should be at offset 0x2A");
		static_assert(offsetof(CS2::animlib::CNmTransitionNode_CDefinition, m_rootMotionBlend) == 0x2B, "m_rootMotionBlend in CNmTransitionNode::CDefinition should be at offset 0x2B");
		static_assert(sizeof(CS2::animlib::CNmTransitionNode_CDefinition) == 0x30, "CNmTransitionNode::CDefinition size should be 0x30");

#endif
	}
}
