// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#ifndef CUSTOM_GLOBAL_TYPES
	#include "../GlobalTypes.hpp"
#else
	#include <Custom/GlobalTypes.hpp>
#endif


#include "CNmPoseTask.hpp"
#include "CNmTarget.hpp"
#include "NmIKBlendMode_t.hpp"





using namespace GlobalTypes;
namespace CS2 {
	namespace animlib {
		class CNmTwoBoneIKTask : public CS2::animlib::CNmPoseTask {
		public:
			int32_t m_nEffectorBoneIdx; // 0x58 | Schema_Builtin | Size: 0x4
			int32_t m_nEffectorTargetBoneIdx; // 0x5c | Schema_Builtin | Size: 0x4
			GlobalTypes::CTransform m_targetTransform; // 0x60 | Schema_Atomic | Size: 0x20
			animlib::CNmTarget m_effectorTarget; // 0x80 | Schema_DeclaredClass | Size: 0x30
			animlib::NmIKBlendMode_t m_blendMode; // 0xb0 | Schema_DeclaredEnum | Size: 0x1
			S2_PAD(0x3);
			float32 m_flBlendWeight; // 0xb4 | Schema_Builtin | Size: 0x4
			bool m_bIsTargetInWorldSpace; // 0xb8 | Schema_Builtin | Size: 0x1
			bool m_bIsRunningFromDeserializedData; // 0xb9 | Schema_Builtin | Size: 0x1
			S2_PAD(0x2);
			float32 m_flReferencePoseTwistWeight; // 0xbc | Schema_Builtin | Size: 0x4
			GlobalTypes::CGlobalSymbol m_debugEffectorBoneID; // 0xc0 | Schema_Atomic | Size: 0x8
			S2_PAD(0x8); // End padding
		};
#ifdef USE_STATIC_ASSERTS
		static_assert(offsetof(CS2::animlib::CNmTwoBoneIKTask, m_nEffectorBoneIdx) == 0x58, "m_nEffectorBoneIdx in CNmTwoBoneIKTask should be at offset 0x58");
		static_assert(offsetof(CS2::animlib::CNmTwoBoneIKTask, m_nEffectorTargetBoneIdx) == 0x5C, "m_nEffectorTargetBoneIdx in CNmTwoBoneIKTask should be at offset 0x5C");
		static_assert(offsetof(CS2::animlib::CNmTwoBoneIKTask, m_targetTransform) == 0x60, "m_targetTransform in CNmTwoBoneIKTask should be at offset 0x60");
		static_assert(offsetof(CS2::animlib::CNmTwoBoneIKTask, m_effectorTarget) == 0x80, "m_effectorTarget in CNmTwoBoneIKTask should be at offset 0x80");
		static_assert(offsetof(CS2::animlib::CNmTwoBoneIKTask, m_blendMode) == 0xB0, "m_blendMode in CNmTwoBoneIKTask should be at offset 0xB0");
		static_assert(offsetof(CS2::animlib::CNmTwoBoneIKTask, m_flBlendWeight) == 0xB4, "m_flBlendWeight in CNmTwoBoneIKTask should be at offset 0xB4");
		static_assert(offsetof(CS2::animlib::CNmTwoBoneIKTask, m_bIsTargetInWorldSpace) == 0xB8, "m_bIsTargetInWorldSpace in CNmTwoBoneIKTask should be at offset 0xB8");
		static_assert(offsetof(CS2::animlib::CNmTwoBoneIKTask, m_bIsRunningFromDeserializedData) == 0xB9, "m_bIsRunningFromDeserializedData in CNmTwoBoneIKTask should be at offset 0xB9");
		static_assert(offsetof(CS2::animlib::CNmTwoBoneIKTask, m_flReferencePoseTwistWeight) == 0xBC, "m_flReferencePoseTwistWeight in CNmTwoBoneIKTask should be at offset 0xBC");
		static_assert(offsetof(CS2::animlib::CNmTwoBoneIKTask, m_debugEffectorBoneID) == 0xC0, "m_debugEffectorBoneID in CNmTwoBoneIKTask should be at offset 0xC0");
		static_assert(sizeof(CS2::animlib::CNmTwoBoneIKTask) == 0xD0, "CNmTwoBoneIKTask size should be 0xD0");

#endif
	}
}
