// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#ifndef CUSTOM_GLOBAL_TYPES
	#include <SDK/GlobalTypes.hpp>
#else
	#include <Custom/GlobalTypes.hpp>
#endif


#include <SDK/animlib/NmPoseBlendMode_t.hpp>





using namespace GlobalTypes;
namespace CS2 {
	namespace animlib {
		class LayerDefinition_t  {
		public:
			int16_t m_nInputNodeIdx; // 0x0 | Schema_Builtin | Size: 0x2
			int16_t m_nWeightValueNodeIdx; // 0x2 | Schema_Builtin | Size: 0x2
			int16_t m_nBoneMaskValueNodeIdx; // 0x4 | Schema_Builtin | Size: 0x2
			int16_t m_nRootMotionWeightValueNodeIdx; // 0x6 | Schema_Builtin | Size: 0x2
			bool m_bIsSynchronized; // 0x8 | Schema_Builtin | Size: 0x1
			bool m_bIgnoreEvents; // 0x9 | Schema_Builtin | Size: 0x1
			bool m_bIsStateMachineLayer; // 0xa | Schema_Builtin | Size: 0x1
			animlib::NmPoseBlendMode_t m_blendMode; // 0xb | Schema_DeclaredEnum | Size: 0x1
		};
		static_assert(offsetof(CS2::animlib::LayerDefinition_t, m_nInputNodeIdx) == 0x0, "m_nInputNodeIdx in CNmLayerBlendNode::LayerDefinition_t should be at offset 0x0");
		static_assert(offsetof(CS2::animlib::LayerDefinition_t, m_nWeightValueNodeIdx) == 0x2, "m_nWeightValueNodeIdx in CNmLayerBlendNode::LayerDefinition_t should be at offset 0x2");
		static_assert(offsetof(CS2::animlib::LayerDefinition_t, m_nBoneMaskValueNodeIdx) == 0x4, "m_nBoneMaskValueNodeIdx in CNmLayerBlendNode::LayerDefinition_t should be at offset 0x4");
		static_assert(offsetof(CS2::animlib::LayerDefinition_t, m_nRootMotionWeightValueNodeIdx) == 0x6, "m_nRootMotionWeightValueNodeIdx in CNmLayerBlendNode::LayerDefinition_t should be at offset 0x6");
		static_assert(offsetof(CS2::animlib::LayerDefinition_t, m_bIsSynchronized) == 0x8, "m_bIsSynchronized in CNmLayerBlendNode::LayerDefinition_t should be at offset 0x8");
		static_assert(offsetof(CS2::animlib::LayerDefinition_t, m_bIgnoreEvents) == 0x9, "m_bIgnoreEvents in CNmLayerBlendNode::LayerDefinition_t should be at offset 0x9");
		static_assert(offsetof(CS2::animlib::LayerDefinition_t, m_bIsStateMachineLayer) == 0xA, "m_bIsStateMachineLayer in CNmLayerBlendNode::LayerDefinition_t should be at offset 0xA");
		static_assert(offsetof(CS2::animlib::LayerDefinition_t, m_blendMode) == 0xB, "m_blendMode in CNmLayerBlendNode::LayerDefinition_t should be at offset 0xB");
		static_assert(sizeof(CS2::animlib::LayerDefinition_t) == 0xC, "CNmLayerBlendNode::LayerDefinition_t size should be 0xC");
	}
}
