// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#ifndef CUSTOM_GLOBAL_TYPES
	#include <SDK/GlobalTypes.hpp>
#else
	#include <Custom/GlobalTypes.hpp>
#endif


#include <SDK/animlib/QuantizationRange_t.hpp>



namespace CS2 {
	namespace animlib {
		class NmCompressionSettings_t  {
		public:
			animlib::QuantizationRange_t m_translationRangeX; // 0x0 | Schema_DeclaredClass | Size: 0x8
			animlib::QuantizationRange_t m_translationRangeY; // 0x8 | Schema_DeclaredClass | Size: 0x8
			animlib::QuantizationRange_t m_translationRangeZ; // 0x10 | Schema_DeclaredClass | Size: 0x8
			animlib::QuantizationRange_t m_scaleRange; // 0x18 | Schema_DeclaredClass | Size: 0x8
			GlobalTypes::Quaternion m_constantRotation; // 0x20 | Schema_Atomic | Size: 0x10
			bool m_bIsRotationStatic; // 0x30 | Schema_Builtin | Size: 0x1
			bool m_bIsTranslationStatic; // 0x31 | Schema_Builtin | Size: 0x1
			bool m_bIsScaleStatic; // 0x32 | Schema_Builtin | Size: 0x1
			S2_PAD(0xd); // End padding
		};
		static_assert(offsetof(CS2::animlib::NmCompressionSettings_t, m_translationRangeX) == 0x0, "m_translationRangeX in NmCompressionSettings_t should be at offset 0x0");
		static_assert(offsetof(CS2::animlib::NmCompressionSettings_t, m_translationRangeY) == 0x8, "m_translationRangeY in NmCompressionSettings_t should be at offset 0x8");
		static_assert(offsetof(CS2::animlib::NmCompressionSettings_t, m_translationRangeZ) == 0x10, "m_translationRangeZ in NmCompressionSettings_t should be at offset 0x10");
		static_assert(offsetof(CS2::animlib::NmCompressionSettings_t, m_scaleRange) == 0x18, "m_scaleRange in NmCompressionSettings_t should be at offset 0x18");
		static_assert(offsetof(CS2::animlib::NmCompressionSettings_t, m_constantRotation) == 0x20, "m_constantRotation in NmCompressionSettings_t should be at offset 0x20");
		static_assert(offsetof(CS2::animlib::NmCompressionSettings_t, m_bIsRotationStatic) == 0x30, "m_bIsRotationStatic in NmCompressionSettings_t should be at offset 0x30");
		static_assert(offsetof(CS2::animlib::NmCompressionSettings_t, m_bIsTranslationStatic) == 0x31, "m_bIsTranslationStatic in NmCompressionSettings_t should be at offset 0x31");
		static_assert(offsetof(CS2::animlib::NmCompressionSettings_t, m_bIsScaleStatic) == 0x32, "m_bIsScaleStatic in NmCompressionSettings_t should be at offset 0x32");
		static_assert(sizeof(CS2::animlib::NmCompressionSettings_t) == 0x40, "NmCompressionSettings_t size should be 0x40");
	}
}
