// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#ifndef CUSTOM_GLOBAL_TYPES
	#include <SDK/GlobalTypes.hpp>
#else
	#include <Custom/GlobalTypes.hpp>
#endif





namespace CS2 {
	namespace entity2 {
		class CEntityComponentHelper;
	}
}
namespace CS2 {
	namespace entity2 {
		class EntComponentInfo_t  {
		public:
			char* m_pName; // 0x0 | Schema_Ptr | Size: 0x8
			char* m_pCPPClassname; // 0x8 | Schema_Ptr | Size: 0x8
			char* m_pNetworkDataReferencedDescription; // 0x10 | Schema_Ptr | Size: 0x8
			char* m_pNetworkDataReferencedPtrPropDescription; // 0x18 | Schema_Ptr | Size: 0x8
			int32_t m_nRuntimeIndex; // 0x20 | Schema_Builtin | Size: 0x4
			uint32_t m_nFlags; // 0x24 | Schema_Builtin | Size: 0x4
			S2_PAD(0x38);
			entity2::CEntityComponentHelper* m_pBaseClassComponentHelper; // 0x60 | Schema_Ptr | Size: 0x8
		};
		static_assert(offsetof(CS2::entity2::EntComponentInfo_t, m_pName) == 0x0, "m_pName in EntComponentInfo_t should be at offset 0x0");
		static_assert(offsetof(CS2::entity2::EntComponentInfo_t, m_pCPPClassname) == 0x8, "m_pCPPClassname in EntComponentInfo_t should be at offset 0x8");
		static_assert(offsetof(CS2::entity2::EntComponentInfo_t, m_pNetworkDataReferencedDescription) == 0x10, "m_pNetworkDataReferencedDescription in EntComponentInfo_t should be at offset 0x10");
		static_assert(offsetof(CS2::entity2::EntComponentInfo_t, m_pNetworkDataReferencedPtrPropDescription) == 0x18, "m_pNetworkDataReferencedPtrPropDescription in EntComponentInfo_t should be at offset 0x18");
		static_assert(offsetof(CS2::entity2::EntComponentInfo_t, m_nRuntimeIndex) == 0x20, "m_nRuntimeIndex in EntComponentInfo_t should be at offset 0x20");
		static_assert(offsetof(CS2::entity2::EntComponentInfo_t, m_nFlags) == 0x24, "m_nFlags in EntComponentInfo_t should be at offset 0x24");
		static_assert(offsetof(CS2::entity2::EntComponentInfo_t, m_pBaseClassComponentHelper) == 0x60, "m_pBaseClassComponentHelper in EntComponentInfo_t should be at offset 0x60");
		static_assert(sizeof(CS2::entity2::EntComponentInfo_t) == 0x68, "EntComponentInfo_t size should be 0x68");
	}
}
