// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#ifndef CUSTOM_GLOBAL_TYPES
	#include "../GlobalTypes.hpp"
#else
	#include "../Custom/GlobalTypes.hpp"
#endif


#include "RTProxyBLAS_t.hpp"
#include "RTProxyInstanceInfo_t.hpp"





using namespace GlobalTypes;
namespace CS2 {
	namespace worldrenderer {
		class AggregateRTProxySceneObject_t  {
		public:
			int16_t m_nLayer; // 0x0 | Schema_Builtin | Size: 0x2
			S2_PAD(0x6);
			GlobalTypes::CUtlVector<worldrenderer::RTProxyBLAS_t> m_BLASes; // 0x8 | Schema_Atomic | Size: 0x18
			// char m_BLASes[0x18]; // 0x8 | Schema_Atomic | Size: 0x18
			GlobalTypes::CUtlVector<worldrenderer::RTProxyInstanceInfo_t> m_Instances; // 0x20 | Schema_Atomic | Size: 0x18
			// char m_Instances[0x18]; // 0x20 | Schema_Atomic | Size: 0x18
			GlobalTypes::CUtlBinaryBlock m_VBData; // 0x38 | Schema_Atomic | Size: 0x10
			GlobalTypes::CUtlBinaryBlock m_IBData; // 0x48 | Schema_Atomic | Size: 0x10
			GlobalTypes::CUtlBinaryBlock m_InstanceAlbedoData; // 0x58 | Schema_Atomic | Size: 0x10
		};
		static_assert(offsetof(CS2::worldrenderer::AggregateRTProxySceneObject_t, m_nLayer) == 0x0, "m_nLayer in AggregateRTProxySceneObject_t should be at offset 0x0");
		static_assert(offsetof(CS2::worldrenderer::AggregateRTProxySceneObject_t, m_BLASes) == 0x8, "m_BLASes in AggregateRTProxySceneObject_t should be at offset 0x8");
		static_assert(offsetof(CS2::worldrenderer::AggregateRTProxySceneObject_t, m_Instances) == 0x20, "m_Instances in AggregateRTProxySceneObject_t should be at offset 0x20");
		static_assert(offsetof(CS2::worldrenderer::AggregateRTProxySceneObject_t, m_VBData) == 0x38, "m_VBData in AggregateRTProxySceneObject_t should be at offset 0x38");
		static_assert(offsetof(CS2::worldrenderer::AggregateRTProxySceneObject_t, m_IBData) == 0x48, "m_IBData in AggregateRTProxySceneObject_t should be at offset 0x48");
		static_assert(offsetof(CS2::worldrenderer::AggregateRTProxySceneObject_t, m_InstanceAlbedoData) == 0x58, "m_InstanceAlbedoData in AggregateRTProxySceneObject_t should be at offset 0x58");
		static_assert(sizeof(CS2::worldrenderer::AggregateRTProxySceneObject_t) == 0x68, "AggregateRTProxySceneObject_t size should be 0x68");
	}
}
