// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#ifndef CUSTOM_GLOBAL_TYPES
	#include <SDK/GlobalTypes.hpp>
#else
	#include <Custom/GlobalTypes.hpp>
#endif







using namespace GlobalTypes;
namespace CS2 {
	namespace worldrenderer {
		class EntityIOConnectionData_t  {
		public:
			GlobalTypes::CUtlString m_outputName; // 0x0 | Schema_Atomic | Size: 0x8
			uint32_t m_targetType; // 0x8 | Schema_Builtin | Size: 0x4
			S2_PAD(0x4);
			GlobalTypes::CUtlString m_targetName; // 0x10 | Schema_Atomic | Size: 0x8
			GlobalTypes::CUtlString m_inputName; // 0x18 | Schema_Atomic | Size: 0x8
			GlobalTypes::CUtlString m_overrideParam; // 0x20 | Schema_Atomic | Size: 0x8
			float32 m_flDelay; // 0x28 | Schema_Builtin | Size: 0x4
			int32_t m_nTimesToFire; // 0x2c | Schema_Builtin | Size: 0x4
			GlobalTypes::KeyValues3 m_paramMap; // 0x30 | Schema_Atomic | Size: 0x10
		};
		static_assert(offsetof(CS2::worldrenderer::EntityIOConnectionData_t, m_outputName) == 0x0, "m_outputName in EntityIOConnectionData_t should be at offset 0x0");
		static_assert(offsetof(CS2::worldrenderer::EntityIOConnectionData_t, m_targetType) == 0x8, "m_targetType in EntityIOConnectionData_t should be at offset 0x8");
		static_assert(offsetof(CS2::worldrenderer::EntityIOConnectionData_t, m_targetName) == 0x10, "m_targetName in EntityIOConnectionData_t should be at offset 0x10");
		static_assert(offsetof(CS2::worldrenderer::EntityIOConnectionData_t, m_inputName) == 0x18, "m_inputName in EntityIOConnectionData_t should be at offset 0x18");
		static_assert(offsetof(CS2::worldrenderer::EntityIOConnectionData_t, m_overrideParam) == 0x20, "m_overrideParam in EntityIOConnectionData_t should be at offset 0x20");
		static_assert(offsetof(CS2::worldrenderer::EntityIOConnectionData_t, m_flDelay) == 0x28, "m_flDelay in EntityIOConnectionData_t should be at offset 0x28");
		static_assert(offsetof(CS2::worldrenderer::EntityIOConnectionData_t, m_nTimesToFire) == 0x2C, "m_nTimesToFire in EntityIOConnectionData_t should be at offset 0x2C");
		static_assert(offsetof(CS2::worldrenderer::EntityIOConnectionData_t, m_paramMap) == 0x30, "m_paramMap in EntityIOConnectionData_t should be at offset 0x30");
		static_assert(sizeof(CS2::worldrenderer::EntityIOConnectionData_t) == 0x40, "EntityIOConnectionData_t size should be 0x40");
	}
}
