// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#include <SDK/GlobalTypes.hpp>




namespace CS2 {
	namespace worldrenderer {
		class InfoOverlayData_t  {
		public:
			GlobalTypes::matrix3x4_t m_transform; // 0x0 | Schema_Atomic | Size: 0x30
			float32 m_flWidth; // 0x30 | Schema_Builtin | Size: 0x4
			float32 m_flHeight; // 0x34 | Schema_Builtin | Size: 0x4
			float32 m_flDepth; // 0x38 | Schema_Builtin | Size: 0x4
			GlobalTypes::Vector2D m_vUVStart; // 0x3c | Schema_Atomic | Size: 0x8
			GlobalTypes::Vector2D m_vUVEnd; // 0x44 | Schema_Atomic | Size: 0x8
			S2_PAD(0x4);
			// GlobalTypes::CStrongHandle< resourcesystem::InfoForResourceTypeIMaterial2 > m_pMaterial; // 0x50 | Schema_Atomic | Size: 0x8
			char  m_pMaterial[0x8]; // 0x50 | Schema_Atomic | Size: 0x8
			int32_t m_nRenderOrder; // 0x58 | Schema_Builtin | Size: 0x4
			GlobalTypes::Vector4D m_vTintColor; // 0x5c | Schema_Atomic | Size: 0x10
			GlobalTypes::CUtlStringToken m_sSequenceOverrideName; // 0x6c | Schema_Atomic | Size: 0x4
		};
		static_assert(offsetof(CS2::worldrenderer::InfoOverlayData_t, m_transform) == 0x0, "m_transform in InfoOverlayData_t should be at offset 0x0");
		static_assert(offsetof(CS2::worldrenderer::InfoOverlayData_t, m_flWidth) == 0x30, "m_flWidth in InfoOverlayData_t should be at offset 0x30");
		static_assert(offsetof(CS2::worldrenderer::InfoOverlayData_t, m_flHeight) == 0x34, "m_flHeight in InfoOverlayData_t should be at offset 0x34");
		static_assert(offsetof(CS2::worldrenderer::InfoOverlayData_t, m_flDepth) == 0x38, "m_flDepth in InfoOverlayData_t should be at offset 0x38");
		static_assert(offsetof(CS2::worldrenderer::InfoOverlayData_t, m_vUVStart) == 0x3C, "m_vUVStart in InfoOverlayData_t should be at offset 0x3C");
		static_assert(offsetof(CS2::worldrenderer::InfoOverlayData_t, m_vUVEnd) == 0x44, "m_vUVEnd in InfoOverlayData_t should be at offset 0x44");
		static_assert(offsetof(CS2::worldrenderer::InfoOverlayData_t, m_pMaterial) == 0x50, "m_pMaterial in InfoOverlayData_t should be at offset 0x50");
		static_assert(offsetof(CS2::worldrenderer::InfoOverlayData_t, m_nRenderOrder) == 0x58, "m_nRenderOrder in InfoOverlayData_t should be at offset 0x58");
		static_assert(offsetof(CS2::worldrenderer::InfoOverlayData_t, m_vTintColor) == 0x5C, "m_vTintColor in InfoOverlayData_t should be at offset 0x5C");
		static_assert(offsetof(CS2::worldrenderer::InfoOverlayData_t, m_sSequenceOverrideName) == 0x6C, "m_sSequenceOverrideName in InfoOverlayData_t should be at offset 0x6C");
		static_assert(sizeof(CS2::worldrenderer::InfoOverlayData_t) == 0x70, "InfoOverlayData_t size should be 0x70");
	}
}
