// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#ifndef CUSTOM_GLOBAL_TYPES
	#include <SDK/GlobalTypes.hpp>
#else
	#include <Custom/GlobalTypes.hpp>
#endif


#include <SDK/worldrenderer/RTProxyInstanceFlags_t.hpp>
#include <SDK/modellib/VertexAlbedoFormat_t.hpp>





using namespace GlobalTypes;
namespace CS2 {
	namespace worldrenderer {
		class RTProxyInstanceInfo_t  {
		public:
			worldrenderer::RTProxyInstanceFlags_t m_nFlags; // 0x0 | Schema_DeclaredEnum | Size: 0x1
			modellib::VertexAlbedoFormat_t m_albedoFormat; // 0x1 | Schema_DeclaredEnum | Size: 0x1
			uint16_t m_nBLASCount; // 0x2 | Schema_Builtin | Size: 0x2
			uint32_t m_nBLASIndex; // 0x4 | Schema_Builtin | Size: 0x4
			uint32_t m_nVertexAlbedoByteOffset; // 0x8 | Schema_Builtin | Size: 0x4
			GlobalTypes::matrix3x4_t m_mWorldFromLocal; // 0xc | Schema_Atomic | Size: 0x30
		};
		static_assert(offsetof(CS2::worldrenderer::RTProxyInstanceInfo_t, m_nFlags) == 0x0, "m_nFlags in RTProxyInstanceInfo_t should be at offset 0x0");
		static_assert(offsetof(CS2::worldrenderer::RTProxyInstanceInfo_t, m_albedoFormat) == 0x1, "m_albedoFormat in RTProxyInstanceInfo_t should be at offset 0x1");
		static_assert(offsetof(CS2::worldrenderer::RTProxyInstanceInfo_t, m_nBLASCount) == 0x2, "m_nBLASCount in RTProxyInstanceInfo_t should be at offset 0x2");
		static_assert(offsetof(CS2::worldrenderer::RTProxyInstanceInfo_t, m_nBLASIndex) == 0x4, "m_nBLASIndex in RTProxyInstanceInfo_t should be at offset 0x4");
		static_assert(offsetof(CS2::worldrenderer::RTProxyInstanceInfo_t, m_nVertexAlbedoByteOffset) == 0x8, "m_nVertexAlbedoByteOffset in RTProxyInstanceInfo_t should be at offset 0x8");
		static_assert(offsetof(CS2::worldrenderer::RTProxyInstanceInfo_t, m_mWorldFromLocal) == 0xC, "m_mWorldFromLocal in RTProxyInstanceInfo_t should be at offset 0xC");
		static_assert(sizeof(CS2::worldrenderer::RTProxyInstanceInfo_t) == 0x3C, "RTProxyInstanceInfo_t size should be 0x3C");
	}
}
