// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#ifndef CUSTOM_GLOBAL_TYPES
	#include "../GlobalTypes.hpp"
#else
	#include "../Custom/GlobalTypes.hpp"
#endif


#include "../modellib/VertexAlbedoFormat_t.hpp"
#include "../mathlib_extended/AABB_t.hpp"





using namespace GlobalTypes;
namespace CS2 {
	namespace worldrenderer {
		class RTProxyBLAS_t  {
		public:
			uint32_t m_nFirstIndex; // 0x0 | Schema_Builtin | Size: 0x4
			uint32_t m_nIndexCount; // 0x4 | Schema_Builtin | Size: 0x4
			uint32_t m_nVBByteOffset; // 0x8 | Schema_Builtin | Size: 0x4
			uint32_t m_nBaseVertex; // 0xc | Schema_Builtin | Size: 0x4
			uint16_t m_nVertexCount; // 0x10 | Schema_Builtin | Size: 0x2
			modellib::VertexAlbedoFormat_t m_albedoFormat; // 0x12 | Schema_DeclaredEnum | Size: 0x1
			S2_PAD(0x1);
			mathlib_extended::AABB_t m_boundLs; // 0x14 | Schema_DeclaredClass | Size: 0x18
			GlobalTypes::Vector m_vVertexOriginLs; // 0x2c | Schema_Atomic | Size: 0xc
			GlobalTypes::Vector m_vVertexExtentLs; // 0x38 | Schema_Atomic | Size: 0xc
		};
		static_assert(offsetof(CS2::worldrenderer::RTProxyBLAS_t, m_nFirstIndex) == 0x0, "m_nFirstIndex in RTProxyBLAS_t should be at offset 0x0");
		static_assert(offsetof(CS2::worldrenderer::RTProxyBLAS_t, m_nIndexCount) == 0x4, "m_nIndexCount in RTProxyBLAS_t should be at offset 0x4");
		static_assert(offsetof(CS2::worldrenderer::RTProxyBLAS_t, m_nVBByteOffset) == 0x8, "m_nVBByteOffset in RTProxyBLAS_t should be at offset 0x8");
		static_assert(offsetof(CS2::worldrenderer::RTProxyBLAS_t, m_nBaseVertex) == 0xC, "m_nBaseVertex in RTProxyBLAS_t should be at offset 0xC");
		static_assert(offsetof(CS2::worldrenderer::RTProxyBLAS_t, m_nVertexCount) == 0x10, "m_nVertexCount in RTProxyBLAS_t should be at offset 0x10");
		static_assert(offsetof(CS2::worldrenderer::RTProxyBLAS_t, m_albedoFormat) == 0x12, "m_albedoFormat in RTProxyBLAS_t should be at offset 0x12");
		static_assert(offsetof(CS2::worldrenderer::RTProxyBLAS_t, m_boundLs) == 0x14, "m_boundLs in RTProxyBLAS_t should be at offset 0x14");
		static_assert(offsetof(CS2::worldrenderer::RTProxyBLAS_t, m_vVertexOriginLs) == 0x2C, "m_vVertexOriginLs in RTProxyBLAS_t should be at offset 0x2C");
		static_assert(offsetof(CS2::worldrenderer::RTProxyBLAS_t, m_vVertexExtentLs) == 0x38, "m_vVertexExtentLs in RTProxyBLAS_t should be at offset 0x38");
		static_assert(sizeof(CS2::worldrenderer::RTProxyBLAS_t) == 0x44, "RTProxyBLAS_t size should be 0x44");
	}
}
