// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#include <SDK/GlobalTypes.hpp>




namespace CS2 {
	namespace server {
		class audioparams_t  {
		public:
			S2_PAD(0x8);
			GlobalTypes::Vector localSound[8]; // 0x8 | Schema_FixedArray | Size: 0x60
			int32_t soundscapeIndex; // 0x68 | Schema_Builtin | Size: 0x4
			uint8_t localBits; // 0x6c | Schema_Builtin | Size: 0x1
			S2_PAD(0x3);
			int32_t soundscapeEntityListIndex; // 0x70 | Schema_Builtin | Size: 0x4
			uint32_t soundEventHash; // 0x74 | Schema_Builtin | Size: 0x4
		};
		static_assert(offsetof(CS2::server::audioparams_t, localSound) == 0x8, "localSound in audioparams_t should be at offset 0x8");
		static_assert(offsetof(CS2::server::audioparams_t, soundscapeIndex) == 0x68, "soundscapeIndex in audioparams_t should be at offset 0x68");
		static_assert(offsetof(CS2::server::audioparams_t, localBits) == 0x6C, "localBits in audioparams_t should be at offset 0x6C");
		static_assert(offsetof(CS2::server::audioparams_t, soundscapeEntityListIndex) == 0x70, "soundscapeEntityListIndex in audioparams_t should be at offset 0x70");
		static_assert(offsetof(CS2::server::audioparams_t, soundEventHash) == 0x74, "soundEventHash in audioparams_t should be at offset 0x74");
		static_assert(sizeof(CS2::server::audioparams_t) == 0x78, "audioparams_t size should be 0x78");
	}
}
