// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#include <SDK/GlobalTypes.hpp>

#include <SDK/server/CBaseModelEntity.hpp>
#include <SDK/entity2/GameTime_t.hpp>
#include <SDK/entity2/CEntityIOOutput.hpp>



namespace CS2 {
	namespace server {
		class CBarnLight : public CS2::server::CBaseModelEntity {
		public:
			public:
			bool m_bEnabled; // 0x7e8 | Schema_Builtin | Size: 0x1
			S2_PAD(0x3);
			int32_t m_nColorMode; // 0x7ec | Schema_Builtin | Size: 0x4
			GlobalTypes::Color m_Color; // 0x7f0 | Schema_Atomic | Size: 0x4
			float32 m_flColorTemperature; // 0x7f4 | Schema_Builtin | Size: 0x4
			float32 m_flBrightness; // 0x7f8 | Schema_Builtin | Size: 0x4
			float32 m_flBrightnessScale; // 0x7fc | Schema_Builtin | Size: 0x4
			int32_t m_nDirectLight; // 0x800 | Schema_Builtin | Size: 0x4
			int32_t m_nBakedShadowIndex; // 0x804 | Schema_Builtin | Size: 0x4
			int32_t m_nLightPathUniqueId; // 0x808 | Schema_Builtin | Size: 0x4
			int32_t m_nLightMapUniqueId; // 0x80c | Schema_Builtin | Size: 0x4
			int32_t m_nLuminaireShape; // 0x810 | Schema_Builtin | Size: 0x4
			float32 m_flLuminaireSize; // 0x814 | Schema_Builtin | Size: 0x4
			float32 m_flLuminaireAnisotropy; // 0x818 | Schema_Builtin | Size: 0x4
			S2_PAD(0x4);
			GlobalTypes::CUtlString m_LightStyleString; // 0x820 | Schema_Atomic | Size: 0x8
			entity2::GameTime_t m_flLightStyleStartTime; // 0x828 | Schema_DeclaredClass | Size: 0x4
			S2_PAD(0x4);
			// GlobalTypes::CNetworkUtlVectorBase< GlobalTypes::CUtlString > m_QueuedLightStyleStrings; // 0x830 | Schema_Atomic | Size: 0x18
			char  m_QueuedLightStyleStrings[0x18]; // 0x830 | Schema_Atomic | Size: 0x18
			// GlobalTypes::CNetworkUtlVectorBase< GlobalTypes::CUtlString > m_LightStyleEvents; // 0x848 | Schema_Atomic | Size: 0x18
			char  m_LightStyleEvents[0x18]; // 0x848 | Schema_Atomic | Size: 0x18
			// server::CNetworkUtlVectorBase< server.dll::CHandle< CBaseModelEntity > > m_LightStyleTargets; // 0x860 | Schema_Atomic | Size: 0x18
			char  m_LightStyleTargets[0x18]; // 0x860 | Schema_Atomic | Size: 0x18
			entity2::CEntityIOOutput m_StyleEvent[4]; // 0x878 | Schema_FixedArray | Size: 0x280
			// GlobalTypes::CStrongHandle< resourcesystem::InfoForResourceTypeCTextureBase > m_hLightCookie; // 0x938 | Schema_Atomic | Size: 0x8
			char  m_hLightCookie[0x8]; // 0x938 | Schema_Atomic | Size: 0x8
			float32 m_flShape; // 0x940 | Schema_Builtin | Size: 0x4
			float32 m_flSoftX; // 0x944 | Schema_Builtin | Size: 0x4
			float32 m_flSoftY; // 0x948 | Schema_Builtin | Size: 0x4
			float32 m_flSkirt; // 0x94c | Schema_Builtin | Size: 0x4
			float32 m_flSkirtNear; // 0x950 | Schema_Builtin | Size: 0x4
			GlobalTypes::Vector m_vSizeParams; // 0x954 | Schema_Atomic | Size: 0xc
			float32 m_flRange; // 0x960 | Schema_Builtin | Size: 0x4
			GlobalTypes::Vector m_vShear; // 0x964 | Schema_Atomic | Size: 0xc
			int32_t m_nBakeSpecularToCubemaps; // 0x970 | Schema_Builtin | Size: 0x4
			GlobalTypes::Vector m_vBakeSpecularToCubemapsSize; // 0x974 | Schema_Atomic | Size: 0xc
			int32_t m_nCastShadows; // 0x980 | Schema_Builtin | Size: 0x4
			int32_t m_nShadowMapSize; // 0x984 | Schema_Builtin | Size: 0x4
			int32_t m_nShadowPriority; // 0x988 | Schema_Builtin | Size: 0x4
			bool m_bContactShadow; // 0x98c | Schema_Builtin | Size: 0x1
			bool m_bForceShadowsEnabled; // 0x98d | Schema_Builtin | Size: 0x1
			S2_PAD(0x2);
			int32_t m_nBounceLight; // 0x990 | Schema_Builtin | Size: 0x4
			float32 m_flBounceScale; // 0x994 | Schema_Builtin | Size: 0x4
			float32 m_flMinRoughness; // 0x998 | Schema_Builtin | Size: 0x4
			GlobalTypes::Vector m_vAlternateColor; // 0x99c | Schema_Atomic | Size: 0xc
			float32 m_fAlternateColorBrightness; // 0x9a8 | Schema_Builtin | Size: 0x4
			int32_t m_nFog; // 0x9ac | Schema_Builtin | Size: 0x4
			float32 m_flFogStrength; // 0x9b0 | Schema_Builtin | Size: 0x4
			int32_t m_nFogShadows; // 0x9b4 | Schema_Builtin | Size: 0x4
			float32 m_flFogScale; // 0x9b8 | Schema_Builtin | Size: 0x4
			bool m_bFogMixedShadows; // 0x9bc | Schema_Builtin | Size: 0x1
			S2_PAD(0x3);
			float32 m_flFadeSizeStart; // 0x9c0 | Schema_Builtin | Size: 0x4
			float32 m_flFadeSizeEnd; // 0x9c4 | Schema_Builtin | Size: 0x4
			float32 m_flShadowFadeSizeStart; // 0x9c8 | Schema_Builtin | Size: 0x4
			float32 m_flShadowFadeSizeEnd; // 0x9cc | Schema_Builtin | Size: 0x4
			bool m_bPrecomputedFieldsValid; // 0x9d0 | Schema_Builtin | Size: 0x1
			S2_PAD(0x3);
			GlobalTypes::Vector m_vPrecomputedBoundsMins; // 0x9d4 | Schema_Atomic | Size: 0xc
			GlobalTypes::Vector m_vPrecomputedBoundsMaxs; // 0x9e0 | Schema_Atomic | Size: 0xc
			GlobalTypes::Vector m_vPrecomputedOBBOrigin; // 0x9ec | Schema_Atomic | Size: 0xc
			GlobalTypes::QAngle m_vPrecomputedOBBAngles; // 0x9f8 | Schema_Atomic | Size: 0xc
			GlobalTypes::Vector m_vPrecomputedOBBExtent; // 0xa04 | Schema_Atomic | Size: 0xc
			int32_t m_nPrecomputedSubFrusta; // 0xa10 | Schema_Builtin | Size: 0x4
			GlobalTypes::Vector m_vPrecomputedOBBOrigin0; // 0xa14 | Schema_Atomic | Size: 0xc
			GlobalTypes::QAngle m_vPrecomputedOBBAngles0; // 0xa20 | Schema_Atomic | Size: 0xc
			GlobalTypes::Vector m_vPrecomputedOBBExtent0; // 0xa2c | Schema_Atomic | Size: 0xc
			GlobalTypes::Vector m_vPrecomputedOBBOrigin1; // 0xa38 | Schema_Atomic | Size: 0xc
			GlobalTypes::QAngle m_vPrecomputedOBBAngles1; // 0xa44 | Schema_Atomic | Size: 0xc
			GlobalTypes::Vector m_vPrecomputedOBBExtent1; // 0xa50 | Schema_Atomic | Size: 0xc
			GlobalTypes::Vector m_vPrecomputedOBBOrigin2; // 0xa5c | Schema_Atomic | Size: 0xc
			GlobalTypes::QAngle m_vPrecomputedOBBAngles2; // 0xa68 | Schema_Atomic | Size: 0xc
			GlobalTypes::Vector m_vPrecomputedOBBExtent2; // 0xa74 | Schema_Atomic | Size: 0xc
			GlobalTypes::Vector m_vPrecomputedOBBOrigin3; // 0xa80 | Schema_Atomic | Size: 0xc
			GlobalTypes::QAngle m_vPrecomputedOBBAngles3; // 0xa8c | Schema_Atomic | Size: 0xc
			GlobalTypes::Vector m_vPrecomputedOBBExtent3; // 0xa98 | Schema_Atomic | Size: 0xc
			GlobalTypes::Vector m_vPrecomputedOBBOrigin4; // 0xaa4 | Schema_Atomic | Size: 0xc
			GlobalTypes::QAngle m_vPrecomputedOBBAngles4; // 0xab0 | Schema_Atomic | Size: 0xc
			GlobalTypes::Vector m_vPrecomputedOBBExtent4; // 0xabc | Schema_Atomic | Size: 0xc
			GlobalTypes::Vector m_vPrecomputedOBBOrigin5; // 0xac8 | Schema_Atomic | Size: 0xc
			GlobalTypes::QAngle m_vPrecomputedOBBAngles5; // 0xad4 | Schema_Atomic | Size: 0xc
			GlobalTypes::Vector m_vPrecomputedOBBExtent5; // 0xae0 | Schema_Atomic | Size: 0xc
			bool m_bPvsModifyEntity; // 0xaec | Schema_Builtin | Size: 0x1
			S2_PAD(0x3);
			// GlobalTypes::CNetworkUtlVectorBase< uint16 > m_VisClusters; // 0xaf0 | Schema_Atomic | Size: 0x18
			char  m_VisClusters[0x18]; // 0xaf0 | Schema_Atomic | Size: 0x18
			S2_PAD(0x8); // End padding
		};
		static_assert(offsetof(CS2::server::CBarnLight, m_bEnabled) == 0x7E8, "m_bEnabled in CBarnLight should be at offset 0x7E8");
		static_assert(offsetof(CS2::server::CBarnLight, m_nColorMode) == 0x7EC, "m_nColorMode in CBarnLight should be at offset 0x7EC");
		static_assert(offsetof(CS2::server::CBarnLight, m_Color) == 0x7F0, "m_Color in CBarnLight should be at offset 0x7F0");
		static_assert(offsetof(CS2::server::CBarnLight, m_flColorTemperature) == 0x7F4, "m_flColorTemperature in CBarnLight should be at offset 0x7F4");
		static_assert(offsetof(CS2::server::CBarnLight, m_flBrightness) == 0x7F8, "m_flBrightness in CBarnLight should be at offset 0x7F8");
		static_assert(offsetof(CS2::server::CBarnLight, m_flBrightnessScale) == 0x7FC, "m_flBrightnessScale in CBarnLight should be at offset 0x7FC");
		static_assert(offsetof(CS2::server::CBarnLight, m_nDirectLight) == 0x800, "m_nDirectLight in CBarnLight should be at offset 0x800");
		static_assert(offsetof(CS2::server::CBarnLight, m_nBakedShadowIndex) == 0x804, "m_nBakedShadowIndex in CBarnLight should be at offset 0x804");
		static_assert(offsetof(CS2::server::CBarnLight, m_nLightPathUniqueId) == 0x808, "m_nLightPathUniqueId in CBarnLight should be at offset 0x808");
		static_assert(offsetof(CS2::server::CBarnLight, m_nLightMapUniqueId) == 0x80C, "m_nLightMapUniqueId in CBarnLight should be at offset 0x80C");
		static_assert(offsetof(CS2::server::CBarnLight, m_nLuminaireShape) == 0x810, "m_nLuminaireShape in CBarnLight should be at offset 0x810");
		static_assert(offsetof(CS2::server::CBarnLight, m_flLuminaireSize) == 0x814, "m_flLuminaireSize in CBarnLight should be at offset 0x814");
		static_assert(offsetof(CS2::server::CBarnLight, m_flLuminaireAnisotropy) == 0x818, "m_flLuminaireAnisotropy in CBarnLight should be at offset 0x818");
		static_assert(offsetof(CS2::server::CBarnLight, m_LightStyleString) == 0x820, "m_LightStyleString in CBarnLight should be at offset 0x820");
		static_assert(offsetof(CS2::server::CBarnLight, m_flLightStyleStartTime) == 0x828, "m_flLightStyleStartTime in CBarnLight should be at offset 0x828");
		static_assert(offsetof(CS2::server::CBarnLight, m_QueuedLightStyleStrings) == 0x830, "m_QueuedLightStyleStrings in CBarnLight should be at offset 0x830");
		static_assert(offsetof(CS2::server::CBarnLight, m_LightStyleEvents) == 0x848, "m_LightStyleEvents in CBarnLight should be at offset 0x848");
		static_assert(offsetof(CS2::server::CBarnLight, m_LightStyleTargets) == 0x860, "m_LightStyleTargets in CBarnLight should be at offset 0x860");
		static_assert(offsetof(CS2::server::CBarnLight, m_StyleEvent) == 0x878, "m_StyleEvent in CBarnLight should be at offset 0x878");
		static_assert(offsetof(CS2::server::CBarnLight, m_hLightCookie) == 0x938, "m_hLightCookie in CBarnLight should be at offset 0x938");
		static_assert(offsetof(CS2::server::CBarnLight, m_flShape) == 0x940, "m_flShape in CBarnLight should be at offset 0x940");
		static_assert(offsetof(CS2::server::CBarnLight, m_flSoftX) == 0x944, "m_flSoftX in CBarnLight should be at offset 0x944");
		static_assert(offsetof(CS2::server::CBarnLight, m_flSoftY) == 0x948, "m_flSoftY in CBarnLight should be at offset 0x948");
		static_assert(offsetof(CS2::server::CBarnLight, m_flSkirt) == 0x94C, "m_flSkirt in CBarnLight should be at offset 0x94C");
		static_assert(offsetof(CS2::server::CBarnLight, m_flSkirtNear) == 0x950, "m_flSkirtNear in CBarnLight should be at offset 0x950");
		static_assert(offsetof(CS2::server::CBarnLight, m_vSizeParams) == 0x954, "m_vSizeParams in CBarnLight should be at offset 0x954");
		static_assert(offsetof(CS2::server::CBarnLight, m_flRange) == 0x960, "m_flRange in CBarnLight should be at offset 0x960");
		static_assert(offsetof(CS2::server::CBarnLight, m_vShear) == 0x964, "m_vShear in CBarnLight should be at offset 0x964");
		static_assert(offsetof(CS2::server::CBarnLight, m_nBakeSpecularToCubemaps) == 0x970, "m_nBakeSpecularToCubemaps in CBarnLight should be at offset 0x970");
		static_assert(offsetof(CS2::server::CBarnLight, m_vBakeSpecularToCubemapsSize) == 0x974, "m_vBakeSpecularToCubemapsSize in CBarnLight should be at offset 0x974");
		static_assert(offsetof(CS2::server::CBarnLight, m_nCastShadows) == 0x980, "m_nCastShadows in CBarnLight should be at offset 0x980");
		static_assert(offsetof(CS2::server::CBarnLight, m_nShadowMapSize) == 0x984, "m_nShadowMapSize in CBarnLight should be at offset 0x984");
		static_assert(offsetof(CS2::server::CBarnLight, m_nShadowPriority) == 0x988, "m_nShadowPriority in CBarnLight should be at offset 0x988");
		static_assert(offsetof(CS2::server::CBarnLight, m_bContactShadow) == 0x98C, "m_bContactShadow in CBarnLight should be at offset 0x98C");
		static_assert(offsetof(CS2::server::CBarnLight, m_bForceShadowsEnabled) == 0x98D, "m_bForceShadowsEnabled in CBarnLight should be at offset 0x98D");
		static_assert(offsetof(CS2::server::CBarnLight, m_nBounceLight) == 0x990, "m_nBounceLight in CBarnLight should be at offset 0x990");
		static_assert(offsetof(CS2::server::CBarnLight, m_flBounceScale) == 0x994, "m_flBounceScale in CBarnLight should be at offset 0x994");
		static_assert(offsetof(CS2::server::CBarnLight, m_flMinRoughness) == 0x998, "m_flMinRoughness in CBarnLight should be at offset 0x998");
		static_assert(offsetof(CS2::server::CBarnLight, m_vAlternateColor) == 0x99C, "m_vAlternateColor in CBarnLight should be at offset 0x99C");
		static_assert(offsetof(CS2::server::CBarnLight, m_fAlternateColorBrightness) == 0x9A8, "m_fAlternateColorBrightness in CBarnLight should be at offset 0x9A8");
		static_assert(offsetof(CS2::server::CBarnLight, m_nFog) == 0x9AC, "m_nFog in CBarnLight should be at offset 0x9AC");
		static_assert(offsetof(CS2::server::CBarnLight, m_flFogStrength) == 0x9B0, "m_flFogStrength in CBarnLight should be at offset 0x9B0");
		static_assert(offsetof(CS2::server::CBarnLight, m_nFogShadows) == 0x9B4, "m_nFogShadows in CBarnLight should be at offset 0x9B4");
		static_assert(offsetof(CS2::server::CBarnLight, m_flFogScale) == 0x9B8, "m_flFogScale in CBarnLight should be at offset 0x9B8");
		static_assert(offsetof(CS2::server::CBarnLight, m_bFogMixedShadows) == 0x9BC, "m_bFogMixedShadows in CBarnLight should be at offset 0x9BC");
		static_assert(offsetof(CS2::server::CBarnLight, m_flFadeSizeStart) == 0x9C0, "m_flFadeSizeStart in CBarnLight should be at offset 0x9C0");
		static_assert(offsetof(CS2::server::CBarnLight, m_flFadeSizeEnd) == 0x9C4, "m_flFadeSizeEnd in CBarnLight should be at offset 0x9C4");
		static_assert(offsetof(CS2::server::CBarnLight, m_flShadowFadeSizeStart) == 0x9C8, "m_flShadowFadeSizeStart in CBarnLight should be at offset 0x9C8");
		static_assert(offsetof(CS2::server::CBarnLight, m_flShadowFadeSizeEnd) == 0x9CC, "m_flShadowFadeSizeEnd in CBarnLight should be at offset 0x9CC");
		static_assert(offsetof(CS2::server::CBarnLight, m_bPrecomputedFieldsValid) == 0x9D0, "m_bPrecomputedFieldsValid in CBarnLight should be at offset 0x9D0");
		static_assert(offsetof(CS2::server::CBarnLight, m_vPrecomputedBoundsMins) == 0x9D4, "m_vPrecomputedBoundsMins in CBarnLight should be at offset 0x9D4");
		static_assert(offsetof(CS2::server::CBarnLight, m_vPrecomputedBoundsMaxs) == 0x9E0, "m_vPrecomputedBoundsMaxs in CBarnLight should be at offset 0x9E0");
		static_assert(offsetof(CS2::server::CBarnLight, m_vPrecomputedOBBOrigin) == 0x9EC, "m_vPrecomputedOBBOrigin in CBarnLight should be at offset 0x9EC");
		static_assert(offsetof(CS2::server::CBarnLight, m_vPrecomputedOBBAngles) == 0x9F8, "m_vPrecomputedOBBAngles in CBarnLight should be at offset 0x9F8");
		static_assert(offsetof(CS2::server::CBarnLight, m_vPrecomputedOBBExtent) == 0xA04, "m_vPrecomputedOBBExtent in CBarnLight should be at offset 0xA04");
		static_assert(offsetof(CS2::server::CBarnLight, m_nPrecomputedSubFrusta) == 0xA10, "m_nPrecomputedSubFrusta in CBarnLight should be at offset 0xA10");
		static_assert(offsetof(CS2::server::CBarnLight, m_vPrecomputedOBBOrigin0) == 0xA14, "m_vPrecomputedOBBOrigin0 in CBarnLight should be at offset 0xA14");
		static_assert(offsetof(CS2::server::CBarnLight, m_vPrecomputedOBBAngles0) == 0xA20, "m_vPrecomputedOBBAngles0 in CBarnLight should be at offset 0xA20");
		static_assert(offsetof(CS2::server::CBarnLight, m_vPrecomputedOBBExtent0) == 0xA2C, "m_vPrecomputedOBBExtent0 in CBarnLight should be at offset 0xA2C");
		static_assert(offsetof(CS2::server::CBarnLight, m_vPrecomputedOBBOrigin1) == 0xA38, "m_vPrecomputedOBBOrigin1 in CBarnLight should be at offset 0xA38");
		static_assert(offsetof(CS2::server::CBarnLight, m_vPrecomputedOBBAngles1) == 0xA44, "m_vPrecomputedOBBAngles1 in CBarnLight should be at offset 0xA44");
		static_assert(offsetof(CS2::server::CBarnLight, m_vPrecomputedOBBExtent1) == 0xA50, "m_vPrecomputedOBBExtent1 in CBarnLight should be at offset 0xA50");
		static_assert(offsetof(CS2::server::CBarnLight, m_vPrecomputedOBBOrigin2) == 0xA5C, "m_vPrecomputedOBBOrigin2 in CBarnLight should be at offset 0xA5C");
		static_assert(offsetof(CS2::server::CBarnLight, m_vPrecomputedOBBAngles2) == 0xA68, "m_vPrecomputedOBBAngles2 in CBarnLight should be at offset 0xA68");
		static_assert(offsetof(CS2::server::CBarnLight, m_vPrecomputedOBBExtent2) == 0xA74, "m_vPrecomputedOBBExtent2 in CBarnLight should be at offset 0xA74");
		static_assert(offsetof(CS2::server::CBarnLight, m_vPrecomputedOBBOrigin3) == 0xA80, "m_vPrecomputedOBBOrigin3 in CBarnLight should be at offset 0xA80");
		static_assert(offsetof(CS2::server::CBarnLight, m_vPrecomputedOBBAngles3) == 0xA8C, "m_vPrecomputedOBBAngles3 in CBarnLight should be at offset 0xA8C");
		static_assert(offsetof(CS2::server::CBarnLight, m_vPrecomputedOBBExtent3) == 0xA98, "m_vPrecomputedOBBExtent3 in CBarnLight should be at offset 0xA98");
		static_assert(offsetof(CS2::server::CBarnLight, m_vPrecomputedOBBOrigin4) == 0xAA4, "m_vPrecomputedOBBOrigin4 in CBarnLight should be at offset 0xAA4");
		static_assert(offsetof(CS2::server::CBarnLight, m_vPrecomputedOBBAngles4) == 0xAB0, "m_vPrecomputedOBBAngles4 in CBarnLight should be at offset 0xAB0");
		static_assert(offsetof(CS2::server::CBarnLight, m_vPrecomputedOBBExtent4) == 0xABC, "m_vPrecomputedOBBExtent4 in CBarnLight should be at offset 0xABC");
		static_assert(offsetof(CS2::server::CBarnLight, m_vPrecomputedOBBOrigin5) == 0xAC8, "m_vPrecomputedOBBOrigin5 in CBarnLight should be at offset 0xAC8");
		static_assert(offsetof(CS2::server::CBarnLight, m_vPrecomputedOBBAngles5) == 0xAD4, "m_vPrecomputedOBBAngles5 in CBarnLight should be at offset 0xAD4");
		static_assert(offsetof(CS2::server::CBarnLight, m_vPrecomputedOBBExtent5) == 0xAE0, "m_vPrecomputedOBBExtent5 in CBarnLight should be at offset 0xAE0");
		static_assert(offsetof(CS2::server::CBarnLight, m_bPvsModifyEntity) == 0xAEC, "m_bPvsModifyEntity in CBarnLight should be at offset 0xAEC");
		static_assert(offsetof(CS2::server::CBarnLight, m_VisClusters) == 0xAF0, "m_VisClusters in CBarnLight should be at offset 0xAF0");
		static_assert(sizeof(CS2::server::CBarnLight) == 0xB10, "CBarnLight size should be 0xB10");
	}
}
