// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#include <SDK/GlobalTypes.hpp>

#include <SDK/server/CBaseModelEntity.hpp>
#include <SDK/entity2/CEntityIOOutput.hpp>



namespace CS2 {
	namespace server {
		class CBaseClientUIEntity : public CS2::server::CBaseModelEntity {
		public:
			bool m_bEnabled; // 0x7e8 | Schema_Builtin | Size: 0x1
			S2_PAD(0x7);
			GlobalTypes::CUtlSymbolLarge m_DialogXMLName; // 0x7f0 | Schema_Atomic | Size: 0x8
			GlobalTypes::CUtlSymbolLarge m_PanelClassName; // 0x7f8 | Schema_Atomic | Size: 0x8
			GlobalTypes::CUtlSymbolLarge m_PanelID; // 0x800 | Schema_Atomic | Size: 0x8
			entity2::CEntityIOOutput m_CustomOutput0; // 0x808 | Schema_DeclaredClass | Size: 0x28
			entity2::CEntityIOOutput m_CustomOutput1; // 0x830 | Schema_DeclaredClass | Size: 0x28
			entity2::CEntityIOOutput m_CustomOutput2; // 0x858 | Schema_DeclaredClass | Size: 0x28
			entity2::CEntityIOOutput m_CustomOutput3; // 0x880 | Schema_DeclaredClass | Size: 0x28
			entity2::CEntityIOOutput m_CustomOutput4; // 0x8a8 | Schema_DeclaredClass | Size: 0x28
			entity2::CEntityIOOutput m_CustomOutput5; // 0x8d0 | Schema_DeclaredClass | Size: 0x28
			entity2::CEntityIOOutput m_CustomOutput6; // 0x8f8 | Schema_DeclaredClass | Size: 0x28
			entity2::CEntityIOOutput m_CustomOutput7; // 0x920 | Schema_DeclaredClass | Size: 0x28
			entity2::CEntityIOOutput m_CustomOutput8; // 0x948 | Schema_DeclaredClass | Size: 0x28
			entity2::CEntityIOOutput m_CustomOutput9; // 0x970 | Schema_DeclaredClass | Size: 0x28
		};
		static_assert(offsetof(CS2::server::CBaseClientUIEntity, m_bEnabled) == 0x7E8, "m_bEnabled in CBaseClientUIEntity should be at offset 0x7E8");
		static_assert(offsetof(CS2::server::CBaseClientUIEntity, m_DialogXMLName) == 0x7F0, "m_DialogXMLName in CBaseClientUIEntity should be at offset 0x7F0");
		static_assert(offsetof(CS2::server::CBaseClientUIEntity, m_PanelClassName) == 0x7F8, "m_PanelClassName in CBaseClientUIEntity should be at offset 0x7F8");
		static_assert(offsetof(CS2::server::CBaseClientUIEntity, m_PanelID) == 0x800, "m_PanelID in CBaseClientUIEntity should be at offset 0x800");
		static_assert(offsetof(CS2::server::CBaseClientUIEntity, m_CustomOutput0) == 0x808, "m_CustomOutput0 in CBaseClientUIEntity should be at offset 0x808");
		static_assert(offsetof(CS2::server::CBaseClientUIEntity, m_CustomOutput1) == 0x830, "m_CustomOutput1 in CBaseClientUIEntity should be at offset 0x830");
		static_assert(offsetof(CS2::server::CBaseClientUIEntity, m_CustomOutput2) == 0x858, "m_CustomOutput2 in CBaseClientUIEntity should be at offset 0x858");
		static_assert(offsetof(CS2::server::CBaseClientUIEntity, m_CustomOutput3) == 0x880, "m_CustomOutput3 in CBaseClientUIEntity should be at offset 0x880");
		static_assert(offsetof(CS2::server::CBaseClientUIEntity, m_CustomOutput4) == 0x8A8, "m_CustomOutput4 in CBaseClientUIEntity should be at offset 0x8A8");
		static_assert(offsetof(CS2::server::CBaseClientUIEntity, m_CustomOutput5) == 0x8D0, "m_CustomOutput5 in CBaseClientUIEntity should be at offset 0x8D0");
		static_assert(offsetof(CS2::server::CBaseClientUIEntity, m_CustomOutput6) == 0x8F8, "m_CustomOutput6 in CBaseClientUIEntity should be at offset 0x8F8");
		static_assert(offsetof(CS2::server::CBaseClientUIEntity, m_CustomOutput7) == 0x920, "m_CustomOutput7 in CBaseClientUIEntity should be at offset 0x920");
		static_assert(offsetof(CS2::server::CBaseClientUIEntity, m_CustomOutput8) == 0x948, "m_CustomOutput8 in CBaseClientUIEntity should be at offset 0x948");
		static_assert(offsetof(CS2::server::CBaseClientUIEntity, m_CustomOutput9) == 0x970, "m_CustomOutput9 in CBaseClientUIEntity should be at offset 0x970");
		static_assert(sizeof(CS2::server::CBaseClientUIEntity) == 0x998, "CBaseClientUIEntity size should be 0x998");
	}
}
