// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#include <SDK/GlobalTypes.hpp>

#include <SDK/server/CBaseToggle.hpp>
#include <SDK/server/locksound_t.hpp>
#include <SDK/server/FuncDoorSpawnPos_t.hpp>
#include <SDK/entity2/CEntityIOOutput.hpp>



namespace CS2 {
	namespace server {
		class CBaseDoor : public CS2::server::CBaseToggle {
		public:
			S2_PAD(0x10);
			GlobalTypes::QAngle m_angMoveEntitySpace; // 0x878 | Schema_Atomic | Size: 0xc
			GlobalTypes::Vector m_vecMoveDirParentSpace; // 0x884 | Schema_Atomic | Size: 0xc
			server::locksound_t m_ls; // 0x890 | Schema_DeclaredClass | Size: 0x20
			bool m_bForceClosed; // 0x8b0 | Schema_Builtin | Size: 0x1
			bool m_bDoorGroup; // 0x8b1 | Schema_Builtin | Size: 0x1
			bool m_bLocked; // 0x8b2 | Schema_Builtin | Size: 0x1
			bool m_bIgnoreDebris; // 0x8b3 | Schema_Builtin | Size: 0x1
			bool m_bNoNPCs; // 0x8b4 | Schema_Builtin | Size: 0x1
			S2_PAD(0x3);
			server::FuncDoorSpawnPos_t m_eSpawnPosition; // 0x8b8 | Schema_DeclaredEnum | Size: 0x4
			float32 m_flBlockDamage; // 0x8bc | Schema_Builtin | Size: 0x4
			GlobalTypes::CUtlSymbolLarge m_NoiseMoving; // 0x8c0 | Schema_Atomic | Size: 0x8
			GlobalTypes::CUtlSymbolLarge m_NoiseArrived; // 0x8c8 | Schema_Atomic | Size: 0x8
			GlobalTypes::CUtlSymbolLarge m_NoiseMovingClosed; // 0x8d0 | Schema_Atomic | Size: 0x8
			GlobalTypes::CUtlSymbolLarge m_NoiseArrivedClosed; // 0x8d8 | Schema_Atomic | Size: 0x8
			GlobalTypes::CUtlSymbolLarge m_ChainTarget; // 0x8e0 | Schema_Atomic | Size: 0x8
			entity2::CEntityIOOutput m_OnBlockedClosing; // 0x8e8 | Schema_DeclaredClass | Size: 0x28
			entity2::CEntityIOOutput m_OnBlockedOpening; // 0x910 | Schema_DeclaredClass | Size: 0x28
			entity2::CEntityIOOutput m_OnUnblockedClosing; // 0x938 | Schema_DeclaredClass | Size: 0x28
			entity2::CEntityIOOutput m_OnUnblockedOpening; // 0x960 | Schema_DeclaredClass | Size: 0x28
			entity2::CEntityIOOutput m_OnFullyClosed; // 0x988 | Schema_DeclaredClass | Size: 0x28
			entity2::CEntityIOOutput m_OnFullyOpen; // 0x9b0 | Schema_DeclaredClass | Size: 0x28
			entity2::CEntityIOOutput m_OnClose; // 0x9d8 | Schema_DeclaredClass | Size: 0x28
			entity2::CEntityIOOutput m_OnOpen; // 0xa00 | Schema_DeclaredClass | Size: 0x28
			entity2::CEntityIOOutput m_OnLockedUse; // 0xa28 | Schema_DeclaredClass | Size: 0x28
			bool m_bLoopMoveSound; // 0xa50 | Schema_Builtin | Size: 0x1
			S2_PAD(0x1f);
			bool m_bCreateNavObstacle; // 0xa70 | Schema_Builtin | Size: 0x1
			bool m_isChaining; // 0xa71 | Schema_Builtin | Size: 0x1
			bool m_bIsUsable; // 0xa72 | Schema_Builtin | Size: 0x1
			S2_PAD(0x5); // End padding
		};
		static_assert(offsetof(CS2::server::CBaseDoor, m_angMoveEntitySpace) == 0x878, "m_angMoveEntitySpace in CBaseDoor should be at offset 0x878");
		static_assert(offsetof(CS2::server::CBaseDoor, m_vecMoveDirParentSpace) == 0x884, "m_vecMoveDirParentSpace in CBaseDoor should be at offset 0x884");
		static_assert(offsetof(CS2::server::CBaseDoor, m_ls) == 0x890, "m_ls in CBaseDoor should be at offset 0x890");
		static_assert(offsetof(CS2::server::CBaseDoor, m_bForceClosed) == 0x8B0, "m_bForceClosed in CBaseDoor should be at offset 0x8B0");
		static_assert(offsetof(CS2::server::CBaseDoor, m_bDoorGroup) == 0x8B1, "m_bDoorGroup in CBaseDoor should be at offset 0x8B1");
		static_assert(offsetof(CS2::server::CBaseDoor, m_bLocked) == 0x8B2, "m_bLocked in CBaseDoor should be at offset 0x8B2");
		static_assert(offsetof(CS2::server::CBaseDoor, m_bIgnoreDebris) == 0x8B3, "m_bIgnoreDebris in CBaseDoor should be at offset 0x8B3");
		static_assert(offsetof(CS2::server::CBaseDoor, m_bNoNPCs) == 0x8B4, "m_bNoNPCs in CBaseDoor should be at offset 0x8B4");
		static_assert(offsetof(CS2::server::CBaseDoor, m_eSpawnPosition) == 0x8B8, "m_eSpawnPosition in CBaseDoor should be at offset 0x8B8");
		static_assert(offsetof(CS2::server::CBaseDoor, m_flBlockDamage) == 0x8BC, "m_flBlockDamage in CBaseDoor should be at offset 0x8BC");
		static_assert(offsetof(CS2::server::CBaseDoor, m_NoiseMoving) == 0x8C0, "m_NoiseMoving in CBaseDoor should be at offset 0x8C0");
		static_assert(offsetof(CS2::server::CBaseDoor, m_NoiseArrived) == 0x8C8, "m_NoiseArrived in CBaseDoor should be at offset 0x8C8");
		static_assert(offsetof(CS2::server::CBaseDoor, m_NoiseMovingClosed) == 0x8D0, "m_NoiseMovingClosed in CBaseDoor should be at offset 0x8D0");
		static_assert(offsetof(CS2::server::CBaseDoor, m_NoiseArrivedClosed) == 0x8D8, "m_NoiseArrivedClosed in CBaseDoor should be at offset 0x8D8");
		static_assert(offsetof(CS2::server::CBaseDoor, m_ChainTarget) == 0x8E0, "m_ChainTarget in CBaseDoor should be at offset 0x8E0");
		static_assert(offsetof(CS2::server::CBaseDoor, m_OnBlockedClosing) == 0x8E8, "m_OnBlockedClosing in CBaseDoor should be at offset 0x8E8");
		static_assert(offsetof(CS2::server::CBaseDoor, m_OnBlockedOpening) == 0x910, "m_OnBlockedOpening in CBaseDoor should be at offset 0x910");
		static_assert(offsetof(CS2::server::CBaseDoor, m_OnUnblockedClosing) == 0x938, "m_OnUnblockedClosing in CBaseDoor should be at offset 0x938");
		static_assert(offsetof(CS2::server::CBaseDoor, m_OnUnblockedOpening) == 0x960, "m_OnUnblockedOpening in CBaseDoor should be at offset 0x960");
		static_assert(offsetof(CS2::server::CBaseDoor, m_OnFullyClosed) == 0x988, "m_OnFullyClosed in CBaseDoor should be at offset 0x988");
		static_assert(offsetof(CS2::server::CBaseDoor, m_OnFullyOpen) == 0x9B0, "m_OnFullyOpen in CBaseDoor should be at offset 0x9B0");
		static_assert(offsetof(CS2::server::CBaseDoor, m_OnClose) == 0x9D8, "m_OnClose in CBaseDoor should be at offset 0x9D8");
		static_assert(offsetof(CS2::server::CBaseDoor, m_OnOpen) == 0xA00, "m_OnOpen in CBaseDoor should be at offset 0xA00");
		static_assert(offsetof(CS2::server::CBaseDoor, m_OnLockedUse) == 0xA28, "m_OnLockedUse in CBaseDoor should be at offset 0xA28");
		static_assert(offsetof(CS2::server::CBaseDoor, m_bLoopMoveSound) == 0xA50, "m_bLoopMoveSound in CBaseDoor should be at offset 0xA50");
		static_assert(offsetof(CS2::server::CBaseDoor, m_bCreateNavObstacle) == 0xA70, "m_bCreateNavObstacle in CBaseDoor should be at offset 0xA70");
		static_assert(offsetof(CS2::server::CBaseDoor, m_isChaining) == 0xA71, "m_isChaining in CBaseDoor should be at offset 0xA71");
		static_assert(offsetof(CS2::server::CBaseDoor, m_bIsUsable) == 0xA72, "m_bIsUsable in CBaseDoor should be at offset 0xA72");
		static_assert(sizeof(CS2::server::CBaseDoor) == 0xA78, "CBaseDoor size should be 0xA78");
	}
}
