// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#ifndef CUSTOM_GLOBAL_TYPES
	#include "../GlobalTypes.hpp"
#else
	#include <Custom/GlobalTypes.hpp>
#endif


#include "CBaseToggle.hpp"
#include "locksound_t.hpp"
#include "../entity2/GameTime_t.hpp"
#include "../entity2/CEntityIOOutput.hpp"



namespace CS2 {
	namespace server {
		class CBaseModelEntity;
	}
}


using namespace GlobalTypes;
namespace CS2 {
	namespace server {
		class CBaseButton : public CS2::server::CBaseToggle {
		public:
			GlobalTypes::QAngle m_angMoveEntitySpace; // 0x7b0 | Schema_Atomic | Size: 0xc
			bool m_fStayPushed; // 0x7bc | Schema_Builtin | Size: 0x1
			bool m_fRotating; // 0x7bd | Schema_Builtin | Size: 0x1
			S2_PAD(0x2);
			server::locksound_t m_ls; // 0x7c0 | Schema_DeclaredClass | Size: 0x20
			GlobalTypes::CUtlSymbolLarge m_sUseSound; // 0x7e0 | Schema_Atomic | Size: 0x8
			GlobalTypes::CUtlSymbolLarge m_sLockedSound; // 0x7e8 | Schema_Atomic | Size: 0x8
			GlobalTypes::CUtlSymbolLarge m_sUnlockedSound; // 0x7f0 | Schema_Atomic | Size: 0x8
			GlobalTypes::CUtlSymbolLarge m_sOverrideAnticipationName; // 0x7f8 | Schema_Atomic | Size: 0x8
			bool m_bLocked; // 0x800 | Schema_Builtin | Size: 0x1
			bool m_bDisabled; // 0x801 | Schema_Builtin | Size: 0x1
			S2_PAD(0x2);
			entity2::GameTime_t m_flUseLockedTime; // 0x804 | Schema_DeclaredClass | Size: 0x4
			bool m_bSolidBsp; // 0x808 | Schema_Builtin | Size: 0x1
			S2_PAD(0x7);
			entity2::CEntityIOOutput m_OnDamaged; // 0x810 | Schema_DeclaredClass | Size: 0x18
			entity2::CEntityIOOutput m_OnPressed; // 0x828 | Schema_DeclaredClass | Size: 0x18
			entity2::CEntityIOOutput m_OnUseLocked; // 0x840 | Schema_DeclaredClass | Size: 0x18
			entity2::CEntityIOOutput m_OnIn; // 0x858 | Schema_DeclaredClass | Size: 0x18
			entity2::CEntityIOOutput m_OnOut; // 0x870 | Schema_DeclaredClass | Size: 0x18
			int32_t m_nState; // 0x888 | Schema_Builtin | Size: 0x4
			GlobalTypes::CEntityHandle m_hConstraint; // 0x88c | Schema_Atomic | Size: 0x4
			GlobalTypes::CEntityHandle m_hConstraintParent; // 0x890 | Schema_Atomic | Size: 0x4
			bool m_bForceNpcExclude; // 0x894 | Schema_Builtin | Size: 0x1
			S2_PAD(0x3);
			GlobalTypes::CUtlSymbolLarge m_sGlowEntity; // 0x898 | Schema_Atomic | Size: 0x8
			GlobalTypes::CHandle<server::CBaseModelEntity> m_glowEntity; // 0x8a0 | Schema_Atomic | Size: 0x4
			// char m_glowEntity[0x4]; // 0x8a0 | Schema_Atomic | Size: 0x4
			bool m_usable; // 0x8a4 | Schema_Builtin | Size: 0x1
			S2_PAD(0x3);
			GlobalTypes::CUtlSymbolLarge m_szDisplayText; // 0x8a8 | Schema_Atomic | Size: 0x8
		};
#ifdef USE_STATIC_ASSERTS
		static_assert(offsetof(CS2::server::CBaseButton, m_angMoveEntitySpace) == 0x7B0, "m_angMoveEntitySpace in CBaseButton should be at offset 0x7B0");
		static_assert(offsetof(CS2::server::CBaseButton, m_fStayPushed) == 0x7BC, "m_fStayPushed in CBaseButton should be at offset 0x7BC");
		static_assert(offsetof(CS2::server::CBaseButton, m_fRotating) == 0x7BD, "m_fRotating in CBaseButton should be at offset 0x7BD");
		static_assert(offsetof(CS2::server::CBaseButton, m_ls) == 0x7C0, "m_ls in CBaseButton should be at offset 0x7C0");
		static_assert(offsetof(CS2::server::CBaseButton, m_sUseSound) == 0x7E0, "m_sUseSound in CBaseButton should be at offset 0x7E0");
		static_assert(offsetof(CS2::server::CBaseButton, m_sLockedSound) == 0x7E8, "m_sLockedSound in CBaseButton should be at offset 0x7E8");
		static_assert(offsetof(CS2::server::CBaseButton, m_sUnlockedSound) == 0x7F0, "m_sUnlockedSound in CBaseButton should be at offset 0x7F0");
		static_assert(offsetof(CS2::server::CBaseButton, m_sOverrideAnticipationName) == 0x7F8, "m_sOverrideAnticipationName in CBaseButton should be at offset 0x7F8");
		static_assert(offsetof(CS2::server::CBaseButton, m_bLocked) == 0x800, "m_bLocked in CBaseButton should be at offset 0x800");
		static_assert(offsetof(CS2::server::CBaseButton, m_bDisabled) == 0x801, "m_bDisabled in CBaseButton should be at offset 0x801");
		static_assert(offsetof(CS2::server::CBaseButton, m_flUseLockedTime) == 0x804, "m_flUseLockedTime in CBaseButton should be at offset 0x804");
		static_assert(offsetof(CS2::server::CBaseButton, m_bSolidBsp) == 0x808, "m_bSolidBsp in CBaseButton should be at offset 0x808");
		static_assert(offsetof(CS2::server::CBaseButton, m_OnDamaged) == 0x810, "m_OnDamaged in CBaseButton should be at offset 0x810");
		static_assert(offsetof(CS2::server::CBaseButton, m_OnPressed) == 0x828, "m_OnPressed in CBaseButton should be at offset 0x828");
		static_assert(offsetof(CS2::server::CBaseButton, m_OnUseLocked) == 0x840, "m_OnUseLocked in CBaseButton should be at offset 0x840");
		static_assert(offsetof(CS2::server::CBaseButton, m_OnIn) == 0x858, "m_OnIn in CBaseButton should be at offset 0x858");
		static_assert(offsetof(CS2::server::CBaseButton, m_OnOut) == 0x870, "m_OnOut in CBaseButton should be at offset 0x870");
		static_assert(offsetof(CS2::server::CBaseButton, m_nState) == 0x888, "m_nState in CBaseButton should be at offset 0x888");
		static_assert(offsetof(CS2::server::CBaseButton, m_hConstraint) == 0x88C, "m_hConstraint in CBaseButton should be at offset 0x88C");
		static_assert(offsetof(CS2::server::CBaseButton, m_hConstraintParent) == 0x890, "m_hConstraintParent in CBaseButton should be at offset 0x890");
		static_assert(offsetof(CS2::server::CBaseButton, m_bForceNpcExclude) == 0x894, "m_bForceNpcExclude in CBaseButton should be at offset 0x894");
		static_assert(offsetof(CS2::server::CBaseButton, m_sGlowEntity) == 0x898, "m_sGlowEntity in CBaseButton should be at offset 0x898");
		static_assert(offsetof(CS2::server::CBaseButton, m_glowEntity) == 0x8A0, "m_glowEntity in CBaseButton should be at offset 0x8A0");
		static_assert(offsetof(CS2::server::CBaseButton, m_usable) == 0x8A4, "m_usable in CBaseButton should be at offset 0x8A4");
		static_assert(offsetof(CS2::server::CBaseButton, m_szDisplayText) == 0x8A8, "m_szDisplayText in CBaseButton should be at offset 0x8A8");
		static_assert(sizeof(CS2::server::CBaseButton) == 0x8B0, "CBaseButton size should be 0x8B0");

#endif
	}
}
