// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#ifndef CUSTOM_GLOBAL_TYPES
	#include "../GlobalTypes.hpp"
#else
	#include <Custom/GlobalTypes.hpp>
#endif


#include "CEconEntity.hpp"
#include "../entity2/GameTick_t.hpp"
#include "../entity2/CEntityIOOutput.hpp"





using namespace GlobalTypes;
namespace CS2 {
	namespace server {
		class CBasePlayerWeapon : public CS2::server::CEconEntity {
		public:
			entity2::GameTick_t m_nNextPrimaryAttackTick; // 0xde0 | Schema_DeclaredClass | Size: 0x4
			float32 m_flNextPrimaryAttackTickRatio; // 0xde4 | Schema_Builtin | Size: 0x4
			entity2::GameTick_t m_nNextSecondaryAttackTick; // 0xde8 | Schema_DeclaredClass | Size: 0x4
			float32 m_flNextSecondaryAttackTickRatio; // 0xdec | Schema_Builtin | Size: 0x4
			int32_t m_iClip1; // 0xdf0 | Schema_Builtin | Size: 0x4
			int32_t m_iClip2; // 0xdf4 | Schema_Builtin | Size: 0x4
			int32_t m_pReserveAmmo[2]; // 0xdf8 | Schema_FixedArray | Size: 0x8
			entity2::CEntityIOOutput m_OnPlayerUse; // 0xe00 | Schema_DeclaredClass | Size: 0x18
			S2_PAD(0x8); // End padding
		};
#ifdef USE_STATIC_ASSERTS
		static_assert(offsetof(CS2::server::CBasePlayerWeapon, m_nNextPrimaryAttackTick) == 0xDE0, "m_nNextPrimaryAttackTick in CBasePlayerWeapon should be at offset 0xDE0");
		static_assert(offsetof(CS2::server::CBasePlayerWeapon, m_flNextPrimaryAttackTickRatio) == 0xDE4, "m_flNextPrimaryAttackTickRatio in CBasePlayerWeapon should be at offset 0xDE4");
		static_assert(offsetof(CS2::server::CBasePlayerWeapon, m_nNextSecondaryAttackTick) == 0xDE8, "m_nNextSecondaryAttackTick in CBasePlayerWeapon should be at offset 0xDE8");
		static_assert(offsetof(CS2::server::CBasePlayerWeapon, m_flNextSecondaryAttackTickRatio) == 0xDEC, "m_flNextSecondaryAttackTickRatio in CBasePlayerWeapon should be at offset 0xDEC");
		static_assert(offsetof(CS2::server::CBasePlayerWeapon, m_iClip1) == 0xDF0, "m_iClip1 in CBasePlayerWeapon should be at offset 0xDF0");
		static_assert(offsetof(CS2::server::CBasePlayerWeapon, m_iClip2) == 0xDF4, "m_iClip2 in CBasePlayerWeapon should be at offset 0xDF4");
		static_assert(offsetof(CS2::server::CBasePlayerWeapon, m_pReserveAmmo) == 0xDF8, "m_pReserveAmmo in CBasePlayerWeapon should be at offset 0xDF8");
		static_assert(offsetof(CS2::server::CBasePlayerWeapon, m_OnPlayerUse) == 0xE00, "m_OnPlayerUse in CBasePlayerWeapon should be at offset 0xE00");
		static_assert(sizeof(CS2::server::CBasePlayerWeapon) == 0xE20, "CBasePlayerWeapon size should be 0xE20");

#endif
	}
}
