// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#ifndef CUSTOM_GLOBAL_TYPES
	#include <SDK/GlobalTypes.hpp>
#else
	#include <Custom/GlobalTypes.hpp>
#endif


#include <SDK/server/CBaseModelEntity.hpp>
#include <SDK/server/TOGGLE_STATE.hpp>



namespace CS2 {
	namespace server {
		class CBaseEntity;
	}
}


using namespace GlobalTypes;
namespace CS2 {
	namespace server {
		class CBaseToggle : public CS2::server::CBaseModelEntity {
		public:
			server::TOGGLE_STATE m_toggle_state; // 0x730 | Schema_DeclaredEnum | Size: 0x4
			float32 m_flMoveDistance; // 0x734 | Schema_Builtin | Size: 0x4
			float32 m_flWait; // 0x738 | Schema_Builtin | Size: 0x4
			float32 m_flLip; // 0x73c | Schema_Builtin | Size: 0x4
			bool m_bAlwaysFireBlockedOutputs; // 0x740 | Schema_Builtin | Size: 0x1
			S2_PAD(0x3);
			GlobalTypes::Vector m_vecPosition1; // 0x744 | Schema_Atomic | Size: 0xc
			GlobalTypes::Vector m_vecPosition2; // 0x750 | Schema_Atomic | Size: 0xc
			GlobalTypes::QAngle m_vecMoveAng; // 0x75c | Schema_Atomic | Size: 0xc
			GlobalTypes::QAngle m_vecAngle1; // 0x768 | Schema_Atomic | Size: 0xc
			GlobalTypes::QAngle m_vecAngle2; // 0x774 | Schema_Atomic | Size: 0xc
			float32 m_flHeight; // 0x780 | Schema_Builtin | Size: 0x4
			GlobalTypes::CHandle<server::CBaseEntity> m_hActivator; // 0x784 | Schema_Atomic | Size: 0x4
			// char m_hActivator[0x4]; // 0x784 | Schema_Atomic | Size: 0x4
			GlobalTypes::Vector m_vecFinalDest; // 0x788 | Schema_Atomic | Size: 0xc
			GlobalTypes::QAngle m_vecFinalAngle; // 0x794 | Schema_Atomic | Size: 0xc
			int32_t m_movementType; // 0x7a0 | Schema_Builtin | Size: 0x4
			S2_PAD(0x4);
			GlobalTypes::CUtlSymbolLarge m_sMaster; // 0x7a8 | Schema_Atomic | Size: 0x8
		};
		static_assert(offsetof(CS2::server::CBaseToggle, m_toggle_state) == 0x730, "m_toggle_state in CBaseToggle should be at offset 0x730");
		static_assert(offsetof(CS2::server::CBaseToggle, m_flMoveDistance) == 0x734, "m_flMoveDistance in CBaseToggle should be at offset 0x734");
		static_assert(offsetof(CS2::server::CBaseToggle, m_flWait) == 0x738, "m_flWait in CBaseToggle should be at offset 0x738");
		static_assert(offsetof(CS2::server::CBaseToggle, m_flLip) == 0x73C, "m_flLip in CBaseToggle should be at offset 0x73C");
		static_assert(offsetof(CS2::server::CBaseToggle, m_bAlwaysFireBlockedOutputs) == 0x740, "m_bAlwaysFireBlockedOutputs in CBaseToggle should be at offset 0x740");
		static_assert(offsetof(CS2::server::CBaseToggle, m_vecPosition1) == 0x744, "m_vecPosition1 in CBaseToggle should be at offset 0x744");
		static_assert(offsetof(CS2::server::CBaseToggle, m_vecPosition2) == 0x750, "m_vecPosition2 in CBaseToggle should be at offset 0x750");
		static_assert(offsetof(CS2::server::CBaseToggle, m_vecMoveAng) == 0x75C, "m_vecMoveAng in CBaseToggle should be at offset 0x75C");
		static_assert(offsetof(CS2::server::CBaseToggle, m_vecAngle1) == 0x768, "m_vecAngle1 in CBaseToggle should be at offset 0x768");
		static_assert(offsetof(CS2::server::CBaseToggle, m_vecAngle2) == 0x774, "m_vecAngle2 in CBaseToggle should be at offset 0x774");
		static_assert(offsetof(CS2::server::CBaseToggle, m_flHeight) == 0x780, "m_flHeight in CBaseToggle should be at offset 0x780");
		static_assert(offsetof(CS2::server::CBaseToggle, m_hActivator) == 0x784, "m_hActivator in CBaseToggle should be at offset 0x784");
		static_assert(offsetof(CS2::server::CBaseToggle, m_vecFinalDest) == 0x788, "m_vecFinalDest in CBaseToggle should be at offset 0x788");
		static_assert(offsetof(CS2::server::CBaseToggle, m_vecFinalAngle) == 0x794, "m_vecFinalAngle in CBaseToggle should be at offset 0x794");
		static_assert(offsetof(CS2::server::CBaseToggle, m_movementType) == 0x7A0, "m_movementType in CBaseToggle should be at offset 0x7A0");
		static_assert(offsetof(CS2::server::CBaseToggle, m_sMaster) == 0x7A8, "m_sMaster in CBaseToggle should be at offset 0x7A8");
		static_assert(sizeof(CS2::server::CBaseToggle) == 0x7B0, "CBaseToggle size should be 0x7B0");
	}
}
