// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#include <SDK/GlobalTypes.hpp>

#include <SDK/server/CCSWeaponBase.hpp>
#include <SDK/entity2/GameTime_t.hpp>
#include <SDK/entity2/GameTick_t.hpp>



namespace CS2 {
	namespace server {
		class CBaseCSGrenade : public CS2::server::CCSWeaponBase {
		public:
			public:
			bool m_bRedraw; // 0x1030 | Schema_Builtin | Size: 0x1
			bool m_bIsHeldByPlayer; // 0x1031 | Schema_Builtin | Size: 0x1
			bool m_bPinPulled; // 0x1032 | Schema_Builtin | Size: 0x1
			bool m_bJumpThrow; // 0x1033 | Schema_Builtin | Size: 0x1
			bool m_bThrowAnimating; // 0x1034 | Schema_Builtin | Size: 0x1
			S2_PAD(0x3);
			entity2::GameTime_t m_fThrowTime; // 0x1038 | Schema_DeclaredClass | Size: 0x4
			float32 m_flThrowStrength; // 0x103c | Schema_Builtin | Size: 0x4
			entity2::GameTime_t m_fDropTime; // 0x1040 | Schema_DeclaredClass | Size: 0x4
			entity2::GameTime_t m_fPinPullTime; // 0x1044 | Schema_DeclaredClass | Size: 0x4
			bool m_bJustPulledPin; // 0x1048 | Schema_Builtin | Size: 0x1
			S2_PAD(0x3);
			entity2::GameTick_t m_nNextHoldTick; // 0x104c | Schema_DeclaredClass | Size: 0x4
			float32 m_flNextHoldFrac; // 0x1050 | Schema_Builtin | Size: 0x4
			// server::CHandle< server::CCSWeaponBase > m_hSwitchToWeaponAfterThrow; // 0x1054 | Schema_Atomic | Size: 0x4
			char  m_hSwitchToWeaponAfterThrow[0x4]; // 0x1054 | Schema_Atomic | Size: 0x4
			S2_PAD(0x18); // End padding
		};
		static_assert(offsetof(CS2::server::CBaseCSGrenade, m_bRedraw) == 0x1030, "m_bRedraw in CBaseCSGrenade should be at offset 0x1030");
		static_assert(offsetof(CS2::server::CBaseCSGrenade, m_bIsHeldByPlayer) == 0x1031, "m_bIsHeldByPlayer in CBaseCSGrenade should be at offset 0x1031");
		static_assert(offsetof(CS2::server::CBaseCSGrenade, m_bPinPulled) == 0x1032, "m_bPinPulled in CBaseCSGrenade should be at offset 0x1032");
		static_assert(offsetof(CS2::server::CBaseCSGrenade, m_bJumpThrow) == 0x1033, "m_bJumpThrow in CBaseCSGrenade should be at offset 0x1033");
		static_assert(offsetof(CS2::server::CBaseCSGrenade, m_bThrowAnimating) == 0x1034, "m_bThrowAnimating in CBaseCSGrenade should be at offset 0x1034");
		static_assert(offsetof(CS2::server::CBaseCSGrenade, m_fThrowTime) == 0x1038, "m_fThrowTime in CBaseCSGrenade should be at offset 0x1038");
		static_assert(offsetof(CS2::server::CBaseCSGrenade, m_flThrowStrength) == 0x103C, "m_flThrowStrength in CBaseCSGrenade should be at offset 0x103C");
		static_assert(offsetof(CS2::server::CBaseCSGrenade, m_fDropTime) == 0x1040, "m_fDropTime in CBaseCSGrenade should be at offset 0x1040");
		static_assert(offsetof(CS2::server::CBaseCSGrenade, m_fPinPullTime) == 0x1044, "m_fPinPullTime in CBaseCSGrenade should be at offset 0x1044");
		static_assert(offsetof(CS2::server::CBaseCSGrenade, m_bJustPulledPin) == 0x1048, "m_bJustPulledPin in CBaseCSGrenade should be at offset 0x1048");
		static_assert(offsetof(CS2::server::CBaseCSGrenade, m_nNextHoldTick) == 0x104C, "m_nNextHoldTick in CBaseCSGrenade should be at offset 0x104C");
		static_assert(offsetof(CS2::server::CBaseCSGrenade, m_flNextHoldFrac) == 0x1050, "m_flNextHoldFrac in CBaseCSGrenade should be at offset 0x1050");
		static_assert(offsetof(CS2::server::CBaseCSGrenade, m_hSwitchToWeaponAfterThrow) == 0x1054, "m_hSwitchToWeaponAfterThrow in CBaseCSGrenade should be at offset 0x1054");
		static_assert(sizeof(CS2::server::CBaseCSGrenade) == 0x1070, "CBaseCSGrenade size should be 0x1070");
	}
}
