// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#ifndef CUSTOM_GLOBAL_TYPES
	#include "../GlobalTypes.hpp"
#else
	#include "../Custom/GlobalTypes.hpp"
#endif


#include "../entity2/CEntityInstance.hpp"
#include "../client/CNetworkTransmitComponent.hpp"
#include "../client/thinkfunc_t.hpp"
#include "../entity2/GameTick_t.hpp"
#include "ResponseContext_t.hpp"
#include "../client/TakeDamageFlags_t.hpp"
#include "../client/EntityPlatformTypes_t.hpp"
#include "../client/MoveCollide_t.hpp"
#include "../client/MoveType_t.hpp"
#include "../entity2/GameTime_t.hpp"
#include "../entity2/CEntityIOOutput.hpp"
#include "../client/CNetworkVelocityVector.hpp"
#include "../client/BloodType.hpp"



namespace CS2 {
	namespace server {
		class CBodyComponent;
		class CBaseFilter;
		class CCollisionProperty;
		class CPulseGraphInstance_ServerEntity;
	}
}


using namespace GlobalTypes;
namespace CS2 {
	namespace server {
		class CBaseEntity : public CS2::entity2::CEntityInstance {
		public:
			server::CBodyComponent* m_CBodyComponent; // 0x38 | Schema_Ptr | Size: 0x8
			client::CNetworkTransmitComponent m_NetworkTransmitComponent; // 0x40 | Schema_DeclaredClass | Size: 0x1d0
			S2_PAD(0x40);
			GlobalTypes::CUtlVector<client::thinkfunc_t> m_aThinkFunctions; // 0x250 | Schema_Atomic | Size: 0x18
			// char m_aThinkFunctions[0x18]; // 0x250 | Schema_Atomic | Size: 0x18
			int32_t m_iCurrentThinkContext; // 0x268 | Schema_Builtin | Size: 0x4
			entity2::GameTick_t m_nLastThinkTick; // 0x26c | Schema_DeclaredClass | Size: 0x4
			bool m_bDisabledContextThinks; // 0x270 | Schema_Builtin | Size: 0x1
			S2_PAD(0xf);
			// GlobalTypes::CTypedBitVec< 64 > m_isSteadyState; // 0x280 | Schema_Atomic | Size: 0x8
			char m_isSteadyState[0x8]; // 0x280 | Schema_Atomic | Size: 0x8
			float32 m_lastNetworkChange; // 0x288 | Schema_Builtin | Size: 0x4
			S2_PAD(0xc);
			GlobalTypes::CUtlVector<server::ResponseContext_t> m_ResponseContexts; // 0x298 | Schema_Atomic | Size: 0x18
			// char m_ResponseContexts[0x18]; // 0x298 | Schema_Atomic | Size: 0x18
			GlobalTypes::CUtlSymbolLarge m_iszResponseContext; // 0x2b0 | Schema_Atomic | Size: 0x8
			S2_PAD(0x20);
			int32_t m_iHealth; // 0x2d8 | Schema_Builtin | Size: 0x4
			int32_t m_iMaxHealth; // 0x2dc | Schema_Builtin | Size: 0x4
			uint8_t m_lifeState; // 0x2e0 | Schema_Builtin | Size: 0x1
			S2_PAD(0x3);
			float32 m_flDamageAccumulator; // 0x2e4 | Schema_Builtin | Size: 0x4
			bool m_bTakesDamage; // 0x2e8 | Schema_Builtin | Size: 0x1
			S2_PAD(0x7);
			client::TakeDamageFlags_t m_nTakeDamageFlags; // 0x2f0 | Schema_DeclaredEnum | Size: 0x8
			client::EntityPlatformTypes_t m_nPlatformType; // 0x2f8 | Schema_DeclaredEnum | Size: 0x1
			S2_PAD(0x1);
			client::MoveCollide_t m_MoveCollide; // 0x2fa | Schema_DeclaredEnum | Size: 0x1
			client::MoveType_t m_MoveType; // 0x2fb | Schema_DeclaredEnum | Size: 0x1
			client::MoveType_t m_nActualMoveType; // 0x2fc | Schema_DeclaredEnum | Size: 0x1
			uint8_t m_nWaterTouch; // 0x2fd | Schema_Builtin | Size: 0x1
			uint8_t m_nSlimeTouch; // 0x2fe | Schema_Builtin | Size: 0x1
			bool m_bRestoreInHierarchy; // 0x2ff | Schema_Builtin | Size: 0x1
			GlobalTypes::CUtlSymbolLarge m_target; // 0x300 | Schema_Atomic | Size: 0x8
			GlobalTypes::CHandle<server::CBaseFilter> m_hDamageFilter; // 0x308 | Schema_Atomic | Size: 0x4
			// char m_hDamageFilter[0x4]; // 0x308 | Schema_Atomic | Size: 0x4
			S2_PAD(0x4);
			GlobalTypes::CUtlSymbolLarge m_iszDamageFilterName; // 0x310 | Schema_Atomic | Size: 0x8
			float32 m_flMoveDoneTime; // 0x318 | Schema_Builtin | Size: 0x4
			GlobalTypes::CUtlStringToken m_nSubclassID; // 0x31c | Schema_Atomic | Size: 0x4
			S2_PAD(0x8);
			float32 m_flAnimTime; // 0x328 | Schema_Builtin | Size: 0x4
			float32 m_flSimulationTime; // 0x32c | Schema_Builtin | Size: 0x4
			entity2::GameTime_t m_flCreateTime; // 0x330 | Schema_DeclaredClass | Size: 0x4
			bool m_bClientSideRagdoll; // 0x334 | Schema_Builtin | Size: 0x1
			uint8_t m_ubInterpolationFrame; // 0x335 | Schema_Builtin | Size: 0x1
			S2_PAD(0x2);
			GlobalTypes::Vector m_vPrevVPhysicsUpdatePos; // 0x338 | Schema_Atomic | Size: 0xc
			uint8_t m_iTeamNum; // 0x344 | Schema_Builtin | Size: 0x1
			S2_PAD(0x3);
			GlobalTypes::CUtlSymbolLarge m_iGlobalname; // 0x348 | Schema_Atomic | Size: 0x8
			int32_t m_iSentToClients; // 0x350 | Schema_Builtin | Size: 0x4
			float32 m_flSpeed; // 0x354 | Schema_Builtin | Size: 0x4
			GlobalTypes::CUtlString m_sUniqueHammerID; // 0x358 | Schema_Atomic | Size: 0x8
			uint32_t m_spawnflags; // 0x360 | Schema_Builtin | Size: 0x4
			entity2::GameTick_t m_nNextThinkTick; // 0x364 | Schema_DeclaredClass | Size: 0x4
			int32_t m_nSimulationTick; // 0x368 | Schema_Builtin | Size: 0x4
			S2_PAD(0x4);
			entity2::CEntityIOOutput m_OnKilled; // 0x370 | Schema_DeclaredClass | Size: 0x18
			uint32_t m_fFlags; // 0x388 | Schema_Builtin | Size: 0x4
			GlobalTypes::Vector m_vecAbsVelocity; // 0x38c | Schema_Atomic | Size: 0xc
			client::CNetworkVelocityVector m_vecVelocity; // 0x398 | Schema_DeclaredClass | Size: 0x28
			S2_PAD(0x8);
			GlobalTypes::Vector m_vecBaseVelocity; // 0x3c8 | Schema_Atomic | Size: 0xc
			int32_t m_nPushEnumCount; // 0x3d4 | Schema_Builtin | Size: 0x4
			server::CCollisionProperty* m_pCollision; // 0x3d8 | Schema_Ptr | Size: 0x8
			GlobalTypes::CHandle<server::CBaseEntity> m_hEffectEntity; // 0x3e0 | Schema_Atomic | Size: 0x4
			// char m_hEffectEntity[0x4]; // 0x3e0 | Schema_Atomic | Size: 0x4
			GlobalTypes::CHandle<server::CBaseEntity> m_hOwnerEntity; // 0x3e4 | Schema_Atomic | Size: 0x4
			// char m_hOwnerEntity[0x4]; // 0x3e4 | Schema_Atomic | Size: 0x4
			uint32_t m_fEffects; // 0x3e8 | Schema_Builtin | Size: 0x4
			GlobalTypes::CHandle<server::CBaseEntity> m_hGroundEntity; // 0x3ec | Schema_Atomic | Size: 0x4
			// char m_hGroundEntity[0x4]; // 0x3ec | Schema_Atomic | Size: 0x4
			int32_t m_nGroundBodyIndex; // 0x3f0 | Schema_Builtin | Size: 0x4
			float32 m_flFriction; // 0x3f4 | Schema_Builtin | Size: 0x4
			float32 m_flElasticity; // 0x3f8 | Schema_Builtin | Size: 0x4
			float32 m_flGravityScale; // 0x3fc | Schema_Builtin | Size: 0x4
			float32 m_flTimeScale; // 0x400 | Schema_Builtin | Size: 0x4
			float32 m_flWaterLevel; // 0x404 | Schema_Builtin | Size: 0x4
			bool m_bGravityDisabled; // 0x408 | Schema_Builtin | Size: 0x1
			bool m_bAnimatedEveryTick; // 0x409 | Schema_Builtin | Size: 0x1
			S2_PAD(0x2);
			float32 m_flActualGravityScale; // 0x40c | Schema_Builtin | Size: 0x4
			bool m_bGravityActuallyDisabled; // 0x410 | Schema_Builtin | Size: 0x1
			bool m_bDisableLowViolence; // 0x411 | Schema_Builtin | Size: 0x1
			uint8_t m_nWaterType; // 0x412 | Schema_Builtin | Size: 0x1
			S2_PAD(0x1);
			int32_t m_iEFlags; // 0x414 | Schema_Builtin | Size: 0x4
			entity2::CEntityIOOutput m_OnUser1; // 0x418 | Schema_DeclaredClass | Size: 0x18
			entity2::CEntityIOOutput m_OnUser2; // 0x430 | Schema_DeclaredClass | Size: 0x18
			entity2::CEntityIOOutput m_OnUser3; // 0x448 | Schema_DeclaredClass | Size: 0x18
			entity2::CEntityIOOutput m_OnUser4; // 0x460 | Schema_DeclaredClass | Size: 0x18
			int32_t m_iInitialTeamNum; // 0x478 | Schema_Builtin | Size: 0x4
			entity2::GameTime_t m_flNavIgnoreUntilTime; // 0x47c | Schema_DeclaredClass | Size: 0x4
			GlobalTypes::QAngle m_vecAngVelocity; // 0x480 | Schema_Atomic | Size: 0xc
			bool m_bNetworkQuantizeOriginAndAngles; // 0x48c | Schema_Builtin | Size: 0x1
			bool m_bLagCompensate; // 0x48d | Schema_Builtin | Size: 0x1
			S2_PAD(0x2);
			GlobalTypes::CHandle<server::CBaseEntity> m_pBlocker; // 0x490 | Schema_Atomic | Size: 0x4
			// char m_pBlocker[0x4]; // 0x490 | Schema_Atomic | Size: 0x4
			float32 m_flLocalTime; // 0x494 | Schema_Builtin | Size: 0x4
			float32 m_flVPhysicsUpdateLocalTime; // 0x498 | Schema_Builtin | Size: 0x4
			client::BloodType m_nBloodType; // 0x49c | Schema_DeclaredEnum | Size: 0x4
			server::CPulseGraphInstance_ServerEntity* m_pPulseGraphInstance; // 0x4a0 | Schema_Ptr | Size: 0x8
		};
#ifdef USE_STATIC_ASSERTS
		static_assert(offsetof(CS2::server::CBaseEntity, m_CBodyComponent) == 0x38, "m_CBodyComponent in CBaseEntity should be at offset 0x38");
		static_assert(offsetof(CS2::server::CBaseEntity, m_NetworkTransmitComponent) == 0x40, "m_NetworkTransmitComponent in CBaseEntity should be at offset 0x40");
		static_assert(offsetof(CS2::server::CBaseEntity, m_aThinkFunctions) == 0x250, "m_aThinkFunctions in CBaseEntity should be at offset 0x250");
		static_assert(offsetof(CS2::server::CBaseEntity, m_iCurrentThinkContext) == 0x268, "m_iCurrentThinkContext in CBaseEntity should be at offset 0x268");
		static_assert(offsetof(CS2::server::CBaseEntity, m_nLastThinkTick) == 0x26C, "m_nLastThinkTick in CBaseEntity should be at offset 0x26C");
		static_assert(offsetof(CS2::server::CBaseEntity, m_bDisabledContextThinks) == 0x270, "m_bDisabledContextThinks in CBaseEntity should be at offset 0x270");
		static_assert(offsetof(CS2::server::CBaseEntity, m_isSteadyState) == 0x280, "m_isSteadyState in CBaseEntity should be at offset 0x280");
		static_assert(offsetof(CS2::server::CBaseEntity, m_lastNetworkChange) == 0x288, "m_lastNetworkChange in CBaseEntity should be at offset 0x288");
		static_assert(offsetof(CS2::server::CBaseEntity, m_ResponseContexts) == 0x298, "m_ResponseContexts in CBaseEntity should be at offset 0x298");
		static_assert(offsetof(CS2::server::CBaseEntity, m_iszResponseContext) == 0x2B0, "m_iszResponseContext in CBaseEntity should be at offset 0x2B0");
		static_assert(offsetof(CS2::server::CBaseEntity, m_iHealth) == 0x2D8, "m_iHealth in CBaseEntity should be at offset 0x2D8");
		static_assert(offsetof(CS2::server::CBaseEntity, m_iMaxHealth) == 0x2DC, "m_iMaxHealth in CBaseEntity should be at offset 0x2DC");
		static_assert(offsetof(CS2::server::CBaseEntity, m_lifeState) == 0x2E0, "m_lifeState in CBaseEntity should be at offset 0x2E0");
		static_assert(offsetof(CS2::server::CBaseEntity, m_flDamageAccumulator) == 0x2E4, "m_flDamageAccumulator in CBaseEntity should be at offset 0x2E4");
		static_assert(offsetof(CS2::server::CBaseEntity, m_bTakesDamage) == 0x2E8, "m_bTakesDamage in CBaseEntity should be at offset 0x2E8");
		static_assert(offsetof(CS2::server::CBaseEntity, m_nTakeDamageFlags) == 0x2F0, "m_nTakeDamageFlags in CBaseEntity should be at offset 0x2F0");
		static_assert(offsetof(CS2::server::CBaseEntity, m_nPlatformType) == 0x2F8, "m_nPlatformType in CBaseEntity should be at offset 0x2F8");
		static_assert(offsetof(CS2::server::CBaseEntity, m_MoveCollide) == 0x2FA, "m_MoveCollide in CBaseEntity should be at offset 0x2FA");
		static_assert(offsetof(CS2::server::CBaseEntity, m_MoveType) == 0x2FB, "m_MoveType in CBaseEntity should be at offset 0x2FB");
		static_assert(offsetof(CS2::server::CBaseEntity, m_nActualMoveType) == 0x2FC, "m_nActualMoveType in CBaseEntity should be at offset 0x2FC");
		static_assert(offsetof(CS2::server::CBaseEntity, m_nWaterTouch) == 0x2FD, "m_nWaterTouch in CBaseEntity should be at offset 0x2FD");
		static_assert(offsetof(CS2::server::CBaseEntity, m_nSlimeTouch) == 0x2FE, "m_nSlimeTouch in CBaseEntity should be at offset 0x2FE");
		static_assert(offsetof(CS2::server::CBaseEntity, m_bRestoreInHierarchy) == 0x2FF, "m_bRestoreInHierarchy in CBaseEntity should be at offset 0x2FF");
		static_assert(offsetof(CS2::server::CBaseEntity, m_target) == 0x300, "m_target in CBaseEntity should be at offset 0x300");
		static_assert(offsetof(CS2::server::CBaseEntity, m_hDamageFilter) == 0x308, "m_hDamageFilter in CBaseEntity should be at offset 0x308");
		static_assert(offsetof(CS2::server::CBaseEntity, m_iszDamageFilterName) == 0x310, "m_iszDamageFilterName in CBaseEntity should be at offset 0x310");
		static_assert(offsetof(CS2::server::CBaseEntity, m_flMoveDoneTime) == 0x318, "m_flMoveDoneTime in CBaseEntity should be at offset 0x318");
		static_assert(offsetof(CS2::server::CBaseEntity, m_nSubclassID) == 0x31C, "m_nSubclassID in CBaseEntity should be at offset 0x31C");
		static_assert(offsetof(CS2::server::CBaseEntity, m_flAnimTime) == 0x328, "m_flAnimTime in CBaseEntity should be at offset 0x328");
		static_assert(offsetof(CS2::server::CBaseEntity, m_flSimulationTime) == 0x32C, "m_flSimulationTime in CBaseEntity should be at offset 0x32C");
		static_assert(offsetof(CS2::server::CBaseEntity, m_flCreateTime) == 0x330, "m_flCreateTime in CBaseEntity should be at offset 0x330");
		static_assert(offsetof(CS2::server::CBaseEntity, m_bClientSideRagdoll) == 0x334, "m_bClientSideRagdoll in CBaseEntity should be at offset 0x334");
		static_assert(offsetof(CS2::server::CBaseEntity, m_ubInterpolationFrame) == 0x335, "m_ubInterpolationFrame in CBaseEntity should be at offset 0x335");
		static_assert(offsetof(CS2::server::CBaseEntity, m_vPrevVPhysicsUpdatePos) == 0x338, "m_vPrevVPhysicsUpdatePos in CBaseEntity should be at offset 0x338");
		static_assert(offsetof(CS2::server::CBaseEntity, m_iTeamNum) == 0x344, "m_iTeamNum in CBaseEntity should be at offset 0x344");
		static_assert(offsetof(CS2::server::CBaseEntity, m_iGlobalname) == 0x348, "m_iGlobalname in CBaseEntity should be at offset 0x348");
		static_assert(offsetof(CS2::server::CBaseEntity, m_iSentToClients) == 0x350, "m_iSentToClients in CBaseEntity should be at offset 0x350");
		static_assert(offsetof(CS2::server::CBaseEntity, m_flSpeed) == 0x354, "m_flSpeed in CBaseEntity should be at offset 0x354");
		static_assert(offsetof(CS2::server::CBaseEntity, m_sUniqueHammerID) == 0x358, "m_sUniqueHammerID in CBaseEntity should be at offset 0x358");
		static_assert(offsetof(CS2::server::CBaseEntity, m_spawnflags) == 0x360, "m_spawnflags in CBaseEntity should be at offset 0x360");
		static_assert(offsetof(CS2::server::CBaseEntity, m_nNextThinkTick) == 0x364, "m_nNextThinkTick in CBaseEntity should be at offset 0x364");
		static_assert(offsetof(CS2::server::CBaseEntity, m_nSimulationTick) == 0x368, "m_nSimulationTick in CBaseEntity should be at offset 0x368");
		static_assert(offsetof(CS2::server::CBaseEntity, m_OnKilled) == 0x370, "m_OnKilled in CBaseEntity should be at offset 0x370");
		static_assert(offsetof(CS2::server::CBaseEntity, m_fFlags) == 0x388, "m_fFlags in CBaseEntity should be at offset 0x388");
		static_assert(offsetof(CS2::server::CBaseEntity, m_vecAbsVelocity) == 0x38C, "m_vecAbsVelocity in CBaseEntity should be at offset 0x38C");
		static_assert(offsetof(CS2::server::CBaseEntity, m_vecVelocity) == 0x398, "m_vecVelocity in CBaseEntity should be at offset 0x398");
		static_assert(offsetof(CS2::server::CBaseEntity, m_vecBaseVelocity) == 0x3C8, "m_vecBaseVelocity in CBaseEntity should be at offset 0x3C8");
		static_assert(offsetof(CS2::server::CBaseEntity, m_nPushEnumCount) == 0x3D4, "m_nPushEnumCount in CBaseEntity should be at offset 0x3D4");
		static_assert(offsetof(CS2::server::CBaseEntity, m_pCollision) == 0x3D8, "m_pCollision in CBaseEntity should be at offset 0x3D8");
		static_assert(offsetof(CS2::server::CBaseEntity, m_hEffectEntity) == 0x3E0, "m_hEffectEntity in CBaseEntity should be at offset 0x3E0");
		static_assert(offsetof(CS2::server::CBaseEntity, m_hOwnerEntity) == 0x3E4, "m_hOwnerEntity in CBaseEntity should be at offset 0x3E4");
		static_assert(offsetof(CS2::server::CBaseEntity, m_fEffects) == 0x3E8, "m_fEffects in CBaseEntity should be at offset 0x3E8");
		static_assert(offsetof(CS2::server::CBaseEntity, m_hGroundEntity) == 0x3EC, "m_hGroundEntity in CBaseEntity should be at offset 0x3EC");
		static_assert(offsetof(CS2::server::CBaseEntity, m_nGroundBodyIndex) == 0x3F0, "m_nGroundBodyIndex in CBaseEntity should be at offset 0x3F0");
		static_assert(offsetof(CS2::server::CBaseEntity, m_flFriction) == 0x3F4, "m_flFriction in CBaseEntity should be at offset 0x3F4");
		static_assert(offsetof(CS2::server::CBaseEntity, m_flElasticity) == 0x3F8, "m_flElasticity in CBaseEntity should be at offset 0x3F8");
		static_assert(offsetof(CS2::server::CBaseEntity, m_flGravityScale) == 0x3FC, "m_flGravityScale in CBaseEntity should be at offset 0x3FC");
		static_assert(offsetof(CS2::server::CBaseEntity, m_flTimeScale) == 0x400, "m_flTimeScale in CBaseEntity should be at offset 0x400");
		static_assert(offsetof(CS2::server::CBaseEntity, m_flWaterLevel) == 0x404, "m_flWaterLevel in CBaseEntity should be at offset 0x404");
		static_assert(offsetof(CS2::server::CBaseEntity, m_bGravityDisabled) == 0x408, "m_bGravityDisabled in CBaseEntity should be at offset 0x408");
		static_assert(offsetof(CS2::server::CBaseEntity, m_bAnimatedEveryTick) == 0x409, "m_bAnimatedEveryTick in CBaseEntity should be at offset 0x409");
		static_assert(offsetof(CS2::server::CBaseEntity, m_flActualGravityScale) == 0x40C, "m_flActualGravityScale in CBaseEntity should be at offset 0x40C");
		static_assert(offsetof(CS2::server::CBaseEntity, m_bGravityActuallyDisabled) == 0x410, "m_bGravityActuallyDisabled in CBaseEntity should be at offset 0x410");
		static_assert(offsetof(CS2::server::CBaseEntity, m_bDisableLowViolence) == 0x411, "m_bDisableLowViolence in CBaseEntity should be at offset 0x411");
		static_assert(offsetof(CS2::server::CBaseEntity, m_nWaterType) == 0x412, "m_nWaterType in CBaseEntity should be at offset 0x412");
		static_assert(offsetof(CS2::server::CBaseEntity, m_iEFlags) == 0x414, "m_iEFlags in CBaseEntity should be at offset 0x414");
		static_assert(offsetof(CS2::server::CBaseEntity, m_OnUser1) == 0x418, "m_OnUser1 in CBaseEntity should be at offset 0x418");
		static_assert(offsetof(CS2::server::CBaseEntity, m_OnUser2) == 0x430, "m_OnUser2 in CBaseEntity should be at offset 0x430");
		static_assert(offsetof(CS2::server::CBaseEntity, m_OnUser3) == 0x448, "m_OnUser3 in CBaseEntity should be at offset 0x448");
		static_assert(offsetof(CS2::server::CBaseEntity, m_OnUser4) == 0x460, "m_OnUser4 in CBaseEntity should be at offset 0x460");
		static_assert(offsetof(CS2::server::CBaseEntity, m_iInitialTeamNum) == 0x478, "m_iInitialTeamNum in CBaseEntity should be at offset 0x478");
		static_assert(offsetof(CS2::server::CBaseEntity, m_flNavIgnoreUntilTime) == 0x47C, "m_flNavIgnoreUntilTime in CBaseEntity should be at offset 0x47C");
		static_assert(offsetof(CS2::server::CBaseEntity, m_vecAngVelocity) == 0x480, "m_vecAngVelocity in CBaseEntity should be at offset 0x480");
		static_assert(offsetof(CS2::server::CBaseEntity, m_bNetworkQuantizeOriginAndAngles) == 0x48C, "m_bNetworkQuantizeOriginAndAngles in CBaseEntity should be at offset 0x48C");
		static_assert(offsetof(CS2::server::CBaseEntity, m_bLagCompensate) == 0x48D, "m_bLagCompensate in CBaseEntity should be at offset 0x48D");
		static_assert(offsetof(CS2::server::CBaseEntity, m_pBlocker) == 0x490, "m_pBlocker in CBaseEntity should be at offset 0x490");
		static_assert(offsetof(CS2::server::CBaseEntity, m_flLocalTime) == 0x494, "m_flLocalTime in CBaseEntity should be at offset 0x494");
		static_assert(offsetof(CS2::server::CBaseEntity, m_flVPhysicsUpdateLocalTime) == 0x498, "m_flVPhysicsUpdateLocalTime in CBaseEntity should be at offset 0x498");
		static_assert(offsetof(CS2::server::CBaseEntity, m_nBloodType) == 0x49C, "m_nBloodType in CBaseEntity should be at offset 0x49C");
		static_assert(offsetof(CS2::server::CBaseEntity, m_pPulseGraphInstance) == 0x4A0, "m_pPulseGraphInstance in CBaseEntity should be at offset 0x4A0");
		static_assert(sizeof(CS2::server::CBaseEntity) == 0x4A8, "CBaseEntity size should be 0x4A8");

#endif
	}
}
