// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#include <SDK/GlobalTypes.hpp>

#include <SDK/server/CBaseFlex.hpp>
#include <SDK/client/Hull_t.hpp>
#include <SDK/server/CMovementStatsProperty.hpp>



namespace CS2 {
	namespace server {
		class CBaseCombatCharacter : public CS2::server::CBaseFlex {
		public:
			public:
			bool m_bForceServerRagdoll; // 0xb08 | Schema_Builtin | Size: 0x1
			S2_PAD(0x7);
			// server::CNetworkUtlVectorBase< server.dll::CHandle< CEconWearable > > m_hMyWearables; // 0xb10 | Schema_Atomic | Size: 0x18
			char  m_hMyWearables[0x18]; // 0xb10 | Schema_Atomic | Size: 0x18
			float32 m_impactEnergyScale; // 0xb28 | Schema_Builtin | Size: 0x4
			int32_t m_nMinVehicleDamageToTempRagdoll; // 0xb2c | Schema_Builtin | Size: 0x4
			bool m_bApplyStressDamage; // 0xb30 | Schema_Builtin | Size: 0x1
			bool m_bDeathEventsDispatched; // 0xb31 | Schema_Builtin | Size: 0x1
			S2_PAD(0x46);
			// GlobalTypes::CUtlVector< RelationshipOverride_t >* m_pVecRelationships; // 0xb78 | Schema_Ptr | Size: 0x8
			char  m_pVecRelationships[0x8]; // 0xb78 | Schema_Ptr | Size: 0x8
			GlobalTypes::CUtlSymbolLarge m_strRelationships; // 0xb80 | Schema_Atomic | Size: 0x8
			client::Hull_t m_eHull; // 0xb88 | Schema_DeclaredEnum | Size: 0x4
			uint32_t m_nNavHullIdx; // 0xb8c | Schema_Builtin | Size: 0x4
			server::CMovementStatsProperty m_movementStats; // 0xb90 | Schema_DeclaredClass | Size: 0x40
		};
		static_assert(offsetof(CS2::server::CBaseCombatCharacter, m_bForceServerRagdoll) == 0xB08, "m_bForceServerRagdoll in CBaseCombatCharacter should be at offset 0xB08");
		static_assert(offsetof(CS2::server::CBaseCombatCharacter, m_hMyWearables) == 0xB10, "m_hMyWearables in CBaseCombatCharacter should be at offset 0xB10");
		static_assert(offsetof(CS2::server::CBaseCombatCharacter, m_impactEnergyScale) == 0xB28, "m_impactEnergyScale in CBaseCombatCharacter should be at offset 0xB28");
		static_assert(offsetof(CS2::server::CBaseCombatCharacter, m_nMinVehicleDamageToTempRagdoll) == 0xB2C, "m_nMinVehicleDamageToTempRagdoll in CBaseCombatCharacter should be at offset 0xB2C");
		static_assert(offsetof(CS2::server::CBaseCombatCharacter, m_bApplyStressDamage) == 0xB30, "m_bApplyStressDamage in CBaseCombatCharacter should be at offset 0xB30");
		static_assert(offsetof(CS2::server::CBaseCombatCharacter, m_bDeathEventsDispatched) == 0xB31, "m_bDeathEventsDispatched in CBaseCombatCharacter should be at offset 0xB31");
		static_assert(offsetof(CS2::server::CBaseCombatCharacter, m_pVecRelationships) == 0xB78, "m_pVecRelationships in CBaseCombatCharacter should be at offset 0xB78");
		static_assert(offsetof(CS2::server::CBaseCombatCharacter, m_strRelationships) == 0xB80, "m_strRelationships in CBaseCombatCharacter should be at offset 0xB80");
		static_assert(offsetof(CS2::server::CBaseCombatCharacter, m_eHull) == 0xB88, "m_eHull in CBaseCombatCharacter should be at offset 0xB88");
		static_assert(offsetof(CS2::server::CBaseCombatCharacter, m_nNavHullIdx) == 0xB8C, "m_nNavHullIdx in CBaseCombatCharacter should be at offset 0xB8C");
		static_assert(offsetof(CS2::server::CBaseCombatCharacter, m_movementStats) == 0xB90, "m_movementStats in CBaseCombatCharacter should be at offset 0xB90");
		static_assert(sizeof(CS2::server::CBaseCombatCharacter) == 0xBD0, "CBaseCombatCharacter size should be 0xBD0");
	}
}
