// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#include <SDK/GlobalTypes.hpp>

#include <SDK/server/CBaseAnimGraph.hpp>
#include <SDK/entity2/GameTime_t.hpp>
#include <SDK/client/SceneEventId_t.hpp>



namespace CS2 {
	namespace server {
		class CBaseFlex : public CS2::server::CBaseAnimGraph {
		public:
			// GlobalTypes::CNetworkUtlVectorBase< float32 > m_flexWeight; // 0xa80 | Schema_Atomic | Size: 0x18
			char  m_flexWeight[0x18]; // 0xa80 | Schema_Atomic | Size: 0x18
			GlobalTypes::Vector m_vLookTargetPosition; // 0xa98 | Schema_Atomic | Size: 0xc
			bool m_blinktoggle; // 0xaa4 | Schema_Builtin | Size: 0x1
			S2_PAD(0x53);
			entity2::GameTime_t m_flAllowResponsesEndTime; // 0xaf8 | Schema_DeclaredClass | Size: 0x4
			entity2::GameTime_t m_flLastFlexAnimationTime; // 0xafc | Schema_DeclaredClass | Size: 0x4
			client::SceneEventId_t m_nNextSceneEventId; // 0xb00 | Schema_DeclaredClass | Size: 0x4
			bool m_bUpdateLayerPriorities; // 0xb04 | Schema_Builtin | Size: 0x1
			S2_PAD(0xb); // End padding
		};
		static_assert(offsetof(CS2::server::CBaseFlex, m_flexWeight) == 0xA80, "m_flexWeight in CBaseFlex should be at offset 0xA80");
		static_assert(offsetof(CS2::server::CBaseFlex, m_vLookTargetPosition) == 0xA98, "m_vLookTargetPosition in CBaseFlex should be at offset 0xA98");
		static_assert(offsetof(CS2::server::CBaseFlex, m_blinktoggle) == 0xAA4, "m_blinktoggle in CBaseFlex should be at offset 0xAA4");
		static_assert(offsetof(CS2::server::CBaseFlex, m_flAllowResponsesEndTime) == 0xAF8, "m_flAllowResponsesEndTime in CBaseFlex should be at offset 0xAF8");
		static_assert(offsetof(CS2::server::CBaseFlex, m_flLastFlexAnimationTime) == 0xAFC, "m_flLastFlexAnimationTime in CBaseFlex should be at offset 0xAFC");
		static_assert(offsetof(CS2::server::CBaseFlex, m_nNextSceneEventId) == 0xB00, "m_nNextSceneEventId in CBaseFlex should be at offset 0xB00");
		static_assert(offsetof(CS2::server::CBaseFlex, m_bUpdateLayerPriorities) == 0xB04, "m_bUpdateLayerPriorities in CBaseFlex should be at offset 0xB04");
		static_assert(sizeof(CS2::server::CBaseFlex) == 0xB10, "CBaseFlex size should be 0xB10");
	}
}
