// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#ifndef CUSTOM_GLOBAL_TYPES
	#include <SDK/GlobalTypes.hpp>
#else
	#include <Custom/GlobalTypes.hpp>
#endif





namespace CS2 {
	namespace server {
		class CVoteController;
	}
}
namespace CS2 {
	namespace server {
		class CBaseIssue  {
		public:
			S2_PAD(0x20);
			char m_szTypeString[64]; // 0x20 | Schema_FixedArray | Size: 0x40
			char m_szDetailsString[260]; // 0x60 | Schema_FixedArray | Size: 0x104
			int32_t m_iNumYesVotes; // 0x164 | Schema_Builtin | Size: 0x4
			int32_t m_iNumNoVotes; // 0x168 | Schema_Builtin | Size: 0x4
			int32_t m_iNumPotentialVotes; // 0x16c | Schema_Builtin | Size: 0x4
			server::CVoteController* m_pVoteController; // 0x170 | Schema_Ptr | Size: 0x8
		};
		static_assert(offsetof(CS2::server::CBaseIssue, m_szTypeString) == 0x20, "m_szTypeString in CBaseIssue should be at offset 0x20");
		static_assert(offsetof(CS2::server::CBaseIssue, m_szDetailsString) == 0x60, "m_szDetailsString in CBaseIssue should be at offset 0x60");
		static_assert(offsetof(CS2::server::CBaseIssue, m_iNumYesVotes) == 0x164, "m_iNumYesVotes in CBaseIssue should be at offset 0x164");
		static_assert(offsetof(CS2::server::CBaseIssue, m_iNumNoVotes) == 0x168, "m_iNumNoVotes in CBaseIssue should be at offset 0x168");
		static_assert(offsetof(CS2::server::CBaseIssue, m_iNumPotentialVotes) == 0x16C, "m_iNumPotentialVotes in CBaseIssue should be at offset 0x16C");
		static_assert(offsetof(CS2::server::CBaseIssue, m_pVoteController) == 0x170, "m_pVoteController in CBaseIssue should be at offset 0x170");
		static_assert(sizeof(CS2::server::CBaseIssue) == 0x178, "CBaseIssue size should be 0x178");
	}
}
