// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#include <SDK/GlobalTypes.hpp>

#include <SDK/server/CBaseGrenade.hpp>
#include <SDK/entity2/GameTime_t.hpp>



namespace CS2 {
	namespace server {
		class CBaseCSGrenadeProjectile : public CS2::server::CBaseGrenade {
		public:
			public:
			GlobalTypes::Vector m_vInitialPosition; // 0xbb0 | Schema_Atomic | Size: 0xc
			GlobalTypes::Vector m_vInitialVelocity; // 0xbbc | Schema_Atomic | Size: 0xc
			int32_t m_nBounces; // 0xbc8 | Schema_Builtin | Size: 0x4
			S2_PAD(0x4);
			// GlobalTypes::CStrongHandle< resourcesystem::InfoForResourceTypeIParticleSystemDefinition > m_nExplodeEffectIndex; // 0xbd0 | Schema_Atomic | Size: 0x8
			char  m_nExplodeEffectIndex[0x8]; // 0xbd0 | Schema_Atomic | Size: 0x8
			int32_t m_nExplodeEffectTickBegin; // 0xbd8 | Schema_Builtin | Size: 0x4
			GlobalTypes::Vector m_vecExplodeEffectOrigin; // 0xbdc | Schema_Atomic | Size: 0xc
			entity2::GameTime_t m_flSpawnTime; // 0xbe8 | Schema_DeclaredClass | Size: 0x4
			uint8_t m_unOGSExtraFlags; // 0xbec | Schema_Builtin | Size: 0x1
			bool m_bDetonationRecorded; // 0xbed | Schema_Builtin | Size: 0x1
			uint16_t m_nItemIndex; // 0xbee | Schema_Builtin | Size: 0x2
			GlobalTypes::Vector m_vecOriginalSpawnLocation; // 0xbf0 | Schema_Atomic | Size: 0xc
			entity2::GameTime_t m_flLastBounceSoundTime; // 0xbfc | Schema_DeclaredClass | Size: 0x4
			GlobalTypes::RotationVector m_vecGrenadeSpin; // 0xc00 | Schema_Atomic | Size: 0xc
			GlobalTypes::Vector m_vecLastHitSurfaceNormal; // 0xc0c | Schema_Atomic | Size: 0xc
			int32_t m_nTicksAtZeroVelocity; // 0xc18 | Schema_Builtin | Size: 0x4
			bool m_bHasEverHitEnemy; // 0xc1c | Schema_Builtin | Size: 0x1
			S2_PAD(0x3); // End padding
		};
		static_assert(offsetof(CS2::server::CBaseCSGrenadeProjectile, m_vInitialPosition) == 0xBB0, "m_vInitialPosition in CBaseCSGrenadeProjectile should be at offset 0xBB0");
		static_assert(offsetof(CS2::server::CBaseCSGrenadeProjectile, m_vInitialVelocity) == 0xBBC, "m_vInitialVelocity in CBaseCSGrenadeProjectile should be at offset 0xBBC");
		static_assert(offsetof(CS2::server::CBaseCSGrenadeProjectile, m_nBounces) == 0xBC8, "m_nBounces in CBaseCSGrenadeProjectile should be at offset 0xBC8");
		static_assert(offsetof(CS2::server::CBaseCSGrenadeProjectile, m_nExplodeEffectIndex) == 0xBD0, "m_nExplodeEffectIndex in CBaseCSGrenadeProjectile should be at offset 0xBD0");
		static_assert(offsetof(CS2::server::CBaseCSGrenadeProjectile, m_nExplodeEffectTickBegin) == 0xBD8, "m_nExplodeEffectTickBegin in CBaseCSGrenadeProjectile should be at offset 0xBD8");
		static_assert(offsetof(CS2::server::CBaseCSGrenadeProjectile, m_vecExplodeEffectOrigin) == 0xBDC, "m_vecExplodeEffectOrigin in CBaseCSGrenadeProjectile should be at offset 0xBDC");
		static_assert(offsetof(CS2::server::CBaseCSGrenadeProjectile, m_flSpawnTime) == 0xBE8, "m_flSpawnTime in CBaseCSGrenadeProjectile should be at offset 0xBE8");
		static_assert(offsetof(CS2::server::CBaseCSGrenadeProjectile, m_unOGSExtraFlags) == 0xBEC, "m_unOGSExtraFlags in CBaseCSGrenadeProjectile should be at offset 0xBEC");
		static_assert(offsetof(CS2::server::CBaseCSGrenadeProjectile, m_bDetonationRecorded) == 0xBED, "m_bDetonationRecorded in CBaseCSGrenadeProjectile should be at offset 0xBED");
		static_assert(offsetof(CS2::server::CBaseCSGrenadeProjectile, m_nItemIndex) == 0xBEE, "m_nItemIndex in CBaseCSGrenadeProjectile should be at offset 0xBEE");
		static_assert(offsetof(CS2::server::CBaseCSGrenadeProjectile, m_vecOriginalSpawnLocation) == 0xBF0, "m_vecOriginalSpawnLocation in CBaseCSGrenadeProjectile should be at offset 0xBF0");
		static_assert(offsetof(CS2::server::CBaseCSGrenadeProjectile, m_flLastBounceSoundTime) == 0xBFC, "m_flLastBounceSoundTime in CBaseCSGrenadeProjectile should be at offset 0xBFC");
		static_assert(offsetof(CS2::server::CBaseCSGrenadeProjectile, m_vecGrenadeSpin) == 0xC00, "m_vecGrenadeSpin in CBaseCSGrenadeProjectile should be at offset 0xC00");
		static_assert(offsetof(CS2::server::CBaseCSGrenadeProjectile, m_vecLastHitSurfaceNormal) == 0xC0C, "m_vecLastHitSurfaceNormal in CBaseCSGrenadeProjectile should be at offset 0xC0C");
		static_assert(offsetof(CS2::server::CBaseCSGrenadeProjectile, m_nTicksAtZeroVelocity) == 0xC18, "m_nTicksAtZeroVelocity in CBaseCSGrenadeProjectile should be at offset 0xC18");
		static_assert(offsetof(CS2::server::CBaseCSGrenadeProjectile, m_bHasEverHitEnemy) == 0xC1C, "m_bHasEverHitEnemy in CBaseCSGrenadeProjectile should be at offset 0xC1C");
		static_assert(sizeof(CS2::server::CBaseCSGrenadeProjectile) == 0xC20, "CBaseCSGrenadeProjectile size should be 0xC20");
	}
}
