// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#ifndef CUSTOM_GLOBAL_TYPES
	#include "../GlobalTypes.hpp"
#else
	#include <Custom/GlobalTypes.hpp>
#endif


#include "CBaseCombatCharacter.hpp"
#include "ViewAngleServerChange_t.hpp"
#include "sky3dparams_t.hpp"
#include "../entity2/GameTime_t.hpp"
#include "../client/sndopvarlatchdata_t.hpp"



namespace CS2 {
	namespace server {
		class CPlayer_WeaponServices;
		class CPlayer_ItemServices;
		class CPlayer_AutoaimServices;
		class CPlayer_ObserverServices;
		class CPlayer_WaterServices;
		class CPlayer_UseServices;
		class CPlayer_FlashlightServices;
		class CPlayer_CameraServices;
		class CPlayer_MovementServices;
		class CAI_Expresser;
		class CBasePlayerController;
	}
}


using namespace GlobalTypes;
namespace CS2 {
	namespace server {
		class CBasePlayerPawn : public CS2::server::CBaseCombatCharacter {
		public:
			server::CPlayer_WeaponServices* m_pWeaponServices; // 0xb70 | Schema_Ptr | Size: 0x8
			server::CPlayer_ItemServices* m_pItemServices; // 0xb78 | Schema_Ptr | Size: 0x8
			server::CPlayer_AutoaimServices* m_pAutoaimServices; // 0xb80 | Schema_Ptr | Size: 0x8
			server::CPlayer_ObserverServices* m_pObserverServices; // 0xb88 | Schema_Ptr | Size: 0x8
			server::CPlayer_WaterServices* m_pWaterServices; // 0xb90 | Schema_Ptr | Size: 0x8
			server::CPlayer_UseServices* m_pUseServices; // 0xb98 | Schema_Ptr | Size: 0x8
			server::CPlayer_FlashlightServices* m_pFlashlightServices; // 0xba0 | Schema_Ptr | Size: 0x8
			server::CPlayer_CameraServices* m_pCameraServices; // 0xba8 | Schema_Ptr | Size: 0x8
			server::CPlayer_MovementServices* m_pMovementServices; // 0xbb0 | Schema_Ptr | Size: 0x8
			S2_PAD(0x8);
			// server::CUtlVectorEmbeddedNetworkVar<server::ViewAngleServerChange_t> m_ServerViewAngleChanges; // 0xbc0 | Schema_Atomic | Size: 0x68
			char m_ServerViewAngleChanges[0x68]; // 0xbc0 | Schema_Atomic | Size: 0x68
			GlobalTypes::QAngle v_angle; // 0xc28 | Schema_Atomic | Size: 0xc
			GlobalTypes::QAngle v_anglePrevious; // 0xc34 | Schema_Atomic | Size: 0xc
			uint32_t m_iHideHUD; // 0xc40 | Schema_Builtin | Size: 0x4
			S2_PAD(0x4);
			server::sky3dparams_t m_skybox3d; // 0xc48 | Schema_DeclaredClass | Size: 0x90
			entity2::GameTime_t m_fTimeLastHurt; // 0xcd8 | Schema_DeclaredClass | Size: 0x4
			entity2::GameTime_t m_flDeathTime; // 0xcdc | Schema_DeclaredClass | Size: 0x4
			entity2::GameTime_t m_fNextSuicideTime; // 0xce0 | Schema_DeclaredClass | Size: 0x4
			bool m_fInitHUD; // 0xce4 | Schema_Builtin | Size: 0x1
			S2_PAD(0x3);
			server::CAI_Expresser* m_pExpresser; // 0xce8 | Schema_Ptr | Size: 0x8
			GlobalTypes::CHandle<server::CBasePlayerController> m_hController; // 0xcf0 | Schema_Atomic | Size: 0x4
			// char m_hController[0x4]; // 0xcf0 | Schema_Atomic | Size: 0x4
			GlobalTypes::CHandle<server::CBasePlayerController> m_hDefaultController; // 0xcf4 | Schema_Atomic | Size: 0x4
			// char m_hDefaultController[0x4]; // 0xcf4 | Schema_Atomic | Size: 0x4
			S2_PAD(0x4);
			float32 m_fHltvReplayDelay; // 0xcfc | Schema_Builtin | Size: 0x4
			float32 m_fHltvReplayEnd; // 0xd00 | Schema_Builtin | Size: 0x4
			GlobalTypes::CEntityIndex m_iHltvReplayEntity; // 0xd04 | Schema_Atomic | Size: 0x4
			GlobalTypes::CUtlVector<client::sndopvarlatchdata_t> m_sndOpvarLatchData; // 0xd08 | Schema_Atomic | Size: 0x18
			// char m_sndOpvarLatchData[0x18]; // 0xd08 | Schema_Atomic | Size: 0x18
		};
#ifdef USE_STATIC_ASSERTS
		static_assert(offsetof(CS2::server::CBasePlayerPawn, m_pWeaponServices) == 0xB70, "m_pWeaponServices in CBasePlayerPawn should be at offset 0xB70");
		static_assert(offsetof(CS2::server::CBasePlayerPawn, m_pItemServices) == 0xB78, "m_pItemServices in CBasePlayerPawn should be at offset 0xB78");
		static_assert(offsetof(CS2::server::CBasePlayerPawn, m_pAutoaimServices) == 0xB80, "m_pAutoaimServices in CBasePlayerPawn should be at offset 0xB80");
		static_assert(offsetof(CS2::server::CBasePlayerPawn, m_pObserverServices) == 0xB88, "m_pObserverServices in CBasePlayerPawn should be at offset 0xB88");
		static_assert(offsetof(CS2::server::CBasePlayerPawn, m_pWaterServices) == 0xB90, "m_pWaterServices in CBasePlayerPawn should be at offset 0xB90");
		static_assert(offsetof(CS2::server::CBasePlayerPawn, m_pUseServices) == 0xB98, "m_pUseServices in CBasePlayerPawn should be at offset 0xB98");
		static_assert(offsetof(CS2::server::CBasePlayerPawn, m_pFlashlightServices) == 0xBA0, "m_pFlashlightServices in CBasePlayerPawn should be at offset 0xBA0");
		static_assert(offsetof(CS2::server::CBasePlayerPawn, m_pCameraServices) == 0xBA8, "m_pCameraServices in CBasePlayerPawn should be at offset 0xBA8");
		static_assert(offsetof(CS2::server::CBasePlayerPawn, m_pMovementServices) == 0xBB0, "m_pMovementServices in CBasePlayerPawn should be at offset 0xBB0");
		static_assert(offsetof(CS2::server::CBasePlayerPawn, m_ServerViewAngleChanges) == 0xBC0, "m_ServerViewAngleChanges in CBasePlayerPawn should be at offset 0xBC0");
		static_assert(offsetof(CS2::server::CBasePlayerPawn, v_angle) == 0xC28, "v_angle in CBasePlayerPawn should be at offset 0xC28");
		static_assert(offsetof(CS2::server::CBasePlayerPawn, v_anglePrevious) == 0xC34, "v_anglePrevious in CBasePlayerPawn should be at offset 0xC34");
		static_assert(offsetof(CS2::server::CBasePlayerPawn, m_iHideHUD) == 0xC40, "m_iHideHUD in CBasePlayerPawn should be at offset 0xC40");
		static_assert(offsetof(CS2::server::CBasePlayerPawn, m_skybox3d) == 0xC48, "m_skybox3d in CBasePlayerPawn should be at offset 0xC48");
		static_assert(offsetof(CS2::server::CBasePlayerPawn, m_fTimeLastHurt) == 0xCD8, "m_fTimeLastHurt in CBasePlayerPawn should be at offset 0xCD8");
		static_assert(offsetof(CS2::server::CBasePlayerPawn, m_flDeathTime) == 0xCDC, "m_flDeathTime in CBasePlayerPawn should be at offset 0xCDC");
		static_assert(offsetof(CS2::server::CBasePlayerPawn, m_fNextSuicideTime) == 0xCE0, "m_fNextSuicideTime in CBasePlayerPawn should be at offset 0xCE0");
		static_assert(offsetof(CS2::server::CBasePlayerPawn, m_fInitHUD) == 0xCE4, "m_fInitHUD in CBasePlayerPawn should be at offset 0xCE4");
		static_assert(offsetof(CS2::server::CBasePlayerPawn, m_pExpresser) == 0xCE8, "m_pExpresser in CBasePlayerPawn should be at offset 0xCE8");
		static_assert(offsetof(CS2::server::CBasePlayerPawn, m_hController) == 0xCF0, "m_hController in CBasePlayerPawn should be at offset 0xCF0");
		static_assert(offsetof(CS2::server::CBasePlayerPawn, m_hDefaultController) == 0xCF4, "m_hDefaultController in CBasePlayerPawn should be at offset 0xCF4");
		static_assert(offsetof(CS2::server::CBasePlayerPawn, m_fHltvReplayDelay) == 0xCFC, "m_fHltvReplayDelay in CBasePlayerPawn should be at offset 0xCFC");
		static_assert(offsetof(CS2::server::CBasePlayerPawn, m_fHltvReplayEnd) == 0xD00, "m_fHltvReplayEnd in CBasePlayerPawn should be at offset 0xD00");
		static_assert(offsetof(CS2::server::CBasePlayerPawn, m_iHltvReplayEntity) == 0xD04, "m_iHltvReplayEntity in CBasePlayerPawn should be at offset 0xD04");
		static_assert(offsetof(CS2::server::CBasePlayerPawn, m_sndOpvarLatchData) == 0xD08, "m_sndOpvarLatchData in CBasePlayerPawn should be at offset 0xD08");
		static_assert(sizeof(CS2::server::CBasePlayerPawn) == 0xD20, "CBasePlayerPawn size should be 0xD20");

#endif
	}
}
