// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#ifndef CUSTOM_GLOBAL_TYPES
	#include "../GlobalTypes.hpp"
#else
	#include "../Custom/GlobalTypes.hpp"
#endif


#include "CBaseFlex.hpp"
#include "CEconWearable.hpp"
#include "../client/Hull_t.hpp"
#include "CMovementStatsProperty.hpp"





using namespace GlobalTypes;
namespace CS2 {
	namespace server {
		class CBaseCombatCharacter : public CS2::server::CBaseFlex {
		public:
			bool m_bForceServerRagdoll; // 0xab0 | Schema_Builtin | Size: 0x1
			S2_PAD(0x7);
			// server::CNetworkUtlVectorBase<GlobalTypes::CHandle<server::CEconWearable>> m_hMyWearables; // 0xab8 | Schema_Atomic | Size: 0x18
			char m_hMyWearables[0x18]; // 0xab8 | Schema_Atomic | Size: 0x18
			float32 m_impactEnergyScale; // 0xad0 | Schema_Builtin | Size: 0x4
			bool m_bApplyStressDamage; // 0xad4 | Schema_Builtin | Size: 0x1
			bool m_bDeathEventsDispatched; // 0xad5 | Schema_Builtin | Size: 0x1
			S2_PAD(0x42);
			GlobalTypes::CUtlVector< RelationshipOverride_t >** m_pVecRelationships; // 0xb18 | Schema_Ptr | Size: 0x8
			// char m_pVecRelationships[0x8]; // 0xb18 | Schema_Ptr | Size: 0x8
			GlobalTypes::CUtlSymbolLarge m_strRelationships; // 0xb20 | Schema_Atomic | Size: 0x8
			client::Hull_t m_eHull; // 0xb28 | Schema_DeclaredEnum | Size: 0x4
			uint32_t m_nNavHullIdx; // 0xb2c | Schema_Builtin | Size: 0x4
			server::CMovementStatsProperty m_movementStats; // 0xb30 | Schema_DeclaredClass | Size: 0x40
		};
		static_assert(offsetof(CS2::server::CBaseCombatCharacter, m_bForceServerRagdoll) == 0xAB0, "m_bForceServerRagdoll in CBaseCombatCharacter should be at offset 0xAB0");
		static_assert(offsetof(CS2::server::CBaseCombatCharacter, m_hMyWearables) == 0xAB8, "m_hMyWearables in CBaseCombatCharacter should be at offset 0xAB8");
		static_assert(offsetof(CS2::server::CBaseCombatCharacter, m_impactEnergyScale) == 0xAD0, "m_impactEnergyScale in CBaseCombatCharacter should be at offset 0xAD0");
		static_assert(offsetof(CS2::server::CBaseCombatCharacter, m_bApplyStressDamage) == 0xAD4, "m_bApplyStressDamage in CBaseCombatCharacter should be at offset 0xAD4");
		static_assert(offsetof(CS2::server::CBaseCombatCharacter, m_bDeathEventsDispatched) == 0xAD5, "m_bDeathEventsDispatched in CBaseCombatCharacter should be at offset 0xAD5");
		static_assert(offsetof(CS2::server::CBaseCombatCharacter, m_pVecRelationships) == 0xB18, "m_pVecRelationships in CBaseCombatCharacter should be at offset 0xB18");
		static_assert(offsetof(CS2::server::CBaseCombatCharacter, m_strRelationships) == 0xB20, "m_strRelationships in CBaseCombatCharacter should be at offset 0xB20");
		static_assert(offsetof(CS2::server::CBaseCombatCharacter, m_eHull) == 0xB28, "m_eHull in CBaseCombatCharacter should be at offset 0xB28");
		static_assert(offsetof(CS2::server::CBaseCombatCharacter, m_nNavHullIdx) == 0xB2C, "m_nNavHullIdx in CBaseCombatCharacter should be at offset 0xB2C");
		static_assert(offsetof(CS2::server::CBaseCombatCharacter, m_movementStats) == 0xB30, "m_movementStats in CBaseCombatCharacter should be at offset 0xB30");
		static_assert(sizeof(CS2::server::CBaseCombatCharacter) == 0xB70, "CBaseCombatCharacter size should be 0xB70");
	}
}
