// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#ifndef CUSTOM_GLOBAL_TYPES
	#include "../GlobalTypes.hpp"
#else
	#include <Custom/GlobalTypes.hpp>
#endif


#include "CBaseToggle.hpp"
#include "../entity2/CEntityIOOutput.hpp"
#include "CBaseEntity.hpp"



namespace CS2 {
	namespace server {
		class CBaseFilter;
	}
}


using namespace GlobalTypes;
namespace CS2 {
	namespace server {
		class CBaseTrigger : public CS2::server::CBaseToggle {
		public:
			entity2::CEntityIOOutput m_OnStartTouch; // 0x7b0 | Schema_DeclaredClass | Size: 0x18
			entity2::CEntityIOOutput m_OnStartTouchAll; // 0x7c8 | Schema_DeclaredClass | Size: 0x18
			entity2::CEntityIOOutput m_OnEndTouch; // 0x7e0 | Schema_DeclaredClass | Size: 0x18
			entity2::CEntityIOOutput m_OnEndTouchAll; // 0x7f8 | Schema_DeclaredClass | Size: 0x18
			entity2::CEntityIOOutput m_OnTouching; // 0x810 | Schema_DeclaredClass | Size: 0x18
			entity2::CEntityIOOutput m_OnTouchingEachEntity; // 0x828 | Schema_DeclaredClass | Size: 0x18
			entity2::CEntityIOOutput m_OnNotTouching; // 0x840 | Schema_DeclaredClass | Size: 0x18
			GlobalTypes::CUtlVector<GlobalTypes::CHandle<server::CBaseEntity>> m_hTouchingEntities; // 0x858 | Schema_Atomic | Size: 0x18
			// char m_hTouchingEntities[0x18]; // 0x858 | Schema_Atomic | Size: 0x18
			GlobalTypes::CUtlSymbolLarge m_iFilterName; // 0x870 | Schema_Atomic | Size: 0x8
			GlobalTypes::CHandle<server::CBaseFilter> m_hFilter; // 0x878 | Schema_Atomic | Size: 0x4
			// char m_hFilter[0x4]; // 0x878 | Schema_Atomic | Size: 0x4
			bool m_bDisabled; // 0x87c | Schema_Builtin | Size: 0x1
			S2_PAD(0xb);
			bool m_bUseAsyncQueries; // 0x888 | Schema_Builtin | Size: 0x1
			S2_PAD(0x7); // End padding
		};
#ifdef USE_STATIC_ASSERTS
		static_assert(offsetof(CS2::server::CBaseTrigger, m_OnStartTouch) == 0x7B0, "m_OnStartTouch in CBaseTrigger should be at offset 0x7B0");
		static_assert(offsetof(CS2::server::CBaseTrigger, m_OnStartTouchAll) == 0x7C8, "m_OnStartTouchAll in CBaseTrigger should be at offset 0x7C8");
		static_assert(offsetof(CS2::server::CBaseTrigger, m_OnEndTouch) == 0x7E0, "m_OnEndTouch in CBaseTrigger should be at offset 0x7E0");
		static_assert(offsetof(CS2::server::CBaseTrigger, m_OnEndTouchAll) == 0x7F8, "m_OnEndTouchAll in CBaseTrigger should be at offset 0x7F8");
		static_assert(offsetof(CS2::server::CBaseTrigger, m_OnTouching) == 0x810, "m_OnTouching in CBaseTrigger should be at offset 0x810");
		static_assert(offsetof(CS2::server::CBaseTrigger, m_OnTouchingEachEntity) == 0x828, "m_OnTouchingEachEntity in CBaseTrigger should be at offset 0x828");
		static_assert(offsetof(CS2::server::CBaseTrigger, m_OnNotTouching) == 0x840, "m_OnNotTouching in CBaseTrigger should be at offset 0x840");
		static_assert(offsetof(CS2::server::CBaseTrigger, m_hTouchingEntities) == 0x858, "m_hTouchingEntities in CBaseTrigger should be at offset 0x858");
		static_assert(offsetof(CS2::server::CBaseTrigger, m_iFilterName) == 0x870, "m_iFilterName in CBaseTrigger should be at offset 0x870");
		static_assert(offsetof(CS2::server::CBaseTrigger, m_hFilter) == 0x878, "m_hFilter in CBaseTrigger should be at offset 0x878");
		static_assert(offsetof(CS2::server::CBaseTrigger, m_bDisabled) == 0x87C, "m_bDisabled in CBaseTrigger should be at offset 0x87C");
		static_assert(offsetof(CS2::server::CBaseTrigger, m_bUseAsyncQueries) == 0x888, "m_bUseAsyncQueries in CBaseTrigger should be at offset 0x888");
		static_assert(sizeof(CS2::server::CBaseTrigger) == 0x890, "CBaseTrigger size should be 0x890");

#endif
	}
}
