// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#include <SDK/GlobalTypes.hpp>

#include <SDK/server/CBaseAnimGraph.hpp>
#include <SDK/entity2/GameTime_t.hpp>
#include <SDK/client/SceneEventId_t.hpp>



namespace CS2 {
	namespace server {
		class CBaseFlex : public CS2::server::CBaseAnimGraph {
		public:
			public:
			// GlobalTypes::CNetworkUtlVectorBase< float32 > m_flexWeight; // 0xa78 | Schema_Atomic | Size: 0x18
			char  m_flexWeight[0x18]; // 0xa78 | Schema_Atomic | Size: 0x18
			GlobalTypes::Vector m_vLookTargetPosition; // 0xa90 | Schema_Atomic | Size: 0xc
			bool m_blinktoggle; // 0xa9c | Schema_Builtin | Size: 0x1
			S2_PAD(0x53);
			entity2::GameTime_t m_flAllowResponsesEndTime; // 0xaf0 | Schema_DeclaredClass | Size: 0x4
			entity2::GameTime_t m_flLastFlexAnimationTime; // 0xaf4 | Schema_DeclaredClass | Size: 0x4
			client::SceneEventId_t m_nNextSceneEventId; // 0xaf8 | Schema_DeclaredClass | Size: 0x4
			bool m_bUpdateLayerPriorities; // 0xafc | Schema_Builtin | Size: 0x1
			S2_PAD(0xb); // End padding
		};
		static_assert(offsetof(CS2::server::CBaseFlex, m_flexWeight) == 0xA78, "m_flexWeight in CBaseFlex should be at offset 0xA78");
		static_assert(offsetof(CS2::server::CBaseFlex, m_vLookTargetPosition) == 0xA90, "m_vLookTargetPosition in CBaseFlex should be at offset 0xA90");
		static_assert(offsetof(CS2::server::CBaseFlex, m_blinktoggle) == 0xA9C, "m_blinktoggle in CBaseFlex should be at offset 0xA9C");
		static_assert(offsetof(CS2::server::CBaseFlex, m_flAllowResponsesEndTime) == 0xAF0, "m_flAllowResponsesEndTime in CBaseFlex should be at offset 0xAF0");
		static_assert(offsetof(CS2::server::CBaseFlex, m_flLastFlexAnimationTime) == 0xAF4, "m_flLastFlexAnimationTime in CBaseFlex should be at offset 0xAF4");
		static_assert(offsetof(CS2::server::CBaseFlex, m_nNextSceneEventId) == 0xAF8, "m_nNextSceneEventId in CBaseFlex should be at offset 0xAF8");
		static_assert(offsetof(CS2::server::CBaseFlex, m_bUpdateLayerPriorities) == 0xAFC, "m_bUpdateLayerPriorities in CBaseFlex should be at offset 0xAFC");
		static_assert(sizeof(CS2::server::CBaseFlex) == 0xB08, "CBaseFlex size should be 0xB08");
	}
}
