// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#ifndef CUSTOM_GLOBAL_TYPES
	#include "../GlobalTypes.hpp"
#else
	#include <Custom/GlobalTypes.hpp>
#endif


#include "CBaseModelEntity.hpp"
#include "../entity2/GameTime_t.hpp"
#include "../client/BeamType_t.hpp"

#include "../modellib/AttachmentHandle_t.hpp"
#include "../client/BeamClipStyle_t.hpp"



namespace CS2 {
	namespace server {
		class CBaseEntity;
	}
}


using namespace GlobalTypes;
namespace CS2 {
	namespace server {
		class CBeam : public CS2::server::CBaseModelEntity {
		public:
			float32 m_flFrameRate; // 0x730 | Schema_Builtin | Size: 0x4
			float32 m_flHDRColorScale; // 0x734 | Schema_Builtin | Size: 0x4
			entity2::GameTime_t m_flFireTime; // 0x738 | Schema_DeclaredClass | Size: 0x4
			float32 m_flDamage; // 0x73c | Schema_Builtin | Size: 0x4
			uint8_t m_nNumBeamEnts; // 0x740 | Schema_Builtin | Size: 0x1
			S2_PAD(0x7);
			// GlobalTypes::CStrongHandle<resourcesystem::InfoForResourceTypeIMaterial2> m_hBaseMaterial; // 0x748 | Schema_Atomic | Size: 0x8
			char m_hBaseMaterial[0x8]; // 0x748 | Schema_Atomic | Size: 0x8
			// GlobalTypes::CStrongHandle<resourcesystem::InfoForResourceTypeIMaterial2> m_nHaloIndex; // 0x750 | Schema_Atomic | Size: 0x8
			char m_nHaloIndex[0x8]; // 0x750 | Schema_Atomic | Size: 0x8
			client::BeamType_t m_nBeamType; // 0x758 | Schema_DeclaredEnum | Size: 0x4
			uint32_t m_nBeamFlags; // 0x75c | Schema_Builtin | Size: 0x4
			GlobalTypes::CHandle< CBaseEntity > m_hAttachEntity[10]; // 0x760 | Schema_FixedArray | Size: 0x28
			// char m_hAttachEntity[0x28]; // 0x760 | Schema_FixedArray | Size: 0x4
			modellib::AttachmentHandle_t m_nAttachIndex[10]; // 0x788 | Schema_FixedArray | Size: 0xa
			S2_PAD(0x2);
			float32 m_fWidth; // 0x794 | Schema_Builtin | Size: 0x4
			float32 m_fEndWidth; // 0x798 | Schema_Builtin | Size: 0x4
			float32 m_fFadeLength; // 0x79c | Schema_Builtin | Size: 0x4
			float32 m_fHaloScale; // 0x7a0 | Schema_Builtin | Size: 0x4
			float32 m_fAmplitude; // 0x7a4 | Schema_Builtin | Size: 0x4
			float32 m_fStartFrame; // 0x7a8 | Schema_Builtin | Size: 0x4
			float32 m_fSpeed; // 0x7ac | Schema_Builtin | Size: 0x4
			float32 m_flFrame; // 0x7b0 | Schema_Builtin | Size: 0x4
			client::BeamClipStyle_t m_nClipStyle; // 0x7b4 | Schema_DeclaredEnum | Size: 0x4
			bool m_bTurnedOff; // 0x7b8 | Schema_Builtin | Size: 0x1
			S2_PAD(0x3);
			GlobalTypes::VectorWS m_vecEndPos; // 0x7bc | Schema_Atomic | Size: 0xc
			GlobalTypes::CHandle<server::CBaseEntity> m_hEndEntity; // 0x7c8 | Schema_Atomic | Size: 0x4
			// char m_hEndEntity[0x4]; // 0x7c8 | Schema_Atomic | Size: 0x4
			int32_t m_nDissolveType; // 0x7cc | Schema_Builtin | Size: 0x4
		};
#ifdef USE_STATIC_ASSERTS
		static_assert(offsetof(CS2::server::CBeam, m_flFrameRate) == 0x730, "m_flFrameRate in CBeam should be at offset 0x730");
		static_assert(offsetof(CS2::server::CBeam, m_flHDRColorScale) == 0x734, "m_flHDRColorScale in CBeam should be at offset 0x734");
		static_assert(offsetof(CS2::server::CBeam, m_flFireTime) == 0x738, "m_flFireTime in CBeam should be at offset 0x738");
		static_assert(offsetof(CS2::server::CBeam, m_flDamage) == 0x73C, "m_flDamage in CBeam should be at offset 0x73C");
		static_assert(offsetof(CS2::server::CBeam, m_nNumBeamEnts) == 0x740, "m_nNumBeamEnts in CBeam should be at offset 0x740");
		static_assert(offsetof(CS2::server::CBeam, m_hBaseMaterial) == 0x748, "m_hBaseMaterial in CBeam should be at offset 0x748");
		static_assert(offsetof(CS2::server::CBeam, m_nHaloIndex) == 0x750, "m_nHaloIndex in CBeam should be at offset 0x750");
		static_assert(offsetof(CS2::server::CBeam, m_nBeamType) == 0x758, "m_nBeamType in CBeam should be at offset 0x758");
		static_assert(offsetof(CS2::server::CBeam, m_nBeamFlags) == 0x75C, "m_nBeamFlags in CBeam should be at offset 0x75C");
		static_assert(offsetof(CS2::server::CBeam, m_hAttachEntity) == 0x760, "m_hAttachEntity in CBeam should be at offset 0x760");
		static_assert(offsetof(CS2::server::CBeam, m_nAttachIndex) == 0x788, "m_nAttachIndex in CBeam should be at offset 0x788");
		static_assert(offsetof(CS2::server::CBeam, m_fWidth) == 0x794, "m_fWidth in CBeam should be at offset 0x794");
		static_assert(offsetof(CS2::server::CBeam, m_fEndWidth) == 0x798, "m_fEndWidth in CBeam should be at offset 0x798");
		static_assert(offsetof(CS2::server::CBeam, m_fFadeLength) == 0x79C, "m_fFadeLength in CBeam should be at offset 0x79C");
		static_assert(offsetof(CS2::server::CBeam, m_fHaloScale) == 0x7A0, "m_fHaloScale in CBeam should be at offset 0x7A0");
		static_assert(offsetof(CS2::server::CBeam, m_fAmplitude) == 0x7A4, "m_fAmplitude in CBeam should be at offset 0x7A4");
		static_assert(offsetof(CS2::server::CBeam, m_fStartFrame) == 0x7A8, "m_fStartFrame in CBeam should be at offset 0x7A8");
		static_assert(offsetof(CS2::server::CBeam, m_fSpeed) == 0x7AC, "m_fSpeed in CBeam should be at offset 0x7AC");
		static_assert(offsetof(CS2::server::CBeam, m_flFrame) == 0x7B0, "m_flFrame in CBeam should be at offset 0x7B0");
		static_assert(offsetof(CS2::server::CBeam, m_nClipStyle) == 0x7B4, "m_nClipStyle in CBeam should be at offset 0x7B4");
		static_assert(offsetof(CS2::server::CBeam, m_bTurnedOff) == 0x7B8, "m_bTurnedOff in CBeam should be at offset 0x7B8");
		static_assert(offsetof(CS2::server::CBeam, m_vecEndPos) == 0x7BC, "m_vecEndPos in CBeam should be at offset 0x7BC");
		static_assert(offsetof(CS2::server::CBeam, m_hEndEntity) == 0x7C8, "m_hEndEntity in CBeam should be at offset 0x7C8");
		static_assert(offsetof(CS2::server::CBeam, m_nDissolveType) == 0x7CC, "m_nDissolveType in CBeam should be at offset 0x7CC");
		static_assert(sizeof(CS2::server::CBeam) == 0x7D0, "CBeam size should be 0x7D0");

#endif
	}
}
