// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#include <SDK/GlobalTypes.hpp>

#include <SDK/server/CBaseTrigger.hpp>
#include <SDK/entity2/CEntityIOOutput.hpp>



namespace CS2 {
	namespace server {
		class CBombTarget : public CS2::server::CBaseTrigger {
		public:
			entity2::CEntityIOOutput m_OnBombExplode; // 0x9c0 | Schema_DeclaredClass | Size: 0x28
			entity2::CEntityIOOutput m_OnBombPlanted; // 0x9e8 | Schema_DeclaredClass | Size: 0x28
			entity2::CEntityIOOutput m_OnBombDefused; // 0xa10 | Schema_DeclaredClass | Size: 0x28
			bool m_bIsBombSiteB; // 0xa38 | Schema_Builtin | Size: 0x1
			bool m_bIsHeistBombTarget; // 0xa39 | Schema_Builtin | Size: 0x1
			bool m_bBombPlantedHere; // 0xa3a | Schema_Builtin | Size: 0x1
			S2_PAD(0x5);
			GlobalTypes::CUtlSymbolLarge m_szMountTarget; // 0xa40 | Schema_Atomic | Size: 0x8
			// server::CHandle< server::CBaseEntity > m_hInstructorHint; // 0xa48 | Schema_Atomic | Size: 0x4
			char  m_hInstructorHint[0x4]; // 0xa48 | Schema_Atomic | Size: 0x4
			int32_t m_nBombSiteDesignation; // 0xa4c | Schema_Builtin | Size: 0x4
		};
		static_assert(offsetof(CS2::server::CBombTarget, m_OnBombExplode) == 0x9C0, "m_OnBombExplode in CBombTarget should be at offset 0x9C0");
		static_assert(offsetof(CS2::server::CBombTarget, m_OnBombPlanted) == 0x9E8, "m_OnBombPlanted in CBombTarget should be at offset 0x9E8");
		static_assert(offsetof(CS2::server::CBombTarget, m_OnBombDefused) == 0xA10, "m_OnBombDefused in CBombTarget should be at offset 0xA10");
		static_assert(offsetof(CS2::server::CBombTarget, m_bIsBombSiteB) == 0xA38, "m_bIsBombSiteB in CBombTarget should be at offset 0xA38");
		static_assert(offsetof(CS2::server::CBombTarget, m_bIsHeistBombTarget) == 0xA39, "m_bIsHeistBombTarget in CBombTarget should be at offset 0xA39");
		static_assert(offsetof(CS2::server::CBombTarget, m_bBombPlantedHere) == 0xA3A, "m_bBombPlantedHere in CBombTarget should be at offset 0xA3A");
		static_assert(offsetof(CS2::server::CBombTarget, m_szMountTarget) == 0xA40, "m_szMountTarget in CBombTarget should be at offset 0xA40");
		static_assert(offsetof(CS2::server::CBombTarget, m_hInstructorHint) == 0xA48, "m_hInstructorHint in CBombTarget should be at offset 0xA48");
		static_assert(offsetof(CS2::server::CBombTarget, m_nBombSiteDesignation) == 0xA4C, "m_nBombSiteDesignation in CBombTarget should be at offset 0xA4C");
		static_assert(sizeof(CS2::server::CBombTarget) == 0xA50, "CBombTarget size should be 0xA50");
	}
}
