// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#ifndef CUSTOM_GLOBAL_TYPES
	#include "../GlobalTypes.hpp"
#else
	#include "../Custom/GlobalTypes.hpp"
#endif


#include "CBaseModelEntity.hpp"
#include "CPropDataComponent.hpp"
#include "Materials.hpp"
#include "Explosions.hpp"
#include "EOverrideBlockLOS_t.hpp"
#include "../entity2/CEntityIOOutput.hpp"
#include "../client/PerformanceMode_t.hpp"
#include "../entity2/GameTime_t.hpp"



namespace CS2 {
	namespace server {
		class CBaseEntity;
		class CBasePlayerPawn;
	}
}


using namespace GlobalTypes;
namespace CS2 {
	namespace server {
		class CBreakable : public CS2::server::CBaseModelEntity {
		public:
			S2_PAD(0x8);
			server::CPropDataComponent m_CPropDataComponent; // 0x738 | Schema_DeclaredClass | Size: 0x40
			server::Materials m_Material; // 0x778 | Schema_DeclaredEnum | Size: 0x4
			GlobalTypes::CHandle<server::CBaseEntity> m_hBreaker; // 0x77c | Schema_Atomic | Size: 0x4
			// char m_hBreaker[0x4]; // 0x77c | Schema_Atomic | Size: 0x4
			server::Explosions m_Explosion; // 0x780 | Schema_DeclaredEnum | Size: 0x4
			S2_PAD(0x4);
			GlobalTypes::CUtlSymbolLarge m_iszSpawnObject; // 0x788 | Schema_Atomic | Size: 0x8
			float32 m_flPressureDelay; // 0x790 | Schema_Builtin | Size: 0x4
			int32_t m_iMinHealthDmg; // 0x794 | Schema_Builtin | Size: 0x4
			GlobalTypes::CUtlSymbolLarge m_iszPropData; // 0x798 | Schema_Atomic | Size: 0x8
			float32 m_impactEnergyScale; // 0x7a0 | Schema_Builtin | Size: 0x4
			server::EOverrideBlockLOS_t m_nOverrideBlockLOS; // 0x7a4 | Schema_DeclaredEnum | Size: 0x4
			entity2::CEntityIOOutput m_OnStartDeath; // 0x7a8 | Schema_DeclaredClass | Size: 0x18
			entity2::CEntityIOOutput m_OnBreak; // 0x7c0 | Schema_DeclaredClass | Size: 0x18
			// GlobalTypes::CEntityOutputTemplate< float32, float32 > m_OnHealthChanged; // 0x7d8 | Schema_Atomic | Size: 0x20
			char m_OnHealthChanged[0x20]; // 0x7d8 | Schema_Atomic | Size: 0x20
			client::PerformanceMode_t m_PerformanceMode; // 0x7f8 | Schema_DeclaredEnum | Size: 0x4
			GlobalTypes::CHandle<server::CBasePlayerPawn> m_hPhysicsAttacker; // 0x7fc | Schema_Atomic | Size: 0x4
			// char m_hPhysicsAttacker[0x4]; // 0x7fc | Schema_Atomic | Size: 0x4
			entity2::GameTime_t m_flLastPhysicsInfluenceTime; // 0x800 | Schema_DeclaredClass | Size: 0x4
			S2_PAD(0x4); // End padding
		};
#ifdef USE_STATIC_ASSERTS
		static_assert(offsetof(CS2::server::CBreakable, m_CPropDataComponent) == 0x738, "m_CPropDataComponent in CBreakable should be at offset 0x738");
		static_assert(offsetof(CS2::server::CBreakable, m_Material) == 0x778, "m_Material in CBreakable should be at offset 0x778");
		static_assert(offsetof(CS2::server::CBreakable, m_hBreaker) == 0x77C, "m_hBreaker in CBreakable should be at offset 0x77C");
		static_assert(offsetof(CS2::server::CBreakable, m_Explosion) == 0x780, "m_Explosion in CBreakable should be at offset 0x780");
		static_assert(offsetof(CS2::server::CBreakable, m_iszSpawnObject) == 0x788, "m_iszSpawnObject in CBreakable should be at offset 0x788");
		static_assert(offsetof(CS2::server::CBreakable, m_flPressureDelay) == 0x790, "m_flPressureDelay in CBreakable should be at offset 0x790");
		static_assert(offsetof(CS2::server::CBreakable, m_iMinHealthDmg) == 0x794, "m_iMinHealthDmg in CBreakable should be at offset 0x794");
		static_assert(offsetof(CS2::server::CBreakable, m_iszPropData) == 0x798, "m_iszPropData in CBreakable should be at offset 0x798");
		static_assert(offsetof(CS2::server::CBreakable, m_impactEnergyScale) == 0x7A0, "m_impactEnergyScale in CBreakable should be at offset 0x7A0");
		static_assert(offsetof(CS2::server::CBreakable, m_nOverrideBlockLOS) == 0x7A4, "m_nOverrideBlockLOS in CBreakable should be at offset 0x7A4");
		static_assert(offsetof(CS2::server::CBreakable, m_OnStartDeath) == 0x7A8, "m_OnStartDeath in CBreakable should be at offset 0x7A8");
		static_assert(offsetof(CS2::server::CBreakable, m_OnBreak) == 0x7C0, "m_OnBreak in CBreakable should be at offset 0x7C0");
		static_assert(offsetof(CS2::server::CBreakable, m_OnHealthChanged) == 0x7D8, "m_OnHealthChanged in CBreakable should be at offset 0x7D8");
		static_assert(offsetof(CS2::server::CBreakable, m_PerformanceMode) == 0x7F8, "m_PerformanceMode in CBreakable should be at offset 0x7F8");
		static_assert(offsetof(CS2::server::CBreakable, m_hPhysicsAttacker) == 0x7FC, "m_hPhysicsAttacker in CBreakable should be at offset 0x7FC");
		static_assert(offsetof(CS2::server::CBreakable, m_flLastPhysicsInfluenceTime) == 0x800, "m_flLastPhysicsInfluenceTime in CBreakable should be at offset 0x800");
		static_assert(sizeof(CS2::server::CBreakable) == 0x808, "CBreakable size should be 0x808");

#endif
	}
}
