// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#include <SDK/GlobalTypes.hpp>

#include <SDK/server/CBaseProp.hpp>
#include <SDK/server/CPropDataComponent.hpp>
#include <SDK/entity2/CEntityIOOutput.hpp>
#include <SDK/client/PerformanceMode_t.hpp>
#include <SDK/entity2/GameTime_t.hpp>
#include <SDK/client/BreakableContentsType_t.hpp>



namespace CS2 {
	namespace server {
		class CBreakableProp : public CS2::server::CBaseProp {
		public:
			S2_PAD(0x8);
			server::CPropDataComponent m_CPropDataComponent; // 0xab8 | Schema_DeclaredClass | Size: 0x40
			entity2::CEntityIOOutput m_OnStartDeath; // 0xaf8 | Schema_DeclaredClass | Size: 0x28
			entity2::CEntityIOOutput m_OnBreak; // 0xb20 | Schema_DeclaredClass | Size: 0x28
			// GlobalTypes::CEntityOutputTemplate< float32 > m_OnHealthChanged; // 0xb48 | Schema_Atomic | Size: 0x28
			char  m_OnHealthChanged[0x28]; // 0xb48 | Schema_Atomic | Size: 0x28
			entity2::CEntityIOOutput m_OnTakeDamage; // 0xb70 | Schema_DeclaredClass | Size: 0x28
			float32 m_impactEnergyScale; // 0xb98 | Schema_Builtin | Size: 0x4
			int32_t m_iMinHealthDmg; // 0xb9c | Schema_Builtin | Size: 0x4
			GlobalTypes::QAngle m_preferredCarryAngles; // 0xba0 | Schema_Atomic | Size: 0xc
			float32 m_flPressureDelay; // 0xbac | Schema_Builtin | Size: 0x4
			float32 m_flDefBurstScale; // 0xbb0 | Schema_Builtin | Size: 0x4
			GlobalTypes::Vector m_vDefBurstOffset; // 0xbb4 | Schema_Atomic | Size: 0xc
			// server::CHandle< server::CBaseEntity > m_hBreaker; // 0xbc0 | Schema_Atomic | Size: 0x4
			char  m_hBreaker[0x4]; // 0xbc0 | Schema_Atomic | Size: 0x4
			client::PerformanceMode_t m_PerformanceMode; // 0xbc4 | Schema_DeclaredEnum | Size: 0x4
			entity2::GameTime_t m_flPreventDamageBeforeTime; // 0xbc8 | Schema_DeclaredClass | Size: 0x4
			client::BreakableContentsType_t m_BreakableContentsType; // 0xbcc | Schema_DeclaredEnum | Size: 0x4
			GlobalTypes::CUtlString m_strBreakableContentsPropGroupOverride; // 0xbd0 | Schema_Atomic | Size: 0x8
			GlobalTypes::CUtlString m_strBreakableContentsParticleOverride; // 0xbd8 | Schema_Atomic | Size: 0x8
			bool m_bHasBreakPiecesOrCommands; // 0xbe0 | Schema_Builtin | Size: 0x1
			S2_PAD(0x3);
			float32 m_explodeDamage; // 0xbe4 | Schema_Builtin | Size: 0x4
			float32 m_explodeRadius; // 0xbe8 | Schema_Builtin | Size: 0x4
			S2_PAD(0x4);
			float32 m_explosionDelay; // 0xbf0 | Schema_Builtin | Size: 0x4
			S2_PAD(0x4);
			GlobalTypes::CUtlSymbolLarge m_explosionBuildupSound; // 0xbf8 | Schema_Atomic | Size: 0x8
			GlobalTypes::CUtlSymbolLarge m_explosionCustomEffect; // 0xc00 | Schema_Atomic | Size: 0x8
			GlobalTypes::CUtlSymbolLarge m_explosionCustomSound; // 0xc08 | Schema_Atomic | Size: 0x8
			GlobalTypes::CUtlSymbolLarge m_explosionModifier; // 0xc10 | Schema_Atomic | Size: 0x8
			// server::CHandle< server::CBasePlayerPawn > m_hPhysicsAttacker; // 0xc18 | Schema_Atomic | Size: 0x4
			char  m_hPhysicsAttacker[0x4]; // 0xc18 | Schema_Atomic | Size: 0x4
			entity2::GameTime_t m_flLastPhysicsInfluenceTime; // 0xc1c | Schema_DeclaredClass | Size: 0x4
			float32 m_flDefaultFadeScale; // 0xc20 | Schema_Builtin | Size: 0x4
			// server::CHandle< server::CBaseEntity > m_hLastAttacker; // 0xc24 | Schema_Atomic | Size: 0x4
			char  m_hLastAttacker[0x4]; // 0xc24 | Schema_Atomic | Size: 0x4
			GlobalTypes::CUtlSymbolLarge m_iszPuntSound; // 0xc28 | Schema_Atomic | Size: 0x8
			bool m_bUsePuntSound; // 0xc30 | Schema_Builtin | Size: 0x1
			bool m_bOriginalBlockLOS; // 0xc31 | Schema_Builtin | Size: 0x1
			S2_PAD(0xe); // End padding
		};
		static_assert(offsetof(CS2::server::CBreakableProp, m_CPropDataComponent) == 0xAB8, "m_CPropDataComponent in CBreakableProp should be at offset 0xAB8");
		static_assert(offsetof(CS2::server::CBreakableProp, m_OnStartDeath) == 0xAF8, "m_OnStartDeath in CBreakableProp should be at offset 0xAF8");
		static_assert(offsetof(CS2::server::CBreakableProp, m_OnBreak) == 0xB20, "m_OnBreak in CBreakableProp should be at offset 0xB20");
		static_assert(offsetof(CS2::server::CBreakableProp, m_OnHealthChanged) == 0xB48, "m_OnHealthChanged in CBreakableProp should be at offset 0xB48");
		static_assert(offsetof(CS2::server::CBreakableProp, m_OnTakeDamage) == 0xB70, "m_OnTakeDamage in CBreakableProp should be at offset 0xB70");
		static_assert(offsetof(CS2::server::CBreakableProp, m_impactEnergyScale) == 0xB98, "m_impactEnergyScale in CBreakableProp should be at offset 0xB98");
		static_assert(offsetof(CS2::server::CBreakableProp, m_iMinHealthDmg) == 0xB9C, "m_iMinHealthDmg in CBreakableProp should be at offset 0xB9C");
		static_assert(offsetof(CS2::server::CBreakableProp, m_preferredCarryAngles) == 0xBA0, "m_preferredCarryAngles in CBreakableProp should be at offset 0xBA0");
		static_assert(offsetof(CS2::server::CBreakableProp, m_flPressureDelay) == 0xBAC, "m_flPressureDelay in CBreakableProp should be at offset 0xBAC");
		static_assert(offsetof(CS2::server::CBreakableProp, m_flDefBurstScale) == 0xBB0, "m_flDefBurstScale in CBreakableProp should be at offset 0xBB0");
		static_assert(offsetof(CS2::server::CBreakableProp, m_vDefBurstOffset) == 0xBB4, "m_vDefBurstOffset in CBreakableProp should be at offset 0xBB4");
		static_assert(offsetof(CS2::server::CBreakableProp, m_hBreaker) == 0xBC0, "m_hBreaker in CBreakableProp should be at offset 0xBC0");
		static_assert(offsetof(CS2::server::CBreakableProp, m_PerformanceMode) == 0xBC4, "m_PerformanceMode in CBreakableProp should be at offset 0xBC4");
		static_assert(offsetof(CS2::server::CBreakableProp, m_flPreventDamageBeforeTime) == 0xBC8, "m_flPreventDamageBeforeTime in CBreakableProp should be at offset 0xBC8");
		static_assert(offsetof(CS2::server::CBreakableProp, m_BreakableContentsType) == 0xBCC, "m_BreakableContentsType in CBreakableProp should be at offset 0xBCC");
		static_assert(offsetof(CS2::server::CBreakableProp, m_strBreakableContentsPropGroupOverride) == 0xBD0, "m_strBreakableContentsPropGroupOverride in CBreakableProp should be at offset 0xBD0");
		static_assert(offsetof(CS2::server::CBreakableProp, m_strBreakableContentsParticleOverride) == 0xBD8, "m_strBreakableContentsParticleOverride in CBreakableProp should be at offset 0xBD8");
		static_assert(offsetof(CS2::server::CBreakableProp, m_bHasBreakPiecesOrCommands) == 0xBE0, "m_bHasBreakPiecesOrCommands in CBreakableProp should be at offset 0xBE0");
		static_assert(offsetof(CS2::server::CBreakableProp, m_explodeDamage) == 0xBE4, "m_explodeDamage in CBreakableProp should be at offset 0xBE4");
		static_assert(offsetof(CS2::server::CBreakableProp, m_explodeRadius) == 0xBE8, "m_explodeRadius in CBreakableProp should be at offset 0xBE8");
		static_assert(offsetof(CS2::server::CBreakableProp, m_explosionDelay) == 0xBF0, "m_explosionDelay in CBreakableProp should be at offset 0xBF0");
		static_assert(offsetof(CS2::server::CBreakableProp, m_explosionBuildupSound) == 0xBF8, "m_explosionBuildupSound in CBreakableProp should be at offset 0xBF8");
		static_assert(offsetof(CS2::server::CBreakableProp, m_explosionCustomEffect) == 0xC00, "m_explosionCustomEffect in CBreakableProp should be at offset 0xC00");
		static_assert(offsetof(CS2::server::CBreakableProp, m_explosionCustomSound) == 0xC08, "m_explosionCustomSound in CBreakableProp should be at offset 0xC08");
		static_assert(offsetof(CS2::server::CBreakableProp, m_explosionModifier) == 0xC10, "m_explosionModifier in CBreakableProp should be at offset 0xC10");
		static_assert(offsetof(CS2::server::CBreakableProp, m_hPhysicsAttacker) == 0xC18, "m_hPhysicsAttacker in CBreakableProp should be at offset 0xC18");
		static_assert(offsetof(CS2::server::CBreakableProp, m_flLastPhysicsInfluenceTime) == 0xC1C, "m_flLastPhysicsInfluenceTime in CBreakableProp should be at offset 0xC1C");
		static_assert(offsetof(CS2::server::CBreakableProp, m_flDefaultFadeScale) == 0xC20, "m_flDefaultFadeScale in CBreakableProp should be at offset 0xC20");
		static_assert(offsetof(CS2::server::CBreakableProp, m_hLastAttacker) == 0xC24, "m_hLastAttacker in CBreakableProp should be at offset 0xC24");
		static_assert(offsetof(CS2::server::CBreakableProp, m_iszPuntSound) == 0xC28, "m_iszPuntSound in CBreakableProp should be at offset 0xC28");
		static_assert(offsetof(CS2::server::CBreakableProp, m_bUsePuntSound) == 0xC30, "m_bUsePuntSound in CBreakableProp should be at offset 0xC30");
		static_assert(offsetof(CS2::server::CBreakableProp, m_bOriginalBlockLOS) == 0xC31, "m_bOriginalBlockLOS in CBreakableProp should be at offset 0xC31");
		static_assert(sizeof(CS2::server::CBreakableProp) == 0xC40, "CBreakableProp size should be 0xC40");
	}
}
