// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#ifndef CUSTOM_GLOBAL_TYPES
	#include "../GlobalTypes.hpp"
#else
	#include "../Custom/GlobalTypes.hpp"
#endif


#include "CBaseProp.hpp"
#include "CPropDataComponent.hpp"
#include "../entity2/CEntityIOOutput.hpp"
#include "../client/PerformanceMode_t.hpp"
#include "../entity2/GameTime_t.hpp"
#include "../client/BreakableContentsType_t.hpp"
#include "../client/BaseExplosionTypes_t.hpp"



namespace CS2 {
	namespace server {
		class CBaseEntity;
		class CBasePlayerPawn;
	}
}


using namespace GlobalTypes;
namespace CS2 {
	namespace server {
		class CBreakableProp : public CS2::server::CBaseProp {
		public:
			S2_PAD(0x8);
			server::CPropDataComponent m_CPropDataComponent; // 0xa58 | Schema_DeclaredClass | Size: 0x40
			entity2::CEntityIOOutput m_OnStartDeath; // 0xa98 | Schema_DeclaredClass | Size: 0x18
			entity2::CEntityIOOutput m_OnBreak; // 0xab0 | Schema_DeclaredClass | Size: 0x18
			// GlobalTypes::CEntityOutputTemplate< float32, float32 > m_OnHealthChanged; // 0xac8 | Schema_Atomic | Size: 0x20
			char m_OnHealthChanged[0x20]; // 0xac8 | Schema_Atomic | Size: 0x20
			entity2::CEntityIOOutput m_OnTakeDamage; // 0xae8 | Schema_DeclaredClass | Size: 0x18
			float32 m_impactEnergyScale; // 0xb00 | Schema_Builtin | Size: 0x4
			int32_t m_iMinHealthDmg; // 0xb04 | Schema_Builtin | Size: 0x4
			GlobalTypes::QAngle m_preferredCarryAngles; // 0xb08 | Schema_Atomic | Size: 0xc
			float32 m_flPressureDelay; // 0xb14 | Schema_Builtin | Size: 0x4
			float32 m_flDefBurstScale; // 0xb18 | Schema_Builtin | Size: 0x4
			GlobalTypes::Vector m_vDefBurstOffset; // 0xb1c | Schema_Atomic | Size: 0xc
			GlobalTypes::CHandle<server::CBaseEntity> m_hBreaker; // 0xb28 | Schema_Atomic | Size: 0x4
			// char m_hBreaker[0x4]; // 0xb28 | Schema_Atomic | Size: 0x4
			client::PerformanceMode_t m_PerformanceMode; // 0xb2c | Schema_DeclaredEnum | Size: 0x4
			entity2::GameTime_t m_flPreventDamageBeforeTime; // 0xb30 | Schema_DeclaredClass | Size: 0x4
			client::BreakableContentsType_t m_BreakableContentsType; // 0xb34 | Schema_DeclaredEnum | Size: 0x4
			GlobalTypes::CUtlString m_strBreakableContentsPropGroupOverride; // 0xb38 | Schema_Atomic | Size: 0x8
			GlobalTypes::CUtlString m_strBreakableContentsParticleOverride; // 0xb40 | Schema_Atomic | Size: 0x8
			bool m_bHasBreakPiecesOrCommands; // 0xb48 | Schema_Builtin | Size: 0x1
			S2_PAD(0x3);
			float32 m_explodeDamage; // 0xb4c | Schema_Builtin | Size: 0x4
			float32 m_explodeRadius; // 0xb50 | Schema_Builtin | Size: 0x4
			client::BaseExplosionTypes_t m_nExplosionType; // 0xb54 | Schema_DeclaredEnum | Size: 0x4
			float32 m_explosionDelay; // 0xb58 | Schema_Builtin | Size: 0x4
			S2_PAD(0x4);
			GlobalTypes::CUtlSymbolLarge m_explosionBuildupSound; // 0xb60 | Schema_Atomic | Size: 0x8
			GlobalTypes::CUtlSymbolLarge m_explosionCustomEffect; // 0xb68 | Schema_Atomic | Size: 0x8
			GlobalTypes::CUtlSymbolLarge m_explosionCustomSound; // 0xb70 | Schema_Atomic | Size: 0x8
			GlobalTypes::CUtlSymbolLarge m_explosionModifier; // 0xb78 | Schema_Atomic | Size: 0x8
			GlobalTypes::CHandle<server::CBasePlayerPawn> m_hPhysicsAttacker; // 0xb80 | Schema_Atomic | Size: 0x4
			// char m_hPhysicsAttacker[0x4]; // 0xb80 | Schema_Atomic | Size: 0x4
			entity2::GameTime_t m_flLastPhysicsInfluenceTime; // 0xb84 | Schema_DeclaredClass | Size: 0x4
			float32 m_flDefaultFadeScale; // 0xb88 | Schema_Builtin | Size: 0x4
			GlobalTypes::CHandle<server::CBaseEntity> m_hLastAttacker; // 0xb8c | Schema_Atomic | Size: 0x4
			// char m_hLastAttacker[0x4]; // 0xb8c | Schema_Atomic | Size: 0x4
			GlobalTypes::CUtlSymbolLarge m_iszPuntSound; // 0xb90 | Schema_Atomic | Size: 0x8
			bool m_bUsePuntSound; // 0xb98 | Schema_Builtin | Size: 0x1
			bool m_bOriginalBlockLOS; // 0xb99 | Schema_Builtin | Size: 0x1
			S2_PAD(0x6); // End padding
		};
		static_assert(offsetof(CS2::server::CBreakableProp, m_CPropDataComponent) == 0xA58, "m_CPropDataComponent in CBreakableProp should be at offset 0xA58");
		static_assert(offsetof(CS2::server::CBreakableProp, m_OnStartDeath) == 0xA98, "m_OnStartDeath in CBreakableProp should be at offset 0xA98");
		static_assert(offsetof(CS2::server::CBreakableProp, m_OnBreak) == 0xAB0, "m_OnBreak in CBreakableProp should be at offset 0xAB0");
		static_assert(offsetof(CS2::server::CBreakableProp, m_OnHealthChanged) == 0xAC8, "m_OnHealthChanged in CBreakableProp should be at offset 0xAC8");
		static_assert(offsetof(CS2::server::CBreakableProp, m_OnTakeDamage) == 0xAE8, "m_OnTakeDamage in CBreakableProp should be at offset 0xAE8");
		static_assert(offsetof(CS2::server::CBreakableProp, m_impactEnergyScale) == 0xB00, "m_impactEnergyScale in CBreakableProp should be at offset 0xB00");
		static_assert(offsetof(CS2::server::CBreakableProp, m_iMinHealthDmg) == 0xB04, "m_iMinHealthDmg in CBreakableProp should be at offset 0xB04");
		static_assert(offsetof(CS2::server::CBreakableProp, m_preferredCarryAngles) == 0xB08, "m_preferredCarryAngles in CBreakableProp should be at offset 0xB08");
		static_assert(offsetof(CS2::server::CBreakableProp, m_flPressureDelay) == 0xB14, "m_flPressureDelay in CBreakableProp should be at offset 0xB14");
		static_assert(offsetof(CS2::server::CBreakableProp, m_flDefBurstScale) == 0xB18, "m_flDefBurstScale in CBreakableProp should be at offset 0xB18");
		static_assert(offsetof(CS2::server::CBreakableProp, m_vDefBurstOffset) == 0xB1C, "m_vDefBurstOffset in CBreakableProp should be at offset 0xB1C");
		static_assert(offsetof(CS2::server::CBreakableProp, m_hBreaker) == 0xB28, "m_hBreaker in CBreakableProp should be at offset 0xB28");
		static_assert(offsetof(CS2::server::CBreakableProp, m_PerformanceMode) == 0xB2C, "m_PerformanceMode in CBreakableProp should be at offset 0xB2C");
		static_assert(offsetof(CS2::server::CBreakableProp, m_flPreventDamageBeforeTime) == 0xB30, "m_flPreventDamageBeforeTime in CBreakableProp should be at offset 0xB30");
		static_assert(offsetof(CS2::server::CBreakableProp, m_BreakableContentsType) == 0xB34, "m_BreakableContentsType in CBreakableProp should be at offset 0xB34");
		static_assert(offsetof(CS2::server::CBreakableProp, m_strBreakableContentsPropGroupOverride) == 0xB38, "m_strBreakableContentsPropGroupOverride in CBreakableProp should be at offset 0xB38");
		static_assert(offsetof(CS2::server::CBreakableProp, m_strBreakableContentsParticleOverride) == 0xB40, "m_strBreakableContentsParticleOverride in CBreakableProp should be at offset 0xB40");
		static_assert(offsetof(CS2::server::CBreakableProp, m_bHasBreakPiecesOrCommands) == 0xB48, "m_bHasBreakPiecesOrCommands in CBreakableProp should be at offset 0xB48");
		static_assert(offsetof(CS2::server::CBreakableProp, m_explodeDamage) == 0xB4C, "m_explodeDamage in CBreakableProp should be at offset 0xB4C");
		static_assert(offsetof(CS2::server::CBreakableProp, m_explodeRadius) == 0xB50, "m_explodeRadius in CBreakableProp should be at offset 0xB50");
		static_assert(offsetof(CS2::server::CBreakableProp, m_nExplosionType) == 0xB54, "m_nExplosionType in CBreakableProp should be at offset 0xB54");
		static_assert(offsetof(CS2::server::CBreakableProp, m_explosionDelay) == 0xB58, "m_explosionDelay in CBreakableProp should be at offset 0xB58");
		static_assert(offsetof(CS2::server::CBreakableProp, m_explosionBuildupSound) == 0xB60, "m_explosionBuildupSound in CBreakableProp should be at offset 0xB60");
		static_assert(offsetof(CS2::server::CBreakableProp, m_explosionCustomEffect) == 0xB68, "m_explosionCustomEffect in CBreakableProp should be at offset 0xB68");
		static_assert(offsetof(CS2::server::CBreakableProp, m_explosionCustomSound) == 0xB70, "m_explosionCustomSound in CBreakableProp should be at offset 0xB70");
		static_assert(offsetof(CS2::server::CBreakableProp, m_explosionModifier) == 0xB78, "m_explosionModifier in CBreakableProp should be at offset 0xB78");
		static_assert(offsetof(CS2::server::CBreakableProp, m_hPhysicsAttacker) == 0xB80, "m_hPhysicsAttacker in CBreakableProp should be at offset 0xB80");
		static_assert(offsetof(CS2::server::CBreakableProp, m_flLastPhysicsInfluenceTime) == 0xB84, "m_flLastPhysicsInfluenceTime in CBreakableProp should be at offset 0xB84");
		static_assert(offsetof(CS2::server::CBreakableProp, m_flDefaultFadeScale) == 0xB88, "m_flDefaultFadeScale in CBreakableProp should be at offset 0xB88");
		static_assert(offsetof(CS2::server::CBreakableProp, m_hLastAttacker) == 0xB8C, "m_hLastAttacker in CBreakableProp should be at offset 0xB8C");
		static_assert(offsetof(CS2::server::CBreakableProp, m_iszPuntSound) == 0xB90, "m_iszPuntSound in CBreakableProp should be at offset 0xB90");
		static_assert(offsetof(CS2::server::CBreakableProp, m_bUsePuntSound) == 0xB98, "m_bUsePuntSound in CBreakableProp should be at offset 0xB98");
		static_assert(offsetof(CS2::server::CBreakableProp, m_bOriginalBlockLOS) == 0xB99, "m_bOriginalBlockLOS in CBreakableProp should be at offset 0xB99");
		static_assert(sizeof(CS2::server::CBreakableProp) == 0xBA0, "CBreakableProp size should be 0xBA0");
	}
}
