// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#include <SDK/GlobalTypes.hpp>

#include <SDK/server/CBtNode.hpp>
#include <SDK/server/CountdownTimer.hpp>



namespace CS2 {
	namespace server {
		class CBtActionCombatPositioning : public CS2::server::CBtNode {
		public:
			S2_PAD(0x10);
			GlobalTypes::CUtlString m_szSensorInputKey; // 0x68 | Schema_Atomic | Size: 0x8
			S2_PAD(0x10);
			GlobalTypes::CUtlString m_szIsAttackingKey; // 0x80 | Schema_Atomic | Size: 0x8
			server::CountdownTimer m_ActionTimer; // 0x88 | Schema_DeclaredClass | Size: 0x18
			bool m_bCrouching; // 0xa0 | Schema_Builtin | Size: 0x1
			S2_PAD(0xf); // End padding
		};
		static_assert(offsetof(CS2::server::CBtActionCombatPositioning, m_szSensorInputKey) == 0x68, "m_szSensorInputKey in CBtActionCombatPositioning should be at offset 0x68");
		static_assert(offsetof(CS2::server::CBtActionCombatPositioning, m_szIsAttackingKey) == 0x80, "m_szIsAttackingKey in CBtActionCombatPositioning should be at offset 0x80");
		static_assert(offsetof(CS2::server::CBtActionCombatPositioning, m_ActionTimer) == 0x88, "m_ActionTimer in CBtActionCombatPositioning should be at offset 0x88");
		static_assert(offsetof(CS2::server::CBtActionCombatPositioning, m_bCrouching) == 0xA0, "m_bCrouching in CBtActionCombatPositioning should be at offset 0xA0");
		static_assert(sizeof(CS2::server::CBtActionCombatPositioning) == 0xB0, "CBtActionCombatPositioning size should be 0xB0");
	}
}
