// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#include <SDK/GlobalTypes.hpp>

#include <SDK/server/CCSWeaponBase.hpp>
#include <SDK/entity2/GameTime_t.hpp>
#include <SDK/server/EntitySpottedState_t.hpp>



namespace CS2 {
	namespace server {
		class CC4 : public CS2::server::CCSWeaponBase {
		public:
			public:
			S2_PAD(0x30);
			GlobalTypes::Vector m_vecLastValidPlayerHeldPosition; // 0x1060 | Schema_Atomic | Size: 0xc
			GlobalTypes::Vector m_vecLastValidDroppedPosition; // 0x106c | Schema_Atomic | Size: 0xc
			bool m_bDoValidDroppedPositionCheck; // 0x1078 | Schema_Builtin | Size: 0x1
			bool m_bStartedArming; // 0x1079 | Schema_Builtin | Size: 0x1
			S2_PAD(0x2);
			entity2::GameTime_t m_fArmedTime; // 0x107c | Schema_DeclaredClass | Size: 0x4
			bool m_bBombPlacedAnimation; // 0x1080 | Schema_Builtin | Size: 0x1
			bool m_bIsPlantingViaUse; // 0x1081 | Schema_Builtin | Size: 0x1
			S2_PAD(0x6);
			server::EntitySpottedState_t m_entitySpottedState; // 0x1088 | Schema_DeclaredClass | Size: 0x18
			int32_t m_nSpotRules; // 0x10a0 | Schema_Builtin | Size: 0x4
			bool m_bPlayedArmingBeeps[7]; // 0x10a4 | Schema_FixedArray | Size: 0x7
			bool m_bBombPlanted; // 0x10ab | Schema_Builtin | Size: 0x1
			S2_PAD(0x4); // End padding
		};
		static_assert(offsetof(CS2::server::CC4, m_vecLastValidPlayerHeldPosition) == 0x1060, "m_vecLastValidPlayerHeldPosition in CC4 should be at offset 0x1060");
		static_assert(offsetof(CS2::server::CC4, m_vecLastValidDroppedPosition) == 0x106C, "m_vecLastValidDroppedPosition in CC4 should be at offset 0x106C");
		static_assert(offsetof(CS2::server::CC4, m_bDoValidDroppedPositionCheck) == 0x1078, "m_bDoValidDroppedPositionCheck in CC4 should be at offset 0x1078");
		static_assert(offsetof(CS2::server::CC4, m_bStartedArming) == 0x1079, "m_bStartedArming in CC4 should be at offset 0x1079");
		static_assert(offsetof(CS2::server::CC4, m_fArmedTime) == 0x107C, "m_fArmedTime in CC4 should be at offset 0x107C");
		static_assert(offsetof(CS2::server::CC4, m_bBombPlacedAnimation) == 0x1080, "m_bBombPlacedAnimation in CC4 should be at offset 0x1080");
		static_assert(offsetof(CS2::server::CC4, m_bIsPlantingViaUse) == 0x1081, "m_bIsPlantingViaUse in CC4 should be at offset 0x1081");
		static_assert(offsetof(CS2::server::CC4, m_entitySpottedState) == 0x1088, "m_entitySpottedState in CC4 should be at offset 0x1088");
		static_assert(offsetof(CS2::server::CC4, m_nSpotRules) == 0x10A0, "m_nSpotRules in CC4 should be at offset 0x10A0");
		static_assert(offsetof(CS2::server::CC4, m_bPlayedArmingBeeps) == 0x10A4, "m_bPlayedArmingBeeps in CC4 should be at offset 0x10A4");
		static_assert(offsetof(CS2::server::CC4, m_bBombPlanted) == 0x10AB, "m_bBombPlanted in CC4 should be at offset 0x10AB");
		static_assert(sizeof(CS2::server::CC4) == 0x10B0, "CC4 size should be 0x10B0");
	}
}
