// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#include <SDK/GlobalTypes.hpp>

#include <SDK/server/CBaseTrigger.hpp>
#include <SDK/entity2/CEntityIOOutput.hpp>



namespace CS2 {
	namespace server {
		class CChangeLevel : public CS2::server::CBaseTrigger {
		public:
			GlobalTypes::CUtlString m_sMapName; // 0x9b8 | Schema_Atomic | Size: 0x8
			GlobalTypes::CUtlString m_sLandmarkName; // 0x9c0 | Schema_Atomic | Size: 0x8
			entity2::CEntityIOOutput m_OnChangeLevel; // 0x9c8 | Schema_DeclaredClass | Size: 0x28
			bool m_bTouched; // 0x9f0 | Schema_Builtin | Size: 0x1
			bool m_bNoTouch; // 0x9f1 | Schema_Builtin | Size: 0x1
			bool m_bNewChapter; // 0x9f2 | Schema_Builtin | Size: 0x1
			bool m_bOnChangeLevelFired; // 0x9f3 | Schema_Builtin | Size: 0x1
			S2_PAD(0x4); // End padding
		};
		static_assert(offsetof(CS2::server::CChangeLevel, m_sMapName) == 0x9B8, "m_sMapName in CChangeLevel should be at offset 0x9B8");
		static_assert(offsetof(CS2::server::CChangeLevel, m_sLandmarkName) == 0x9C0, "m_sLandmarkName in CChangeLevel should be at offset 0x9C0");
		static_assert(offsetof(CS2::server::CChangeLevel, m_OnChangeLevel) == 0x9C8, "m_OnChangeLevel in CChangeLevel should be at offset 0x9C8");
		static_assert(offsetof(CS2::server::CChangeLevel, m_bTouched) == 0x9F0, "m_bTouched in CChangeLevel should be at offset 0x9F0");
		static_assert(offsetof(CS2::server::CChangeLevel, m_bNoTouch) == 0x9F1, "m_bNoTouch in CChangeLevel should be at offset 0x9F1");
		static_assert(offsetof(CS2::server::CChangeLevel, m_bNewChapter) == 0x9F2, "m_bNewChapter in CChangeLevel should be at offset 0x9F2");
		static_assert(offsetof(CS2::server::CChangeLevel, m_bOnChangeLevelFired) == 0x9F3, "m_bOnChangeLevelFired in CChangeLevel should be at offset 0x9F3");
		static_assert(sizeof(CS2::server::CChangeLevel) == 0x9F8, "CChangeLevel size should be 0x9F8");
	}
}
