// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#ifndef CUSTOM_GLOBAL_TYPES
	#include "../GlobalTypes.hpp"
#else
	#include "../Custom/GlobalTypes.hpp"
#endif


#include "CBaseTrigger.hpp"
#include "../entity2/CEntityIOOutput.hpp"





using namespace GlobalTypes;
namespace CS2 {
	namespace server {
		class CChangeLevel : public CS2::server::CBaseTrigger {
		public:
			GlobalTypes::CUtlString m_sMapName; // 0x890 | Schema_Atomic | Size: 0x8
			GlobalTypes::CUtlString m_sLandmarkName; // 0x898 | Schema_Atomic | Size: 0x8
			entity2::CEntityIOOutput m_OnChangeLevel; // 0x8a0 | Schema_DeclaredClass | Size: 0x18
			bool m_bTouched; // 0x8b8 | Schema_Builtin | Size: 0x1
			bool m_bNoTouch; // 0x8b9 | Schema_Builtin | Size: 0x1
			bool m_bNewChapter; // 0x8ba | Schema_Builtin | Size: 0x1
			bool m_bOnChangeLevelFired; // 0x8bb | Schema_Builtin | Size: 0x1
			S2_PAD(0x4); // End padding
		};
		static_assert(offsetof(CS2::server::CChangeLevel, m_sMapName) == 0x890, "m_sMapName in CChangeLevel should be at offset 0x890");
		static_assert(offsetof(CS2::server::CChangeLevel, m_sLandmarkName) == 0x898, "m_sLandmarkName in CChangeLevel should be at offset 0x898");
		static_assert(offsetof(CS2::server::CChangeLevel, m_OnChangeLevel) == 0x8A0, "m_OnChangeLevel in CChangeLevel should be at offset 0x8A0");
		static_assert(offsetof(CS2::server::CChangeLevel, m_bTouched) == 0x8B8, "m_bTouched in CChangeLevel should be at offset 0x8B8");
		static_assert(offsetof(CS2::server::CChangeLevel, m_bNoTouch) == 0x8B9, "m_bNoTouch in CChangeLevel should be at offset 0x8B9");
		static_assert(offsetof(CS2::server::CChangeLevel, m_bNewChapter) == 0x8BA, "m_bNewChapter in CChangeLevel should be at offset 0x8BA");
		static_assert(offsetof(CS2::server::CChangeLevel, m_bOnChangeLevelFired) == 0x8BB, "m_bOnChangeLevelFired in CChangeLevel should be at offset 0x8BB");
		static_assert(sizeof(CS2::server::CChangeLevel) == 0x8C0, "CChangeLevel size should be 0x8C0");
	}
}
