// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#ifndef CUSTOM_GLOBAL_TYPES
	#include <SDK/GlobalTypes.hpp>
#else
	#include <Custom/GlobalTypes.hpp>
#endif


#include <SDK/server/CBot.hpp>
#include <SDK/server/CountdownTimer.hpp>
#include <SDK/server/IntervalTimer.hpp>
#include <SDK/entity2/GameTime_t.hpp>



namespace CS2 {
	namespace server {
		class CCSPlayerPawn;
		class CBaseEntity;
	}
}


using namespace GlobalTypes;
namespace CS2 {
	namespace server {
		class CCSBot : public CS2::server::CBot {
		public:
			S2_PAD(0x8);
			GlobalTypes::VectorWS m_eyePosition; // 0x108 | Schema_Atomic | Size: 0xc
			char m_name[64]; // 0x114 | Schema_FixedArray | Size: 0x40
			float32 m_combatRange; // 0x154 | Schema_Builtin | Size: 0x4
			bool m_isRogue; // 0x158 | Schema_Builtin | Size: 0x1
			S2_PAD(0x7);
			server::CountdownTimer m_rogueTimer; // 0x160 | Schema_DeclaredClass | Size: 0x18
			S2_PAD(0x4);
			bool m_diedLastRound; // 0x17c | Schema_Builtin | Size: 0x1
			S2_PAD(0x3);
			float32 m_safeTime; // 0x180 | Schema_Builtin | Size: 0x4
			bool m_wasSafe; // 0x184 | Schema_Builtin | Size: 0x1
			S2_PAD(0x7);
			bool m_blindFire; // 0x18c | Schema_Builtin | Size: 0x1
			S2_PAD(0x3);
			server::CountdownTimer m_surpriseTimer; // 0x190 | Schema_DeclaredClass | Size: 0x18
			bool m_bAllowActive; // 0x1a8 | Schema_Builtin | Size: 0x1
			bool m_isFollowing; // 0x1a9 | Schema_Builtin | Size: 0x1
			S2_PAD(0x2);
			GlobalTypes::CHandle<server::CCSPlayerPawn> m_leader; // 0x1ac | Schema_Atomic | Size: 0x4
			// char m_leader[0x4]; // 0x1ac | Schema_Atomic | Size: 0x4
			float32 m_followTimestamp; // 0x1b0 | Schema_Builtin | Size: 0x4
			float32 m_allowAutoFollowTime; // 0x1b4 | Schema_Builtin | Size: 0x4
			server::CountdownTimer m_hurryTimer; // 0x1b8 | Schema_DeclaredClass | Size: 0x18
			server::CountdownTimer m_alertTimer; // 0x1d0 | Schema_DeclaredClass | Size: 0x18
			server::CountdownTimer m_sneakTimer; // 0x1e8 | Schema_DeclaredClass | Size: 0x18
			server::CountdownTimer m_panicTimer; // 0x200 | Schema_DeclaredClass | Size: 0x18
			S2_PAD(0x380);
			float32 m_stateTimestamp; // 0x598 | Schema_Builtin | Size: 0x4
			bool m_isAttacking; // 0x59c | Schema_Builtin | Size: 0x1
			bool m_isOpeningDoor; // 0x59d | Schema_Builtin | Size: 0x1
			S2_PAD(0x6);
			GlobalTypes::CHandle<server::CBaseEntity> m_taskEntity; // 0x5a4 | Schema_Atomic | Size: 0x4
			// char m_taskEntity[0x4]; // 0x5a4 | Schema_Atomic | Size: 0x4
			S2_PAD(0xc);
			GlobalTypes::VectorWS m_goalPosition; // 0x5b4 | Schema_Atomic | Size: 0xc
			GlobalTypes::CHandle<server::CBaseEntity> m_goalEntity; // 0x5c0 | Schema_Atomic | Size: 0x4
			// char m_goalEntity[0x4]; // 0x5c0 | Schema_Atomic | Size: 0x4
			GlobalTypes::CHandle<server::CBaseEntity> m_avoid; // 0x5c4 | Schema_Atomic | Size: 0x4
			// char m_avoid[0x4]; // 0x5c4 | Schema_Atomic | Size: 0x4
			float32 m_avoidTimestamp; // 0x5c8 | Schema_Builtin | Size: 0x4
			bool m_isStopping; // 0x5cc | Schema_Builtin | Size: 0x1
			bool m_hasVisitedEnemySpawn; // 0x5cd | Schema_Builtin | Size: 0x1
			S2_PAD(0x2);
			server::IntervalTimer m_stillTimer; // 0x5d0 | Schema_DeclaredClass | Size: 0x10
			bool m_bEyeAnglesUnderPathFinderControl; // 0x5e0 | Schema_Builtin | Size: 0x1
			S2_PAD(0x58ff);
			int32_t m_pathIndex; // 0x5ee0 | Schema_Builtin | Size: 0x4
			entity2::GameTime_t m_areaEnteredTimestamp; // 0x5ee4 | Schema_DeclaredClass | Size: 0x4
			server::CountdownTimer m_repathTimer; // 0x5ee8 | Schema_DeclaredClass | Size: 0x18
			server::CountdownTimer m_avoidFriendTimer; // 0x5f00 | Schema_DeclaredClass | Size: 0x18
			bool m_isFriendInTheWay; // 0x5f18 | Schema_Builtin | Size: 0x1
			S2_PAD(0x7);
			server::CountdownTimer m_politeTimer; // 0x5f20 | Schema_DeclaredClass | Size: 0x18
			bool m_isWaitingBehindFriend; // 0x5f38 | Schema_Builtin | Size: 0x1
			S2_PAD(0x2b);
			float32 m_pathLadderEnd; // 0x5f64 | Schema_Builtin | Size: 0x4
			S2_PAD(0x48);
			server::CountdownTimer m_mustRunTimer; // 0x5fb0 | Schema_DeclaredClass | Size: 0x18
			server::CountdownTimer m_waitTimer; // 0x5fc8 | Schema_DeclaredClass | Size: 0x18
			server::CountdownTimer m_updateTravelDistanceTimer; // 0x5fe0 | Schema_DeclaredClass | Size: 0x18
			float32 m_playerTravelDistance[64]; // 0x5ff8 | Schema_FixedArray | Size: 0x100
			uint8_t m_travelDistancePhase; // 0x60f8 | Schema_Builtin | Size: 0x1
			S2_PAD(0x197);
			uint8_t m_hostageEscortCount; // 0x6290 | Schema_Builtin | Size: 0x1
			S2_PAD(0x3);
			float32 m_hostageEscortCountTimestamp; // 0x6294 | Schema_Builtin | Size: 0x4
			int32_t m_desiredTeam; // 0x6298 | Schema_Builtin | Size: 0x4
			bool m_hasJoined; // 0x629c | Schema_Builtin | Size: 0x1
			bool m_isWaitingForHostage; // 0x629d | Schema_Builtin | Size: 0x1
			S2_PAD(0x2);
			server::CountdownTimer m_inhibitWaitingForHostageTimer; // 0x62a0 | Schema_DeclaredClass | Size: 0x18
			server::CountdownTimer m_waitForHostageTimer; // 0x62b8 | Schema_DeclaredClass | Size: 0x18
			GlobalTypes::Vector m_noisePosition; // 0x62d0 | Schema_Atomic | Size: 0xc
			float32 m_noiseTravelDistance; // 0x62dc | Schema_Builtin | Size: 0x4
			float32 m_noiseTimestamp; // 0x62e0 | Schema_Builtin | Size: 0x4
			S2_PAD(0x4);
			server::CCSPlayerPawn* m_noiseSource; // 0x62e8 | Schema_Ptr | Size: 0x8
			S2_PAD(0x10);
			server::CountdownTimer m_noiseBendTimer; // 0x6300 | Schema_DeclaredClass | Size: 0x18
			GlobalTypes::Vector m_bentNoisePosition; // 0x6318 | Schema_Atomic | Size: 0xc
			bool m_bendNoisePositionValid; // 0x6324 | Schema_Builtin | Size: 0x1
			S2_PAD(0x3);
			float32 m_lookAroundStateTimestamp; // 0x6328 | Schema_Builtin | Size: 0x4
			float32 m_lookAheadAngle; // 0x632c | Schema_Builtin | Size: 0x4
			float32 m_forwardAngle; // 0x6330 | Schema_Builtin | Size: 0x4
			float32 m_inhibitLookAroundTimestamp; // 0x6334 | Schema_Builtin | Size: 0x4
			S2_PAD(0x4);
			GlobalTypes::Vector m_lookAtSpot; // 0x633c | Schema_Atomic | Size: 0xc
			S2_PAD(0x4);
			float32 m_lookAtSpotDuration; // 0x634c | Schema_Builtin | Size: 0x4
			float32 m_lookAtSpotTimestamp; // 0x6350 | Schema_Builtin | Size: 0x4
			float32 m_lookAtSpotAngleTolerance; // 0x6354 | Schema_Builtin | Size: 0x4
			bool m_lookAtSpotClearIfClose; // 0x6358 | Schema_Builtin | Size: 0x1
			bool m_lookAtSpotAttack; // 0x6359 | Schema_Builtin | Size: 0x1
			S2_PAD(0x6);
			char* m_lookAtDesc; // 0x6360 | Schema_Ptr | Size: 0x8
			float32 m_peripheralTimestamp; // 0x6368 | Schema_Builtin | Size: 0x4
			S2_PAD(0x184);
			uint8_t m_approachPointCount; // 0x64f0 | Schema_Builtin | Size: 0x1
			S2_PAD(0x3);
			GlobalTypes::Vector m_approachPointViewPosition; // 0x64f4 | Schema_Atomic | Size: 0xc
			server::IntervalTimer m_viewSteadyTimer; // 0x6500 | Schema_DeclaredClass | Size: 0x10
			S2_PAD(0x8);
			server::CountdownTimer m_tossGrenadeTimer; // 0x6518 | Schema_DeclaredClass | Size: 0x18
			S2_PAD(0x8);
			server::CountdownTimer m_isAvoidingGrenade; // 0x6538 | Schema_DeclaredClass | Size: 0x18
			S2_PAD(0x8);
			float32 m_spotCheckTimestamp; // 0x6558 | Schema_Builtin | Size: 0x4
			S2_PAD(0x404);
			int32_t m_checkedHidingSpotCount; // 0x6960 | Schema_Builtin | Size: 0x4
			float32 m_lookPitch; // 0x6964 | Schema_Builtin | Size: 0x4
			float32 m_lookPitchVel; // 0x6968 | Schema_Builtin | Size: 0x4
			float32 m_lookYaw; // 0x696c | Schema_Builtin | Size: 0x4
			float32 m_lookYawVel; // 0x6970 | Schema_Builtin | Size: 0x4
			GlobalTypes::Vector m_targetSpot; // 0x6974 | Schema_Atomic | Size: 0xc
			GlobalTypes::Vector m_targetSpotVelocity; // 0x6980 | Schema_Atomic | Size: 0xc
			GlobalTypes::Vector m_targetSpotPredicted; // 0x698c | Schema_Atomic | Size: 0xc
			GlobalTypes::QAngle m_aimError; // 0x6998 | Schema_Atomic | Size: 0xc
			GlobalTypes::QAngle m_aimGoal; // 0x69a4 | Schema_Atomic | Size: 0xc
			entity2::GameTime_t m_targetSpotTime; // 0x69b0 | Schema_DeclaredClass | Size: 0x4
			float32 m_aimFocus; // 0x69b4 | Schema_Builtin | Size: 0x4
			float32 m_aimFocusInterval; // 0x69b8 | Schema_Builtin | Size: 0x4
			entity2::GameTime_t m_aimFocusNextUpdate; // 0x69bc | Schema_DeclaredClass | Size: 0x4
			S2_PAD(0x8);
			server::CountdownTimer m_ignoreEnemiesTimer; // 0x69c8 | Schema_DeclaredClass | Size: 0x18
			GlobalTypes::CHandle<server::CCSPlayerPawn> m_enemy; // 0x69e0 | Schema_Atomic | Size: 0x4
			// char m_enemy[0x4]; // 0x69e0 | Schema_Atomic | Size: 0x4
			bool m_isEnemyVisible; // 0x69e4 | Schema_Builtin | Size: 0x1
			uint8_t m_visibleEnemyParts; // 0x69e5 | Schema_Builtin | Size: 0x1
			S2_PAD(0x2);
			GlobalTypes::Vector m_lastEnemyPosition; // 0x69e8 | Schema_Atomic | Size: 0xc
			float32 m_lastSawEnemyTimestamp; // 0x69f4 | Schema_Builtin | Size: 0x4
			float32 m_firstSawEnemyTimestamp; // 0x69f8 | Schema_Builtin | Size: 0x4
			float32 m_currentEnemyAcquireTimestamp; // 0x69fc | Schema_Builtin | Size: 0x4
			float32 m_enemyDeathTimestamp; // 0x6a00 | Schema_Builtin | Size: 0x4
			float32 m_friendDeathTimestamp; // 0x6a04 | Schema_Builtin | Size: 0x4
			bool m_isLastEnemyDead; // 0x6a08 | Schema_Builtin | Size: 0x1
			S2_PAD(0x3);
			int32_t m_nearbyEnemyCount; // 0x6a0c | Schema_Builtin | Size: 0x4
			S2_PAD(0x208);
			GlobalTypes::CHandle<server::CCSPlayerPawn> m_bomber; // 0x6c18 | Schema_Atomic | Size: 0x4
			// char m_bomber[0x4]; // 0x6c18 | Schema_Atomic | Size: 0x4
			int32_t m_nearbyFriendCount; // 0x6c1c | Schema_Builtin | Size: 0x4
			GlobalTypes::CHandle<server::CCSPlayerPawn> m_closestVisibleFriend; // 0x6c20 | Schema_Atomic | Size: 0x4
			// char m_closestVisibleFriend[0x4]; // 0x6c20 | Schema_Atomic | Size: 0x4
			GlobalTypes::CHandle<server::CCSPlayerPawn> m_closestVisibleHumanFriend; // 0x6c24 | Schema_Atomic | Size: 0x4
			// char m_closestVisibleHumanFriend[0x4]; // 0x6c24 | Schema_Atomic | Size: 0x4
			server::IntervalTimer m_attentionInterval; // 0x6c28 | Schema_DeclaredClass | Size: 0x10
			GlobalTypes::CHandle<server::CCSPlayerPawn> m_attacker; // 0x6c38 | Schema_Atomic | Size: 0x4
			// char m_attacker[0x4]; // 0x6c38 | Schema_Atomic | Size: 0x4
			float32 m_attackedTimestamp; // 0x6c3c | Schema_Builtin | Size: 0x4
			server::IntervalTimer m_burnedByFlamesTimer; // 0x6c40 | Schema_DeclaredClass | Size: 0x10
			int32_t m_lastVictimID; // 0x6c50 | Schema_Builtin | Size: 0x4
			bool m_isAimingAtEnemy; // 0x6c54 | Schema_Builtin | Size: 0x1
			bool m_isRapidFiring; // 0x6c55 | Schema_Builtin | Size: 0x1
			S2_PAD(0x2);
			server::IntervalTimer m_equipTimer; // 0x6c58 | Schema_DeclaredClass | Size: 0x10
			server::CountdownTimer m_zoomTimer; // 0x6c68 | Schema_DeclaredClass | Size: 0x18
			entity2::GameTime_t m_fireWeaponTimestamp; // 0x6c80 | Schema_DeclaredClass | Size: 0x4
			S2_PAD(0x4);
			server::CountdownTimer m_lookForWeaponsOnGroundTimer; // 0x6c88 | Schema_DeclaredClass | Size: 0x18
			bool m_bIsSleeping; // 0x6ca0 | Schema_Builtin | Size: 0x1
			bool m_isEnemySniperVisible; // 0x6ca1 | Schema_Builtin | Size: 0x1
			S2_PAD(0x6);
			server::CountdownTimer m_sawEnemySniperTimer; // 0x6ca8 | Schema_DeclaredClass | Size: 0x18
			S2_PAD(0xa0);
			uint8_t m_enemyQueueIndex; // 0x6d60 | Schema_Builtin | Size: 0x1
			uint8_t m_enemyQueueCount; // 0x6d61 | Schema_Builtin | Size: 0x1
			uint8_t m_enemyQueueAttendIndex; // 0x6d62 | Schema_Builtin | Size: 0x1
			bool m_isStuck; // 0x6d63 | Schema_Builtin | Size: 0x1
			entity2::GameTime_t m_stuckTimestamp; // 0x6d64 | Schema_DeclaredClass | Size: 0x4
			GlobalTypes::Vector m_stuckSpot; // 0x6d68 | Schema_Atomic | Size: 0xc
			S2_PAD(0x4);
			server::CountdownTimer m_wiggleTimer; // 0x6d78 | Schema_DeclaredClass | Size: 0x18
			server::CountdownTimer m_stuckJumpTimer; // 0x6d90 | Schema_DeclaredClass | Size: 0x18
			entity2::GameTime_t m_nextCleanupCheckTimestamp; // 0x6da8 | Schema_DeclaredClass | Size: 0x4
			float32 m_avgVel[10]; // 0x6dac | Schema_FixedArray | Size: 0x28
			int32_t m_avgVelIndex; // 0x6dd4 | Schema_Builtin | Size: 0x4
			int32_t m_avgVelCount; // 0x6dd8 | Schema_Builtin | Size: 0x4
			GlobalTypes::Vector m_lastOrigin; // 0x6ddc | Schema_Atomic | Size: 0xc
			S2_PAD(0x4);
			float32 m_lastRadioRecievedTimestamp; // 0x6dec | Schema_Builtin | Size: 0x4
			float32 m_lastRadioSentTimestamp; // 0x6df0 | Schema_Builtin | Size: 0x4
			GlobalTypes::CHandle<server::CCSPlayerPawn> m_radioSubject; // 0x6df4 | Schema_Atomic | Size: 0x4
			// char m_radioSubject[0x4]; // 0x6df4 | Schema_Atomic | Size: 0x4
			GlobalTypes::Vector m_radioPosition; // 0x6df8 | Schema_Atomic | Size: 0xc
			float32 m_voiceEndTimestamp; // 0x6e04 | Schema_Builtin | Size: 0x4
			S2_PAD(0x8);
			int32_t m_lastValidReactionQueueFrame; // 0x6e10 | Schema_Builtin | Size: 0x4
			S2_PAD(0x4); // End padding
		};
		static_assert(offsetof(CS2::server::CCSBot, m_eyePosition) == 0x108, "m_eyePosition in CCSBot should be at offset 0x108");
		static_assert(offsetof(CS2::server::CCSBot, m_name) == 0x114, "m_name in CCSBot should be at offset 0x114");
		static_assert(offsetof(CS2::server::CCSBot, m_combatRange) == 0x154, "m_combatRange in CCSBot should be at offset 0x154");
		static_assert(offsetof(CS2::server::CCSBot, m_isRogue) == 0x158, "m_isRogue in CCSBot should be at offset 0x158");
		static_assert(offsetof(CS2::server::CCSBot, m_rogueTimer) == 0x160, "m_rogueTimer in CCSBot should be at offset 0x160");
		static_assert(offsetof(CS2::server::CCSBot, m_diedLastRound) == 0x17C, "m_diedLastRound in CCSBot should be at offset 0x17C");
		static_assert(offsetof(CS2::server::CCSBot, m_safeTime) == 0x180, "m_safeTime in CCSBot should be at offset 0x180");
