// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#ifndef CUSTOM_GLOBAL_TYPES
	#include <SDK/GlobalTypes.hpp>
#else
	#include <Custom/GlobalTypes.hpp>
#endif


#include <SDK/server/CTeamplayRules.hpp>
#include <SDK/entity2/GameTime_t.hpp>
#include <SDK/server/CRetakeGameRules.hpp>



namespace CS2 {
	namespace server {
		class CCSGameModeRules;
		class CBaseEntity;
	}
}


using namespace GlobalTypes;
namespace CS2 {
	namespace server {
		class CCSGameRules : public CS2::server::CTeamplayRules {
		public:
			S2_PAD(0x8);
			bool m_bFreezePeriod; // 0xc8 | Schema_Builtin | Size: 0x1
			bool m_bWarmupPeriod; // 0xc9 | Schema_Builtin | Size: 0x1
			S2_PAD(0x2);
			entity2::GameTime_t m_fWarmupPeriodEnd; // 0xcc | Schema_DeclaredClass | Size: 0x4
			entity2::GameTime_t m_fWarmupPeriodStart; // 0xd0 | Schema_DeclaredClass | Size: 0x4
			bool m_bTerroristTimeOutActive; // 0xd4 | Schema_Builtin | Size: 0x1
			bool m_bCTTimeOutActive; // 0xd5 | Schema_Builtin | Size: 0x1
			S2_PAD(0x2);
			float32 m_flTerroristTimeOutRemaining; // 0xd8 | Schema_Builtin | Size: 0x4
			float32 m_flCTTimeOutRemaining; // 0xdc | Schema_Builtin | Size: 0x4
			int32_t m_nTerroristTimeOuts; // 0xe0 | Schema_Builtin | Size: 0x4
			int32_t m_nCTTimeOuts; // 0xe4 | Schema_Builtin | Size: 0x4
			bool m_bTechnicalTimeOut; // 0xe8 | Schema_Builtin | Size: 0x1
			bool m_bMatchWaitingForResume; // 0xe9 | Schema_Builtin | Size: 0x1
			S2_PAD(0x2);
			int32_t m_iFreezeTime; // 0xec | Schema_Builtin | Size: 0x4
			int32_t m_iRoundTime; // 0xf0 | Schema_Builtin | Size: 0x4
			float32 m_fMatchStartTime; // 0xf4 | Schema_Builtin | Size: 0x4
			entity2::GameTime_t m_fRoundStartTime; // 0xf8 | Schema_DeclaredClass | Size: 0x4
			entity2::GameTime_t m_flRestartRoundTime; // 0xfc | Schema_DeclaredClass | Size: 0x4
			bool m_bGameRestart; // 0x100 | Schema_Builtin | Size: 0x1
			S2_PAD(0x3);
			float32 m_flGameStartTime; // 0x104 | Schema_Builtin | Size: 0x4
			float32 m_timeUntilNextPhaseStarts; // 0x108 | Schema_Builtin | Size: 0x4
			int32_t m_gamePhase; // 0x10c | Schema_Builtin | Size: 0x4
			int32_t m_totalRoundsPlayed; // 0x110 | Schema_Builtin | Size: 0x4
			int32_t m_nRoundsPlayedThisPhase; // 0x114 | Schema_Builtin | Size: 0x4
			int32_t m_nOvertimePlaying; // 0x118 | Schema_Builtin | Size: 0x4
			int32_t m_iHostagesRemaining; // 0x11c | Schema_Builtin | Size: 0x4
			bool m_bAnyHostageReached; // 0x120 | Schema_Builtin | Size: 0x1
			bool m_bMapHasBombTarget; // 0x121 | Schema_Builtin | Size: 0x1
			bool m_bMapHasRescueZone; // 0x122 | Schema_Builtin | Size: 0x1
			bool m_bMapHasBuyZone; // 0x123 | Schema_Builtin | Size: 0x1
			bool m_bIsQueuedMatchmaking; // 0x124 | Schema_Builtin | Size: 0x1
			S2_PAD(0x3);
			int32_t m_nQueuedMatchmakingMode; // 0x128 | Schema_Builtin | Size: 0x4
			bool m_bIsValveDS; // 0x12c | Schema_Builtin | Size: 0x1
			bool m_bLogoMap; // 0x12d | Schema_Builtin | Size: 0x1
			bool m_bPlayAllStepSoundsOnServer; // 0x12e | Schema_Builtin | Size: 0x1
			S2_PAD(0x1);
			int32_t m_iSpectatorSlotCount; // 0x130 | Schema_Builtin | Size: 0x4
			int32_t m_MatchDevice; // 0x134 | Schema_Builtin | Size: 0x4
			bool m_bHasMatchStarted; // 0x138 | Schema_Builtin | Size: 0x1
			S2_PAD(0x3);
			int32_t m_nNextMapInMapgroup; // 0x13c | Schema_Builtin | Size: 0x4
			char m_szTournamentEventName[512]; // 0x140 | Schema_FixedArray | Size: 0x200
			char m_szTournamentEventStage[512]; // 0x340 | Schema_FixedArray | Size: 0x200
			char m_szMatchStatTxt[512]; // 0x540 | Schema_FixedArray | Size: 0x200
			char m_szTournamentPredictionsTxt[512]; // 0x740 | Schema_FixedArray | Size: 0x200
			int32_t m_nTournamentPredictionsPct; // 0x940 | Schema_Builtin | Size: 0x4
			entity2::GameTime_t m_flCMMItemDropRevealStartTime; // 0x944 | Schema_DeclaredClass | Size: 0x4
			entity2::GameTime_t m_flCMMItemDropRevealEndTime; // 0x948 | Schema_DeclaredClass | Size: 0x4
			bool m_bIsDroppingItems; // 0x94c | Schema_Builtin | Size: 0x1
			bool m_bIsQuestEligible; // 0x94d | Schema_Builtin | Size: 0x1
			bool m_bIsHltvActive; // 0x94e | Schema_Builtin | Size: 0x1
			S2_PAD(0x1);
			uint16_t m_arrProhibitedItemIndices[100]; // 0x950 | Schema_FixedArray | Size: 0xc8
			uint32_t m_arrTournamentActiveCasterAccounts[4]; // 0xa18 | Schema_FixedArray | Size: 0x10
			int32_t m_numBestOfMaps; // 0xa28 | Schema_Builtin | Size: 0x4
			int32_t m_nHalloweenMaskListSeed; // 0xa2c | Schema_Builtin | Size: 0x4
			bool m_bBombDropped; // 0xa30 | Schema_Builtin | Size: 0x1
			bool m_bBombPlanted; // 0xa31 | Schema_Builtin | Size: 0x1
			S2_PAD(0x2);
			int32_t m_iRoundWinStatus; // 0xa34 | Schema_Builtin | Size: 0x4
			int32_t m_eRoundWinReason; // 0xa38 | Schema_Builtin | Size: 0x4
			bool m_bTCantBuy; // 0xa3c | Schema_Builtin | Size: 0x1
			bool m_bCTCantBuy; // 0xa3d | Schema_Builtin | Size: 0x1
			S2_PAD(0x2);
			int32_t m_iMatchStats_RoundResults[30]; // 0xa40 | Schema_FixedArray | Size: 0x78
			int32_t m_iMatchStats_PlayersAlive_CT[30]; // 0xab8 | Schema_FixedArray | Size: 0x78
			int32_t m_iMatchStats_PlayersAlive_T[30]; // 0xb30 | Schema_FixedArray | Size: 0x78
			float32 m_TeamRespawnWaveTimes[32]; // 0xba8 | Schema_FixedArray | Size: 0x80
			entity2::GameTime_t m_flNextRespawnWave[32]; // 0xc28 | Schema_FixedArray | Size: 0x1000
			GlobalTypes::Vector m_vMinimapMins; // 0xca8 | Schema_Atomic | Size: 0xc
			GlobalTypes::Vector m_vMinimapMaxs; // 0xcb4 | Schema_Atomic | Size: 0xc
			float32 m_MinimapVerticalSectionHeights[8]; // 0xcc0 | Schema_FixedArray | Size: 0x20
			uint64_t m_ullLocalMatchID; // 0xce0 | Schema_Builtin | Size: 0x8
			int32_t m_nEndMatchMapGroupVoteTypes[10]; // 0xce8 | Schema_FixedArray | Size: 0x28
			int32_t m_nEndMatchMapGroupVoteOptions[10]; // 0xd10 | Schema_FixedArray | Size: 0x28
			int32_t m_nEndMatchMapVoteWinner; // 0xd38 | Schema_Builtin | Size: 0x4
			int32_t m_iNumConsecutiveCTLoses; // 0xd3c | Schema_Builtin | Size: 0x4
			int32_t m_iNumConsecutiveTerroristLoses; // 0xd40 | Schema_Builtin | Size: 0x4
			S2_PAD(0x1c);
			bool m_bHasHostageBeenTouched; // 0xd60 | Schema_Builtin | Size: 0x1
			S2_PAD(0x3);
			entity2::GameTime_t m_flIntermissionStartTime; // 0xd64 | Schema_DeclaredClass | Size: 0x4
			entity2::GameTime_t m_flIntermissionEndTime; // 0xd68 | Schema_DeclaredClass | Size: 0x4
			bool m_bLevelInitialized; // 0xd6c | Schema_Builtin | Size: 0x1
			S2_PAD(0x3);
			int32_t m_iTotalRoundsPlayed; // 0xd70 | Schema_Builtin | Size: 0x4
			int32_t m_iUnBalancedRounds; // 0xd74 | Schema_Builtin | Size: 0x4
			bool m_endMatchOnRoundReset; // 0xd78 | Schema_Builtin | Size: 0x1
			bool m_endMatchOnThink; // 0xd79 | Schema_Builtin | Size: 0x1
			S2_PAD(0x2);
			int32_t m_iNumTerrorist; // 0xd7c | Schema_Builtin | Size: 0x4
			int32_t m_iNumCT; // 0xd80 | Schema_Builtin | Size: 0x4
			int32_t m_iNumSpawnableTerrorist; // 0xd84 | Schema_Builtin | Size: 0x4
			int32_t m_iNumSpawnableCT; // 0xd88 | Schema_Builtin | Size: 0x4
			S2_PAD(0x4);
			GlobalTypes::CUtlVector< int32 > m_arrSelectedHostageSpawnIndices; // 0xd90 | Schema_Atomic | Size: 0x18
			// char  m_arrSelectedHostageSpawnIndices[0x18]; // 0xd90 | Schema_Atomic | Size: 0x18
			int32_t m_nSpawnPointsRandomSeed; // 0xda8 | Schema_Builtin | Size: 0x4
			bool m_bFirstConnected; // 0xdac | Schema_Builtin | Size: 0x1
			bool m_bCompleteReset; // 0xdad | Schema_Builtin | Size: 0x1
			bool m_bPickNewTeamsOnReset; // 0xdae | Schema_Builtin | Size: 0x1
			bool m_bScrambleTeamsOnRestart; // 0xdaf | Schema_Builtin | Size: 0x1
			bool m_bSwapTeamsOnRestart; // 0xdb0 | Schema_Builtin | Size: 0x1
			S2_PAD(0x7);
			GlobalTypes::CUtlVector< int32 > m_nEndMatchTiedVotes; // 0xdb8 | Schema_Atomic | Size: 0x18
			// char  m_nEndMatchTiedVotes[0x18]; // 0xdb8 | Schema_Atomic | Size: 0x18
			S2_PAD(0x4);
			bool m_bNeedToAskPlayersForContinueVote; // 0xdd4 | Schema_Builtin | Size: 0x1
			S2_PAD(0x3);
			uint32_t m_numQueuedMatchmakingAccounts; // 0xdd8 | Schema_Builtin | Size: 0x4
			float32 m_fAvgPlayerRank; // 0xddc | Schema_Builtin | Size: 0x4
			char* m_pQueuedMatchmakingReservationString; // 0xde0 | Schema_Ptr | Size: 0x8
			uint32_t m_numTotalTournamentDrops; // 0xde8 | Schema_Builtin | Size: 0x4
			uint32_t m_numSpectatorsCountMax; // 0xdec | Schema_Builtin | Size: 0x4
			uint32_t m_numSpectatorsCountMaxTV; // 0xdf0 | Schema_Builtin | Size: 0x4
			uint32_t m_numSpectatorsCountMaxLnk; // 0xdf4 | Schema_Builtin | Size: 0x4
			S2_PAD(0x8);
			int32_t m_nCTsAliveAtFreezetimeEnd; // 0xe00 | Schema_Builtin | Size: 0x4
			int32_t m_nTerroristsAliveAtFreezetimeEnd; // 0xe04 | Schema_Builtin | Size: 0x4
			bool m_bForceTeamChangeSilent; // 0xe08 | Schema_Builtin | Size: 0x1
			bool m_bLoadingRoundBackupData; // 0xe09 | Schema_Builtin | Size: 0x1
			S2_PAD(0x36);
			int32_t m_nMatchInfoShowType; // 0xe40 | Schema_Builtin | Size: 0x4
			float32 m_flMatchInfoDecidedTime; // 0xe44 | Schema_Builtin | Size: 0x4
			S2_PAD(0x18);
			int32_t mTeamDMLastWinningTeamNumber; // 0xe60 | Schema_Builtin | Size: 0x4
			float32 mTeamDMLastThinkTime; // 0xe64 | Schema_Builtin | Size: 0x4
			float32 m_flTeamDMLastAnnouncementTime; // 0xe68 | Schema_Builtin | Size: 0x4
			int32_t m_iAccountTerrorist; // 0xe6c | Schema_Builtin | Size: 0x4
			int32_t m_iAccountCT; // 0xe70 | Schema_Builtin | Size: 0x4
			int32_t m_iSpawnPointCount_Terrorist; // 0xe74 | Schema_Builtin | Size: 0x4
			int32_t m_iSpawnPointCount_CT; // 0xe78 | Schema_Builtin | Size: 0x4
			int32_t m_iMaxNumTerrorists; // 0xe7c | Schema_Builtin | Size: 0x4
			int32_t m_iMaxNumCTs; // 0xe80 | Schema_Builtin | Size: 0x4
			int32_t m_iLoserBonusMostRecentTeam; // 0xe84 | Schema_Builtin | Size: 0x4
			float32 m_tmNextPeriodicThink; // 0xe88 | Schema_Builtin | Size: 0x4
			bool m_bVoiceWonMatchBragFired; // 0xe8c | Schema_Builtin | Size: 0x1
			S2_PAD(0x3);
			float32 m_fWarmupNextChatNoticeTime; // 0xe90 | Schema_Builtin | Size: 0x4
			S2_PAD(0x4);
			int32_t m_iHostagesRescued; // 0xe98 | Schema_Builtin | Size: 0x4
			int32_t m_iHostagesTouched; // 0xe9c | Schema_Builtin | Size: 0x4
			float32 m_flNextHostageAnnouncement; // 0xea0 | Schema_Builtin | Size: 0x4
			bool m_bNoTerroristsKilled; // 0xea4 | Schema_Builtin | Size: 0x1
			bool m_bNoCTsKilled; // 0xea5 | Schema_Builtin | Size: 0x1
			bool m_bNoEnemiesKilled; // 0xea6 | Schema_Builtin | Size: 0x1
			bool m_bCanDonateWeapons; // 0xea7 | Schema_Builtin | Size: 0x1
			S2_PAD(0x4);
			float32 m_firstKillTime; // 0xeac | Schema_Builtin | Size: 0x4
			S2_PAD(0x4);
			float32 m_firstBloodTime; // 0xeb4 | Schema_Builtin | Size: 0x4
			S2_PAD(0x18);
			bool m_hostageWasInjured; // 0xed0 | Schema_Builtin | Size: 0x1
			bool m_hostageWasKilled; // 0xed1 | Schema_Builtin | Size: 0x1
			S2_PAD(0xe);
			bool m_bVoteCalled; // 0xee0 | Schema_Builtin | Size: 0x1
			bool m_bServerVoteOnReset; // 0xee1 | Schema_Builtin | Size: 0x1
			S2_PAD(0x2);
			float32 m_flVoteCheckThrottle; // 0xee4 | Schema_Builtin | Size: 0x4
			bool m_bBuyTimeEnded; // 0xee8 | Schema_Builtin | Size: 0x1
			S2_PAD(0x3);
			int32_t m_nLastFreezeEndBeep; // 0xeec | Schema_Builtin | Size: 0x4
			bool m_bTargetBombed; // 0xef0 | Schema_Builtin | Size: 0x1
			bool m_bBombDefused; // 0xef1 | Schema_Builtin | Size: 0x1
			bool m_bMapHasBombZone; // 0xef2 | Schema_Builtin | Size: 0x1
			S2_PAD(0x4d);
			GlobalTypes::Vector m_vecMainCTSpawnPos; // 0xf40 | Schema_Atomic | Size: 0xc
			S2_PAD(0x4);
			// server::CUtlVector<server::SpawnPoint*> m_CTSpawnPointsMasterList; // 0xf50 | Schema_Atomic | Size: 0x18
			char  m_CTSpawnPointsMasterList[0x18]; // 0xf50 | Schema_Atomic | Size: 0x18
			// server::CUtlVector<server::SpawnPoint*> m_TerroristSpawnPointsMasterList; // 0xf68 | Schema_Atomic | Size: 0x18
			char  m_TerroristSpawnPointsMasterList[0x18]; // 0xf68 | Schema_Atomic | Size: 0x18
			bool m_bRespawningAllRespawnablePlayers; // 0xf80 | Schema_Builtin | Size: 0x1
			S2_PAD(0x3);
			int32_t m_iNextCTSpawnPoint; // 0xf84 | Schema_Builtin | Size: 0x4
			float32 m_flCTSpawnPointUsedTime; // 0xf88 | Schema_Builtin | Size: 0x4
			int32_t m_iNextTerroristSpawnPoint; // 0xf8c | Schema_Builtin | Size: 0x4
			float32 m_flTerroristSpawnPointUsedTime; // 0xf90 | Schema_Builtin | Size: 0x4
			S2_PAD(0x4);
			// server::CUtlVector<server::SpawnPoint*> m_CTSpawnPoints; // 0xf98 | Schema_Atomic | Size: 0x18
			char  m_CTSpawnPoints[0x18]; // 0xf98 | Schema_Atomic | Size: 0x18
			// server::CUtlVector<server::SpawnPoint*> m_TerroristSpawnPoints; // 0xfb0 | Schema_Atomic | Size: 0x18
			char  m_TerroristSpawnPoints[0x18]; // 0xfb0 | Schema_Atomic | Size: 0x18
			bool m_bIsUnreservedGameServer; // 0xfc8 | Schema_Builtin | Size: 0x1
			S2_PAD(0x3);
			float32 m_fAutobalanceDisplayTime; // 0xfcc | Schema_Builtin | Size: 0x4
			S2_PAD(0x38);
			bool m_bAllowWeaponSwitch; // 0x1008 | Schema_Builtin | Size: 0x1
			bool m_bRoundTimeWarningTriggered; // 0x1009 | Schema_Builtin | Size: 0x1
			S2_PAD(0x2);
			entity2::GameTime_t m_phaseChangeAnnouncementTime; // 0x100c | Schema_DeclaredClass | Size: 0x4
			float32 m_fNextUpdateTeamClanNamesTime; // 0x1010 | Schema_Builtin | Size: 0x4
			entity2::GameTime_t m_flLastThinkTime; // 0x1014 | Schema_DeclaredClass | Size: 0x4
			float32 m_fAccumulatedRoundOffDamage; // 0x1018 | Schema_Builtin | Size: 0x4
			int32_t m_nShorthandedBonusLastEvalRound; // 0x101c | Schema_Builtin | Size: 0x4
			S2_PAD(0x48);
			int32_t m_nMatchAbortedEarlyReason; // 0x1068 | Schema_Builtin | Size: 0x4
			bool m_bHasTriggeredRoundStartMusic; // 0x106c | Schema_Builtin | Size: 0x1
			bool m_bSwitchingTeamsAtRoundReset; // 0x106d | Schema_Builtin | Size: 0x1
			S2_PAD(0x1a);
			server::CCSGameModeRules* m_pGameModeRules; // 0x1088 | Schema_Ptr | Size: 0x8
			GlobalTypes::KeyValues3 m_BtGlobalBlackboard; // 0x1090 | Schema_Atomic | Size: 0x10
			S2_PAD(0x88);
			GlobalTypes::CHandle<server::CBaseEntity> m_hPlayerResource; // 0x1128 | Schema_Atomic | Size: 0x4
			// char  m_hPlayerResource[0x4]; // 0x1128 | Schema_Atomic | Size: 0x4
			S2_PAD(0x4);
			server::CRetakeGameRules m_RetakeRules; // 0x1130 | Schema_DeclaredClass | Size: 0x1f0
			GlobalTypes::CUtlVector< int32 >[4] m_arrTeamUniqueKillWeaponsMatch[4]; // 0x1320 | Schema_FixedArray | Size: 0x60
			// char  m_arrTeamUniqueKillWeaponsMatch[0x18]; // 0x1320 | Schema_FixedArray | Size: 0x18
			bool m_bTeamLastKillUsedUniqueWeaponMatch[4]; // 0x1380 | Schema_FixedArray | Size: 0x4
			S2_PAD(0x24);
			uint8_t m_nMatchEndCount; // 0x13a8 | Schema_Builtin | Size: 0x1
			S2_PAD(0x3);
			int32_t m_nTTeamIntroVariant; // 0x13ac | Schema_Builtin | Size: 0x4
			int32_t m_nCTTeamIntroVariant; // 0x13b0 | Schema_Builtin | Size: 0x4
			bool m_bTeamIntroPeriod; // 0x13b4 | Schema_Builtin | Size: 0x1
			S2_PAD(0x3);
			entity2::GameTime_t m_fTeamIntroPeriodEnd; // 0x13b8 | Schema_DeclaredClass | Size: 0x4
			bool m_bPlayedTeamIntroVO; // 0x13bc | Schema_Builtin | Size: 0x1
			S2_PAD(0x3);
			int32_t m_iRoundEndWinnerTeam; // 0x13c0 | Schema_Builtin | Size: 0x4
			int32_t m_eRoundEndReason; // 0x13c4 | Schema_Builtin | Size: 0x4
			bool m_bRoundEndShowTimerDefend; // 0x13c8 | Schema_Builtin | Size: 0x1
			S2_PAD(0x3);
			int32_t m_iRoundEndTimerTime; // 0x13cc | Schema_Builtin | Size: 0x4
			GlobalTypes::CUtlString m_sRoundEndFunFactToken; // 0x13d0 | Schema_Atomic | Size: 0x8
			GlobalTypes::CPlayerSlot m_iRoundEndFunFactPlayerSlot; // 0x13d8 | Schema_Atomic | Size: 0x4
			int32_t m_iRoundEndFunFactData1; // 0x13dc | Schema_Builtin | Size: 0x4
			int32_t m_iRoundEndFunFactData2; // 0x13e0 | Schema_Builtin | Size: 0x4
			int32_t m_iRoundEndFunFactData3; // 0x13e4 | Schema_Builtin | Size: 0x4
			GlobalTypes::CUtlString m_sRoundEndMessage; // 0x13e8 | Schema_Atomic | Size: 0x8
			int32_t m_iRoundEndPlayerCount; // 0x13f0 | Schema_Builtin | Size: 0x4
			bool m_bRoundEndNoMusic; // 0x13f4 | Schema_Builtin | Size: 0x1
			S2_PAD(0x3);
			int32_t m_iRoundEndLegacy; // 0x13f8 | Schema_Builtin | Size: 0x4
			uint8_t m_nRoundEndCount; // 0x13fc | Schema_Builtin | Size: 0x1
			S2_PAD(0x3);
			int32_t m_iRoundStartRoundNumber; // 0x1400 | Schema_Builtin | Size: 0x4
			uint8_t m_nRoundStartCount; // 0x1404 | Schema_Builtin | Size: 0x1
			S2_PAD(0x400b);
			float64 m_flLastPerfSampleTime; // 0x5410 | Schema_Builtin | Size: 0x8
			S2_PAD(0xc018); // End padding
		};
		static_assert(offsetof(CS2::server::CCSGameRules, m_bFreezePeriod) == 0xC8, "m_bFreezePeriod in CCSGameRules should be at offset 0xC8");
		static_assert(offsetof(CS2::server::CCSGameRules, m_bWarmupPeriod) == 0xC9, "m_bWarmupPeriod in CCSGameRules should be at offset 0xC9");
		static_assert(offsetof(CS2::server::CCSGameRules, m_fWarmupPeriodEnd) == 0xCC, "m_fWarmupPeriodEnd in CCSGameRules should be at offset 0xCC");
		static_assert(offsetof(CS2::server::CCSGameRules, m_fWarmupPeriodStart) == 0xD0, "m_fWarmupPeriodStart in CCSGameRules should be at offset 0xD0");
		static_assert(offsetof(CS2::server::CCSGameRules, m_bTerroristTimeOutActive) == 0xD4, "m_bTerroristTimeOutActive in CCSGameRules should be at offset 0xD4");
		static_assert(offsetof(CS2::server::CCSGameRules, m_bCTTimeOutActive) == 0xD5, "m_bCTTimeOutActive in CCSGameRules should be at offset 0xD5");
