// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#include <SDK/GlobalTypes.hpp>

#include <SDK/server/CCSPlayerPawnBase.hpp>
#include <SDK/client/loadout_slot_t.hpp>
#include <SDK/entity2/GameTime_t.hpp>
#include <SDK/entity2/GameTick_t.hpp>
#include <SDK/server/CEconItemView.hpp>
#include <SDK/server/EntitySpottedState_t.hpp>
#include <SDK/client/CSPlayerBlockingUseAction_t.hpp>



namespace CS2 {
	namespace server {
		class CCSPlayer_BulletServices;
		class CCSPlayer_HostageServices;
		class CCSPlayer_BuyServices;
		class CCSPlayer_ActionTrackingServices;
		class CCSPlayer_RadioServices;
		class CCSPlayer_DamageReactServices;
		class CCSBot;
	}
}
namespace CS2 {
	namespace server {
		class CCSPlayerPawn : public CS2::server::CCSPlayerPawnBase {
		public:
			S2_PAD(0x8);
			server::CCSPlayer_BulletServices* m_pBulletServices; // 0xee8 | Schema_Ptr | Size: 0x8
			server::CCSPlayer_HostageServices* m_pHostageServices; // 0xef0 | Schema_Ptr | Size: 0x8
			server::CCSPlayer_BuyServices* m_pBuyServices; // 0xef8 | Schema_Ptr | Size: 0x8
			server::CCSPlayer_ActionTrackingServices* m_pActionTrackingServices; // 0xf00 | Schema_Ptr | Size: 0x8
			server::CCSPlayer_RadioServices* m_pRadioServices; // 0xf08 | Schema_Ptr | Size: 0x8
			server::CCSPlayer_DamageReactServices* m_pDamageReactServices; // 0xf10 | Schema_Ptr | Size: 0x8
			uint16_t m_nCharacterDefIndex; // 0xf18 | Schema_Builtin | Size: 0x2
			bool m_bHasFemaleVoice; // 0xf1a | Schema_Builtin | Size: 0x1
			S2_PAD(0x5);
			GlobalTypes::CUtlString m_strVOPrefix; // 0xf20 | Schema_Atomic | Size: 0x8
			char m_szLastPlaceName[18]; // 0xf28 | Schema_FixedArray | Size: 0x12
			S2_PAD(0xae);
			bool m_bInHostageResetZone; // 0xfe8 | Schema_Builtin | Size: 0x1
			bool m_bInBuyZone; // 0xfe9 | Schema_Builtin | Size: 0x1
			S2_PAD(0x6);
			// server::CUtlVector< server.dll::CHandle< CBaseEntity > > m_TouchingBuyZones; // 0xff0 | Schema_Atomic | Size: 0x18
			char  m_TouchingBuyZones[0x18]; // 0xff0 | Schema_Atomic | Size: 0x18
			bool m_bWasInBuyZone; // 0x1008 | Schema_Builtin | Size: 0x1
			bool m_bInHostageRescueZone; // 0x1009 | Schema_Builtin | Size: 0x1
			bool m_bInBombZone; // 0x100a | Schema_Builtin | Size: 0x1
			bool m_bWasInHostageRescueZone; // 0x100b | Schema_Builtin | Size: 0x1
			int32_t m_iRetakesOffering; // 0x100c | Schema_Builtin | Size: 0x4
			int32_t m_iRetakesOfferingCard; // 0x1010 | Schema_Builtin | Size: 0x4
			bool m_bRetakesHasDefuseKit; // 0x1014 | Schema_Builtin | Size: 0x1
			bool m_bRetakesMVPLastRound; // 0x1015 | Schema_Builtin | Size: 0x1
			S2_PAD(0x2);
			int32_t m_iRetakesMVPBoostItem; // 0x1018 | Schema_Builtin | Size: 0x4
			client::loadout_slot_t m_RetakesMVPBoostExtraUtility; // 0x101c | Schema_DeclaredEnum | Size: 0x4
			entity2::GameTime_t m_flHealthShotBoostExpirationTime; // 0x1020 | Schema_DeclaredClass | Size: 0x4
			float32 m_flLandingTimeSeconds; // 0x1024 | Schema_Builtin | Size: 0x4
			GlobalTypes::QAngle m_aimPunchAngle; // 0x1028 | Schema_Atomic | Size: 0xc
			GlobalTypes::QAngle m_aimPunchAngleVel; // 0x1034 | Schema_Atomic | Size: 0xc
			entity2::GameTick_t m_aimPunchTickBase; // 0x1040 | Schema_DeclaredClass | Size: 0x4
			float32 m_aimPunchTickFraction; // 0x1044 | Schema_Builtin | Size: 0x4
			// GlobalTypes::CUtlVector< GlobalTypes::QAngle > m_aimPunchCache; // 0x1048 | Schema_Atomic | Size: 0x18
			char  m_aimPunchCache[0x18]; // 0x1048 | Schema_Atomic | Size: 0x18
			bool m_bIsBuyMenuOpen; // 0x1060 | Schema_Builtin | Size: 0x1
			S2_PAD(0x6a7);
			entity2::GameTime_t m_lastLandTime; // 0x1708 | Schema_DeclaredClass | Size: 0x4
			bool m_bOnGroundLastTick; // 0x170c | Schema_Builtin | Size: 0x1
			S2_PAD(0x3);
			int32_t m_iPlayerLocked; // 0x1710 | Schema_Builtin | Size: 0x4
			S2_PAD(0x4);
			entity2::GameTime_t m_flTimeOfLastInjury; // 0x1718 | Schema_DeclaredClass | Size: 0x4
			entity2::GameTime_t m_flNextSprayDecalTime; // 0x171c | Schema_DeclaredClass | Size: 0x4
			bool m_bNextSprayDecalTimeExpedited; // 0x1720 | Schema_Builtin | Size: 0x1
			S2_PAD(0x3);
			int32_t m_nRagdollDamageBone; // 0x1724 | Schema_Builtin | Size: 0x4
			GlobalTypes::Vector m_vRagdollDamageForce; // 0x1728 | Schema_Atomic | Size: 0xc
			GlobalTypes::Vector m_vRagdollDamagePosition; // 0x1734 | Schema_Atomic | Size: 0xc
			char m_szRagdollDamageWeaponName[64]; // 0x1740 | Schema_FixedArray | Size: 0x40
			bool m_bRagdollDamageHeadshot; // 0x1780 | Schema_Builtin | Size: 0x1
			S2_PAD(0x3);
			GlobalTypes::Vector m_vRagdollServerOrigin; // 0x1784 | Schema_Atomic | Size: 0xc
			server::CEconItemView m_EconGloves; // 0x1790 | Schema_DeclaredClass | Size: 0x2a8
			uint8_t m_nEconGlovesChanged; // 0x1a38 | Schema_Builtin | Size: 0x1
			S2_PAD(0x3);
			GlobalTypes::QAngle m_qDeathEyeAngles; // 0x1a3c | Schema_Atomic | Size: 0xc
			bool m_bSkipOneHeadConstraintUpdate; // 0x1a48 | Schema_Builtin | Size: 0x1
			bool m_bLeftHanded; // 0x1a49 | Schema_Builtin | Size: 0x1
			S2_PAD(0x2);
			entity2::GameTime_t m_fSwitchedHandednessTime; // 0x1a4c | Schema_DeclaredClass | Size: 0x4
			float32 m_flViewmodelOffsetX; // 0x1a50 | Schema_Builtin | Size: 0x4
			float32 m_flViewmodelOffsetY; // 0x1a54 | Schema_Builtin | Size: 0x4
			float32 m_flViewmodelOffsetZ; // 0x1a58 | Schema_Builtin | Size: 0x4
			float32 m_flViewmodelFOV; // 0x1a5c | Schema_Builtin | Size: 0x4
			bool m_bIsWalking; // 0x1a60 | Schema_Builtin | Size: 0x1
			S2_PAD(0x3);
			float32 m_fLastGivenDefuserTime; // 0x1a64 | Schema_Builtin | Size: 0x4
			float32 m_fLastGivenBombTime; // 0x1a68 | Schema_Builtin | Size: 0x4
			float32 m_flDealtDamageToEnemyMostRecentTimestamp; // 0x1a6c | Schema_Builtin | Size: 0x4
			uint32_t m_iDisplayHistoryBits; // 0x1a70 | Schema_Builtin | Size: 0x4
			float32 m_flLastAttackedTeammate; // 0x1a74 | Schema_Builtin | Size: 0x4
			entity2::GameTime_t m_allowAutoFollowTime; // 0x1a78 | Schema_DeclaredClass | Size: 0x4
			bool m_bResetArmorNextSpawn; // 0x1a7c | Schema_Builtin | Size: 0x1
			S2_PAD(0x3);
			GlobalTypes::CEntityIndex m_nLastKillerIndex; // 0x1a80 | Schema_Atomic | Size: 0x4
			S2_PAD(0x4);
			server::EntitySpottedState_t m_entitySpottedState; // 0x1a88 | Schema_DeclaredClass | Size: 0x18
			int32_t m_nSpotRules; // 0x1aa0 | Schema_Builtin | Size: 0x4
			bool m_bIsScoped; // 0x1aa4 | Schema_Builtin | Size: 0x1
			bool m_bResumeZoom; // 0x1aa5 | Schema_Builtin | Size: 0x1
			bool m_bIsDefusing; // 0x1aa6 | Schema_Builtin | Size: 0x1
			bool m_bIsGrabbingHostage; // 0x1aa7 | Schema_Builtin | Size: 0x1
			client::CSPlayerBlockingUseAction_t m_iBlockingUseActionInProgress; // 0x1aa8 | Schema_DeclaredEnum | Size: 0x4
			entity2::GameTime_t m_flEmitSoundTime; // 0x1aac | Schema_DeclaredClass | Size: 0x4
			bool m_bInNoDefuseArea; // 0x1ab0 | Schema_Builtin | Size: 0x1
			S2_PAD(0x3);
			GlobalTypes::CEntityIndex m_iBombSiteIndex; // 0x1ab4 | Schema_Atomic | Size: 0x4
			int32_t m_nWhichBombZone; // 0x1ab8 | Schema_Builtin | Size: 0x4
			bool m_bInBombZoneTrigger; // 0x1abc | Schema_Builtin | Size: 0x1
			bool m_bWasInBombZoneTrigger; // 0x1abd | Schema_Builtin | Size: 0x1
			S2_PAD(0x2);
			int32_t m_iShotsFired; // 0x1ac0 | Schema_Builtin | Size: 0x4
			float32 m_flFlinchStack; // 0x1ac4 | Schema_Builtin | Size: 0x4
			float32 m_flVelocityModifier; // 0x1ac8 | Schema_Builtin | Size: 0x4
			float32 m_flHitHeading; // 0x1acc | Schema_Builtin | Size: 0x4
			int32_t m_nHitBodyPart; // 0x1ad0 | Schema_Builtin | Size: 0x4
			GlobalTypes::Vector m_vecTotalBulletForce; // 0x1ad4 | Schema_Atomic | Size: 0xc
			bool m_bWaitForNoAttack; // 0x1ae0 | Schema_Builtin | Size: 0x1
			S2_PAD(0x3);
			float32 m_ignoreLadderJumpTime; // 0x1ae4 | Schema_Builtin | Size: 0x4
			bool m_bKilledByHeadshot; // 0x1ae8 | Schema_Builtin | Size: 0x1
			S2_PAD(0x3);
			int32_t m_LastHitBox; // 0x1aec | Schema_Builtin | Size: 0x4
			int32_t m_LastHealth; // 0x1af0 | Schema_Builtin | Size: 0x4
			S2_PAD(0x4);
			server::CCSBot* m_pBot; // 0x1af8 | Schema_Ptr | Size: 0x8
			bool m_bBotAllowActive; // 0x1b00 | Schema_Builtin | Size: 0x1
			S2_PAD(0x3);
			GlobalTypes::QAngle m_thirdPersonHeading; // 0x1b04 | Schema_Atomic | Size: 0xc
			float32 m_flSlopeDropOffset; // 0x1b10 | Schema_Builtin | Size: 0x4
			float32 m_flSlopeDropHeight; // 0x1b14 | Schema_Builtin | Size: 0x4
			GlobalTypes::Vector m_vHeadConstraintOffset; // 0x1b18 | Schema_Atomic | Size: 0xc
			int32_t m_nLastPickupPriority; // 0x1b24 | Schema_Builtin | Size: 0x4
			float32 m_flLastPickupPriorityTime; // 0x1b28 | Schema_Builtin | Size: 0x4
			int32_t m_ArmorValue; // 0x1b2c | Schema_Builtin | Size: 0x4
			uint16_t m_unCurrentEquipmentValue; // 0x1b30 | Schema_Builtin | Size: 0x2
			uint16_t m_unRoundStartEquipmentValue; // 0x1b32 | Schema_Builtin | Size: 0x2
			uint16_t m_unFreezetimeEndEquipmentValue; // 0x1b34 | Schema_Builtin | Size: 0x2
			S2_PAD(0x2);
			int32_t m_iLastWeaponFireUsercmd; // 0x1b38 | Schema_Builtin | Size: 0x4
			bool m_bIsSpawning; // 0x1b3c | Schema_Builtin | Size: 0x1
			S2_PAD(0xb);
			int32_t m_iDeathFlags; // 0x1b48 | Schema_Builtin | Size: 0x4
			bool m_bHasDeathInfo; // 0x1b4c | Schema_Builtin | Size: 0x1
			S2_PAD(0x3);
			float32 m_flDeathInfoTime; // 0x1b50 | Schema_Builtin | Size: 0x4
			GlobalTypes::Vector m_vecDeathInfoOrigin; // 0x1b54 | Schema_Atomic | Size: 0xc
			uint32_t m_vecPlayerPatchEconIndices[5]; // 0x1b60 | Schema_FixedArray | Size: 0x14
			GlobalTypes::Color m_GunGameImmunityColor; // 0x1b74 | Schema_Atomic | Size: 0x4
			entity2::GameTime_t m_grenadeParameterStashTime; // 0x1b78 | Schema_DeclaredClass | Size: 0x4
			bool m_bGrenadeParametersStashed; // 0x1b7c | Schema_Builtin | Size: 0x1
			S2_PAD(0x3);
			GlobalTypes::QAngle m_angStashedShootAngles; // 0x1b80 | Schema_Atomic | Size: 0xc
			GlobalTypes::Vector m_vecStashedGrenadeThrowPosition; // 0x1b8c | Schema_Atomic | Size: 0xc
			GlobalTypes::Vector m_vecStashedVelocity; // 0x1b98 | Schema_Atomic | Size: 0xc
			GlobalTypes::QAngle m_angShootAngleHistory[2]; // 0x1ba4 | Schema_FixedArray | Size: 0x18
			GlobalTypes::Vector m_vecThrowPositionHistory[2]; // 0x1bbc | Schema_FixedArray | Size: 0x18
			GlobalTypes::Vector m_vecVelocityHistory[2]; // 0x1bd4 | Schema_FixedArray | Size: 0x18
			S2_PAD(0x4);
			// server::CUtlVectorEmbeddedNetworkVar< server::PredictedDamageTag_t > m_PredictedDamageTags; // 0x1bf0 | Schema_Atomic | Size: 0x68
			char  m_PredictedDamageTags[0x68]; // 0x1bf0 | Schema_Atomic | Size: 0x68
			int32_t m_nHighestAppliedDamageTagTick; // 0x1c58 | Schema_Builtin | Size: 0x4
			bool m_bCommittingSuicideOnTeamChange; // 0x1c5c | Schema_Builtin | Size: 0x1
			bool m_wasNotKilledNaturally; // 0x1c5d | Schema_Builtin | Size: 0x1
			S2_PAD(0x2);
			entity2::GameTime_t m_fImmuneToGunGameDamageTime; // 0x1c60 | Schema_DeclaredClass | Size: 0x4
			bool m_bGunGameImmunity; // 0x1c64 | Schema_Builtin | Size: 0x1
			S2_PAD(0x3);
			float32 m_fMolotovDamageTime; // 0x1c68 | Schema_Builtin | Size: 0x4
			GlobalTypes::QAngle m_angEyeAngles; // 0x1c6c | Schema_Atomic | Size: 0xc
			S2_PAD(0x8); // End padding
		};
		static_assert(offsetof(CS2::server::CCSPlayerPawn, m_pBulletServices) == 0xEE8, "m_pBulletServices in CCSPlayerPawn should be at offset 0xEE8");
		static_assert(offsetof(CS2::server::CCSPlayerPawn, m_pHostageServices) == 0xEF0, "m_pHostageServices in CCSPlayerPawn should be at offset 0xEF0");
		static_assert(offsetof(CS2::server::CCSPlayerPawn, m_pBuyServices) == 0xEF8, "m_pBuyServices in CCSPlayerPawn should be at offset 0xEF8");
		static_assert(offsetof(CS2::server::CCSPlayerPawn, m_pActionTrackingServices) == 0xF00, "m_pActionTrackingServices in CCSPlayerPawn should be at offset 0xF00");
		static_assert(offsetof(CS2::server::CCSPlayerPawn, m_pRadioServices) == 0xF08, "m_pRadioServices in CCSPlayerPawn should be at offset 0xF08");
