// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#include <SDK/GlobalTypes.hpp>

#include <SDK/server/CBasePlayerController.hpp>
#include <SDK/entity2/GameTime_t.hpp>
#include <SDK/client/Reason.hpp>
#include <SDK/server/IntervalTimer.hpp>



namespace CS2 {
	namespace server {
		class CCSPlayerController_InGameMoneyServices;
		class CCSPlayerController_InventoryServices;
		class CCSPlayerController_ActionTrackingServices;
		class CCSPlayerController_DamageServices;
	}
}
namespace CS2 {
	namespace server {
		class CCSPlayerController : public CS2::server::CBasePlayerController {
		public:
			S2_PAD(0x10);
			server::CCSPlayerController_InGameMoneyServices* m_pInGameMoneyServices; // 0x800 | Schema_Ptr | Size: 0x8
			server::CCSPlayerController_InventoryServices* m_pInventoryServices; // 0x808 | Schema_Ptr | Size: 0x8
			server::CCSPlayerController_ActionTrackingServices* m_pActionTrackingServices; // 0x810 | Schema_Ptr | Size: 0x8
			server::CCSPlayerController_DamageServices* m_pDamageServices; // 0x818 | Schema_Ptr | Size: 0x8
			uint32_t m_iPing; // 0x820 | Schema_Builtin | Size: 0x4
			bool m_bHasCommunicationAbuseMute; // 0x824 | Schema_Builtin | Size: 0x1
			S2_PAD(0x3);
			uint32_t m_uiCommunicationMuteFlags; // 0x828 | Schema_Builtin | Size: 0x4
			S2_PAD(0x4);
			GlobalTypes::CUtlSymbolLarge m_szCrosshairCodes; // 0x830 | Schema_Atomic | Size: 0x8
			uint8_t m_iPendingTeamNum; // 0x838 | Schema_Builtin | Size: 0x1
			S2_PAD(0x3);
			entity2::GameTime_t m_flForceTeamTime; // 0x83c | Schema_DeclaredClass | Size: 0x4
			int32_t m_iCompTeammateColor; // 0x840 | Schema_Builtin | Size: 0x4
			bool m_bEverPlayedOnTeam; // 0x844 | Schema_Builtin | Size: 0x1
			bool m_bAttemptedToGetColor; // 0x845 | Schema_Builtin | Size: 0x1
			S2_PAD(0x2);
			int32_t m_iTeammatePreferredColor; // 0x848 | Schema_Builtin | Size: 0x4
			bool m_bTeamChanged; // 0x84c | Schema_Builtin | Size: 0x1
			bool m_bInSwitchTeam; // 0x84d | Schema_Builtin | Size: 0x1
			bool m_bHasSeenJoinGame; // 0x84e | Schema_Builtin | Size: 0x1
			bool m_bJustBecameSpectator; // 0x84f | Schema_Builtin | Size: 0x1
			bool m_bSwitchTeamsOnNextRoundReset; // 0x850 | Schema_Builtin | Size: 0x1
			bool m_bRemoveAllItemsOnNextRoundReset; // 0x851 | Schema_Builtin | Size: 0x1
			S2_PAD(0x2);
			entity2::GameTime_t m_flLastJoinTeamTime; // 0x854 | Schema_DeclaredClass | Size: 0x4
			GlobalTypes::CUtlSymbolLarge m_szClan; // 0x858 | Schema_Atomic | Size: 0x8
			int32_t m_iCoachingTeam; // 0x860 | Schema_Builtin | Size: 0x4
			S2_PAD(0x4);
			uint64_t m_nPlayerDominated; // 0x868 | Schema_Builtin | Size: 0x8
			uint64_t m_nPlayerDominatingMe; // 0x870 | Schema_Builtin | Size: 0x8
			int32_t m_iCompetitiveRanking; // 0x878 | Schema_Builtin | Size: 0x4
			int32_t m_iCompetitiveWins; // 0x87c | Schema_Builtin | Size: 0x4
			int8_t m_iCompetitiveRankType; // 0x880 | Schema_Builtin | Size: 0x1
			S2_PAD(0x3);
			int32_t m_iCompetitiveRankingPredicted_Win; // 0x884 | Schema_Builtin | Size: 0x4
			int32_t m_iCompetitiveRankingPredicted_Loss; // 0x888 | Schema_Builtin | Size: 0x4
			int32_t m_iCompetitiveRankingPredicted_Tie; // 0x88c | Schema_Builtin | Size: 0x4
			int32_t m_nEndMatchNextMapVote; // 0x890 | Schema_Builtin | Size: 0x4
			uint16_t m_unActiveQuestId; // 0x894 | Schema_Builtin | Size: 0x2
			S2_PAD(0x2);
			uint32_t m_rtActiveMissionPeriod; // 0x898 | Schema_Builtin | Size: 0x4
			client::Reason m_nQuestProgressReason; // 0x89c | Schema_DeclaredEnum | Size: 0x4
			uint32_t m_unPlayerTvControlFlags; // 0x8a0 | Schema_Builtin | Size: 0x4
			S2_PAD(0x2c);
			int32_t m_iDraftIndex; // 0x8d0 | Schema_Builtin | Size: 0x4
			uint32_t m_msQueuedModeDisconnectionTimestamp; // 0x8d4 | Schema_Builtin | Size: 0x4
			uint32_t m_uiAbandonRecordedReason; // 0x8d8 | Schema_Builtin | Size: 0x4
			uint32_t m_eNetworkDisconnectionReason; // 0x8dc | Schema_Builtin | Size: 0x4
			bool m_bCannotBeKicked; // 0x8e0 | Schema_Builtin | Size: 0x1
			bool m_bEverFullyConnected; // 0x8e1 | Schema_Builtin | Size: 0x1
			bool m_bAbandonAllowsSurrender; // 0x8e2 | Schema_Builtin | Size: 0x1
			bool m_bAbandonOffersInstantSurrender; // 0x8e3 | Schema_Builtin | Size: 0x1
			bool m_bDisconnection1MinWarningPrinted; // 0x8e4 | Schema_Builtin | Size: 0x1
			bool m_bScoreReported; // 0x8e5 | Schema_Builtin | Size: 0x1
			S2_PAD(0x2);
			int32_t m_nDisconnectionTick; // 0x8e8 | Schema_Builtin | Size: 0x4
			S2_PAD(0xc);
			bool m_bControllingBot; // 0x8f8 | Schema_Builtin | Size: 0x1
			bool m_bHasControlledBotThisRound; // 0x8f9 | Schema_Builtin | Size: 0x1
			bool m_bHasBeenControlledByPlayerThisRound; // 0x8fa | Schema_Builtin | Size: 0x1
			S2_PAD(0x1);
			int32_t m_nBotsControlledThisRound; // 0x8fc | Schema_Builtin | Size: 0x4
			bool m_bCanControlObservedBot; // 0x900 | Schema_Builtin | Size: 0x1
			S2_PAD(0x3);
			// server::CHandle< server::CCSPlayerPawn > m_hPlayerPawn; // 0x904 | Schema_Atomic | Size: 0x4
			char  m_hPlayerPawn[0x4]; // 0x904 | Schema_Atomic | Size: 0x4
			// server::CHandle< server::CCSObserverPawn > m_hObserverPawn; // 0x908 | Schema_Atomic | Size: 0x4
			char  m_hObserverPawn[0x4]; // 0x908 | Schema_Atomic | Size: 0x4
			int32_t m_DesiredObserverMode; // 0x90c | Schema_Builtin | Size: 0x4
			GlobalTypes::CEntityHandle m_hDesiredObserverTarget; // 0x910 | Schema_Atomic | Size: 0x4
			bool m_bPawnIsAlive; // 0x914 | Schema_Builtin | Size: 0x1
			S2_PAD(0x3);
			uint32_t m_iPawnHealth; // 0x918 | Schema_Builtin | Size: 0x4
			int32_t m_iPawnArmor; // 0x91c | Schema_Builtin | Size: 0x4
			bool m_bPawnHasDefuser; // 0x920 | Schema_Builtin | Size: 0x1
			bool m_bPawnHasHelmet; // 0x921 | Schema_Builtin | Size: 0x1
			uint16_t m_nPawnCharacterDefIndex; // 0x922 | Schema_Builtin | Size: 0x2
			int32_t m_iPawnLifetimeStart; // 0x924 | Schema_Builtin | Size: 0x4
			int32_t m_iPawnLifetimeEnd; // 0x928 | Schema_Builtin | Size: 0x4
			int32_t m_iPawnBotDifficulty; // 0x92c | Schema_Builtin | Size: 0x4
			// server::CHandle< server::CCSPlayerController > m_hOriginalControllerOfCurrentPawn; // 0x930 | Schema_Atomic | Size: 0x4
			char  m_hOriginalControllerOfCurrentPawn[0x4]; // 0x930 | Schema_Atomic | Size: 0x4
			int32_t m_iScore; // 0x934 | Schema_Builtin | Size: 0x4
			int32_t m_iRoundScore; // 0x938 | Schema_Builtin | Size: 0x4
			int32_t m_iRoundsWon; // 0x93c | Schema_Builtin | Size: 0x4
			uint8_t m_recentKillQueue[8]; // 0x940 | Schema_FixedArray | Size: 0x8
			uint8_t m_nFirstKill; // 0x948 | Schema_Builtin | Size: 0x1
			uint8_t m_nKillCount; // 0x949 | Schema_Builtin | Size: 0x1
			bool m_bMvpNoMusic; // 0x94a | Schema_Builtin | Size: 0x1
			S2_PAD(0x1);
			int32_t m_eMvpReason; // 0x94c | Schema_Builtin | Size: 0x4
			int32_t m_iMusicKitID; // 0x950 | Schema_Builtin | Size: 0x4
			int32_t m_iMusicKitMVPs; // 0x954 | Schema_Builtin | Size: 0x4
			int32_t m_iMVPs; // 0x958 | Schema_Builtin | Size: 0x4
			int32_t m_nUpdateCounter; // 0x95c | Schema_Builtin | Size: 0x4
			float32 m_flSmoothedPing; // 0x960 | Schema_Builtin | Size: 0x4
			S2_PAD(0x4);
			server::IntervalTimer m_lastHeldVoteTimer; // 0x968 | Schema_DeclaredClass | Size: 0x10
			S2_PAD(0x8);
			bool m_bShowHints; // 0x980 | Schema_Builtin | Size: 0x1
			S2_PAD(0x3);
			int32_t m_iNextTimeCheck; // 0x984 | Schema_Builtin | Size: 0x4
			bool m_bJustDidTeamKill; // 0x988 | Schema_Builtin | Size: 0x1
			bool m_bPunishForTeamKill; // 0x989 | Schema_Builtin | Size: 0x1
			bool m_bGaveTeamDamageWarning; // 0x98a | Schema_Builtin | Size: 0x1
			bool m_bGaveTeamDamageWarningThisRound; // 0x98b | Schema_Builtin | Size: 0x1
			S2_PAD(0x4);
			float64 m_dblLastReceivedPacketPlatFloatTime; // 0x990 | Schema_Builtin | Size: 0x8
			entity2::GameTime_t m_LastTeamDamageWarningTime; // 0x998 | Schema_DeclaredClass | Size: 0x4
			entity2::GameTime_t m_LastTimePlayerWasDisconnectedForPawnsRemove; // 0x99c | Schema_DeclaredClass | Size: 0x4
			uint32_t m_nSuspiciousHitCount; // 0x9a0 | Schema_Builtin | Size: 0x4
			uint32_t m_nNonSuspiciousHitStreak; // 0x9a4 | Schema_Builtin | Size: 0x4
			S2_PAD(0xa1);
			bool m_bFireBulletsSeedSynchronized; // 0xa49 | Schema_Builtin | Size: 0x1
			S2_PAD(0x7e); // End padding
		};
		static_assert(offsetof(CS2::server::CCSPlayerController, m_pInGameMoneyServices) == 0x800, "m_pInGameMoneyServices in CCSPlayerController should be at offset 0x800");
		static_assert(offsetof(CS2::server::CCSPlayerController, m_pInventoryServices) == 0x808, "m_pInventoryServices in CCSPlayerController should be at offset 0x808");
		static_assert(offsetof(CS2::server::CCSPlayerController, m_pActionTrackingServices) == 0x810, "m_pActionTrackingServices in CCSPlayerController should be at offset 0x810");
		static_assert(offsetof(CS2::server::CCSPlayerController, m_pDamageServices) == 0x818, "m_pDamageServices in CCSPlayerController should be at offset 0x818");
		static_assert(offsetof(CS2::server::CCSPlayerController, m_iPing) == 0x820, "m_iPing in CCSPlayerController should be at offset 0x820");
		static_assert(offsetof(CS2::server::CCSPlayerController, m_bHasCommunicationAbuseMute) == 0x824, "m_bHasCommunicationAbuseMute in CCSPlayerController should be at offset 0x824");
		static_assert(offsetof(CS2::server::CCSPlayerController, m_uiCommunicationMuteFlags) == 0x828, "m_uiCommunicationMuteFlags in CCSPlayerController should be at offset 0x828");
		static_assert(offsetof(CS2::server::CCSPlayerController, m_szCrosshairCodes) == 0x830, "m_szCrosshairCodes in CCSPlayerController should be at offset 0x830");
		static_assert(offsetof(CS2::server::CCSPlayerController, m_iPendingTeamNum) == 0x838, "m_iPendingTeamNum in CCSPlayerController should be at offset 0x838");
		static_assert(offsetof(CS2::server::CCSPlayerController, m_flForceTeamTime) == 0x83C, "m_flForceTeamTime in CCSPlayerController should be at offset 0x83C");
		static_assert(offsetof(CS2::server::CCSPlayerController, m_iCompTeammateColor) == 0x840, "m_iCompTeammateColor in CCSPlayerController should be at offset 0x840");
		static_assert(offsetof(CS2::server::CCSPlayerController, m_bEverPlayedOnTeam) == 0x844, "m_bEverPlayedOnTeam in CCSPlayerController should be at offset 0x844");
		static_assert(offsetof(CS2::server::CCSPlayerController, m_bAttemptedToGetColor) == 0x845, "m_bAttemptedToGetColor in CCSPlayerController should be at offset 0x845");
		static_assert(offsetof(CS2::server::CCSPlayerController, m_iTeammatePreferredColor) == 0x848, "m_iTeammatePreferredColor in CCSPlayerController should be at offset 0x848");
		static_assert(offsetof(CS2::server::CCSPlayerController, m_bTeamChanged) == 0x84C, "m_bTeamChanged in CCSPlayerController should be at offset 0x84C");
		static_assert(offsetof(CS2::server::CCSPlayerController, m_bInSwitchTeam) == 0x84D, "m_bInSwitchTeam in CCSPlayerController should be at offset 0x84D");
		static_assert(offsetof(CS2::server::CCSPlayerController, m_bHasSeenJoinGame) == 0x84E, "m_bHasSeenJoinGame in CCSPlayerController should be at offset 0x84E");
		static_assert(offsetof(CS2::server::CCSPlayerController, m_bJustBecameSpectator) == 0x84F, "m_bJustBecameSpectator in CCSPlayerController should be at offset 0x84F");
		static_assert(offsetof(CS2::server::CCSPlayerController, m_bSwitchTeamsOnNextRoundReset) == 0x850, "m_bSwitchTeamsOnNextRoundReset in CCSPlayerController should be at offset 0x850");
		static_assert(offsetof(CS2::server::CCSPlayerController, m_bRemoveAllItemsOnNextRoundReset) == 0x851, "m_bRemoveAllItemsOnNextRoundReset in CCSPlayerController should be at offset 0x851");
		static_assert(offsetof(CS2::server::CCSPlayerController, m_flLastJoinTeamTime) == 0x854, "m_flLastJoinTeamTime in CCSPlayerController should be at offset 0x854");
		static_assert(offsetof(CS2::server::CCSPlayerController, m_szClan) == 0x858, "m_szClan in CCSPlayerController should be at offset 0x858");
		static_assert(offsetof(CS2::server::CCSPlayerController, m_iCoachingTeam) == 0x860, "m_iCoachingTeam in CCSPlayerController should be at offset 0x860");
		static_assert(offsetof(CS2::server::CCSPlayerController, m_nPlayerDominated) == 0x868, "m_nPlayerDominated in CCSPlayerController should be at offset 0x868");
		static_assert(offsetof(CS2::server::CCSPlayerController, m_nPlayerDominatingMe) == 0x870, "m_nPlayerDominatingMe in CCSPlayerController should be at offset 0x870");
		static_assert(offsetof(CS2::server::CCSPlayerController, m_iCompetitiveRanking) == 0x878, "m_iCompetitiveRanking in CCSPlayerController should be at offset 0x878");
		static_assert(offsetof(CS2::server::CCSPlayerController, m_iCompetitiveWins) == 0x87C, "m_iCompetitiveWins in CCSPlayerController should be at offset 0x87C");
		static_assert(offsetof(CS2::server::CCSPlayerController, m_iCompetitiveRankType) == 0x880, "m_iCompetitiveRankType in CCSPlayerController should be at offset 0x880");
		static_assert(offsetof(CS2::server::CCSPlayerController, m_iCompetitiveRankingPredicted_Win) == 0x884, "m_iCompetitiveRankingPredicted_Win in CCSPlayerController should be at offset 0x884");
		static_assert(offsetof(CS2::server::CCSPlayerController, m_iCompetitiveRankingPredicted_Loss) == 0x888, "m_iCompetitiveRankingPredicted_Loss in CCSPlayerController should be at offset 0x888");
		static_assert(offsetof(CS2::server::CCSPlayerController, m_iCompetitiveRankingPredicted_Tie) == 0x88C, "m_iCompetitiveRankingPredicted_Tie in CCSPlayerController should be at offset 0x88C");
		static_assert(offsetof(CS2::server::CCSPlayerController, m_nEndMatchNextMapVote) == 0x890, "m_nEndMatchNextMapVote in CCSPlayerController should be at offset 0x890");
		static_assert(offsetof(CS2::server::CCSPlayerController, m_unActiveQuestId) == 0x894, "m_unActiveQuestId in CCSPlayerController should be at offset 0x894");
		static_assert(offsetof(CS2::server::CCSPlayerController, m_rtActiveMissionPeriod) == 0x898, "m_rtActiveMissionPeriod in CCSPlayerController should be at offset 0x898");
		static_assert(offsetof(CS2::server::CCSPlayerController, m_nQuestProgressReason) == 0x89C, "m_nQuestProgressReason in CCSPlayerController should be at offset 0x89C");
		static_assert(offsetof(CS2::server::CCSPlayerController, m_unPlayerTvControlFlags) == 0x8A0, "m_unPlayerTvControlFlags in CCSPlayerController should be at offset 0x8A0");
		static_assert(offsetof(CS2::server::CCSPlayerController, m_iDraftIndex) == 0x8D0, "m_iDraftIndex in CCSPlayerController should be at offset 0x8D0");
		static_assert(offsetof(CS2::server::CCSPlayerController, m_msQueuedModeDisconnectionTimestamp) == 0x8D4, "m_msQueuedModeDisconnectionTimestamp in CCSPlayerController should be at offset 0x8D4");
		static_assert(offsetof(CS2::server::CCSPlayerController, m_uiAbandonRecordedReason) == 0x8D8, "m_uiAbandonRecordedReason in CCSPlayerController should be at offset 0x8D8");
		static_assert(offsetof(CS2::server::CCSPlayerController, m_eNetworkDisconnectionReason) == 0x8DC, "m_eNetworkDisconnectionReason in CCSPlayerController should be at offset 0x8DC");
		static_assert(offsetof(CS2::server::CCSPlayerController, m_bCannotBeKicked) == 0x8E0, "m_bCannotBeKicked in CCSPlayerController should be at offset 0x8E0");
		static_assert(offsetof(CS2::server::CCSPlayerController, m_bEverFullyConnected) == 0x8E1, "m_bEverFullyConnected in CCSPlayerController should be at offset 0x8E1");
		static_assert(offsetof(CS2::server::CCSPlayerController, m_bAbandonAllowsSurrender) == 0x8E2, "m_bAbandonAllowsSurrender in CCSPlayerController should be at offset 0x8E2");
		static_assert(offsetof(CS2::server::CCSPlayerController, m_bAbandonOffersInstantSurrender) == 0x8E3, "m_bAbandonOffersInstantSurrender in CCSPlayerController should be at offset 0x8E3");
		static_assert(offsetof(CS2::server::CCSPlayerController, m_bDisconnection1MinWarningPrinted) == 0x8E4, "m_bDisconnection1MinWarningPrinted in CCSPlayerController should be at offset 0x8E4");
		static_assert(offsetof(CS2::server::CCSPlayerController, m_bScoreReported) == 0x8E5, "m_bScoreReported in CCSPlayerController should be at offset 0x8E5");
		static_assert(offsetof(CS2::server::CCSPlayerController, m_nDisconnectionTick) == 0x8E8, "m_nDisconnectionTick in CCSPlayerController should be at offset 0x8E8");
		static_assert(offsetof(CS2::server::CCSPlayerController, m_bControllingBot) == 0x8F8, "m_bControllingBot in CCSPlayerController should be at offset 0x8F8");
		static_assert(offsetof(CS2::server::CCSPlayerController, m_bHasControlledBotThisRound) == 0x8F9, "m_bHasControlledBotThisRound in CCSPlayerController should be at offset 0x8F9");
		static_assert(offsetof(CS2::server::CCSPlayerController, m_bHasBeenControlledByPlayerThisRound) == 0x8FA, "m_bHasBeenControlledByPlayerThisRound in CCSPlayerController should be at offset 0x8FA");
		static_assert(offsetof(CS2::server::CCSPlayerController, m_nBotsControlledThisRound) == 0x8FC, "m_nBotsControlledThisRound in CCSPlayerController should be at offset 0x8FC");
		static_assert(offsetof(CS2::server::CCSPlayerController, m_bCanControlObservedBot) == 0x900, "m_bCanControlObservedBot in CCSPlayerController should be at offset 0x900");
		static_assert(offsetof(CS2::server::CCSPlayerController, m_hPlayerPawn) == 0x904, "m_hPlayerPawn in CCSPlayerController should be at offset 0x904");
		static_assert(offsetof(CS2::server::CCSPlayerController, m_hObserverPawn) == 0x908, "m_hObserverPawn in CCSPlayerController should be at offset 0x908");
		static_assert(offsetof(CS2::server::CCSPlayerController, m_DesiredObserverMode) == 0x90C, "m_DesiredObserverMode in CCSPlayerController should be at offset 0x90C");
		static_assert(offsetof(CS2::server::CCSPlayerController, m_hDesiredObserverTarget) == 0x910, "m_hDesiredObserverTarget in CCSPlayerController should be at offset 0x910");
		static_assert(offsetof(CS2::server::CCSPlayerController, m_bPawnIsAlive) == 0x914, "m_bPawnIsAlive in CCSPlayerController should be at offset 0x914");
		static_assert(offsetof(CS2::server::CCSPlayerController, m_iPawnHealth) == 0x918, "m_iPawnHealth in CCSPlayerController should be at offset 0x918");
		static_assert(offsetof(CS2::server::CCSPlayerController, m_iPawnArmor) == 0x91C, "m_iPawnArmor in CCSPlayerController should be at offset 0x91C");
		static_assert(offsetof(CS2::server::CCSPlayerController, m_bPawnHasDefuser) == 0x920, "m_bPawnHasDefuser in CCSPlayerController should be at offset 0x920");
		static_assert(offsetof(CS2::server::CCSPlayerController, m_bPawnHasHelmet) == 0x921, "m_bPawnHasHelmet in CCSPlayerController should be at offset 0x921");
		static_assert(offsetof(CS2::server::CCSPlayerController, m_nPawnCharacterDefIndex) == 0x922, "m_nPawnCharacterDefIndex in CCSPlayerController should be at offset 0x922");
		static_assert(offsetof(CS2::server::CCSPlayerController, m_iPawnLifetimeStart) == 0x924, "m_iPawnLifetimeStart in CCSPlayerController should be at offset 0x924");
		static_assert(offsetof(CS2::server::CCSPlayerController, m_iPawnLifetimeEnd) == 0x928, "m_iPawnLifetimeEnd in CCSPlayerController should be at offset 0x928");
		static_assert(offsetof(CS2::server::CCSPlayerController, m_iPawnBotDifficulty) == 0x92C, "m_iPawnBotDifficulty in CCSPlayerController should be at offset 0x92C");
		static_assert(offsetof(CS2::server::CCSPlayerController, m_hOriginalControllerOfCurrentPawn) == 0x930, "m_hOriginalControllerOfCurrentPawn in CCSPlayerController should be at offset 0x930");
		static_assert(offsetof(CS2::server::CCSPlayerController, m_iScore) == 0x934, "m_iScore in CCSPlayerController should be at offset 0x934");
		static_assert(offsetof(CS2::server::CCSPlayerController, m_iRoundScore) == 0x938, "m_iRoundScore in CCSPlayerController should be at offset 0x938");
		static_assert(offsetof(CS2::server::CCSPlayerController, m_iRoundsWon) == 0x93C, "m_iRoundsWon in CCSPlayerController should be at offset 0x93C");
		static_assert(offsetof(CS2::server::CCSPlayerController, m_recentKillQueue) == 0x940, "m_recentKillQueue in CCSPlayerController should be at offset 0x940");
		static_assert(offsetof(CS2::server::CCSPlayerController, m_nFirstKill) == 0x948, "m_nFirstKill in CCSPlayerController should be at offset 0x948");
		static_assert(offsetof(CS2::server::CCSPlayerController, m_nKillCount) == 0x949, "m_nKillCount in CCSPlayerController should be at offset 0x949");
		static_assert(offsetof(CS2::server::CCSPlayerController, m_bMvpNoMusic) == 0x94A, "m_bMvpNoMusic in CCSPlayerController should be at offset 0x94A");
		static_assert(offsetof(CS2::server::CCSPlayerController, m_eMvpReason) == 0x94C, "m_eMvpReason in CCSPlayerController should be at offset 0x94C");
		static_assert(offsetof(CS2::server::CCSPlayerController, m_iMusicKitID) == 0x950, "m_iMusicKitID in CCSPlayerController should be at offset 0x950");
		static_assert(offsetof(CS2::server::CCSPlayerController, m_iMusicKitMVPs) == 0x954, "m_iMusicKitMVPs in CCSPlayerController should be at offset 0x954");
		static_assert(offsetof(CS2::server::CCSPlayerController, m_iMVPs) == 0x958, "m_iMVPs in CCSPlayerController should be at offset 0x958");
		static_assert(offsetof(CS2::server::CCSPlayerController, m_nUpdateCounter) == 0x95C, "m_nUpdateCounter in CCSPlayerController should be at offset 0x95C");
		static_assert(offsetof(CS2::server::CCSPlayerController, m_flSmoothedPing) == 0x960, "m_flSmoothedPing in CCSPlayerController should be at offset 0x960");
		static_assert(offsetof(CS2::server::CCSPlayerController, m_lastHeldVoteTimer) == 0x968, "m_lastHeldVoteTimer in CCSPlayerController should be at offset 0x968");
		static_assert(offsetof(CS2::server::CCSPlayerController, m_bShowHints) == 0x980, "m_bShowHints in CCSPlayerController should be at offset 0x980");
		static_assert(offsetof(CS2::server::CCSPlayerController, m_iNextTimeCheck) == 0x984, "m_iNextTimeCheck in CCSPlayerController should be at offset 0x984");
		static_assert(offsetof(CS2::server::CCSPlayerController, m_bJustDidTeamKill) == 0x988, "m_bJustDidTeamKill in CCSPlayerController should be at offset 0x988");
		static_assert(offsetof(CS2::server::CCSPlayerController, m_bPunishForTeamKill) == 0x989, "m_bPunishForTeamKill in CCSPlayerController should be at offset 0x989");
		static_assert(offsetof(CS2::server::CCSPlayerController, m_bGaveTeamDamageWarning) == 0x98A, "m_bGaveTeamDamageWarning in CCSPlayerController should be at offset 0x98A");
		static_assert(offsetof(CS2::server::CCSPlayerController, m_bGaveTeamDamageWarningThisRound) == 0x98B, "m_bGaveTeamDamageWarningThisRound in CCSPlayerController should be at offset 0x98B");
		static_assert(offsetof(CS2::server::CCSPlayerController, m_dblLastReceivedPacketPlatFloatTime) == 0x990, "m_dblLastReceivedPacketPlatFloatTime in CCSPlayerController should be at offset 0x990");
		static_assert(offsetof(CS2::server::CCSPlayerController, m_LastTeamDamageWarningTime) == 0x998, "m_LastTeamDamageWarningTime in CCSPlayerController should be at offset 0x998");
		static_assert(offsetof(CS2::server::CCSPlayerController, m_LastTimePlayerWasDisconnectedForPawnsRemove) == 0x99C, "m_LastTimePlayerWasDisconnectedForPawnsRemove in CCSPlayerController should be at offset 0x99C");
		static_assert(offsetof(CS2::server::CCSPlayerController, m_nSuspiciousHitCount) == 0x9A0, "m_nSuspiciousHitCount in CCSPlayerController should be at offset 0x9A0");
		static_assert(offsetof(CS2::server::CCSPlayerController, m_nNonSuspiciousHitStreak) == 0x9A4, "m_nNonSuspiciousHitStreak in CCSPlayerController should be at offset 0x9A4");
		static_assert(offsetof(CS2::server::CCSPlayerController, m_bFireBulletsSeedSynchronized) == 0xA49, "m_bFireBulletsSeedSynchronized in CCSPlayerController should be at offset 0xA49");
		static_assert(sizeof(CS2::server::CCSPlayerController) == 0xAC8, "CCSPlayerController size should be 0xAC8");
	}
}
