// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#ifndef CUSTOM_GLOBAL_TYPES
	#include <SDK/GlobalTypes.hpp>
#else
	#include <Custom/GlobalTypes.hpp>
#endif


#include <SDK/client/CPlayerControllerComponent.hpp>
#include <SDK/server/CSMatchStats_t.hpp>





using namespace GlobalTypes;
namespace CS2 {
	namespace server {
		class CCSPlayerController_ActionTrackingServices : public CS2::client::CPlayerControllerComponent {
		public:
			// server::CUtlVectorEmbeddedNetworkVar<server::CSPerRoundStats_t> m_perRoundStats; // 0x40 | Schema_Atomic | Size: 0x88
			char  m_perRoundStats[0x88]; // 0x40 | Schema_Atomic | Size: 0x88
			server::CSMatchStats_t m_matchStats; // 0xc8 | Schema_DeclaredClass | Size: 0xc0
			int32_t m_iNumRoundKills; // 0x188 | Schema_Builtin | Size: 0x4
			int32_t m_iNumRoundKillsHeadshots; // 0x18c | Schema_Builtin | Size: 0x4
			float32 m_flTotalRoundDamageDealt; // 0x190 | Schema_Builtin | Size: 0x4
			S2_PAD(0xdc); // End padding
		};
		static_assert(offsetof(CS2::server::CCSPlayerController_ActionTrackingServices, m_perRoundStats) == 0x40, "m_perRoundStats in CCSPlayerController_ActionTrackingServices should be at offset 0x40");
		static_assert(offsetof(CS2::server::CCSPlayerController_ActionTrackingServices, m_matchStats) == 0xC8, "m_matchStats in CCSPlayerController_ActionTrackingServices should be at offset 0xC8");
		static_assert(offsetof(CS2::server::CCSPlayerController_ActionTrackingServices, m_iNumRoundKills) == 0x188, "m_iNumRoundKills in CCSPlayerController_ActionTrackingServices should be at offset 0x188");
		static_assert(offsetof(CS2::server::CCSPlayerController_ActionTrackingServices, m_iNumRoundKillsHeadshots) == 0x18C, "m_iNumRoundKillsHeadshots in CCSPlayerController_ActionTrackingServices should be at offset 0x18C");
		static_assert(offsetof(CS2::server::CCSPlayerController_ActionTrackingServices, m_flTotalRoundDamageDealt) == 0x190, "m_flTotalRoundDamageDealt in CCSPlayerController_ActionTrackingServices should be at offset 0x190");
		static_assert(sizeof(CS2::server::CCSPlayerController_ActionTrackingServices) == 0x270, "CCSPlayerController_ActionTrackingServices size should be 0x270");
	}
}
