// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#ifndef CUSTOM_GLOBAL_TYPES
	#include "../GlobalTypes.hpp"
#else
	#include "../Custom/GlobalTypes.hpp"
#endif


#include "../entity2/GameTick_t.hpp"





using namespace GlobalTypes;
namespace CS2 {
	namespace server {
		class CCSPlayerModernJump  {
		public:
			S2_PAD(0x10);
			entity2::GameTick_t m_nLastActualJumpPressTick; // 0x10 | Schema_DeclaredClass | Size: 0x4
			float32 m_flLastActualJumpPressFrac; // 0x14 | Schema_Builtin | Size: 0x4
			entity2::GameTick_t m_nLastUsableJumpPressTick; // 0x18 | Schema_DeclaredClass | Size: 0x4
			float32 m_flLastUsableJumpPressFrac; // 0x1c | Schema_Builtin | Size: 0x4
			entity2::GameTick_t m_nLastLandedTick; // 0x20 | Schema_DeclaredClass | Size: 0x4
			float32 m_flLastLandedFrac; // 0x24 | Schema_Builtin | Size: 0x4
			float32 m_flLastLandedVelocityX; // 0x28 | Schema_Builtin | Size: 0x4
			float32 m_flLastLandedVelocityY; // 0x2c | Schema_Builtin | Size: 0x4
			float32 m_flLastLandedVelocityZ; // 0x30 | Schema_Builtin | Size: 0x4
			S2_PAD(0x4); // End padding
		};
#ifdef USE_STATIC_ASSERTS
		static_assert(offsetof(CS2::server::CCSPlayerModernJump, m_nLastActualJumpPressTick) == 0x10, "m_nLastActualJumpPressTick in CCSPlayerModernJump should be at offset 0x10");
		static_assert(offsetof(CS2::server::CCSPlayerModernJump, m_flLastActualJumpPressFrac) == 0x14, "m_flLastActualJumpPressFrac in CCSPlayerModernJump should be at offset 0x14");
		static_assert(offsetof(CS2::server::CCSPlayerModernJump, m_nLastUsableJumpPressTick) == 0x18, "m_nLastUsableJumpPressTick in CCSPlayerModernJump should be at offset 0x18");
		static_assert(offsetof(CS2::server::CCSPlayerModernJump, m_flLastUsableJumpPressFrac) == 0x1C, "m_flLastUsableJumpPressFrac in CCSPlayerModernJump should be at offset 0x1C");
		static_assert(offsetof(CS2::server::CCSPlayerModernJump, m_nLastLandedTick) == 0x20, "m_nLastLandedTick in CCSPlayerModernJump should be at offset 0x20");
		static_assert(offsetof(CS2::server::CCSPlayerModernJump, m_flLastLandedFrac) == 0x24, "m_flLastLandedFrac in CCSPlayerModernJump should be at offset 0x24");
		static_assert(offsetof(CS2::server::CCSPlayerModernJump, m_flLastLandedVelocityX) == 0x28, "m_flLastLandedVelocityX in CCSPlayerModernJump should be at offset 0x28");
		static_assert(offsetof(CS2::server::CCSPlayerModernJump, m_flLastLandedVelocityY) == 0x2C, "m_flLastLandedVelocityY in CCSPlayerModernJump should be at offset 0x2C");
		static_assert(offsetof(CS2::server::CCSPlayerModernJump, m_flLastLandedVelocityZ) == 0x30, "m_flLastLandedVelocityZ in CCSPlayerModernJump should be at offset 0x30");
		static_assert(sizeof(CS2::server::CCSPlayerModernJump) == 0x38, "CCSPlayerModernJump size should be 0x38");

#endif
	}
}
