// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#include <SDK/GlobalTypes.hpp>

#include <SDK/server/CBasePlayerPawn.hpp>
#include <SDK/server/CTouchExpansionComponent.hpp>
#include <SDK/entity2/GameTime_t.hpp>
#include <SDK/client/CSPlayerState.hpp>



namespace CS2 {
	namespace server {
		class CCSPlayer_PingServices;
	}
}
namespace CS2 {
	namespace server {
		class CCSPlayerPawnBase : public CS2::server::CBasePlayerPawn {
		public:
			S2_PAD(0x8);
			server::CTouchExpansionComponent m_CTouchExpansionComponent; // 0xd90 | Schema_DeclaredClass | Size: 0x50
			server::CCSPlayer_PingServices* m_pPingServices; // 0xde0 | Schema_Ptr | Size: 0x8
			entity2::GameTime_t m_blindUntilTime; // 0xde8 | Schema_DeclaredClass | Size: 0x4
			entity2::GameTime_t m_blindStartTime; // 0xdec | Schema_DeclaredClass | Size: 0x4
			client::CSPlayerState m_iPlayerState; // 0xdf0 | Schema_DeclaredEnum | Size: 0x4
			S2_PAD(0xac);
			bool m_bRespawning; // 0xea0 | Schema_Builtin | Size: 0x1
			bool m_bHasMovedSinceSpawn; // 0xea1 | Schema_Builtin | Size: 0x1
			S2_PAD(0x2);
			int32_t m_iNumSpawns; // 0xea4 | Schema_Builtin | Size: 0x4
			S2_PAD(0x4);
			float32 m_flIdleTimeSinceLastAction; // 0xeac | Schema_Builtin | Size: 0x4
			float32 m_fNextRadarUpdateTime; // 0xeb0 | Schema_Builtin | Size: 0x4
			float32 m_flFlashDuration; // 0xeb4 | Schema_Builtin | Size: 0x4
			float32 m_flFlashMaxAlpha; // 0xeb8 | Schema_Builtin | Size: 0x4
			float32 m_flProgressBarStartTime; // 0xebc | Schema_Builtin | Size: 0x4
			int32_t m_iProgressBarDuration; // 0xec0 | Schema_Builtin | Size: 0x4
			// server::CHandle< server::CCSPlayerController > m_hOriginalController; // 0xec4 | Schema_Atomic | Size: 0x4
			char  m_hOriginalController[0x4]; // 0xec4 | Schema_Atomic | Size: 0x4
		};
		static_assert(offsetof(CS2::server::CCSPlayerPawnBase, m_CTouchExpansionComponent) == 0xD90, "m_CTouchExpansionComponent in CCSPlayerPawnBase should be at offset 0xD90");
		static_assert(offsetof(CS2::server::CCSPlayerPawnBase, m_pPingServices) == 0xDE0, "m_pPingServices in CCSPlayerPawnBase should be at offset 0xDE0");
		static_assert(offsetof(CS2::server::CCSPlayerPawnBase, m_blindUntilTime) == 0xDE8, "m_blindUntilTime in CCSPlayerPawnBase should be at offset 0xDE8");
		static_assert(offsetof(CS2::server::CCSPlayerPawnBase, m_blindStartTime) == 0xDEC, "m_blindStartTime in CCSPlayerPawnBase should be at offset 0xDEC");
		static_assert(offsetof(CS2::server::CCSPlayerPawnBase, m_iPlayerState) == 0xDF0, "m_iPlayerState in CCSPlayerPawnBase should be at offset 0xDF0");
		static_assert(offsetof(CS2::server::CCSPlayerPawnBase, m_bRespawning) == 0xEA0, "m_bRespawning in CCSPlayerPawnBase should be at offset 0xEA0");
		static_assert(offsetof(CS2::server::CCSPlayerPawnBase, m_bHasMovedSinceSpawn) == 0xEA1, "m_bHasMovedSinceSpawn in CCSPlayerPawnBase should be at offset 0xEA1");
		static_assert(offsetof(CS2::server::CCSPlayerPawnBase, m_iNumSpawns) == 0xEA4, "m_iNumSpawns in CCSPlayerPawnBase should be at offset 0xEA4");
		static_assert(offsetof(CS2::server::CCSPlayerPawnBase, m_flIdleTimeSinceLastAction) == 0xEAC, "m_flIdleTimeSinceLastAction in CCSPlayerPawnBase should be at offset 0xEAC");
		static_assert(offsetof(CS2::server::CCSPlayerPawnBase, m_fNextRadarUpdateTime) == 0xEB0, "m_fNextRadarUpdateTime in CCSPlayerPawnBase should be at offset 0xEB0");
		static_assert(offsetof(CS2::server::CCSPlayerPawnBase, m_flFlashDuration) == 0xEB4, "m_flFlashDuration in CCSPlayerPawnBase should be at offset 0xEB4");
		static_assert(offsetof(CS2::server::CCSPlayerPawnBase, m_flFlashMaxAlpha) == 0xEB8, "m_flFlashMaxAlpha in CCSPlayerPawnBase should be at offset 0xEB8");
		static_assert(offsetof(CS2::server::CCSPlayerPawnBase, m_flProgressBarStartTime) == 0xEBC, "m_flProgressBarStartTime in CCSPlayerPawnBase should be at offset 0xEBC");
		static_assert(offsetof(CS2::server::CCSPlayerPawnBase, m_iProgressBarDuration) == 0xEC0, "m_iProgressBarDuration in CCSPlayerPawnBase should be at offset 0xEC0");
		static_assert(offsetof(CS2::server::CCSPlayerPawnBase, m_hOriginalController) == 0xEC4, "m_hOriginalController in CCSPlayerPawnBase should be at offset 0xEC4");
		static_assert(sizeof(CS2::server::CCSPlayerPawnBase) == 0xEC8, "CCSPlayerPawnBase size should be 0xEC8");
	}
}
