// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#include <SDK/GlobalTypes.hpp>

#include <SDK/server/CBasePlayerPawn.hpp>
#include <SDK/server/CTouchExpansionComponent.hpp>
#include <SDK/entity2/GameTime_t.hpp>
#include <SDK/client/CSPlayerState.hpp>



namespace CS2 {
	namespace server {
		class CCSPlayer_PingServices;
	}
}
namespace CS2 {
	namespace server {
		class CCSPlayerPawnBase : public CS2::server::CBasePlayerPawn {
		public:
			public:
			S2_PAD(0x8);
			server::CTouchExpansionComponent m_CTouchExpansionComponent; // 0xd88 | Schema_DeclaredClass | Size: 0x50
			server::CCSPlayer_PingServices* m_pPingServices; // 0xdd8 | Schema_Ptr | Size: 0x8
			entity2::GameTime_t m_blindUntilTime; // 0xde0 | Schema_DeclaredClass | Size: 0x4
			entity2::GameTime_t m_blindStartTime; // 0xde4 | Schema_DeclaredClass | Size: 0x4
			client::CSPlayerState m_iPlayerState; // 0xde8 | Schema_DeclaredEnum | Size: 0x4
			S2_PAD(0xac);
			bool m_bRespawning; // 0xe98 | Schema_Builtin | Size: 0x1
			bool m_bHasMovedSinceSpawn; // 0xe99 | Schema_Builtin | Size: 0x1
			S2_PAD(0x2);
			int32_t m_iNumSpawns; // 0xe9c | Schema_Builtin | Size: 0x4
			S2_PAD(0x4);
			float32 m_flIdleTimeSinceLastAction; // 0xea4 | Schema_Builtin | Size: 0x4
			float32 m_fNextRadarUpdateTime; // 0xea8 | Schema_Builtin | Size: 0x4
			float32 m_flFlashDuration; // 0xeac | Schema_Builtin | Size: 0x4
			float32 m_flFlashMaxAlpha; // 0xeb0 | Schema_Builtin | Size: 0x4
			float32 m_flProgressBarStartTime; // 0xeb4 | Schema_Builtin | Size: 0x4
			int32_t m_iProgressBarDuration; // 0xeb8 | Schema_Builtin | Size: 0x4
			// server::CHandle< server::CCSPlayerController > m_hOriginalController; // 0xebc | Schema_Atomic | Size: 0x4
			char  m_hOriginalController[0x4]; // 0xebc | Schema_Atomic | Size: 0x4
		};
		static_assert(offsetof(CS2::server::CCSPlayerPawnBase, m_CTouchExpansionComponent) == 0xD88, "m_CTouchExpansionComponent in CCSPlayerPawnBase should be at offset 0xD88");
		static_assert(offsetof(CS2::server::CCSPlayerPawnBase, m_pPingServices) == 0xDD8, "m_pPingServices in CCSPlayerPawnBase should be at offset 0xDD8");
		static_assert(offsetof(CS2::server::CCSPlayerPawnBase, m_blindUntilTime) == 0xDE0, "m_blindUntilTime in CCSPlayerPawnBase should be at offset 0xDE0");
		static_assert(offsetof(CS2::server::CCSPlayerPawnBase, m_blindStartTime) == 0xDE4, "m_blindStartTime in CCSPlayerPawnBase should be at offset 0xDE4");
		static_assert(offsetof(CS2::server::CCSPlayerPawnBase, m_iPlayerState) == 0xDE8, "m_iPlayerState in CCSPlayerPawnBase should be at offset 0xDE8");
		static_assert(offsetof(CS2::server::CCSPlayerPawnBase, m_bRespawning) == 0xE98, "m_bRespawning in CCSPlayerPawnBase should be at offset 0xE98");
		static_assert(offsetof(CS2::server::CCSPlayerPawnBase, m_bHasMovedSinceSpawn) == 0xE99, "m_bHasMovedSinceSpawn in CCSPlayerPawnBase should be at offset 0xE99");
		static_assert(offsetof(CS2::server::CCSPlayerPawnBase, m_iNumSpawns) == 0xE9C, "m_iNumSpawns in CCSPlayerPawnBase should be at offset 0xE9C");
		static_assert(offsetof(CS2::server::CCSPlayerPawnBase, m_flIdleTimeSinceLastAction) == 0xEA4, "m_flIdleTimeSinceLastAction in CCSPlayerPawnBase should be at offset 0xEA4");
		static_assert(offsetof(CS2::server::CCSPlayerPawnBase, m_fNextRadarUpdateTime) == 0xEA8, "m_fNextRadarUpdateTime in CCSPlayerPawnBase should be at offset 0xEA8");
		static_assert(offsetof(CS2::server::CCSPlayerPawnBase, m_flFlashDuration) == 0xEAC, "m_flFlashDuration in CCSPlayerPawnBase should be at offset 0xEAC");
		static_assert(offsetof(CS2::server::CCSPlayerPawnBase, m_flFlashMaxAlpha) == 0xEB0, "m_flFlashMaxAlpha in CCSPlayerPawnBase should be at offset 0xEB0");
		static_assert(offsetof(CS2::server::CCSPlayerPawnBase, m_flProgressBarStartTime) == 0xEB4, "m_flProgressBarStartTime in CCSPlayerPawnBase should be at offset 0xEB4");
		static_assert(offsetof(CS2::server::CCSPlayerPawnBase, m_iProgressBarDuration) == 0xEB8, "m_iProgressBarDuration in CCSPlayerPawnBase should be at offset 0xEB8");
		static_assert(offsetof(CS2::server::CCSPlayerPawnBase, m_hOriginalController) == 0xEBC, "m_hOriginalController in CCSPlayerPawnBase should be at offset 0xEBC");
		static_assert(sizeof(CS2::server::CCSPlayerPawnBase) == 0xEC0, "CCSPlayerPawnBase size should be 0xEC0");
	}
}
