// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#ifndef CUSTOM_GLOBAL_TYPES
	#include <SDK/GlobalTypes.hpp>
#else
	#include <Custom/GlobalTypes.hpp>
#endif


#include <SDK/server/CPlayer_WaterServices.hpp>
#include <SDK/entity2/GameTime_t.hpp>



namespace CS2 {
	namespace server {
		class CCSPlayer_WaterServices : public CS2::server::CPlayer_WaterServices {
		public:
			entity2::GameTime_t m_NextDrownDamageTime; // 0x40 | Schema_DeclaredClass | Size: 0x4
			int32_t m_nDrownDmgRate; // 0x44 | Schema_Builtin | Size: 0x4
			entity2::GameTime_t m_AirFinishedTime; // 0x48 | Schema_DeclaredClass | Size: 0x4
			float32 m_flWaterJumpTime; // 0x4c | Schema_Builtin | Size: 0x4
			GlobalTypes::Vector m_vecWaterJumpVel; // 0x50 | Schema_Atomic | Size: 0xc
			float32 m_flSwimSoundTime; // 0x5c | Schema_Builtin | Size: 0x4
			S2_PAD(0x18); // End padding
		};
		static_assert(offsetof(CS2::server::CCSPlayer_WaterServices, m_NextDrownDamageTime) == 0x40, "m_NextDrownDamageTime in CCSPlayer_WaterServices should be at offset 0x40");
		static_assert(offsetof(CS2::server::CCSPlayer_WaterServices, m_nDrownDmgRate) == 0x44, "m_nDrownDmgRate in CCSPlayer_WaterServices should be at offset 0x44");
		static_assert(offsetof(CS2::server::CCSPlayer_WaterServices, m_AirFinishedTime) == 0x48, "m_AirFinishedTime in CCSPlayer_WaterServices should be at offset 0x48");
		static_assert(offsetof(CS2::server::CCSPlayer_WaterServices, m_flWaterJumpTime) == 0x4C, "m_flWaterJumpTime in CCSPlayer_WaterServices should be at offset 0x4C");
		static_assert(offsetof(CS2::server::CCSPlayer_WaterServices, m_vecWaterJumpVel) == 0x50, "m_vecWaterJumpVel in CCSPlayer_WaterServices should be at offset 0x50");
		static_assert(offsetof(CS2::server::CCSPlayer_WaterServices, m_flSwimSoundTime) == 0x5C, "m_flSwimSoundTime in CCSPlayer_WaterServices should be at offset 0x5C");
		static_assert(sizeof(CS2::server::CCSPlayer_WaterServices) == 0x78, "CCSPlayer_WaterServices size should be 0x78");
	}
}
