// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#include <SDK/GlobalTypes.hpp>

#include <SDK/server/CCSWeaponBase.hpp>



namespace CS2 {
	namespace server {
		class CCSWeaponBaseGun : public CS2::server::CCSWeaponBase {
		public:
			public:
			int32_t m_zoomLevel; // 0x1030 | Schema_Builtin | Size: 0x4
			int32_t m_iBurstShotsRemaining; // 0x1034 | Schema_Builtin | Size: 0x4
			S2_PAD(0x8);
			int32_t m_silencedModelIndex; // 0x1040 | Schema_Builtin | Size: 0x4
			bool m_inPrecache; // 0x1044 | Schema_Builtin | Size: 0x1
			bool m_bNeedsBoltAction; // 0x1045 | Schema_Builtin | Size: 0x1
			S2_PAD(0x2);
			int32_t m_nRevolverCylinderIdx; // 0x1048 | Schema_Builtin | Size: 0x4
			bool m_bSkillReloadAvailable; // 0x104c | Schema_Builtin | Size: 0x1
			bool m_bSkillReloadLiftedReloadKey; // 0x104d | Schema_Builtin | Size: 0x1
			bool m_bSkillBoltInterruptAvailable; // 0x104e | Schema_Builtin | Size: 0x1
			bool m_bSkillBoltLiftedFireKey; // 0x104f | Schema_Builtin | Size: 0x1
		};
		static_assert(offsetof(CS2::server::CCSWeaponBaseGun, m_zoomLevel) == 0x1030, "m_zoomLevel in CCSWeaponBaseGun should be at offset 0x1030");
		static_assert(offsetof(CS2::server::CCSWeaponBaseGun, m_iBurstShotsRemaining) == 0x1034, "m_iBurstShotsRemaining in CCSWeaponBaseGun should be at offset 0x1034");
		static_assert(offsetof(CS2::server::CCSWeaponBaseGun, m_silencedModelIndex) == 0x1040, "m_silencedModelIndex in CCSWeaponBaseGun should be at offset 0x1040");
		static_assert(offsetof(CS2::server::CCSWeaponBaseGun, m_inPrecache) == 0x1044, "m_inPrecache in CCSWeaponBaseGun should be at offset 0x1044");
		static_assert(offsetof(CS2::server::CCSWeaponBaseGun, m_bNeedsBoltAction) == 0x1045, "m_bNeedsBoltAction in CCSWeaponBaseGun should be at offset 0x1045");
		static_assert(offsetof(CS2::server::CCSWeaponBaseGun, m_nRevolverCylinderIdx) == 0x1048, "m_nRevolverCylinderIdx in CCSWeaponBaseGun should be at offset 0x1048");
		static_assert(offsetof(CS2::server::CCSWeaponBaseGun, m_bSkillReloadAvailable) == 0x104C, "m_bSkillReloadAvailable in CCSWeaponBaseGun should be at offset 0x104C");
		static_assert(offsetof(CS2::server::CCSWeaponBaseGun, m_bSkillReloadLiftedReloadKey) == 0x104D, "m_bSkillReloadLiftedReloadKey in CCSWeaponBaseGun should be at offset 0x104D");
		static_assert(offsetof(CS2::server::CCSWeaponBaseGun, m_bSkillBoltInterruptAvailable) == 0x104E, "m_bSkillBoltInterruptAvailable in CCSWeaponBaseGun should be at offset 0x104E");
		static_assert(offsetof(CS2::server::CCSWeaponBaseGun, m_bSkillBoltLiftedFireKey) == 0x104F, "m_bSkillBoltLiftedFireKey in CCSWeaponBaseGun should be at offset 0x104F");
		static_assert(sizeof(CS2::server::CCSWeaponBaseGun) == 0x1050, "CCSWeaponBaseGun size should be 0x1050");
	}
}
