// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#include <SDK/GlobalTypes.hpp>

#include <SDK/server/CBasePlayerWeapon.hpp>
#include <SDK/client/WeaponGameplayAnimState.hpp>
#include <SDK/entity2/GameTime_t.hpp>
#include <SDK/entity2/CEntityIOOutput.hpp>
#include <SDK/client/CSWeaponMode.hpp>
#include <SDK/entity2/GameTick_t.hpp>
#include <SDK/server/CIronSightController.hpp>



namespace CS2 {
	namespace server {
		class CCSWeaponBase : public CS2::server::CBasePlayerWeapon {
		public:
			bool m_bRemoveable; // 0xe78 | Schema_Builtin | Size: 0x1
			S2_PAD(0x7);
			// GlobalTypes::CUtlVector< animationsystem::HSequence > m_thirdPersonFireSequences; // 0xe80 | Schema_Atomic | Size: 0x18
			char  m_thirdPersonFireSequences[0x18]; // 0xe80 | Schema_Atomic | Size: 0x18
			animationsystem::HSequence m_hCurrentThirdPersonSequence; // 0xe98 | Schema_DeclaredClass | Size: 0x4
			animationsystem::HSequence m_thirdPersonSequences[7]; // 0xe9c | Schema_FixedArray | Size: 0xc4
			bool m_bPlayerAmmoStockOnPickup; // 0xec0 | Schema_Builtin | Size: 0x1
			bool m_bRequireUseToTouch; // 0xec1 | Schema_Builtin | Size: 0x1
			client::WeaponGameplayAnimState m_iWeaponGameplayAnimState; // 0xec2 | Schema_DeclaredEnum | Size: 0x2
			entity2::GameTime_t m_flWeaponGameplayAnimStateTimestamp; // 0xec4 | Schema_DeclaredClass | Size: 0x4
			entity2::GameTime_t m_flInspectCancelCompleteTime; // 0xec8 | Schema_DeclaredClass | Size: 0x4
			bool m_bInspectPending; // 0xecc | Schema_Builtin | Size: 0x1
			bool m_bInspectShouldLoop; // 0xecd | Schema_Builtin | Size: 0x1
			S2_PAD(0x2a);
			int32_t m_nLastEmptySoundCmdNum; // 0xef8 | Schema_Builtin | Size: 0x4
			S2_PAD(0x1c);
			bool m_bFireOnEmpty; // 0xf18 | Schema_Builtin | Size: 0x1
			S2_PAD(0x7);
			entity2::CEntityIOOutput m_OnPlayerPickup; // 0xf20 | Schema_DeclaredClass | Size: 0x28
			client::CSWeaponMode m_weaponMode; // 0xf48 | Schema_DeclaredEnum | Size: 0x4
			float32 m_flTurningInaccuracyDelta; // 0xf4c | Schema_Builtin | Size: 0x4
			GlobalTypes::Vector m_vecTurningInaccuracyEyeDirLast; // 0xf50 | Schema_Atomic | Size: 0xc
			float32 m_flTurningInaccuracy; // 0xf5c | Schema_Builtin | Size: 0x4
			float32 m_fAccuracyPenalty; // 0xf60 | Schema_Builtin | Size: 0x4
			entity2::GameTime_t m_flLastAccuracyUpdateTime; // 0xf64 | Schema_DeclaredClass | Size: 0x4
			float32 m_fAccuracySmoothedForZoom; // 0xf68 | Schema_Builtin | Size: 0x4
			int32_t m_iRecoilIndex; // 0xf6c | Schema_Builtin | Size: 0x4
			float32 m_flRecoilIndex; // 0xf70 | Schema_Builtin | Size: 0x4
			bool m_bBurstMode; // 0xf74 | Schema_Builtin | Size: 0x1
			S2_PAD(0x3);
			entity2::GameTick_t m_nPostponeFireReadyTicks; // 0xf78 | Schema_DeclaredClass | Size: 0x4
			float32 m_flPostponeFireReadyFrac; // 0xf7c | Schema_Builtin | Size: 0x4
			bool m_bInReload; // 0xf80 | Schema_Builtin | Size: 0x1
			S2_PAD(0x3);
			entity2::GameTime_t m_flDroppedAtTime; // 0xf84 | Schema_DeclaredClass | Size: 0x4
			bool m_bIsHauledBack; // 0xf88 | Schema_Builtin | Size: 0x1
			bool m_bSilencerOn; // 0xf89 | Schema_Builtin | Size: 0x1
			S2_PAD(0x2);
			entity2::GameTime_t m_flTimeSilencerSwitchComplete; // 0xf8c | Schema_DeclaredClass | Size: 0x4
			int32_t m_iOriginalTeamNumber; // 0xf90 | Schema_Builtin | Size: 0x4
			int32_t m_iMostRecentTeamNumber; // 0xf94 | Schema_Builtin | Size: 0x4
			bool m_bDroppedNearBuyZone; // 0xf98 | Schema_Builtin | Size: 0x1
			S2_PAD(0x3);
			float32 m_flNextAttackRenderTimeOffset; // 0xf9c | Schema_Builtin | Size: 0x4
			S2_PAD(0x10);
			bool m_bCanBePickedUp; // 0xfb0 | Schema_Builtin | Size: 0x1
			bool m_bUseCanOverrideNextOwnerTouchTime; // 0xfb1 | Schema_Builtin | Size: 0x1
			S2_PAD(0x2);
			entity2::GameTime_t m_nextOwnerTouchTime; // 0xfb4 | Schema_DeclaredClass | Size: 0x4
			entity2::GameTime_t m_nextPrevOwnerTouchTime; // 0xfb8 | Schema_DeclaredClass | Size: 0x4
			S2_PAD(0x4);
			entity2::GameTime_t m_nextPrevOwnerUseTime; // 0xfc0 | Schema_DeclaredClass | Size: 0x4
			// server::CHandle< server::CCSPlayerPawn > m_hPrevOwner; // 0xfc4 | Schema_Atomic | Size: 0x4
			char  m_hPrevOwner[0x4]; // 0xfc4 | Schema_Atomic | Size: 0x4
			entity2::GameTick_t m_nDropTick; // 0xfc8 | Schema_DeclaredClass | Size: 0x4
			bool m_bWasActiveWeaponWhenDropped; // 0xfcc | Schema_Builtin | Size: 0x1
			S2_PAD(0x1f);
			bool m_donated; // 0xfec | Schema_Builtin | Size: 0x1
			S2_PAD(0x3);
			entity2::GameTime_t m_fLastShotTime; // 0xff0 | Schema_DeclaredClass | Size: 0x4
			bool m_bWasOwnedByCT; // 0xff4 | Schema_Builtin | Size: 0x1
			bool m_bWasOwnedByTerrorist; // 0xff5 | Schema_Builtin | Size: 0x1
			S2_PAD(0x2);
			int32_t m_numRemoveUnownedWeaponThink; // 0xff8 | Schema_Builtin | Size: 0x4
			S2_PAD(0x4);
			server::CIronSightController m_IronSightController; // 0x1000 | Schema_DeclaredClass | Size: 0x18
			int32_t m_iIronSightMode; // 0x1018 | Schema_Builtin | Size: 0x4
			entity2::GameTime_t m_flLastLOSTraceFailureTime; // 0x101c | Schema_DeclaredClass | Size: 0x4
			float32 m_flWatTickOffset; // 0x1020 | Schema_Builtin | Size: 0x4
			S2_PAD(0xc); // End padding
		};
		static_assert(offsetof(CS2::server::CCSWeaponBase, m_bRemoveable) == 0xE78, "m_bRemoveable in CCSWeaponBase should be at offset 0xE78");
		static_assert(offsetof(CS2::server::CCSWeaponBase, m_thirdPersonFireSequences) == 0xE80, "m_thirdPersonFireSequences in CCSWeaponBase should be at offset 0xE80");
		static_assert(offsetof(CS2::server::CCSWeaponBase, m_hCurrentThirdPersonSequence) == 0xE98, "m_hCurrentThirdPersonSequence in CCSWeaponBase should be at offset 0xE98");
		static_assert(offsetof(CS2::server::CCSWeaponBase, m_thirdPersonSequences) == 0xE9C, "m_thirdPersonSequences in CCSWeaponBase should be at offset 0xE9C");
		static_assert(offsetof(CS2::server::CCSWeaponBase, m_bPlayerAmmoStockOnPickup) == 0xEC0, "m_bPlayerAmmoStockOnPickup in CCSWeaponBase should be at offset 0xEC0");
		static_assert(offsetof(CS2::server::CCSWeaponBase, m_bRequireUseToTouch) == 0xEC1, "m_bRequireUseToTouch in CCSWeaponBase should be at offset 0xEC1");
		static_assert(offsetof(CS2::server::CCSWeaponBase, m_iWeaponGameplayAnimState) == 0xEC2, "m_iWeaponGameplayAnimState in CCSWeaponBase should be at offset 0xEC2");
		static_assert(offsetof(CS2::server::CCSWeaponBase, m_flWeaponGameplayAnimStateTimestamp) == 0xEC4, "m_flWeaponGameplayAnimStateTimestamp in CCSWeaponBase should be at offset 0xEC4");
		static_assert(offsetof(CS2::server::CCSWeaponBase, m_flInspectCancelCompleteTime) == 0xEC8, "m_flInspectCancelCompleteTime in CCSWeaponBase should be at offset 0xEC8");
		static_assert(offsetof(CS2::server::CCSWeaponBase, m_bInspectPending) == 0xECC, "m_bInspectPending in CCSWeaponBase should be at offset 0xECC");
		static_assert(offsetof(CS2::server::CCSWeaponBase, m_bInspectShouldLoop) == 0xECD, "m_bInspectShouldLoop in CCSWeaponBase should be at offset 0xECD");
		static_assert(offsetof(CS2::server::CCSWeaponBase, m_nLastEmptySoundCmdNum) == 0xEF8, "m_nLastEmptySoundCmdNum in CCSWeaponBase should be at offset 0xEF8");
		static_assert(offsetof(CS2::server::CCSWeaponBase, m_bFireOnEmpty) == 0xF18, "m_bFireOnEmpty in CCSWeaponBase should be at offset 0xF18");
		static_assert(offsetof(CS2::server::CCSWeaponBase, m_OnPlayerPickup) == 0xF20, "m_OnPlayerPickup in CCSWeaponBase should be at offset 0xF20");
		static_assert(offsetof(CS2::server::CCSWeaponBase, m_weaponMode) == 0xF48, "m_weaponMode in CCSWeaponBase should be at offset 0xF48");
		static_assert(offsetof(CS2::server::CCSWeaponBase, m_flTurningInaccuracyDelta) == 0xF4C, "m_flTurningInaccuracyDelta in CCSWeaponBase should be at offset 0xF4C");
		static_assert(offsetof(CS2::server::CCSWeaponBase, m_vecTurningInaccuracyEyeDirLast) == 0xF50, "m_vecTurningInaccuracyEyeDirLast in CCSWeaponBase should be at offset 0xF50");
		static_assert(offsetof(CS2::server::CCSWeaponBase, m_flTurningInaccuracy) == 0xF5C, "m_flTurningInaccuracy in CCSWeaponBase should be at offset 0xF5C");
		static_assert(offsetof(CS2::server::CCSWeaponBase, m_fAccuracyPenalty) == 0xF60, "m_fAccuracyPenalty in CCSWeaponBase should be at offset 0xF60");
		static_assert(offsetof(CS2::server::CCSWeaponBase, m_flLastAccuracyUpdateTime) == 0xF64, "m_flLastAccuracyUpdateTime in CCSWeaponBase should be at offset 0xF64");
		static_assert(offsetof(CS2::server::CCSWeaponBase, m_fAccuracySmoothedForZoom) == 0xF68, "m_fAccuracySmoothedForZoom in CCSWeaponBase should be at offset 0xF68");
		static_assert(offsetof(CS2::server::CCSWeaponBase, m_iRecoilIndex) == 0xF6C, "m_iRecoilIndex in CCSWeaponBase should be at offset 0xF6C");
		static_assert(offsetof(CS2::server::CCSWeaponBase, m_flRecoilIndex) == 0xF70, "m_flRecoilIndex in CCSWeaponBase should be at offset 0xF70");
		static_assert(offsetof(CS2::server::CCSWeaponBase, m_bBurstMode) == 0xF74, "m_bBurstMode in CCSWeaponBase should be at offset 0xF74");
		static_assert(offsetof(CS2::server::CCSWeaponBase, m_nPostponeFireReadyTicks) == 0xF78, "m_nPostponeFireReadyTicks in CCSWeaponBase should be at offset 0xF78");
		static_assert(offsetof(CS2::server::CCSWeaponBase, m_flPostponeFireReadyFrac) == 0xF7C, "m_flPostponeFireReadyFrac in CCSWeaponBase should be at offset 0xF7C");
		static_assert(offsetof(CS2::server::CCSWeaponBase, m_bInReload) == 0xF80, "m_bInReload in CCSWeaponBase should be at offset 0xF80");
		static_assert(offsetof(CS2::server::CCSWeaponBase, m_flDroppedAtTime) == 0xF84, "m_flDroppedAtTime in CCSWeaponBase should be at offset 0xF84");
		static_assert(offsetof(CS2::server::CCSWeaponBase, m_bIsHauledBack) == 0xF88, "m_bIsHauledBack in CCSWeaponBase should be at offset 0xF88");
		static_assert(offsetof(CS2::server::CCSWeaponBase, m_bSilencerOn) == 0xF89, "m_bSilencerOn in CCSWeaponBase should be at offset 0xF89");
		static_assert(offsetof(CS2::server::CCSWeaponBase, m_flTimeSilencerSwitchComplete) == 0xF8C, "m_flTimeSilencerSwitchComplete in CCSWeaponBase should be at offset 0xF8C");
		static_assert(offsetof(CS2::server::CCSWeaponBase, m_iOriginalTeamNumber) == 0xF90, "m_iOriginalTeamNumber in CCSWeaponBase should be at offset 0xF90");
		static_assert(offsetof(CS2::server::CCSWeaponBase, m_iMostRecentTeamNumber) == 0xF94, "m_iMostRecentTeamNumber in CCSWeaponBase should be at offset 0xF94");
		static_assert(offsetof(CS2::server::CCSWeaponBase, m_bDroppedNearBuyZone) == 0xF98, "m_bDroppedNearBuyZone in CCSWeaponBase should be at offset 0xF98");
		static_assert(offsetof(CS2::server::CCSWeaponBase, m_flNextAttackRenderTimeOffset) == 0xF9C, "m_flNextAttackRenderTimeOffset in CCSWeaponBase should be at offset 0xF9C");
		static_assert(offsetof(CS2::server::CCSWeaponBase, m_bCanBePickedUp) == 0xFB0, "m_bCanBePickedUp in CCSWeaponBase should be at offset 0xFB0");
		static_assert(offsetof(CS2::server::CCSWeaponBase, m_bUseCanOverrideNextOwnerTouchTime) == 0xFB1, "m_bUseCanOverrideNextOwnerTouchTime in CCSWeaponBase should be at offset 0xFB1");
		static_assert(offsetof(CS2::server::CCSWeaponBase, m_nextOwnerTouchTime) == 0xFB4, "m_nextOwnerTouchTime in CCSWeaponBase should be at offset 0xFB4");
		static_assert(offsetof(CS2::server::CCSWeaponBase, m_nextPrevOwnerTouchTime) == 0xFB8, "m_nextPrevOwnerTouchTime in CCSWeaponBase should be at offset 0xFB8");
		static_assert(offsetof(CS2::server::CCSWeaponBase, m_nextPrevOwnerUseTime) == 0xFC0, "m_nextPrevOwnerUseTime in CCSWeaponBase should be at offset 0xFC0");
		static_assert(offsetof(CS2::server::CCSWeaponBase, m_hPrevOwner) == 0xFC4, "m_hPrevOwner in CCSWeaponBase should be at offset 0xFC4");
		static_assert(offsetof(CS2::server::CCSWeaponBase, m_nDropTick) == 0xFC8, "m_nDropTick in CCSWeaponBase should be at offset 0xFC8");
		static_assert(offsetof(CS2::server::CCSWeaponBase, m_bWasActiveWeaponWhenDropped) == 0xFCC, "m_bWasActiveWeaponWhenDropped in CCSWeaponBase should be at offset 0xFCC");
		static_assert(offsetof(CS2::server::CCSWeaponBase, m_donated) == 0xFEC, "m_donated in CCSWeaponBase should be at offset 0xFEC");
		static_assert(offsetof(CS2::server::CCSWeaponBase, m_fLastShotTime) == 0xFF0, "m_fLastShotTime in CCSWeaponBase should be at offset 0xFF0");
		static_assert(offsetof(CS2::server::CCSWeaponBase, m_bWasOwnedByCT) == 0xFF4, "m_bWasOwnedByCT in CCSWeaponBase should be at offset 0xFF4");
		static_assert(offsetof(CS2::server::CCSWeaponBase, m_bWasOwnedByTerrorist) == 0xFF5, "m_bWasOwnedByTerrorist in CCSWeaponBase should be at offset 0xFF5");
		static_assert(offsetof(CS2::server::CCSWeaponBase, m_numRemoveUnownedWeaponThink) == 0xFF8, "m_numRemoveUnownedWeaponThink in CCSWeaponBase should be at offset 0xFF8");
		static_assert(offsetof(CS2::server::CCSWeaponBase, m_IronSightController) == 0x1000, "m_IronSightController in CCSWeaponBase should be at offset 0x1000");
		static_assert(offsetof(CS2::server::CCSWeaponBase, m_iIronSightMode) == 0x1018, "m_iIronSightMode in CCSWeaponBase should be at offset 0x1018");
		static_assert(offsetof(CS2::server::CCSWeaponBase, m_flLastLOSTraceFailureTime) == 0x101C, "m_flLastLOSTraceFailureTime in CCSWeaponBase should be at offset 0x101C");
		static_assert(offsetof(CS2::server::CCSWeaponBase, m_flWatTickOffset) == 0x1020, "m_flWatTickOffset in CCSWeaponBase should be at offset 0x1020");
		static_assert(sizeof(CS2::server::CCSWeaponBase) == 0x1030, "CCSWeaponBase size should be 0x1030");
	}
}
