// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#ifndef CUSTOM_GLOBAL_TYPES
	#include <SDK/GlobalTypes.hpp>
#else
	#include <Custom/GlobalTypes.hpp>
#endif


#include <SDK/server/CBaseCSGrenadeProjectile.hpp>
#include <SDK/entity2/GameTime_t.hpp>





using namespace GlobalTypes;
namespace CS2 {
	namespace server {
		class CDecoyProjectile : public CS2::server::CBaseCSGrenadeProjectile {
		public:
			S2_PAD(0x18);
			int32_t m_nDecoyShotTick; // 0xbc8 | Schema_Builtin | Size: 0x4
			int32_t m_shotsRemaining; // 0xbcc | Schema_Builtin | Size: 0x4
			entity2::GameTime_t m_fExpireTime; // 0xbd0 | Schema_DeclaredClass | Size: 0x4
			S2_PAD(0xc);
			uint16_t m_decoyWeaponDefIndex; // 0xbe0 | Schema_Builtin | Size: 0x2
			S2_PAD(0xe); // End padding
		};
		static_assert(offsetof(CS2::server::CDecoyProjectile, m_nDecoyShotTick) == 0xBC8, "m_nDecoyShotTick in CDecoyProjectile should be at offset 0xBC8");
		static_assert(offsetof(CS2::server::CDecoyProjectile, m_shotsRemaining) == 0xBCC, "m_shotsRemaining in CDecoyProjectile should be at offset 0xBCC");
		static_assert(offsetof(CS2::server::CDecoyProjectile, m_fExpireTime) == 0xBD0, "m_fExpireTime in CDecoyProjectile should be at offset 0xBD0");
		static_assert(offsetof(CS2::server::CDecoyProjectile, m_decoyWeaponDefIndex) == 0xBE0, "m_decoyWeaponDefIndex in CDecoyProjectile should be at offset 0xBE0");
		static_assert(sizeof(CS2::server::CDecoyProjectile) == 0xBF0, "CDecoyProjectile size should be 0xBF0");
	}
}
