// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#ifndef CUSTOM_GLOBAL_TYPES
	#include <SDK/GlobalTypes.hpp>
#else
	#include <Custom/GlobalTypes.hpp>
#endif


#include <SDK/entity2/CNetworkVarChainer.hpp>



namespace CS2 {
	namespace server {
		class CBaseModelEntity;
	}
}


using namespace GlobalTypes;
namespace CS2 {
	namespace server {
		class CDestructiblePartsComponent  {
		public:
			entity2::CNetworkVarChainer __m_pChainEntity; // 0x0 | Schema_DeclaredClass | Size: 0x28
			S2_PAD(0x20);
			GlobalTypes::CUtlVector< uint16 > m_vecDamageTakenByHitGroup; // 0x48 | Schema_Atomic | Size: 0x18
			// char  m_vecDamageTakenByHitGroup[0x18]; // 0x48 | Schema_Atomic | Size: 0x18
			GlobalTypes::CHandle<server::CBaseModelEntity> m_hOwner; // 0x60 | Schema_Atomic | Size: 0x4
			// char  m_hOwner[0x4]; // 0x60 | Schema_Atomic | Size: 0x4
			int32_t m_nLastHitDamageLevel; // 0x64 | Schema_Builtin | Size: 0x4
		};
		static_assert(offsetof(CS2::server::CDestructiblePartsComponent, __m_pChainEntity) == 0x0, "__m_pChainEntity in CDestructiblePartsComponent should be at offset 0x0");
		static_assert(offsetof(CS2::server::CDestructiblePartsComponent, m_vecDamageTakenByHitGroup) == 0x48, "m_vecDamageTakenByHitGroup in CDestructiblePartsComponent should be at offset 0x48");
		static_assert(offsetof(CS2::server::CDestructiblePartsComponent, m_hOwner) == 0x60, "m_hOwner in CDestructiblePartsComponent should be at offset 0x60");
		static_assert(offsetof(CS2::server::CDestructiblePartsComponent, m_nLastHitDamageLevel) == 0x64, "m_nLastHitDamageLevel in CDestructiblePartsComponent should be at offset 0x64");
		static_assert(sizeof(CS2::server::CDestructiblePartsComponent) == 0x68, "CDestructiblePartsComponent size should be 0x68");
	}
}
