// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#include <SDK/GlobalTypes.hpp>

#include <SDK/entity2/CNetworkVarChainer.hpp>



namespace CS2 {
	namespace server {
		class CDestructiblePartsSystemComponent  {
		public:
			entity2::CNetworkVarChainer __m_pChainEntity; // 0x0 | Schema_DeclaredClass | Size: 0x28
			S2_PAD(0x20);
			// GlobalTypes::CNetworkUtlVectorBase< uint16 > m_DamageLevelTakenByHitGroup; // 0x48 | Schema_Atomic | Size: 0x18
			char  m_DamageLevelTakenByHitGroup[0x18]; // 0x48 | Schema_Atomic | Size: 0x18
			// server::CHandle< server::CBaseModelEntity > m_hOwner; // 0x60 | Schema_Atomic | Size: 0x4
			char  m_hOwner[0x4]; // 0x60 | Schema_Atomic | Size: 0x4
			int32_t m_nLastHitDamageLevel; // 0x64 | Schema_Builtin | Size: 0x4
		};
		static_assert(offsetof(CS2::server::CDestructiblePartsSystemComponent, __m_pChainEntity) == 0x0, "__m_pChainEntity in CDestructiblePartsSystemComponent should be at offset 0x0");
		static_assert(offsetof(CS2::server::CDestructiblePartsSystemComponent, m_DamageLevelTakenByHitGroup) == 0x48, "m_DamageLevelTakenByHitGroup in CDestructiblePartsSystemComponent should be at offset 0x48");
		static_assert(offsetof(CS2::server::CDestructiblePartsSystemComponent, m_hOwner) == 0x60, "m_hOwner in CDestructiblePartsSystemComponent should be at offset 0x60");
		static_assert(offsetof(CS2::server::CDestructiblePartsSystemComponent, m_nLastHitDamageLevel) == 0x64, "m_nLastHitDamageLevel in CDestructiblePartsSystemComponent should be at offset 0x64");
		static_assert(sizeof(CS2::server::CDestructiblePartsSystemComponent) == 0x68, "CDestructiblePartsSystemComponent size should be 0x68");
	}
}
