// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#include <SDK/GlobalTypes.hpp>

#include <SDK/server/CTriggerMultiple.hpp>



namespace CS2 {
	namespace server {
		class CDynamicNavConnectionsVolume : public CS2::server::CTriggerMultiple {
		public:
			GlobalTypes::CUtlSymbolLarge m_iszConnectionTarget; // 0x9e8 | Schema_Atomic | Size: 0x8
			// GlobalTypes::CUtlVector< server::DynamicVolumeDef_t > m_vecConnections; // 0x9f0 | Schema_Atomic | Size: 0x18
			char  m_vecConnections[0x18]; // 0x9f0 | Schema_Atomic | Size: 0x18
			GlobalTypes::CGlobalSymbol m_sTransitionType; // 0xa08 | Schema_Atomic | Size: 0x8
			bool m_bConnectionsEnabled; // 0xa10 | Schema_Builtin | Size: 0x1
			S2_PAD(0x3);
			float32 m_flTargetAreaSearchRadius; // 0xa14 | Schema_Builtin | Size: 0x4
			float32 m_flUpdateDistance; // 0xa18 | Schema_Builtin | Size: 0x4
			float32 m_flMaxConnectionDistance; // 0xa1c | Schema_Builtin | Size: 0x4
		};
		static_assert(offsetof(CS2::server::CDynamicNavConnectionsVolume, m_iszConnectionTarget) == 0x9E8, "m_iszConnectionTarget in CDynamicNavConnectionsVolume should be at offset 0x9E8");
		static_assert(offsetof(CS2::server::CDynamicNavConnectionsVolume, m_vecConnections) == 0x9F0, "m_vecConnections in CDynamicNavConnectionsVolume should be at offset 0x9F0");
		static_assert(offsetof(CS2::server::CDynamicNavConnectionsVolume, m_sTransitionType) == 0xA08, "m_sTransitionType in CDynamicNavConnectionsVolume should be at offset 0xA08");
		static_assert(offsetof(CS2::server::CDynamicNavConnectionsVolume, m_bConnectionsEnabled) == 0xA10, "m_bConnectionsEnabled in CDynamicNavConnectionsVolume should be at offset 0xA10");
		static_assert(offsetof(CS2::server::CDynamicNavConnectionsVolume, m_flTargetAreaSearchRadius) == 0xA14, "m_flTargetAreaSearchRadius in CDynamicNavConnectionsVolume should be at offset 0xA14");
		static_assert(offsetof(CS2::server::CDynamicNavConnectionsVolume, m_flUpdateDistance) == 0xA18, "m_flUpdateDistance in CDynamicNavConnectionsVolume should be at offset 0xA18");
		static_assert(offsetof(CS2::server::CDynamicNavConnectionsVolume, m_flMaxConnectionDistance) == 0xA1C, "m_flMaxConnectionDistance in CDynamicNavConnectionsVolume should be at offset 0xA1C");
		static_assert(sizeof(CS2::server::CDynamicNavConnectionsVolume) == 0xA20, "CDynamicNavConnectionsVolume size should be 0xA20");
	}
}
