// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#ifndef CUSTOM_GLOBAL_TYPES
	#include "../GlobalTypes.hpp"
#else
	#include <Custom/GlobalTypes.hpp>
#endif


#include "CTriggerMultiple.hpp"
#include "DynamicVolumeDef_t.hpp"





using namespace GlobalTypes;
namespace CS2 {
	namespace server {
		class CDynamicNavConnectionsVolume : public CS2::server::CTriggerMultiple {
		public:
			GlobalTypes::CUtlSymbolLarge m_iszConnectionTarget; // 0x8a8 | Schema_Atomic | Size: 0x8
			GlobalTypes::CUtlVector<server::DynamicVolumeDef_t> m_vecConnections; // 0x8b0 | Schema_Atomic | Size: 0x18
			// char m_vecConnections[0x18]; // 0x8b0 | Schema_Atomic | Size: 0x18
			GlobalTypes::CGlobalSymbol m_sTransitionType; // 0x8c8 | Schema_Atomic | Size: 0x8
			bool m_bConnectionsEnabled; // 0x8d0 | Schema_Builtin | Size: 0x1
			S2_PAD(0x3);
			float32 m_flTargetAreaSearchRadius; // 0x8d4 | Schema_Builtin | Size: 0x4
			float32 m_flUpdateDistance; // 0x8d8 | Schema_Builtin | Size: 0x4
			float32 m_flMaxConnectionDistance; // 0x8dc | Schema_Builtin | Size: 0x4
		};
#ifdef USE_STATIC_ASSERTS
		static_assert(offsetof(CS2::server::CDynamicNavConnectionsVolume, m_iszConnectionTarget) == 0x8A8, "m_iszConnectionTarget in CDynamicNavConnectionsVolume should be at offset 0x8A8");
		static_assert(offsetof(CS2::server::CDynamicNavConnectionsVolume, m_vecConnections) == 0x8B0, "m_vecConnections in CDynamicNavConnectionsVolume should be at offset 0x8B0");
		static_assert(offsetof(CS2::server::CDynamicNavConnectionsVolume, m_sTransitionType) == 0x8C8, "m_sTransitionType in CDynamicNavConnectionsVolume should be at offset 0x8C8");
		static_assert(offsetof(CS2::server::CDynamicNavConnectionsVolume, m_bConnectionsEnabled) == 0x8D0, "m_bConnectionsEnabled in CDynamicNavConnectionsVolume should be at offset 0x8D0");
		static_assert(offsetof(CS2::server::CDynamicNavConnectionsVolume, m_flTargetAreaSearchRadius) == 0x8D4, "m_flTargetAreaSearchRadius in CDynamicNavConnectionsVolume should be at offset 0x8D4");
		static_assert(offsetof(CS2::server::CDynamicNavConnectionsVolume, m_flUpdateDistance) == 0x8D8, "m_flUpdateDistance in CDynamicNavConnectionsVolume should be at offset 0x8D8");
		static_assert(offsetof(CS2::server::CDynamicNavConnectionsVolume, m_flMaxConnectionDistance) == 0x8DC, "m_flMaxConnectionDistance in CDynamicNavConnectionsVolume should be at offset 0x8DC");
		static_assert(sizeof(CS2::server::CDynamicNavConnectionsVolume) == 0x8E0, "CDynamicNavConnectionsVolume size should be 0x8E0");

#endif
	}
}
