// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#ifndef CUSTOM_GLOBAL_TYPES
	#include <SDK/GlobalTypes.hpp>
#else
	#include <Custom/GlobalTypes.hpp>
#endif


#include <SDK/client/IEconItemInterface.hpp>
#include <SDK/server/CAttributeList.hpp>



namespace CS2 {
	namespace server {
		class CEconItemView : public CS2::client::IEconItemInterface {
		public:
			S2_PAD(0x30);
			uint16_t m_iItemDefinitionIndex; // 0x38 | Schema_Builtin | Size: 0x2
			S2_PAD(0x2);
			int32_t m_iEntityQuality; // 0x3c | Schema_Builtin | Size: 0x4
			uint32_t m_iEntityLevel; // 0x40 | Schema_Builtin | Size: 0x4
			S2_PAD(0x4);
			uint64_t m_iItemID; // 0x48 | Schema_Builtin | Size: 0x8
			uint32_t m_iItemIDHigh; // 0x50 | Schema_Builtin | Size: 0x4
			uint32_t m_iItemIDLow; // 0x54 | Schema_Builtin | Size: 0x4
			uint32_t m_iAccountID; // 0x58 | Schema_Builtin | Size: 0x4
			uint32_t m_iInventoryPosition; // 0x5c | Schema_Builtin | Size: 0x4
			S2_PAD(0x8);
			bool m_bInitialized; // 0x68 | Schema_Builtin | Size: 0x1
			S2_PAD(0x7);
			server::CAttributeList m_AttributeList; // 0x70 | Schema_DeclaredClass | Size: 0x78
			server::CAttributeList m_NetworkedDynamicAttributes; // 0xe8 | Schema_DeclaredClass | Size: 0x78
			char m_szCustomName[161]; // 0x160 | Schema_FixedArray | Size: 0xa1
			char m_szCustomNameOverride[161]; // 0x201 | Schema_FixedArray | Size: 0xa1
			S2_PAD(0x6); // End padding
		};
		static_assert(offsetof(CS2::server::CEconItemView, m_iItemDefinitionIndex) == 0x38, "m_iItemDefinitionIndex in CEconItemView should be at offset 0x38");
		static_assert(offsetof(CS2::server::CEconItemView, m_iEntityQuality) == 0x3C, "m_iEntityQuality in CEconItemView should be at offset 0x3C");
		static_assert(offsetof(CS2::server::CEconItemView, m_iEntityLevel) == 0x40, "m_iEntityLevel in CEconItemView should be at offset 0x40");
		static_assert(offsetof(CS2::server::CEconItemView, m_iItemID) == 0x48, "m_iItemID in CEconItemView should be at offset 0x48");
		static_assert(offsetof(CS2::server::CEconItemView, m_iItemIDHigh) == 0x50, "m_iItemIDHigh in CEconItemView should be at offset 0x50");
		static_assert(offsetof(CS2::server::CEconItemView, m_iItemIDLow) == 0x54, "m_iItemIDLow in CEconItemView should be at offset 0x54");
		static_assert(offsetof(CS2::server::CEconItemView, m_iAccountID) == 0x58, "m_iAccountID in CEconItemView should be at offset 0x58");
		static_assert(offsetof(CS2::server::CEconItemView, m_iInventoryPosition) == 0x5C, "m_iInventoryPosition in CEconItemView should be at offset 0x5C");
		static_assert(offsetof(CS2::server::CEconItemView, m_bInitialized) == 0x68, "m_bInitialized in CEconItemView should be at offset 0x68");
		static_assert(offsetof(CS2::server::CEconItemView, m_AttributeList) == 0x70, "m_AttributeList in CEconItemView should be at offset 0x70");
		static_assert(offsetof(CS2::server::CEconItemView, m_NetworkedDynamicAttributes) == 0xE8, "m_NetworkedDynamicAttributes in CEconItemView should be at offset 0xE8");
		static_assert(offsetof(CS2::server::CEconItemView, m_szCustomName) == 0x160, "m_szCustomName in CEconItemView should be at offset 0x160");
		static_assert(offsetof(CS2::server::CEconItemView, m_szCustomNameOverride) == 0x201, "m_szCustomNameOverride in CEconItemView should be at offset 0x201");
		static_assert(sizeof(CS2::server::CEconItemView) == 0x2A8, "CEconItemView size should be 0x2A8");
	}
}
