// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#include <SDK/GlobalTypes.hpp>




namespace CS2 {
	namespace server {
		class CEconItemAttribute  {
		public:
			S2_PAD(0x30);
			uint16_t m_iAttributeDefinitionIndex; // 0x30 | Schema_Builtin | Size: 0x2
			S2_PAD(0x2);
			float32 m_flValue; // 0x34 | Schema_Builtin | Size: 0x4
			float32 m_flInitialValue; // 0x38 | Schema_Builtin | Size: 0x4
			int32_t m_nRefundableCurrency; // 0x3c | Schema_Builtin | Size: 0x4
			bool m_bSetBonus; // 0x40 | Schema_Builtin | Size: 0x1
			S2_PAD(0x7); // End padding
		};
		static_assert(offsetof(CS2::server::CEconItemAttribute, m_iAttributeDefinitionIndex) == 0x30, "m_iAttributeDefinitionIndex in CEconItemAttribute should be at offset 0x30");
		static_assert(offsetof(CS2::server::CEconItemAttribute, m_flValue) == 0x34, "m_flValue in CEconItemAttribute should be at offset 0x34");
		static_assert(offsetof(CS2::server::CEconItemAttribute, m_flInitialValue) == 0x38, "m_flInitialValue in CEconItemAttribute should be at offset 0x38");
		static_assert(offsetof(CS2::server::CEconItemAttribute, m_nRefundableCurrency) == 0x3C, "m_nRefundableCurrency in CEconItemAttribute should be at offset 0x3C");
		static_assert(offsetof(CS2::server::CEconItemAttribute, m_bSetBonus) == 0x40, "m_bSetBonus in CEconItemAttribute should be at offset 0x40");
		static_assert(sizeof(CS2::server::CEconItemAttribute) == 0x48, "CEconItemAttribute size should be 0x48");
	}
}
