// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#ifndef CUSTOM_GLOBAL_TYPES
	#include "../GlobalTypes.hpp"
#else
	#include <Custom/GlobalTypes.hpp>
#endif


#include "CBaseModelEntity.hpp"
#include "../entity2/GameTime_t.hpp"
#include "../client/EntityDisolveType_t.hpp"





using namespace GlobalTypes;
namespace CS2 {
	namespace server {
		class CEntityDissolve : public CS2::server::CBaseModelEntity {
		public:
			float32 m_flFadeInStart; // 0x730 | Schema_Builtin | Size: 0x4
			float32 m_flFadeInLength; // 0x734 | Schema_Builtin | Size: 0x4
			float32 m_flFadeOutModelStart; // 0x738 | Schema_Builtin | Size: 0x4
			float32 m_flFadeOutModelLength; // 0x73c | Schema_Builtin | Size: 0x4
			float32 m_flFadeOutStart; // 0x740 | Schema_Builtin | Size: 0x4
			float32 m_flFadeOutLength; // 0x744 | Schema_Builtin | Size: 0x4
			entity2::GameTime_t m_flStartTime; // 0x748 | Schema_DeclaredClass | Size: 0x4
			client::EntityDisolveType_t m_nDissolveType; // 0x74c | Schema_DeclaredEnum | Size: 0x4
			GlobalTypes::Vector m_vDissolverOrigin; // 0x750 | Schema_Atomic | Size: 0xc
			uint32_t m_nMagnitude; // 0x75c | Schema_Builtin | Size: 0x4
		};
#ifdef USE_STATIC_ASSERTS
		static_assert(offsetof(CS2::server::CEntityDissolve, m_flFadeInStart) == 0x730, "m_flFadeInStart in CEntityDissolve should be at offset 0x730");
		static_assert(offsetof(CS2::server::CEntityDissolve, m_flFadeInLength) == 0x734, "m_flFadeInLength in CEntityDissolve should be at offset 0x734");
		static_assert(offsetof(CS2::server::CEntityDissolve, m_flFadeOutModelStart) == 0x738, "m_flFadeOutModelStart in CEntityDissolve should be at offset 0x738");
		static_assert(offsetof(CS2::server::CEntityDissolve, m_flFadeOutModelLength) == 0x73C, "m_flFadeOutModelLength in CEntityDissolve should be at offset 0x73C");
		static_assert(offsetof(CS2::server::CEntityDissolve, m_flFadeOutStart) == 0x740, "m_flFadeOutStart in CEntityDissolve should be at offset 0x740");
		static_assert(offsetof(CS2::server::CEntityDissolve, m_flFadeOutLength) == 0x744, "m_flFadeOutLength in CEntityDissolve should be at offset 0x744");
		static_assert(offsetof(CS2::server::CEntityDissolve, m_flStartTime) == 0x748, "m_flStartTime in CEntityDissolve should be at offset 0x748");
		static_assert(offsetof(CS2::server::CEntityDissolve, m_nDissolveType) == 0x74C, "m_nDissolveType in CEntityDissolve should be at offset 0x74C");
		static_assert(offsetof(CS2::server::CEntityDissolve, m_vDissolverOrigin) == 0x750, "m_vDissolverOrigin in CEntityDissolve should be at offset 0x750");
		static_assert(offsetof(CS2::server::CEntityDissolve, m_nMagnitude) == 0x75C, "m_nMagnitude in CEntityDissolve should be at offset 0x75C");
		static_assert(sizeof(CS2::server::CEntityDissolve) == 0x760, "CEntityDissolve size should be 0x760");

#endif
	}
}
