// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#ifndef CUSTOM_GLOBAL_TYPES
	#include "../GlobalTypes.hpp"
#else
	#include <Custom/GlobalTypes.hpp>
#endif


#include "CPointEntity.hpp"
#include "../entity2/CEntityIOOutput.hpp"



namespace CS2 {
	namespace server {
		class CBaseEntity;
	}
}


using namespace GlobalTypes;
namespace CS2 {
	namespace server {
		class CEnvEntityMaker : public CS2::server::CPointEntity {
		public:
			GlobalTypes::Vector m_vecEntityMins; // 0x4a8 | Schema_Atomic | Size: 0xc
			GlobalTypes::Vector m_vecEntityMaxs; // 0x4b4 | Schema_Atomic | Size: 0xc
			GlobalTypes::CHandle<server::CBaseEntity> m_hCurrentInstance; // 0x4c0 | Schema_Atomic | Size: 0x4
			// char m_hCurrentInstance[0x4]; // 0x4c0 | Schema_Atomic | Size: 0x4
			GlobalTypes::CHandle<server::CBaseEntity> m_hCurrentBlocker; // 0x4c4 | Schema_Atomic | Size: 0x4
			// char m_hCurrentBlocker[0x4]; // 0x4c4 | Schema_Atomic | Size: 0x4
			GlobalTypes::Vector m_vecBlockerOrigin; // 0x4c8 | Schema_Atomic | Size: 0xc
			GlobalTypes::QAngle m_angPostSpawnDirection; // 0x4d4 | Schema_Atomic | Size: 0xc
			float32 m_flPostSpawnDirectionVariance; // 0x4e0 | Schema_Builtin | Size: 0x4
			float32 m_flPostSpawnSpeed; // 0x4e4 | Schema_Builtin | Size: 0x4
			bool m_bPostSpawnUseAngles; // 0x4e8 | Schema_Builtin | Size: 0x1
			S2_PAD(0x7);
			GlobalTypes::CUtlSymbolLarge m_iszTemplate; // 0x4f0 | Schema_Atomic | Size: 0x8
			entity2::CEntityIOOutput m_pOutputOnSpawned; // 0x4f8 | Schema_DeclaredClass | Size: 0x18
			entity2::CEntityIOOutput m_pOutputOnFailedSpawn; // 0x510 | Schema_DeclaredClass | Size: 0x18
		};
#ifdef USE_STATIC_ASSERTS
		static_assert(offsetof(CS2::server::CEnvEntityMaker, m_vecEntityMins) == 0x4A8, "m_vecEntityMins in CEnvEntityMaker should be at offset 0x4A8");
		static_assert(offsetof(CS2::server::CEnvEntityMaker, m_vecEntityMaxs) == 0x4B4, "m_vecEntityMaxs in CEnvEntityMaker should be at offset 0x4B4");
		static_assert(offsetof(CS2::server::CEnvEntityMaker, m_hCurrentInstance) == 0x4C0, "m_hCurrentInstance in CEnvEntityMaker should be at offset 0x4C0");
		static_assert(offsetof(CS2::server::CEnvEntityMaker, m_hCurrentBlocker) == 0x4C4, "m_hCurrentBlocker in CEnvEntityMaker should be at offset 0x4C4");
		static_assert(offsetof(CS2::server::CEnvEntityMaker, m_vecBlockerOrigin) == 0x4C8, "m_vecBlockerOrigin in CEnvEntityMaker should be at offset 0x4C8");
		static_assert(offsetof(CS2::server::CEnvEntityMaker, m_angPostSpawnDirection) == 0x4D4, "m_angPostSpawnDirection in CEnvEntityMaker should be at offset 0x4D4");
		static_assert(offsetof(CS2::server::CEnvEntityMaker, m_flPostSpawnDirectionVariance) == 0x4E0, "m_flPostSpawnDirectionVariance in CEnvEntityMaker should be at offset 0x4E0");
		static_assert(offsetof(CS2::server::CEnvEntityMaker, m_flPostSpawnSpeed) == 0x4E4, "m_flPostSpawnSpeed in CEnvEntityMaker should be at offset 0x4E4");
		static_assert(offsetof(CS2::server::CEnvEntityMaker, m_bPostSpawnUseAngles) == 0x4E8, "m_bPostSpawnUseAngles in CEnvEntityMaker should be at offset 0x4E8");
		static_assert(offsetof(CS2::server::CEnvEntityMaker, m_iszTemplate) == 0x4F0, "m_iszTemplate in CEnvEntityMaker should be at offset 0x4F0");
		static_assert(offsetof(CS2::server::CEnvEntityMaker, m_pOutputOnSpawned) == 0x4F8, "m_pOutputOnSpawned in CEnvEntityMaker should be at offset 0x4F8");
		static_assert(offsetof(CS2::server::CEnvEntityMaker, m_pOutputOnFailedSpawn) == 0x510, "m_pOutputOnFailedSpawn in CEnvEntityMaker should be at offset 0x510");
		static_assert(sizeof(CS2::server::CEnvEntityMaker) == 0x528, "CEnvEntityMaker size should be 0x528");

#endif
	}
}
