// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#ifndef CUSTOM_GLOBAL_TYPES
	#include <SDK/GlobalTypes.hpp>
#else
	#include <Custom/GlobalTypes.hpp>
#endif


#include <SDK/server/CBaseEntity.hpp>
#include <SDK/entity2/CEntityIOOutput.hpp>





using namespace GlobalTypes;
namespace CS2 {
	namespace server {
		class CEnvSoundscape : public CS2::server::CBaseEntity {
		public:
			entity2::CEntityIOOutput m_OnPlay; // 0x4a8 | Schema_DeclaredClass | Size: 0x18
			float32 m_flRadius; // 0x4c0 | Schema_Builtin | Size: 0x4
			S2_PAD(0x4);
			GlobalTypes::CUtlSymbolLarge m_soundEventName; // 0x4c8 | Schema_Atomic | Size: 0x8
			bool m_bOverrideWithEvent; // 0x4d0 | Schema_Builtin | Size: 0x1
			S2_PAD(0x3);
			int32_t m_soundscapeIndex; // 0x4d4 | Schema_Builtin | Size: 0x4
			int32_t m_soundscapeEntityListId; // 0x4d8 | Schema_Builtin | Size: 0x4
			S2_PAD(0x4);
			GlobalTypes::CUtlSymbolLarge m_positionNames[8]; // 0x4e0 | Schema_FixedArray | Size: 0x40
			GlobalTypes::CHandle<server::CEnvSoundscape> m_hProxySoundscape; // 0x520 | Schema_Atomic | Size: 0x4
			// char m_hProxySoundscape[0x4]; // 0x520 | Schema_Atomic | Size: 0x4
			bool m_bDisabled; // 0x524 | Schema_Builtin | Size: 0x1
			S2_PAD(0x3);
			GlobalTypes::CUtlSymbolLarge m_soundscapeName; // 0x528 | Schema_Atomic | Size: 0x8
			uint32_t m_soundEventHash; // 0x530 | Schema_Builtin | Size: 0x4
			S2_PAD(0x4); // End padding
		};
		static_assert(offsetof(CS2::server::CEnvSoundscape, m_OnPlay) == 0x4A8, "m_OnPlay in CEnvSoundscape should be at offset 0x4A8");
		static_assert(offsetof(CS2::server::CEnvSoundscape, m_flRadius) == 0x4C0, "m_flRadius in CEnvSoundscape should be at offset 0x4C0");
		static_assert(offsetof(CS2::server::CEnvSoundscape, m_soundEventName) == 0x4C8, "m_soundEventName in CEnvSoundscape should be at offset 0x4C8");
		static_assert(offsetof(CS2::server::CEnvSoundscape, m_bOverrideWithEvent) == 0x4D0, "m_bOverrideWithEvent in CEnvSoundscape should be at offset 0x4D0");
		static_assert(offsetof(CS2::server::CEnvSoundscape, m_soundscapeIndex) == 0x4D4, "m_soundscapeIndex in CEnvSoundscape should be at offset 0x4D4");
		static_assert(offsetof(CS2::server::CEnvSoundscape, m_soundscapeEntityListId) == 0x4D8, "m_soundscapeEntityListId in CEnvSoundscape should be at offset 0x4D8");
		static_assert(offsetof(CS2::server::CEnvSoundscape, m_positionNames) == 0x4E0, "m_positionNames in CEnvSoundscape should be at offset 0x4E0");
		static_assert(offsetof(CS2::server::CEnvSoundscape, m_hProxySoundscape) == 0x520, "m_hProxySoundscape in CEnvSoundscape should be at offset 0x520");
		static_assert(offsetof(CS2::server::CEnvSoundscape, m_bDisabled) == 0x524, "m_bDisabled in CEnvSoundscape should be at offset 0x524");
		static_assert(offsetof(CS2::server::CEnvSoundscape, m_soundscapeName) == 0x528, "m_soundscapeName in CEnvSoundscape should be at offset 0x528");
		static_assert(offsetof(CS2::server::CEnvSoundscape, m_soundEventHash) == 0x530, "m_soundEventHash in CEnvSoundscape should be at offset 0x530");
		static_assert(sizeof(CS2::server::CEnvSoundscape) == 0x538, "CEnvSoundscape size should be 0x538");
	}
}
