// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#ifndef CUSTOM_GLOBAL_TYPES
	#include "../GlobalTypes.hpp"
#else
	#include "../Custom/GlobalTypes.hpp"
#endif


#include "CBaseEntity.hpp"





using namespace GlobalTypes;
namespace CS2 {
	namespace server {
		class CEnvCombinedLightProbeVolume : public CS2::server::CBaseEntity {
		public:
			S2_PAD(0x1078);
			GlobalTypes::Color m_Entity_Color; // 0x1520 | Schema_Atomic | Size: 0x4
			float32 m_Entity_flBrightness; // 0x1524 | Schema_Builtin | Size: 0x4
			// GlobalTypes::CStrongHandle<resourcesystem::InfoForResourceTypeCTextureBase> m_Entity_hCubemapTexture; // 0x1528 | Schema_Atomic | Size: 0x8
			char m_Entity_hCubemapTexture[0x8]; // 0x1528 | Schema_Atomic | Size: 0x8
			bool m_Entity_bCustomCubemapTexture; // 0x1530 | Schema_Builtin | Size: 0x1
			S2_PAD(0x7);
			// GlobalTypes::CStrongHandle<resourcesystem::InfoForResourceTypeCTextureBase> m_Entity_hLightProbeTexture_AmbientCube; // 0x1538 | Schema_Atomic | Size: 0x8
			char m_Entity_hLightProbeTexture_AmbientCube[0x8]; // 0x1538 | Schema_Atomic | Size: 0x8
			// GlobalTypes::CStrongHandle<resourcesystem::InfoForResourceTypeCTextureBase> m_Entity_hLightProbeTexture_SDF; // 0x1540 | Schema_Atomic | Size: 0x8
			char m_Entity_hLightProbeTexture_SDF[0x8]; // 0x1540 | Schema_Atomic | Size: 0x8
			// GlobalTypes::CStrongHandle<resourcesystem::InfoForResourceTypeCTextureBase> m_Entity_hLightProbeTexture_SH2_DC; // 0x1548 | Schema_Atomic | Size: 0x8
			char m_Entity_hLightProbeTexture_SH2_DC[0x8]; // 0x1548 | Schema_Atomic | Size: 0x8
			// GlobalTypes::CStrongHandle<resourcesystem::InfoForResourceTypeCTextureBase> m_Entity_hLightProbeTexture_SH2_R; // 0x1550 | Schema_Atomic | Size: 0x8
			char m_Entity_hLightProbeTexture_SH2_R[0x8]; // 0x1550 | Schema_Atomic | Size: 0x8
			// GlobalTypes::CStrongHandle<resourcesystem::InfoForResourceTypeCTextureBase> m_Entity_hLightProbeTexture_SH2_G; // 0x1558 | Schema_Atomic | Size: 0x8
			char m_Entity_hLightProbeTexture_SH2_G[0x8]; // 0x1558 | Schema_Atomic | Size: 0x8
			// GlobalTypes::CStrongHandle<resourcesystem::InfoForResourceTypeCTextureBase> m_Entity_hLightProbeTexture_SH2_B; // 0x1560 | Schema_Atomic | Size: 0x8
			char m_Entity_hLightProbeTexture_SH2_B[0x8]; // 0x1560 | Schema_Atomic | Size: 0x8
			// GlobalTypes::CStrongHandle<resourcesystem::InfoForResourceTypeCTextureBase> m_Entity_hLightProbeDirectLightIndicesTexture; // 0x1568 | Schema_Atomic | Size: 0x8
			char m_Entity_hLightProbeDirectLightIndicesTexture[0x8]; // 0x1568 | Schema_Atomic | Size: 0x8
			// GlobalTypes::CStrongHandle<resourcesystem::InfoForResourceTypeCTextureBase> m_Entity_hLightProbeDirectLightScalarsTexture; // 0x1570 | Schema_Atomic | Size: 0x8
			char m_Entity_hLightProbeDirectLightScalarsTexture[0x8]; // 0x1570 | Schema_Atomic | Size: 0x8
			// GlobalTypes::CStrongHandle<resourcesystem::InfoForResourceTypeCTextureBase> m_Entity_hLightProbeDirectLightShadowsTexture; // 0x1578 | Schema_Atomic | Size: 0x8
			char m_Entity_hLightProbeDirectLightShadowsTexture[0x8]; // 0x1578 | Schema_Atomic | Size: 0x8
			GlobalTypes::Vector m_Entity_vBoxMins; // 0x1580 | Schema_Atomic | Size: 0xc
			GlobalTypes::Vector m_Entity_vBoxMaxs; // 0x158c | Schema_Atomic | Size: 0xc
			bool m_Entity_bMoveable; // 0x1598 | Schema_Builtin | Size: 0x1
			S2_PAD(0x3);
			int32_t m_Entity_nHandshake; // 0x159c | Schema_Builtin | Size: 0x4
			int32_t m_Entity_nEnvCubeMapArrayIndex; // 0x15a0 | Schema_Builtin | Size: 0x4
			int32_t m_Entity_nPriority; // 0x15a4 | Schema_Builtin | Size: 0x4
			bool m_Entity_bStartDisabled; // 0x15a8 | Schema_Builtin | Size: 0x1
			S2_PAD(0x3);
			float32 m_Entity_flEdgeFadeDist; // 0x15ac | Schema_Builtin | Size: 0x4
			GlobalTypes::Vector m_Entity_vEdgeFadeDists; // 0x15b0 | Schema_Atomic | Size: 0xc
			int32_t m_Entity_nLightProbeSizeX; // 0x15bc | Schema_Builtin | Size: 0x4
			int32_t m_Entity_nLightProbeSizeY; // 0x15c0 | Schema_Builtin | Size: 0x4
			int32_t m_Entity_nLightProbeSizeZ; // 0x15c4 | Schema_Builtin | Size: 0x4
			int32_t m_Entity_nLightProbeAtlasX; // 0x15c8 | Schema_Builtin | Size: 0x4
			int32_t m_Entity_nLightProbeAtlasY; // 0x15cc | Schema_Builtin | Size: 0x4
			int32_t m_Entity_nLightProbeAtlasZ; // 0x15d0 | Schema_Builtin | Size: 0x4
			S2_PAD(0x15);
			bool m_Entity_bEnabled; // 0x15e9 | Schema_Builtin | Size: 0x1
			S2_PAD(0x6); // End padding
		};
#ifdef USE_STATIC_ASSERTS
		static_assert(offsetof(CS2::server::CEnvCombinedLightProbeVolume, m_Entity_Color) == 0x1520, "m_Entity_Color in CEnvCombinedLightProbeVolume should be at offset 0x1520");
		static_assert(offsetof(CS2::server::CEnvCombinedLightProbeVolume, m_Entity_flBrightness) == 0x1524, "m_Entity_flBrightness in CEnvCombinedLightProbeVolume should be at offset 0x1524");
		static_assert(offsetof(CS2::server::CEnvCombinedLightProbeVolume, m_Entity_hCubemapTexture) == 0x1528, "m_Entity_hCubemapTexture in CEnvCombinedLightProbeVolume should be at offset 0x1528");
		static_assert(offsetof(CS2::server::CEnvCombinedLightProbeVolume, m_Entity_bCustomCubemapTexture) == 0x1530, "m_Entity_bCustomCubemapTexture in CEnvCombinedLightProbeVolume should be at offset 0x1530");
		static_assert(offsetof(CS2::server::CEnvCombinedLightProbeVolume, m_Entity_hLightProbeTexture_AmbientCube) == 0x1538, "m_Entity_hLightProbeTexture_AmbientCube in CEnvCombinedLightProbeVolume should be at offset 0x1538");
		static_assert(offsetof(CS2::server::CEnvCombinedLightProbeVolume, m_Entity_hLightProbeTexture_SDF) == 0x1540, "m_Entity_hLightProbeTexture_SDF in CEnvCombinedLightProbeVolume should be at offset 0x1540");
		static_assert(offsetof(CS2::server::CEnvCombinedLightProbeVolume, m_Entity_hLightProbeTexture_SH2_DC) == 0x1548, "m_Entity_hLightProbeTexture_SH2_DC in CEnvCombinedLightProbeVolume should be at offset 0x1548");
		static_assert(offsetof(CS2::server::CEnvCombinedLightProbeVolume, m_Entity_hLightProbeTexture_SH2_R) == 0x1550, "m_Entity_hLightProbeTexture_SH2_R in CEnvCombinedLightProbeVolume should be at offset 0x1550");
		static_assert(offsetof(CS2::server::CEnvCombinedLightProbeVolume, m_Entity_hLightProbeTexture_SH2_G) == 0x1558, "m_Entity_hLightProbeTexture_SH2_G in CEnvCombinedLightProbeVolume should be at offset 0x1558");
		static_assert(offsetof(CS2::server::CEnvCombinedLightProbeVolume, m_Entity_hLightProbeTexture_SH2_B) == 0x1560, "m_Entity_hLightProbeTexture_SH2_B in CEnvCombinedLightProbeVolume should be at offset 0x1560");
		static_assert(offsetof(CS2::server::CEnvCombinedLightProbeVolume, m_Entity_hLightProbeDirectLightIndicesTexture) == 0x1568, "m_Entity_hLightProbeDirectLightIndicesTexture in CEnvCombinedLightProbeVolume should be at offset 0x1568");
		static_assert(offsetof(CS2::server::CEnvCombinedLightProbeVolume, m_Entity_hLightProbeDirectLightScalarsTexture) == 0x1570, "m_Entity_hLightProbeDirectLightScalarsTexture in CEnvCombinedLightProbeVolume should be at offset 0x1570");
		static_assert(offsetof(CS2::server::CEnvCombinedLightProbeVolume, m_Entity_hLightProbeDirectLightShadowsTexture) == 0x1578, "m_Entity_hLightProbeDirectLightShadowsTexture in CEnvCombinedLightProbeVolume should be at offset 0x1578");
		static_assert(offsetof(CS2::server::CEnvCombinedLightProbeVolume, m_Entity_vBoxMins) == 0x1580, "m_Entity_vBoxMins in CEnvCombinedLightProbeVolume should be at offset 0x1580");
		static_assert(offsetof(CS2::server::CEnvCombinedLightProbeVolume, m_Entity_vBoxMaxs) == 0x158C, "m_Entity_vBoxMaxs in CEnvCombinedLightProbeVolume should be at offset 0x158C");
		static_assert(offsetof(CS2::server::CEnvCombinedLightProbeVolume, m_Entity_bMoveable) == 0x1598, "m_Entity_bMoveable in CEnvCombinedLightProbeVolume should be at offset 0x1598");
		static_assert(offsetof(CS2::server::CEnvCombinedLightProbeVolume, m_Entity_nHandshake) == 0x159C, "m_Entity_nHandshake in CEnvCombinedLightProbeVolume should be at offset 0x159C");
		static_assert(offsetof(CS2::server::CEnvCombinedLightProbeVolume, m_Entity_nEnvCubeMapArrayIndex) == 0x15A0, "m_Entity_nEnvCubeMapArrayIndex in CEnvCombinedLightProbeVolume should be at offset 0x15A0");
		static_assert(offsetof(CS2::server::CEnvCombinedLightProbeVolume, m_Entity_nPriority) == 0x15A4, "m_Entity_nPriority in CEnvCombinedLightProbeVolume should be at offset 0x15A4");
		static_assert(offsetof(CS2::server::CEnvCombinedLightProbeVolume, m_Entity_bStartDisabled) == 0x15A8, "m_Entity_bStartDisabled in CEnvCombinedLightProbeVolume should be at offset 0x15A8");
		static_assert(offsetof(CS2::server::CEnvCombinedLightProbeVolume, m_Entity_flEdgeFadeDist) == 0x15AC, "m_Entity_flEdgeFadeDist in CEnvCombinedLightProbeVolume should be at offset 0x15AC");
		static_assert(offsetof(CS2::server::CEnvCombinedLightProbeVolume, m_Entity_vEdgeFadeDists) == 0x15B0, "m_Entity_vEdgeFadeDists in CEnvCombinedLightProbeVolume should be at offset 0x15B0");
		static_assert(offsetof(CS2::server::CEnvCombinedLightProbeVolume, m_Entity_nLightProbeSizeX) == 0x15BC, "m_Entity_nLightProbeSizeX in CEnvCombinedLightProbeVolume should be at offset 0x15BC");
		static_assert(offsetof(CS2::server::CEnvCombinedLightProbeVolume, m_Entity_nLightProbeSizeY) == 0x15C0, "m_Entity_nLightProbeSizeY in CEnvCombinedLightProbeVolume should be at offset 0x15C0");
		static_assert(offsetof(CS2::server::CEnvCombinedLightProbeVolume, m_Entity_nLightProbeSizeZ) == 0x15C4, "m_Entity_nLightProbeSizeZ in CEnvCombinedLightProbeVolume should be at offset 0x15C4");
		static_assert(offsetof(CS2::server::CEnvCombinedLightProbeVolume, m_Entity_nLightProbeAtlasX) == 0x15C8, "m_Entity_nLightProbeAtlasX in CEnvCombinedLightProbeVolume should be at offset 0x15C8");
		static_assert(offsetof(CS2::server::CEnvCombinedLightProbeVolume, m_Entity_nLightProbeAtlasY) == 0x15CC, "m_Entity_nLightProbeAtlasY in CEnvCombinedLightProbeVolume should be at offset 0x15CC");
		static_assert(offsetof(CS2::server::CEnvCombinedLightProbeVolume, m_Entity_nLightProbeAtlasZ) == 0x15D0, "m_Entity_nLightProbeAtlasZ in CEnvCombinedLightProbeVolume should be at offset 0x15D0");
		static_assert(offsetof(CS2::server::CEnvCombinedLightProbeVolume, m_Entity_bEnabled) == 0x15E9, "m_Entity_bEnabled in CEnvCombinedLightProbeVolume should be at offset 0x15E9");
		static_assert(sizeof(CS2::server::CEnvCombinedLightProbeVolume) == 0x15F0, "CEnvCombinedLightProbeVolume size should be 0x15F0");

#endif
	}
}
