// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#ifndef CUSTOM_GLOBAL_TYPES
	#include <SDK/GlobalTypes.hpp>
#else
	#include <Custom/GlobalTypes.hpp>
#endif


#include <SDK/server/CPointEntity.hpp>





using namespace GlobalTypes;
namespace CS2 {
	namespace server {
		class CEnvInstructorVRHint : public CS2::server::CPointEntity {
		public:
			GlobalTypes::CUtlSymbolLarge m_iszName; // 0x4a8 | Schema_Atomic | Size: 0x8
			GlobalTypes::CUtlSymbolLarge m_iszHintTargetEntity; // 0x4b0 | Schema_Atomic | Size: 0x8
			int32_t m_iTimeout; // 0x4b8 | Schema_Builtin | Size: 0x4
			S2_PAD(0x4);
			GlobalTypes::CUtlSymbolLarge m_iszCaption; // 0x4c0 | Schema_Atomic | Size: 0x8
			GlobalTypes::CUtlSymbolLarge m_iszStartSound; // 0x4c8 | Schema_Atomic | Size: 0x8
			int32_t m_iLayoutFileType; // 0x4d0 | Schema_Builtin | Size: 0x4
			S2_PAD(0x4);
			GlobalTypes::CUtlSymbolLarge m_iszCustomLayoutFile; // 0x4d8 | Schema_Atomic | Size: 0x8
			int32_t m_iAttachType; // 0x4e0 | Schema_Builtin | Size: 0x4
			float32 m_flHeightOffset; // 0x4e4 | Schema_Builtin | Size: 0x4
		};
		static_assert(offsetof(CS2::server::CEnvInstructorVRHint, m_iszName) == 0x4A8, "m_iszName in CEnvInstructorVRHint should be at offset 0x4A8");
		static_assert(offsetof(CS2::server::CEnvInstructorVRHint, m_iszHintTargetEntity) == 0x4B0, "m_iszHintTargetEntity in CEnvInstructorVRHint should be at offset 0x4B0");
		static_assert(offsetof(CS2::server::CEnvInstructorVRHint, m_iTimeout) == 0x4B8, "m_iTimeout in CEnvInstructorVRHint should be at offset 0x4B8");
		static_assert(offsetof(CS2::server::CEnvInstructorVRHint, m_iszCaption) == 0x4C0, "m_iszCaption in CEnvInstructorVRHint should be at offset 0x4C0");
		static_assert(offsetof(CS2::server::CEnvInstructorVRHint, m_iszStartSound) == 0x4C8, "m_iszStartSound in CEnvInstructorVRHint should be at offset 0x4C8");
		static_assert(offsetof(CS2::server::CEnvInstructorVRHint, m_iLayoutFileType) == 0x4D0, "m_iLayoutFileType in CEnvInstructorVRHint should be at offset 0x4D0");
		static_assert(offsetof(CS2::server::CEnvInstructorVRHint, m_iszCustomLayoutFile) == 0x4D8, "m_iszCustomLayoutFile in CEnvInstructorVRHint should be at offset 0x4D8");
		static_assert(offsetof(CS2::server::CEnvInstructorVRHint, m_iAttachType) == 0x4E0, "m_iAttachType in CEnvInstructorVRHint should be at offset 0x4E0");
		static_assert(offsetof(CS2::server::CEnvInstructorVRHint, m_flHeightOffset) == 0x4E4, "m_flHeightOffset in CEnvInstructorVRHint should be at offset 0x4E4");
		static_assert(sizeof(CS2::server::CEnvInstructorVRHint) == 0x4E8, "CEnvInstructorVRHint size should be 0x4E8");
	}
}
