// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#ifndef CUSTOM_GLOBAL_TYPES
	#include "../GlobalTypes.hpp"
#else
	#include <Custom/GlobalTypes.hpp>
#endif


#include "CBaseEntity.hpp"





using namespace GlobalTypes;
namespace CS2 {
	namespace server {
		class CEnvCubemap : public CS2::server::CBaseEntity {
		public:
			S2_PAD(0x80);
			// GlobalTypes::CStrongHandle<resourcesystem::InfoForResourceTypeCTextureBase> m_Entity_hCubemapTexture; // 0x528 | Schema_Atomic | Size: 0x8
			char m_Entity_hCubemapTexture[0x8]; // 0x528 | Schema_Atomic | Size: 0x8
			bool m_Entity_bCustomCubemapTexture; // 0x530 | Schema_Builtin | Size: 0x1
			S2_PAD(0x3);
			float32 m_Entity_flInfluenceRadius; // 0x534 | Schema_Builtin | Size: 0x4
			GlobalTypes::Vector m_Entity_vBoxProjectMins; // 0x538 | Schema_Atomic | Size: 0xc
			GlobalTypes::Vector m_Entity_vBoxProjectMaxs; // 0x544 | Schema_Atomic | Size: 0xc
			bool m_Entity_bMoveable; // 0x550 | Schema_Builtin | Size: 0x1
			S2_PAD(0x3);
			int32_t m_Entity_nHandshake; // 0x554 | Schema_Builtin | Size: 0x4
			int32_t m_Entity_nEnvCubeMapArrayIndex; // 0x558 | Schema_Builtin | Size: 0x4
			int32_t m_Entity_nPriority; // 0x55c | Schema_Builtin | Size: 0x4
			float32 m_Entity_flEdgeFadeDist; // 0x560 | Schema_Builtin | Size: 0x4
			GlobalTypes::Vector m_Entity_vEdgeFadeDists; // 0x564 | Schema_Atomic | Size: 0xc
			float32 m_Entity_flDiffuseScale; // 0x570 | Schema_Builtin | Size: 0x4
			bool m_Entity_bStartDisabled; // 0x574 | Schema_Builtin | Size: 0x1
			bool m_Entity_bDefaultEnvMap; // 0x575 | Schema_Builtin | Size: 0x1
			bool m_Entity_bDefaultSpecEnvMap; // 0x576 | Schema_Builtin | Size: 0x1
			bool m_Entity_bIndoorCubeMap; // 0x577 | Schema_Builtin | Size: 0x1
			bool m_Entity_bCopyDiffuseFromDefaultCubemap; // 0x578 | Schema_Builtin | Size: 0x1
			S2_PAD(0xf);
			bool m_Entity_bEnabled; // 0x588 | Schema_Builtin | Size: 0x1
			S2_PAD(0x7); // End padding
		};
#ifdef USE_STATIC_ASSERTS
		static_assert(offsetof(CS2::server::CEnvCubemap, m_Entity_hCubemapTexture) == 0x528, "m_Entity_hCubemapTexture in CEnvCubemap should be at offset 0x528");
		static_assert(offsetof(CS2::server::CEnvCubemap, m_Entity_bCustomCubemapTexture) == 0x530, "m_Entity_bCustomCubemapTexture in CEnvCubemap should be at offset 0x530");
		static_assert(offsetof(CS2::server::CEnvCubemap, m_Entity_flInfluenceRadius) == 0x534, "m_Entity_flInfluenceRadius in CEnvCubemap should be at offset 0x534");
		static_assert(offsetof(CS2::server::CEnvCubemap, m_Entity_vBoxProjectMins) == 0x538, "m_Entity_vBoxProjectMins in CEnvCubemap should be at offset 0x538");
		static_assert(offsetof(CS2::server::CEnvCubemap, m_Entity_vBoxProjectMaxs) == 0x544, "m_Entity_vBoxProjectMaxs in CEnvCubemap should be at offset 0x544");
		static_assert(offsetof(CS2::server::CEnvCubemap, m_Entity_bMoveable) == 0x550, "m_Entity_bMoveable in CEnvCubemap should be at offset 0x550");
		static_assert(offsetof(CS2::server::CEnvCubemap, m_Entity_nHandshake) == 0x554, "m_Entity_nHandshake in CEnvCubemap should be at offset 0x554");
		static_assert(offsetof(CS2::server::CEnvCubemap, m_Entity_nEnvCubeMapArrayIndex) == 0x558, "m_Entity_nEnvCubeMapArrayIndex in CEnvCubemap should be at offset 0x558");
		static_assert(offsetof(CS2::server::CEnvCubemap, m_Entity_nPriority) == 0x55C, "m_Entity_nPriority in CEnvCubemap should be at offset 0x55C");
		static_assert(offsetof(CS2::server::CEnvCubemap, m_Entity_flEdgeFadeDist) == 0x560, "m_Entity_flEdgeFadeDist in CEnvCubemap should be at offset 0x560");
		static_assert(offsetof(CS2::server::CEnvCubemap, m_Entity_vEdgeFadeDists) == 0x564, "m_Entity_vEdgeFadeDists in CEnvCubemap should be at offset 0x564");
		static_assert(offsetof(CS2::server::CEnvCubemap, m_Entity_flDiffuseScale) == 0x570, "m_Entity_flDiffuseScale in CEnvCubemap should be at offset 0x570");
		static_assert(offsetof(CS2::server::CEnvCubemap, m_Entity_bStartDisabled) == 0x574, "m_Entity_bStartDisabled in CEnvCubemap should be at offset 0x574");
		static_assert(offsetof(CS2::server::CEnvCubemap, m_Entity_bDefaultEnvMap) == 0x575, "m_Entity_bDefaultEnvMap in CEnvCubemap should be at offset 0x575");
		static_assert(offsetof(CS2::server::CEnvCubemap, m_Entity_bDefaultSpecEnvMap) == 0x576, "m_Entity_bDefaultSpecEnvMap in CEnvCubemap should be at offset 0x576");
		static_assert(offsetof(CS2::server::CEnvCubemap, m_Entity_bIndoorCubeMap) == 0x577, "m_Entity_bIndoorCubeMap in CEnvCubemap should be at offset 0x577");
		static_assert(offsetof(CS2::server::CEnvCubemap, m_Entity_bCopyDiffuseFromDefaultCubemap) == 0x578, "m_Entity_bCopyDiffuseFromDefaultCubemap in CEnvCubemap should be at offset 0x578");
		static_assert(offsetof(CS2::server::CEnvCubemap, m_Entity_bEnabled) == 0x588, "m_Entity_bEnabled in CEnvCubemap should be at offset 0x588");
		static_assert(sizeof(CS2::server::CEnvCubemap) == 0x590, "CEnvCubemap size should be 0x590");

#endif
	}
}
