// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#include <SDK/GlobalTypes.hpp>

#include <SDK/server/CPointEntity.hpp>
#include <SDK/entity2/CEntityIOOutput.hpp>



namespace CS2 {
	namespace server {
		class CEnvSpark : public CS2::server::CPointEntity {
		public:
			float32 m_flDelay; // 0x4f0 | Schema_Builtin | Size: 0x4
			int32_t m_nMagnitude; // 0x4f4 | Schema_Builtin | Size: 0x4
			int32_t m_nTrailLength; // 0x4f8 | Schema_Builtin | Size: 0x4
			int32_t m_nType; // 0x4fc | Schema_Builtin | Size: 0x4
			entity2::CEntityIOOutput m_OnSpark; // 0x500 | Schema_DeclaredClass | Size: 0x28
		};
		static_assert(offsetof(CS2::server::CEnvSpark, m_flDelay) == 0x4F0, "m_flDelay in CEnvSpark should be at offset 0x4F0");
		static_assert(offsetof(CS2::server::CEnvSpark, m_nMagnitude) == 0x4F4, "m_nMagnitude in CEnvSpark should be at offset 0x4F4");
		static_assert(offsetof(CS2::server::CEnvSpark, m_nTrailLength) == 0x4F8, "m_nTrailLength in CEnvSpark should be at offset 0x4F8");
		static_assert(offsetof(CS2::server::CEnvSpark, m_nType) == 0x4FC, "m_nType in CEnvSpark should be at offset 0x4FC");
		static_assert(offsetof(CS2::server::CEnvSpark, m_OnSpark) == 0x500, "m_OnSpark in CEnvSpark should be at offset 0x500");
		static_assert(sizeof(CS2::server::CEnvSpark) == 0x528, "CEnvSpark size should be 0x528");
	}
}
