// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#ifndef CUSTOM_GLOBAL_TYPES
	#include <SDK/GlobalTypes.hpp>
#else
	#include <Custom/GlobalTypes.hpp>
#endif


#include <SDK/server/CPointEntity.hpp>
#include <SDK/entity2/CEntityIOOutput.hpp>





using namespace GlobalTypes;
namespace CS2 {
	namespace server {
		class CEnvSpark : public CS2::server::CPointEntity {
		public:
			float32 m_flDelay; // 0x4a8 | Schema_Builtin | Size: 0x4
			int32_t m_nMagnitude; // 0x4ac | Schema_Builtin | Size: 0x4
			int32_t m_nTrailLength; // 0x4b0 | Schema_Builtin | Size: 0x4
			int32_t m_nType; // 0x4b4 | Schema_Builtin | Size: 0x4
			entity2::CEntityIOOutput m_OnSpark; // 0x4b8 | Schema_DeclaredClass | Size: 0x18
		};
		static_assert(offsetof(CS2::server::CEnvSpark, m_flDelay) == 0x4A8, "m_flDelay in CEnvSpark should be at offset 0x4A8");
		static_assert(offsetof(CS2::server::CEnvSpark, m_nMagnitude) == 0x4AC, "m_nMagnitude in CEnvSpark should be at offset 0x4AC");
		static_assert(offsetof(CS2::server::CEnvSpark, m_nTrailLength) == 0x4B0, "m_nTrailLength in CEnvSpark should be at offset 0x4B0");
		static_assert(offsetof(CS2::server::CEnvSpark, m_nType) == 0x4B4, "m_nType in CEnvSpark should be at offset 0x4B4");
		static_assert(offsetof(CS2::server::CEnvSpark, m_OnSpark) == 0x4B8, "m_OnSpark in CEnvSpark should be at offset 0x4B8");
		static_assert(sizeof(CS2::server::CEnvSpark) == 0x4D0, "CEnvSpark size should be 0x4D0");
	}
}
