// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#ifndef CUSTOM_GLOBAL_TYPES
	#include <SDK/GlobalTypes.hpp>
#else
	#include <Custom/GlobalTypes.hpp>
#endif


#include <SDK/server/CBeam.hpp>



namespace CS2 {
	namespace server {
		class CSprite;
	}
}


using namespace GlobalTypes;
namespace CS2 {
	namespace server {
		class CEnvLaser : public CS2::server::CBeam {
		public:
			GlobalTypes::CUtlSymbolLarge m_iszLaserTarget; // 0x878 | Schema_Atomic | Size: 0x8
			server::CSprite* m_pSprite; // 0x880 | Schema_Ptr | Size: 0x8
			GlobalTypes::CUtlSymbolLarge m_iszSpriteName; // 0x888 | Schema_Atomic | Size: 0x8
			GlobalTypes::Vector m_firePosition; // 0x890 | Schema_Atomic | Size: 0xc
			float32 m_flStartFrame; // 0x89c | Schema_Builtin | Size: 0x4
		};
		static_assert(offsetof(CS2::server::CEnvLaser, m_iszLaserTarget) == 0x878, "m_iszLaserTarget in CEnvLaser should be at offset 0x878");
		static_assert(offsetof(CS2::server::CEnvLaser, m_pSprite) == 0x880, "m_pSprite in CEnvLaser should be at offset 0x880");
		static_assert(offsetof(CS2::server::CEnvLaser, m_iszSpriteName) == 0x888, "m_iszSpriteName in CEnvLaser should be at offset 0x888");
		static_assert(offsetof(CS2::server::CEnvLaser, m_firePosition) == 0x890, "m_firePosition in CEnvLaser should be at offset 0x890");
		static_assert(offsetof(CS2::server::CEnvLaser, m_flStartFrame) == 0x89C, "m_flStartFrame in CEnvLaser should be at offset 0x89C");
		static_assert(sizeof(CS2::server::CEnvLaser) == 0x8A0, "CEnvLaser size should be 0x8A0");
	}
}
