// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#ifndef CUSTOM_GLOBAL_TYPES
	#include <SDK/GlobalTypes.hpp>
#else
	#include <Custom/GlobalTypes.hpp>
#endif


#include <SDK/server/CPointEntity.hpp>
#include <SDK/entity2/GameTime_t.hpp>
#include <SDK/server/CPhysicsShake.hpp>





using namespace GlobalTypes;
namespace CS2 {
	namespace server {
		class CEnvShake : public CS2::server::CPointEntity {
		public:
			GlobalTypes::CUtlSymbolLarge m_limitToEntity; // 0x4a8 | Schema_Atomic | Size: 0x8
			float32 m_Amplitude; // 0x4b0 | Schema_Builtin | Size: 0x4
			float32 m_Frequency; // 0x4b4 | Schema_Builtin | Size: 0x4
			float32 m_Duration; // 0x4b8 | Schema_Builtin | Size: 0x4
			float32 m_Radius; // 0x4bc | Schema_Builtin | Size: 0x4
			entity2::GameTime_t m_stopTime; // 0x4c0 | Schema_DeclaredClass | Size: 0x4
			entity2::GameTime_t m_nextShake; // 0x4c4 | Schema_DeclaredClass | Size: 0x4
			float32 m_currentAmp; // 0x4c8 | Schema_Builtin | Size: 0x4
			GlobalTypes::Vector m_maxForce; // 0x4cc | Schema_Atomic | Size: 0xc
			S2_PAD(0x8);
			server::CPhysicsShake m_shakeCallback; // 0x4e0 | Schema_DeclaredClass | Size: 0x18
		};
		static_assert(offsetof(CS2::server::CEnvShake, m_limitToEntity) == 0x4A8, "m_limitToEntity in CEnvShake should be at offset 0x4A8");
		static_assert(offsetof(CS2::server::CEnvShake, m_Amplitude) == 0x4B0, "m_Amplitude in CEnvShake should be at offset 0x4B0");
		static_assert(offsetof(CS2::server::CEnvShake, m_Frequency) == 0x4B4, "m_Frequency in CEnvShake should be at offset 0x4B4");
		static_assert(offsetof(CS2::server::CEnvShake, m_Duration) == 0x4B8, "m_Duration in CEnvShake should be at offset 0x4B8");
		static_assert(offsetof(CS2::server::CEnvShake, m_Radius) == 0x4BC, "m_Radius in CEnvShake should be at offset 0x4BC");
		static_assert(offsetof(CS2::server::CEnvShake, m_stopTime) == 0x4C0, "m_stopTime in CEnvShake should be at offset 0x4C0");
		static_assert(offsetof(CS2::server::CEnvShake, m_nextShake) == 0x4C4, "m_nextShake in CEnvShake should be at offset 0x4C4");
		static_assert(offsetof(CS2::server::CEnvShake, m_currentAmp) == 0x4C8, "m_currentAmp in CEnvShake should be at offset 0x4C8");
		static_assert(offsetof(CS2::server::CEnvShake, m_maxForce) == 0x4CC, "m_maxForce in CEnvShake should be at offset 0x4CC");
		static_assert(offsetof(CS2::server::CEnvShake, m_shakeCallback) == 0x4E0, "m_shakeCallback in CEnvShake should be at offset 0x4E0");
		static_assert(sizeof(CS2::server::CEnvShake) == 0x4F8, "CEnvShake size should be 0x4F8");
	}
}
