// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#ifndef CUSTOM_GLOBAL_TYPES
	#include "../GlobalTypes.hpp"
#else
	#include "../Custom/GlobalTypes.hpp"
#endif


#include "CBaseModelEntity.hpp"





using namespace GlobalTypes;
namespace CS2 {
	namespace server {
		class CEnvDecal : public CS2::server::CBaseModelEntity {
		public:
			// GlobalTypes::CStrongHandle<resourcesystem::InfoForResourceTypeIMaterial2> m_hDecalMaterial; // 0x730 | Schema_Atomic | Size: 0x8
			char m_hDecalMaterial[0x8]; // 0x730 | Schema_Atomic | Size: 0x8
			float32 m_flWidth; // 0x738 | Schema_Builtin | Size: 0x4
			float32 m_flHeight; // 0x73c | Schema_Builtin | Size: 0x4
			float32 m_flDepth; // 0x740 | Schema_Builtin | Size: 0x4
			uint32_t m_nRenderOrder; // 0x744 | Schema_Builtin | Size: 0x4
			bool m_bProjectOnWorld; // 0x748 | Schema_Builtin | Size: 0x1
			bool m_bProjectOnCharacters; // 0x749 | Schema_Builtin | Size: 0x1
			bool m_bProjectOnWater; // 0x74a | Schema_Builtin | Size: 0x1
			S2_PAD(0x1);
			float32 m_flDepthSortBias; // 0x74c | Schema_Builtin | Size: 0x4
		};
		static_assert(offsetof(CS2::server::CEnvDecal, m_hDecalMaterial) == 0x730, "m_hDecalMaterial in CEnvDecal should be at offset 0x730");
		static_assert(offsetof(CS2::server::CEnvDecal, m_flWidth) == 0x738, "m_flWidth in CEnvDecal should be at offset 0x738");
		static_assert(offsetof(CS2::server::CEnvDecal, m_flHeight) == 0x73C, "m_flHeight in CEnvDecal should be at offset 0x73C");
		static_assert(offsetof(CS2::server::CEnvDecal, m_flDepth) == 0x740, "m_flDepth in CEnvDecal should be at offset 0x740");
		static_assert(offsetof(CS2::server::CEnvDecal, m_nRenderOrder) == 0x744, "m_nRenderOrder in CEnvDecal should be at offset 0x744");
		static_assert(offsetof(CS2::server::CEnvDecal, m_bProjectOnWorld) == 0x748, "m_bProjectOnWorld in CEnvDecal should be at offset 0x748");
		static_assert(offsetof(CS2::server::CEnvDecal, m_bProjectOnCharacters) == 0x749, "m_bProjectOnCharacters in CEnvDecal should be at offset 0x749");
		static_assert(offsetof(CS2::server::CEnvDecal, m_bProjectOnWater) == 0x74A, "m_bProjectOnWater in CEnvDecal should be at offset 0x74A");
		static_assert(offsetof(CS2::server::CEnvDecal, m_flDepthSortBias) == 0x74C, "m_flDepthSortBias in CEnvDecal should be at offset 0x74C");
		static_assert(sizeof(CS2::server::CEnvDecal) == 0x750, "CEnvDecal size should be 0x750");
	}
}
