// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#ifndef CUSTOM_GLOBAL_TYPES
	#include "../GlobalTypes.hpp"
#else
	#include <Custom/GlobalTypes.hpp>
#endif


#include "CBaseModelEntity.hpp"





using namespace GlobalTypes;
namespace CS2 {
	namespace server {
		class CEnvSky : public CS2::server::CBaseModelEntity {
		public:
			// GlobalTypes::CStrongHandle<resourcesystem::InfoForResourceTypeIMaterial2> m_hSkyMaterial; // 0x730 | Schema_Atomic | Size: 0x8
			char m_hSkyMaterial[0x8]; // 0x730 | Schema_Atomic | Size: 0x8
			// GlobalTypes::CStrongHandle<resourcesystem::InfoForResourceTypeIMaterial2> m_hSkyMaterialLightingOnly; // 0x738 | Schema_Atomic | Size: 0x8
			char m_hSkyMaterialLightingOnly[0x8]; // 0x738 | Schema_Atomic | Size: 0x8
			bool m_bStartDisabled; // 0x740 | Schema_Builtin | Size: 0x1
			GlobalTypes::Color m_vTintColor; // 0x741 | Schema_Atomic | Size: 0x4
			GlobalTypes::Color m_vTintColorLightingOnly; // 0x745 | Schema_Atomic | Size: 0x4
			S2_PAD(0x3);
			float32 m_flBrightnessScale; // 0x74c | Schema_Builtin | Size: 0x4
			int32_t m_nFogType; // 0x750 | Schema_Builtin | Size: 0x4
			float32 m_flFogMinStart; // 0x754 | Schema_Builtin | Size: 0x4
			float32 m_flFogMinEnd; // 0x758 | Schema_Builtin | Size: 0x4
			float32 m_flFogMaxStart; // 0x75c | Schema_Builtin | Size: 0x4
			float32 m_flFogMaxEnd; // 0x760 | Schema_Builtin | Size: 0x4
			bool m_bEnabled; // 0x764 | Schema_Builtin | Size: 0x1
			S2_PAD(0x2b); // End padding
		};
#ifdef USE_STATIC_ASSERTS
		static_assert(offsetof(CS2::server::CEnvSky, m_hSkyMaterial) == 0x730, "m_hSkyMaterial in CEnvSky should be at offset 0x730");
		static_assert(offsetof(CS2::server::CEnvSky, m_hSkyMaterialLightingOnly) == 0x738, "m_hSkyMaterialLightingOnly in CEnvSky should be at offset 0x738");
		static_assert(offsetof(CS2::server::CEnvSky, m_bStartDisabled) == 0x740, "m_bStartDisabled in CEnvSky should be at offset 0x740");
		static_assert(offsetof(CS2::server::CEnvSky, m_vTintColor) == 0x741, "m_vTintColor in CEnvSky should be at offset 0x741");
		static_assert(offsetof(CS2::server::CEnvSky, m_vTintColorLightingOnly) == 0x745, "m_vTintColorLightingOnly in CEnvSky should be at offset 0x745");
		static_assert(offsetof(CS2::server::CEnvSky, m_flBrightnessScale) == 0x74C, "m_flBrightnessScale in CEnvSky should be at offset 0x74C");
		static_assert(offsetof(CS2::server::CEnvSky, m_nFogType) == 0x750, "m_nFogType in CEnvSky should be at offset 0x750");
		static_assert(offsetof(CS2::server::CEnvSky, m_flFogMinStart) == 0x754, "m_flFogMinStart in CEnvSky should be at offset 0x754");
		static_assert(offsetof(CS2::server::CEnvSky, m_flFogMinEnd) == 0x758, "m_flFogMinEnd in CEnvSky should be at offset 0x758");
		static_assert(offsetof(CS2::server::CEnvSky, m_flFogMaxStart) == 0x75C, "m_flFogMaxStart in CEnvSky should be at offset 0x75C");
		static_assert(offsetof(CS2::server::CEnvSky, m_flFogMaxEnd) == 0x760, "m_flFogMaxEnd in CEnvSky should be at offset 0x760");
		static_assert(offsetof(CS2::server::CEnvSky, m_bEnabled) == 0x764, "m_bEnabled in CEnvSky should be at offset 0x764");
		static_assert(sizeof(CS2::server::CEnvSky) == 0x790, "CEnvSky size should be 0x790");

#endif
	}
}
