// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#ifndef CUSTOM_GLOBAL_TYPES
	#include "../GlobalTypes.hpp"
#else
	#include "../Custom/GlobalTypes.hpp"
#endif


#include "CPointEntity.hpp"





using namespace GlobalTypes;
namespace CS2 {
	namespace server {
		class CEnvInstructorHint : public CS2::server::CPointEntity {
		public:
			GlobalTypes::CUtlSymbolLarge m_iszName; // 0x4a8 | Schema_Atomic | Size: 0x8
			GlobalTypes::CUtlSymbolLarge m_iszReplace_Key; // 0x4b0 | Schema_Atomic | Size: 0x8
			GlobalTypes::CUtlSymbolLarge m_iszHintTargetEntity; // 0x4b8 | Schema_Atomic | Size: 0x8
			int32_t m_iTimeout; // 0x4c0 | Schema_Builtin | Size: 0x4
			int32_t m_iDisplayLimit; // 0x4c4 | Schema_Builtin | Size: 0x4
			GlobalTypes::CUtlSymbolLarge m_iszIcon_Onscreen; // 0x4c8 | Schema_Atomic | Size: 0x8
			GlobalTypes::CUtlSymbolLarge m_iszIcon_Offscreen; // 0x4d0 | Schema_Atomic | Size: 0x8
			GlobalTypes::CUtlSymbolLarge m_iszCaption; // 0x4d8 | Schema_Atomic | Size: 0x8
			GlobalTypes::CUtlSymbolLarge m_iszActivatorCaption; // 0x4e0 | Schema_Atomic | Size: 0x8
			GlobalTypes::Color m_Color; // 0x4e8 | Schema_Atomic | Size: 0x4
			float32 m_fIconOffset; // 0x4ec | Schema_Builtin | Size: 0x4
			float32 m_fRange; // 0x4f0 | Schema_Builtin | Size: 0x4
			uint8_t m_iPulseOption; // 0x4f4 | Schema_Builtin | Size: 0x1
			uint8_t m_iAlphaOption; // 0x4f5 | Schema_Builtin | Size: 0x1
			uint8_t m_iShakeOption; // 0x4f6 | Schema_Builtin | Size: 0x1
			bool m_bStatic; // 0x4f7 | Schema_Builtin | Size: 0x1
			bool m_bNoOffscreen; // 0x4f8 | Schema_Builtin | Size: 0x1
			bool m_bForceCaption; // 0x4f9 | Schema_Builtin | Size: 0x1
			S2_PAD(0x2);
			int32_t m_iInstanceType; // 0x4fc | Schema_Builtin | Size: 0x4
			bool m_bSuppressRest; // 0x500 | Schema_Builtin | Size: 0x1
			S2_PAD(0x7);
			GlobalTypes::CUtlSymbolLarge m_iszBinding; // 0x508 | Schema_Atomic | Size: 0x8
			bool m_bAllowNoDrawTarget; // 0x510 | Schema_Builtin | Size: 0x1
			bool m_bAutoStart; // 0x511 | Schema_Builtin | Size: 0x1
			bool m_bLocalPlayerOnly; // 0x512 | Schema_Builtin | Size: 0x1
			S2_PAD(0x5); // End padding
		};
#ifdef USE_STATIC_ASSERTS
		static_assert(offsetof(CS2::server::CEnvInstructorHint, m_iszName) == 0x4A8, "m_iszName in CEnvInstructorHint should be at offset 0x4A8");
		static_assert(offsetof(CS2::server::CEnvInstructorHint, m_iszReplace_Key) == 0x4B0, "m_iszReplace_Key in CEnvInstructorHint should be at offset 0x4B0");
		static_assert(offsetof(CS2::server::CEnvInstructorHint, m_iszHintTargetEntity) == 0x4B8, "m_iszHintTargetEntity in CEnvInstructorHint should be at offset 0x4B8");
		static_assert(offsetof(CS2::server::CEnvInstructorHint, m_iTimeout) == 0x4C0, "m_iTimeout in CEnvInstructorHint should be at offset 0x4C0");
		static_assert(offsetof(CS2::server::CEnvInstructorHint, m_iDisplayLimit) == 0x4C4, "m_iDisplayLimit in CEnvInstructorHint should be at offset 0x4C4");
		static_assert(offsetof(CS2::server::CEnvInstructorHint, m_iszIcon_Onscreen) == 0x4C8, "m_iszIcon_Onscreen in CEnvInstructorHint should be at offset 0x4C8");
		static_assert(offsetof(CS2::server::CEnvInstructorHint, m_iszIcon_Offscreen) == 0x4D0, "m_iszIcon_Offscreen in CEnvInstructorHint should be at offset 0x4D0");
		static_assert(offsetof(CS2::server::CEnvInstructorHint, m_iszCaption) == 0x4D8, "m_iszCaption in CEnvInstructorHint should be at offset 0x4D8");
		static_assert(offsetof(CS2::server::CEnvInstructorHint, m_iszActivatorCaption) == 0x4E0, "m_iszActivatorCaption in CEnvInstructorHint should be at offset 0x4E0");
		static_assert(offsetof(CS2::server::CEnvInstructorHint, m_Color) == 0x4E8, "m_Color in CEnvInstructorHint should be at offset 0x4E8");
		static_assert(offsetof(CS2::server::CEnvInstructorHint, m_fIconOffset) == 0x4EC, "m_fIconOffset in CEnvInstructorHint should be at offset 0x4EC");
		static_assert(offsetof(CS2::server::CEnvInstructorHint, m_fRange) == 0x4F0, "m_fRange in CEnvInstructorHint should be at offset 0x4F0");
		static_assert(offsetof(CS2::server::CEnvInstructorHint, m_iPulseOption) == 0x4F4, "m_iPulseOption in CEnvInstructorHint should be at offset 0x4F4");
		static_assert(offsetof(CS2::server::CEnvInstructorHint, m_iAlphaOption) == 0x4F5, "m_iAlphaOption in CEnvInstructorHint should be at offset 0x4F5");
		static_assert(offsetof(CS2::server::CEnvInstructorHint, m_iShakeOption) == 0x4F6, "m_iShakeOption in CEnvInstructorHint should be at offset 0x4F6");
		static_assert(offsetof(CS2::server::CEnvInstructorHint, m_bStatic) == 0x4F7, "m_bStatic in CEnvInstructorHint should be at offset 0x4F7");
		static_assert(offsetof(CS2::server::CEnvInstructorHint, m_bNoOffscreen) == 0x4F8, "m_bNoOffscreen in CEnvInstructorHint should be at offset 0x4F8");
		static_assert(offsetof(CS2::server::CEnvInstructorHint, m_bForceCaption) == 0x4F9, "m_bForceCaption in CEnvInstructorHint should be at offset 0x4F9");
		static_assert(offsetof(CS2::server::CEnvInstructorHint, m_iInstanceType) == 0x4FC, "m_iInstanceType in CEnvInstructorHint should be at offset 0x4FC");
		static_assert(offsetof(CS2::server::CEnvInstructorHint, m_bSuppressRest) == 0x500, "m_bSuppressRest in CEnvInstructorHint should be at offset 0x500");
		static_assert(offsetof(CS2::server::CEnvInstructorHint, m_iszBinding) == 0x508, "m_iszBinding in CEnvInstructorHint should be at offset 0x508");
		static_assert(offsetof(CS2::server::CEnvInstructorHint, m_bAllowNoDrawTarget) == 0x510, "m_bAllowNoDrawTarget in CEnvInstructorHint should be at offset 0x510");
		static_assert(offsetof(CS2::server::CEnvInstructorHint, m_bAutoStart) == 0x511, "m_bAutoStart in CEnvInstructorHint should be at offset 0x511");
		static_assert(offsetof(CS2::server::CEnvInstructorHint, m_bLocalPlayerOnly) == 0x512, "m_bLocalPlayerOnly in CEnvInstructorHint should be at offset 0x512");
		static_assert(sizeof(CS2::server::CEnvInstructorHint) == 0x518, "CEnvInstructorHint size should be 0x518");

#endif
	}
}
