// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#ifndef CUSTOM_GLOBAL_TYPES
	#include "../GlobalTypes.hpp"
#else
	#include <Custom/GlobalTypes.hpp>
#endif


#include "CBaseEntity.hpp"





using namespace GlobalTypes;
namespace CS2 {
	namespace server {
		class CEnvWindVolume : public CS2::server::CBaseEntity {
		public:
			bool m_bActive; // 0x4a8 | Schema_Builtin | Size: 0x1
			S2_PAD(0x3);
			GlobalTypes::Vector m_vBoxMins; // 0x4ac | Schema_Atomic | Size: 0xc
			GlobalTypes::Vector m_vBoxMaxs; // 0x4b8 | Schema_Atomic | Size: 0xc
			bool m_bStartDisabled; // 0x4c4 | Schema_Builtin | Size: 0x1
			S2_PAD(0x3);
			int32_t m_nShape; // 0x4c8 | Schema_Builtin | Size: 0x4
			float32 m_fWindSpeedMultiplier; // 0x4cc | Schema_Builtin | Size: 0x4
			float32 m_fWindTurbulenceMultiplier; // 0x4d0 | Schema_Builtin | Size: 0x4
			float32 m_fWindSpeedVariationMultiplier; // 0x4d4 | Schema_Builtin | Size: 0x4
			float32 m_fWindDirectionVariationMultiplier; // 0x4d8 | Schema_Builtin | Size: 0x4
			S2_PAD(0x4); // End padding
		};
#ifdef USE_STATIC_ASSERTS
		static_assert(offsetof(CS2::server::CEnvWindVolume, m_bActive) == 0x4A8, "m_bActive in CEnvWindVolume should be at offset 0x4A8");
		static_assert(offsetof(CS2::server::CEnvWindVolume, m_vBoxMins) == 0x4AC, "m_vBoxMins in CEnvWindVolume should be at offset 0x4AC");
		static_assert(offsetof(CS2::server::CEnvWindVolume, m_vBoxMaxs) == 0x4B8, "m_vBoxMaxs in CEnvWindVolume should be at offset 0x4B8");
		static_assert(offsetof(CS2::server::CEnvWindVolume, m_bStartDisabled) == 0x4C4, "m_bStartDisabled in CEnvWindVolume should be at offset 0x4C4");
		static_assert(offsetof(CS2::server::CEnvWindVolume, m_nShape) == 0x4C8, "m_nShape in CEnvWindVolume should be at offset 0x4C8");
		static_assert(offsetof(CS2::server::CEnvWindVolume, m_fWindSpeedMultiplier) == 0x4CC, "m_fWindSpeedMultiplier in CEnvWindVolume should be at offset 0x4CC");
		static_assert(offsetof(CS2::server::CEnvWindVolume, m_fWindTurbulenceMultiplier) == 0x4D0, "m_fWindTurbulenceMultiplier in CEnvWindVolume should be at offset 0x4D0");
		static_assert(offsetof(CS2::server::CEnvWindVolume, m_fWindSpeedVariationMultiplier) == 0x4D4, "m_fWindSpeedVariationMultiplier in CEnvWindVolume should be at offset 0x4D4");
		static_assert(offsetof(CS2::server::CEnvWindVolume, m_fWindDirectionVariationMultiplier) == 0x4D8, "m_fWindDirectionVariationMultiplier in CEnvWindVolume should be at offset 0x4D8");
		static_assert(sizeof(CS2::server::CEnvWindVolume) == 0x4E0, "CEnvWindVolume size should be 0x4E0");

#endif
	}
}
