// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#ifndef CUSTOM_GLOBAL_TYPES
	#include "../GlobalTypes.hpp"
#else
	#include "../Custom/GlobalTypes.hpp"
#endif


#include "CBeam.hpp"
#include "Touch_t.hpp"
#include "../entity2/CEntityIOOutput.hpp"



namespace CS2 {
	namespace server {
		class CBaseEntity;
	}
}


using namespace GlobalTypes;
namespace CS2 {
	namespace server {
		class CEnvBeam : public CS2::server::CBeam {
		public:
			int32_t m_active; // 0x7d0 | Schema_Builtin | Size: 0x4
			S2_PAD(0x4);
			// GlobalTypes::CStrongHandle<resourcesystem::InfoForResourceTypeIMaterial2> m_spriteTexture; // 0x7d8 | Schema_Atomic | Size: 0x8
			char m_spriteTexture[0x8]; // 0x7d8 | Schema_Atomic | Size: 0x8
			GlobalTypes::CUtlSymbolLarge m_iszStartEntity; // 0x7e0 | Schema_Atomic | Size: 0x8
			GlobalTypes::CUtlSymbolLarge m_iszEndEntity; // 0x7e8 | Schema_Atomic | Size: 0x8
			float32 m_life; // 0x7f0 | Schema_Builtin | Size: 0x4
			float32 m_boltWidth; // 0x7f4 | Schema_Builtin | Size: 0x4
			float32 m_noiseAmplitude; // 0x7f8 | Schema_Builtin | Size: 0x4
			int32_t m_speed; // 0x7fc | Schema_Builtin | Size: 0x4
			float32 m_restrike; // 0x800 | Schema_Builtin | Size: 0x4
			S2_PAD(0x4);
			GlobalTypes::CUtlSymbolLarge m_iszSpriteName; // 0x808 | Schema_Atomic | Size: 0x8
			int32_t m_frameStart; // 0x810 | Schema_Builtin | Size: 0x4
			GlobalTypes::VectorWS m_vEndPointWorld; // 0x814 | Schema_Atomic | Size: 0xc
			GlobalTypes::Vector m_vEndPointRelative; // 0x820 | Schema_Atomic | Size: 0xc
			float32 m_radius; // 0x82c | Schema_Builtin | Size: 0x4
			server::Touch_t m_TouchType; // 0x830 | Schema_DeclaredEnum | Size: 0x4
			S2_PAD(0x4);
			GlobalTypes::CUtlSymbolLarge m_iFilterName; // 0x838 | Schema_Atomic | Size: 0x8
			GlobalTypes::CHandle<server::CBaseEntity> m_hFilter; // 0x840 | Schema_Atomic | Size: 0x4
			// char m_hFilter[0x4]; // 0x840 | Schema_Atomic | Size: 0x4
			S2_PAD(0x4);
			GlobalTypes::CUtlSymbolLarge m_iszDecal; // 0x848 | Schema_Atomic | Size: 0x8
			entity2::CEntityIOOutput m_OnTouchedByEntity; // 0x850 | Schema_DeclaredClass | Size: 0x18
		};
		static_assert(offsetof(CS2::server::CEnvBeam, m_active) == 0x7D0, "m_active in CEnvBeam should be at offset 0x7D0");
		static_assert(offsetof(CS2::server::CEnvBeam, m_spriteTexture) == 0x7D8, "m_spriteTexture in CEnvBeam should be at offset 0x7D8");
		static_assert(offsetof(CS2::server::CEnvBeam, m_iszStartEntity) == 0x7E0, "m_iszStartEntity in CEnvBeam should be at offset 0x7E0");
		static_assert(offsetof(CS2::server::CEnvBeam, m_iszEndEntity) == 0x7E8, "m_iszEndEntity in CEnvBeam should be at offset 0x7E8");
		static_assert(offsetof(CS2::server::CEnvBeam, m_life) == 0x7F0, "m_life in CEnvBeam should be at offset 0x7F0");
		static_assert(offsetof(CS2::server::CEnvBeam, m_boltWidth) == 0x7F4, "m_boltWidth in CEnvBeam should be at offset 0x7F4");
		static_assert(offsetof(CS2::server::CEnvBeam, m_noiseAmplitude) == 0x7F8, "m_noiseAmplitude in CEnvBeam should be at offset 0x7F8");
		static_assert(offsetof(CS2::server::CEnvBeam, m_speed) == 0x7FC, "m_speed in CEnvBeam should be at offset 0x7FC");
		static_assert(offsetof(CS2::server::CEnvBeam, m_restrike) == 0x800, "m_restrike in CEnvBeam should be at offset 0x800");
		static_assert(offsetof(CS2::server::CEnvBeam, m_iszSpriteName) == 0x808, "m_iszSpriteName in CEnvBeam should be at offset 0x808");
		static_assert(offsetof(CS2::server::CEnvBeam, m_frameStart) == 0x810, "m_frameStart in CEnvBeam should be at offset 0x810");
		static_assert(offsetof(CS2::server::CEnvBeam, m_vEndPointWorld) == 0x814, "m_vEndPointWorld in CEnvBeam should be at offset 0x814");
		static_assert(offsetof(CS2::server::CEnvBeam, m_vEndPointRelative) == 0x820, "m_vEndPointRelative in CEnvBeam should be at offset 0x820");
		static_assert(offsetof(CS2::server::CEnvBeam, m_radius) == 0x82C, "m_radius in CEnvBeam should be at offset 0x82C");
		static_assert(offsetof(CS2::server::CEnvBeam, m_TouchType) == 0x830, "m_TouchType in CEnvBeam should be at offset 0x830");
		static_assert(offsetof(CS2::server::CEnvBeam, m_iFilterName) == 0x838, "m_iFilterName in CEnvBeam should be at offset 0x838");
		static_assert(offsetof(CS2::server::CEnvBeam, m_hFilter) == 0x840, "m_hFilter in CEnvBeam should be at offset 0x840");
		static_assert(offsetof(CS2::server::CEnvBeam, m_iszDecal) == 0x848, "m_iszDecal in CEnvBeam should be at offset 0x848");
		static_assert(offsetof(CS2::server::CEnvBeam, m_OnTouchedByEntity) == 0x850, "m_OnTouchedByEntity in CEnvBeam should be at offset 0x850");
		static_assert(sizeof(CS2::server::CEnvBeam) == 0x868, "CEnvBeam size should be 0x868");
	}
}
