// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#ifndef CUSTOM_GLOBAL_TYPES
	#include "../GlobalTypes.hpp"
#else
	#include "../Custom/GlobalTypes.hpp"
#endif


#include "CBaseEntity.hpp"
#include "CEnvWindShared.hpp"





using namespace GlobalTypes;
namespace CS2 {
	namespace server {
		class CEnvWindController : public CS2::server::CBaseEntity {
		public:
			server::CEnvWindShared m_EnvWindShared; // 0x4a8 | Schema_DeclaredClass | Size: 0x130
			float32 m_fDirectionVariation; // 0x5d8 | Schema_Builtin | Size: 0x4
			float32 m_fSpeedVariation; // 0x5dc | Schema_Builtin | Size: 0x4
			float32 m_fTurbulence; // 0x5e0 | Schema_Builtin | Size: 0x4
			float32 m_fVolumeHalfExtentXY; // 0x5e4 | Schema_Builtin | Size: 0x4
			float32 m_fVolumeHalfExtentZ; // 0x5e8 | Schema_Builtin | Size: 0x4
			int32_t m_nVolumeResolutionXY; // 0x5ec | Schema_Builtin | Size: 0x4
			int32_t m_nVolumeResolutionZ; // 0x5f0 | Schema_Builtin | Size: 0x4
			int32_t m_nClipmapLevels; // 0x5f4 | Schema_Builtin | Size: 0x4
			bool m_bIsMaster; // 0x5f8 | Schema_Builtin | Size: 0x1
			bool m_bFirstTime; // 0x5f9 | Schema_Builtin | Size: 0x1
			S2_PAD(0x6); // End padding
		};
		static_assert(offsetof(CS2::server::CEnvWindController, m_EnvWindShared) == 0x4A8, "m_EnvWindShared in CEnvWindController should be at offset 0x4A8");
		static_assert(offsetof(CS2::server::CEnvWindController, m_fDirectionVariation) == 0x5D8, "m_fDirectionVariation in CEnvWindController should be at offset 0x5D8");
		static_assert(offsetof(CS2::server::CEnvWindController, m_fSpeedVariation) == 0x5DC, "m_fSpeedVariation in CEnvWindController should be at offset 0x5DC");
		static_assert(offsetof(CS2::server::CEnvWindController, m_fTurbulence) == 0x5E0, "m_fTurbulence in CEnvWindController should be at offset 0x5E0");
		static_assert(offsetof(CS2::server::CEnvWindController, m_fVolumeHalfExtentXY) == 0x5E4, "m_fVolumeHalfExtentXY in CEnvWindController should be at offset 0x5E4");
		static_assert(offsetof(CS2::server::CEnvWindController, m_fVolumeHalfExtentZ) == 0x5E8, "m_fVolumeHalfExtentZ in CEnvWindController should be at offset 0x5E8");
		static_assert(offsetof(CS2::server::CEnvWindController, m_nVolumeResolutionXY) == 0x5EC, "m_nVolumeResolutionXY in CEnvWindController should be at offset 0x5EC");
		static_assert(offsetof(CS2::server::CEnvWindController, m_nVolumeResolutionZ) == 0x5F0, "m_nVolumeResolutionZ in CEnvWindController should be at offset 0x5F0");
		static_assert(offsetof(CS2::server::CEnvWindController, m_nClipmapLevels) == 0x5F4, "m_nClipmapLevels in CEnvWindController should be at offset 0x5F4");
		static_assert(offsetof(CS2::server::CEnvWindController, m_bIsMaster) == 0x5F8, "m_bIsMaster in CEnvWindController should be at offset 0x5F8");
		static_assert(offsetof(CS2::server::CEnvWindController, m_bFirstTime) == 0x5F9, "m_bFirstTime in CEnvWindController should be at offset 0x5F9");
		static_assert(sizeof(CS2::server::CEnvWindController) == 0x600, "CEnvWindController size should be 0x600");
	}
}
