// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#ifndef CUSTOM_GLOBAL_TYPES
	#include <SDK/GlobalTypes.hpp>
#else
	#include <Custom/GlobalTypes.hpp>
#endif


#include <SDK/server/CParticleSystem.hpp>





using namespace GlobalTypes;
namespace CS2 {
	namespace server {
		class CEnvParticleGlow : public CS2::server::CParticleSystem {
		public:
			float32 m_flAlphaScale; // 0xca8 | Schema_Builtin | Size: 0x4
			float32 m_flRadiusScale; // 0xcac | Schema_Builtin | Size: 0x4
			float32 m_flSelfIllumScale; // 0xcb0 | Schema_Builtin | Size: 0x4
			GlobalTypes::Color m_ColorTint; // 0xcb4 | Schema_Atomic | Size: 0x4
			// GlobalTypes::CStrongHandle<resourcesystem::InfoForResourceTypeCTextureBase> m_hTextureOverride; // 0xcb8 | Schema_Atomic | Size: 0x8
			char m_hTextureOverride[0x8]; // 0xcb8 | Schema_Atomic | Size: 0x8
		};
		static_assert(offsetof(CS2::server::CEnvParticleGlow, m_flAlphaScale) == 0xCA8, "m_flAlphaScale in CEnvParticleGlow should be at offset 0xCA8");
		static_assert(offsetof(CS2::server::CEnvParticleGlow, m_flRadiusScale) == 0xCAC, "m_flRadiusScale in CEnvParticleGlow should be at offset 0xCAC");
		static_assert(offsetof(CS2::server::CEnvParticleGlow, m_flSelfIllumScale) == 0xCB0, "m_flSelfIllumScale in CEnvParticleGlow should be at offset 0xCB0");
		static_assert(offsetof(CS2::server::CEnvParticleGlow, m_ColorTint) == 0xCB4, "m_ColorTint in CEnvParticleGlow should be at offset 0xCB4");
		static_assert(offsetof(CS2::server::CEnvParticleGlow, m_hTextureOverride) == 0xCB8, "m_hTextureOverride in CEnvParticleGlow should be at offset 0xCB8");
		static_assert(sizeof(CS2::server::CEnvParticleGlow) == 0xCC0, "CEnvParticleGlow size should be 0xCC0");
	}
}
