// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#ifndef CUSTOM_GLOBAL_TYPES
	#include <SDK/GlobalTypes.hpp>
#else
	#include <Custom/GlobalTypes.hpp>
#endif


#include <SDK/server/CBaseFilter.hpp>





using namespace GlobalTypes;
namespace CS2 {
	namespace server {
		class CFilterEnemy : public CS2::server::CBaseFilter {
		public:
			GlobalTypes::CUtlSymbolLarge m_iszEnemyName; // 0x548 | Schema_Atomic | Size: 0x8
			float32 m_flRadius; // 0x550 | Schema_Builtin | Size: 0x4
			float32 m_flOuterRadius; // 0x554 | Schema_Builtin | Size: 0x4
			int32_t m_nMaxSquadmatesPerEnemy; // 0x558 | Schema_Builtin | Size: 0x4
			S2_PAD(0x4);
			GlobalTypes::CUtlSymbolLarge m_iszPlayerName; // 0x560 | Schema_Atomic | Size: 0x8
		};
		static_assert(offsetof(CS2::server::CFilterEnemy, m_iszEnemyName) == 0x548, "m_iszEnemyName in CFilterEnemy should be at offset 0x548");
		static_assert(offsetof(CS2::server::CFilterEnemy, m_flRadius) == 0x550, "m_flRadius in CFilterEnemy should be at offset 0x550");
		static_assert(offsetof(CS2::server::CFilterEnemy, m_flOuterRadius) == 0x554, "m_flOuterRadius in CFilterEnemy should be at offset 0x554");
		static_assert(offsetof(CS2::server::CFilterEnemy, m_nMaxSquadmatesPerEnemy) == 0x558, "m_nMaxSquadmatesPerEnemy in CFilterEnemy should be at offset 0x558");
		static_assert(offsetof(CS2::server::CFilterEnemy, m_iszPlayerName) == 0x560, "m_iszPlayerName in CFilterEnemy should be at offset 0x560");
		static_assert(sizeof(CS2::server::CFilterEnemy) == 0x568, "CFilterEnemy size should be 0x568");
	}
}
