// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#ifndef CUSTOM_GLOBAL_TYPES
	#include "../GlobalTypes.hpp"
#else
	#include "../Custom/GlobalTypes.hpp"
#endif


#include "CBaseEntity.hpp"
#include "CFish.hpp"
#include "CountdownTimer.hpp"





using namespace GlobalTypes;
namespace CS2 {
	namespace server {
		class CFishPool : public CS2::server::CBaseEntity {
		public:
			S2_PAD(0x10);
			int32_t m_fishCount; // 0x4b8 | Schema_Builtin | Size: 0x4
			float32 m_maxRange; // 0x4bc | Schema_Builtin | Size: 0x4
			float32 m_swimDepth; // 0x4c0 | Schema_Builtin | Size: 0x4
			float32 m_waterLevel; // 0x4c4 | Schema_Builtin | Size: 0x4
			bool m_isDormant; // 0x4c8 | Schema_Builtin | Size: 0x1
			S2_PAD(0x7);
			GlobalTypes::CUtlVector<GlobalTypes::CHandle<server::CFish>> m_fishes; // 0x4d0 | Schema_Atomic | Size: 0x18
			// char m_fishes[0x18]; // 0x4d0 | Schema_Atomic | Size: 0x18
			server::CountdownTimer m_visTimer; // 0x4e8 | Schema_DeclaredClass | Size: 0x18
		};
		static_assert(offsetof(CS2::server::CFishPool, m_fishCount) == 0x4B8, "m_fishCount in CFishPool should be at offset 0x4B8");
		static_assert(offsetof(CS2::server::CFishPool, m_maxRange) == 0x4BC, "m_maxRange in CFishPool should be at offset 0x4BC");
		static_assert(offsetof(CS2::server::CFishPool, m_swimDepth) == 0x4C0, "m_swimDepth in CFishPool should be at offset 0x4C0");
		static_assert(offsetof(CS2::server::CFishPool, m_waterLevel) == 0x4C4, "m_waterLevel in CFishPool should be at offset 0x4C4");
		static_assert(offsetof(CS2::server::CFishPool, m_isDormant) == 0x4C8, "m_isDormant in CFishPool should be at offset 0x4C8");
		static_assert(offsetof(CS2::server::CFishPool, m_fishes) == 0x4D0, "m_fishes in CFishPool should be at offset 0x4D0");
		static_assert(offsetof(CS2::server::CFishPool, m_visTimer) == 0x4E8, "m_visTimer in CFishPool should be at offset 0x4E8");
		static_assert(sizeof(CS2::server::CFishPool) == 0x500, "CFishPool size should be 0x500");
	}
}
