// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#ifndef CUSTOM_GLOBAL_TYPES
	#include "../GlobalTypes.hpp"
#else
	#include "../Custom/GlobalTypes.hpp"
#endif


#include "CBaseAnimGraph.hpp"
#include "CountdownTimer.hpp"



namespace CS2 {
	namespace server {
		class CFishPool;
	}
}


using namespace GlobalTypes;
namespace CS2 {
	namespace server {
		class CFish : public CS2::server::CBaseAnimGraph {
		public:
			GlobalTypes::CHandle<server::CFishPool> m_pool; // 0xa20 | Schema_Atomic | Size: 0x4
			// char m_pool[0x4]; // 0xa20 | Schema_Atomic | Size: 0x4
			uint32_t m_id; // 0xa24 | Schema_Builtin | Size: 0x4
			float32 m_x; // 0xa28 | Schema_Builtin | Size: 0x4
			float32 m_y; // 0xa2c | Schema_Builtin | Size: 0x4
			float32 m_z; // 0xa30 | Schema_Builtin | Size: 0x4
			float32 m_angle; // 0xa34 | Schema_Builtin | Size: 0x4
			float32 m_angleChange; // 0xa38 | Schema_Builtin | Size: 0x4
			GlobalTypes::Vector m_forward; // 0xa3c | Schema_Atomic | Size: 0xc
			GlobalTypes::Vector m_perp; // 0xa48 | Schema_Atomic | Size: 0xc
			GlobalTypes::Vector m_poolOrigin; // 0xa54 | Schema_Atomic | Size: 0xc
			float32 m_waterLevel; // 0xa60 | Schema_Builtin | Size: 0x4
			float32 m_speed; // 0xa64 | Schema_Builtin | Size: 0x4
			float32 m_desiredSpeed; // 0xa68 | Schema_Builtin | Size: 0x4
			float32 m_calmSpeed; // 0xa6c | Schema_Builtin | Size: 0x4
			float32 m_panicSpeed; // 0xa70 | Schema_Builtin | Size: 0x4
			float32 m_avoidRange; // 0xa74 | Schema_Builtin | Size: 0x4
			server::CountdownTimer m_turnTimer; // 0xa78 | Schema_DeclaredClass | Size: 0x18
			bool m_turnClockwise; // 0xa90 | Schema_Builtin | Size: 0x1
			S2_PAD(0x7);
			server::CountdownTimer m_goTimer; // 0xa98 | Schema_DeclaredClass | Size: 0x18
			server::CountdownTimer m_moveTimer; // 0xab0 | Schema_DeclaredClass | Size: 0x18
			server::CountdownTimer m_panicTimer; // 0xac8 | Schema_DeclaredClass | Size: 0x18
			server::CountdownTimer m_disperseTimer; // 0xae0 | Schema_DeclaredClass | Size: 0x18
			server::CountdownTimer m_proximityTimer; // 0xaf8 | Schema_DeclaredClass | Size: 0x18
			// GlobalTypes::CUtlVector<server::CFish*> m_visible; // 0xb10 | Schema_Atomic | Size: 0x18
			char m_visible[0x18]; // 0xb10 | Schema_Atomic | Size: 0x18
			S2_PAD(0x8); // End padding
		};
#ifdef USE_STATIC_ASSERTS
		static_assert(offsetof(CS2::server::CFish, m_pool) == 0xA20, "m_pool in CFish should be at offset 0xA20");
		static_assert(offsetof(CS2::server::CFish, m_id) == 0xA24, "m_id in CFish should be at offset 0xA24");
		static_assert(offsetof(CS2::server::CFish, m_x) == 0xA28, "m_x in CFish should be at offset 0xA28");
		static_assert(offsetof(CS2::server::CFish, m_y) == 0xA2C, "m_y in CFish should be at offset 0xA2C");
		static_assert(offsetof(CS2::server::CFish, m_z) == 0xA30, "m_z in CFish should be at offset 0xA30");
		static_assert(offsetof(CS2::server::CFish, m_angle) == 0xA34, "m_angle in CFish should be at offset 0xA34");
		static_assert(offsetof(CS2::server::CFish, m_angleChange) == 0xA38, "m_angleChange in CFish should be at offset 0xA38");
		static_assert(offsetof(CS2::server::CFish, m_forward) == 0xA3C, "m_forward in CFish should be at offset 0xA3C");
		static_assert(offsetof(CS2::server::CFish, m_perp) == 0xA48, "m_perp in CFish should be at offset 0xA48");
		static_assert(offsetof(CS2::server::CFish, m_poolOrigin) == 0xA54, "m_poolOrigin in CFish should be at offset 0xA54");
		static_assert(offsetof(CS2::server::CFish, m_waterLevel) == 0xA60, "m_waterLevel in CFish should be at offset 0xA60");
		static_assert(offsetof(CS2::server::CFish, m_speed) == 0xA64, "m_speed in CFish should be at offset 0xA64");
		static_assert(offsetof(CS2::server::CFish, m_desiredSpeed) == 0xA68, "m_desiredSpeed in CFish should be at offset 0xA68");
		static_assert(offsetof(CS2::server::CFish, m_calmSpeed) == 0xA6C, "m_calmSpeed in CFish should be at offset 0xA6C");
		static_assert(offsetof(CS2::server::CFish, m_panicSpeed) == 0xA70, "m_panicSpeed in CFish should be at offset 0xA70");
		static_assert(offsetof(CS2::server::CFish, m_avoidRange) == 0xA74, "m_avoidRange in CFish should be at offset 0xA74");
		static_assert(offsetof(CS2::server::CFish, m_turnTimer) == 0xA78, "m_turnTimer in CFish should be at offset 0xA78");
		static_assert(offsetof(CS2::server::CFish, m_turnClockwise) == 0xA90, "m_turnClockwise in CFish should be at offset 0xA90");
		static_assert(offsetof(CS2::server::CFish, m_goTimer) == 0xA98, "m_goTimer in CFish should be at offset 0xA98");
		static_assert(offsetof(CS2::server::CFish, m_moveTimer) == 0xAB0, "m_moveTimer in CFish should be at offset 0xAB0");
		static_assert(offsetof(CS2::server::CFish, m_panicTimer) == 0xAC8, "m_panicTimer in CFish should be at offset 0xAC8");
		static_assert(offsetof(CS2::server::CFish, m_disperseTimer) == 0xAE0, "m_disperseTimer in CFish should be at offset 0xAE0");
		static_assert(offsetof(CS2::server::CFish, m_proximityTimer) == 0xAF8, "m_proximityTimer in CFish should be at offset 0xAF8");
		static_assert(offsetof(CS2::server::CFish, m_visible) == 0xB10, "m_visible in CFish should be at offset 0xB10");
		static_assert(sizeof(CS2::server::CFish) == 0xB30, "CFish size should be 0xB30");

#endif
	}
}
