// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#ifndef CUSTOM_GLOBAL_TYPES
	#include <SDK/GlobalTypes.hpp>
#else
	#include <Custom/GlobalTypes.hpp>
#endif


#include <SDK/server/CServerOnlyModelEntity.hpp>





using namespace GlobalTypes;
namespace CS2 {
	namespace server {
		class CFogVolume : public CS2::server::CServerOnlyModelEntity {
		public:
			GlobalTypes::CUtlSymbolLarge m_fogName; // 0x730 | Schema_Atomic | Size: 0x8
			GlobalTypes::CUtlSymbolLarge m_postProcessName; // 0x738 | Schema_Atomic | Size: 0x8
			GlobalTypes::CUtlSymbolLarge m_colorCorrectionName; // 0x740 | Schema_Atomic | Size: 0x8
			S2_PAD(0x8);
			bool m_bDisabled; // 0x750 | Schema_Builtin | Size: 0x1
			bool m_bInFogVolumesList; // 0x751 | Schema_Builtin | Size: 0x1
			S2_PAD(0x6); // End padding
		};
		static_assert(offsetof(CS2::server::CFogVolume, m_fogName) == 0x730, "m_fogName in CFogVolume should be at offset 0x730");
		static_assert(offsetof(CS2::server::CFogVolume, m_postProcessName) == 0x738, "m_postProcessName in CFogVolume should be at offset 0x738");
		static_assert(offsetof(CS2::server::CFogVolume, m_colorCorrectionName) == 0x740, "m_colorCorrectionName in CFogVolume should be at offset 0x740");
		static_assert(offsetof(CS2::server::CFogVolume, m_bDisabled) == 0x750, "m_bDisabled in CFogVolume should be at offset 0x750");
		static_assert(offsetof(CS2::server::CFogVolume, m_bInFogVolumesList) == 0x751, "m_bInFogVolumesList in CFogVolume should be at offset 0x751");
		static_assert(sizeof(CS2::server::CFogVolume) == 0x758, "CFogVolume size should be 0x758");
	}
}
