// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#ifndef CUSTOM_GLOBAL_TYPES
	#include <SDK/GlobalTypes.hpp>
#else
	#include <Custom/GlobalTypes.hpp>
#endif


#include <SDK/server/CBaseModelEntity.hpp>
#include <SDK/server/CInfoLadderDismount.hpp>
#include <SDK/entity2/CEntityIOOutput.hpp>





using namespace GlobalTypes;
namespace CS2 {
	namespace server {
		class CFuncLadder : public CS2::server::CBaseModelEntity {
		public:
			GlobalTypes::Vector m_vecLadderDir; // 0x730 | Schema_Atomic | Size: 0xc
			S2_PAD(0x4);
			server::CUtlVector<GlobalTypes::CHandle<server::CInfoLadderDismount>> m_Dismounts; // 0x740 | Schema_Atomic | Size: 0x18
			// char m_Dismounts[0x18]; // 0x740 | Schema_Atomic | Size: 0x18
			GlobalTypes::Vector m_vecLocalTop; // 0x758 | Schema_Atomic | Size: 0xc
			GlobalTypes::VectorWS m_vecPlayerMountPositionTop; // 0x764 | Schema_Atomic | Size: 0xc
			GlobalTypes::VectorWS m_vecPlayerMountPositionBottom; // 0x770 | Schema_Atomic | Size: 0xc
			float32 m_flAutoRideSpeed; // 0x77c | Schema_Builtin | Size: 0x4
			bool m_bDisabled; // 0x780 | Schema_Builtin | Size: 0x1
			bool m_bFakeLadder; // 0x781 | Schema_Builtin | Size: 0x1
			bool m_bHasSlack; // 0x782 | Schema_Builtin | Size: 0x1
			S2_PAD(0x5);
			GlobalTypes::CUtlSymbolLarge m_surfacePropName; // 0x788 | Schema_Atomic | Size: 0x8
			entity2::CEntityIOOutput m_OnPlayerGotOnLadder; // 0x790 | Schema_DeclaredClass | Size: 0x18
			entity2::CEntityIOOutput m_OnPlayerGotOffLadder; // 0x7a8 | Schema_DeclaredClass | Size: 0x18
		};
		static_assert(offsetof(CS2::server::CFuncLadder, m_vecLadderDir) == 0x730, "m_vecLadderDir in CFuncLadder should be at offset 0x730");
		static_assert(offsetof(CS2::server::CFuncLadder, m_Dismounts) == 0x740, "m_Dismounts in CFuncLadder should be at offset 0x740");
		static_assert(offsetof(CS2::server::CFuncLadder, m_vecLocalTop) == 0x758, "m_vecLocalTop in CFuncLadder should be at offset 0x758");
		static_assert(offsetof(CS2::server::CFuncLadder, m_vecPlayerMountPositionTop) == 0x764, "m_vecPlayerMountPositionTop in CFuncLadder should be at offset 0x764");
		static_assert(offsetof(CS2::server::CFuncLadder, m_vecPlayerMountPositionBottom) == 0x770, "m_vecPlayerMountPositionBottom in CFuncLadder should be at offset 0x770");
		static_assert(offsetof(CS2::server::CFuncLadder, m_flAutoRideSpeed) == 0x77C, "m_flAutoRideSpeed in CFuncLadder should be at offset 0x77C");
		static_assert(offsetof(CS2::server::CFuncLadder, m_bDisabled) == 0x780, "m_bDisabled in CFuncLadder should be at offset 0x780");
		static_assert(offsetof(CS2::server::CFuncLadder, m_bFakeLadder) == 0x781, "m_bFakeLadder in CFuncLadder should be at offset 0x781");
		static_assert(offsetof(CS2::server::CFuncLadder, m_bHasSlack) == 0x782, "m_bHasSlack in CFuncLadder should be at offset 0x782");
		static_assert(offsetof(CS2::server::CFuncLadder, m_surfacePropName) == 0x788, "m_surfacePropName in CFuncLadder should be at offset 0x788");
		static_assert(offsetof(CS2::server::CFuncLadder, m_OnPlayerGotOnLadder) == 0x790, "m_OnPlayerGotOnLadder in CFuncLadder should be at offset 0x790");
		static_assert(offsetof(CS2::server::CFuncLadder, m_OnPlayerGotOffLadder) == 0x7A8, "m_OnPlayerGotOffLadder in CFuncLadder should be at offset 0x7A8");
		static_assert(sizeof(CS2::server::CFuncLadder) == 0x7C0, "CFuncLadder size should be 0x7C0");
	}
}
