// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#include <SDK/GlobalTypes.hpp>

#include <SDK/server/CBaseModelEntity.hpp>
#include <SDK/entity2/CEntityIOOutput.hpp>



namespace CS2 {
	namespace server {
		class CFuncRotating : public CS2::server::CBaseModelEntity {
		public:
			public:
			entity2::CEntityIOOutput m_OnStopped; // 0x7e8 | Schema_DeclaredClass | Size: 0x28
			entity2::CEntityIOOutput m_OnStarted; // 0x810 | Schema_DeclaredClass | Size: 0x28
			entity2::CEntityIOOutput m_OnReachedStart; // 0x838 | Schema_DeclaredClass | Size: 0x28
			GlobalTypes::RotationVector m_localRotationVector; // 0x860 | Schema_Atomic | Size: 0xc
			float32 m_flFanFriction; // 0x86c | Schema_Builtin | Size: 0x4
			float32 m_flAttenuation; // 0x870 | Schema_Builtin | Size: 0x4
			float32 m_flVolume; // 0x874 | Schema_Builtin | Size: 0x4
			float32 m_flTargetSpeed; // 0x878 | Schema_Builtin | Size: 0x4
			float32 m_flMaxSpeed; // 0x87c | Schema_Builtin | Size: 0x4
			float32 m_flBlockDamage; // 0x880 | Schema_Builtin | Size: 0x4
			S2_PAD(0x4);
			GlobalTypes::CUtlSymbolLarge m_NoiseRunning; // 0x888 | Schema_Atomic | Size: 0x8
			bool m_bReversed; // 0x890 | Schema_Builtin | Size: 0x1
			bool m_bAccelDecel; // 0x891 | Schema_Builtin | Size: 0x1
			S2_PAD(0x16);
			GlobalTypes::QAngle m_prevLocalAngles; // 0x8a8 | Schema_Atomic | Size: 0xc
			GlobalTypes::QAngle m_angStart; // 0x8b4 | Schema_Atomic | Size: 0xc
			bool m_bStopAtStartPos; // 0x8c0 | Schema_Builtin | Size: 0x1
			S2_PAD(0x3);
			GlobalTypes::Vector m_vecClientOrigin; // 0x8c4 | Schema_Atomic | Size: 0xc
			GlobalTypes::QAngle m_vecClientAngles; // 0x8d0 | Schema_Atomic | Size: 0xc
			S2_PAD(0x4); // End padding
		};
		static_assert(offsetof(CS2::server::CFuncRotating, m_OnStopped) == 0x7E8, "m_OnStopped in CFuncRotating should be at offset 0x7E8");
		static_assert(offsetof(CS2::server::CFuncRotating, m_OnStarted) == 0x810, "m_OnStarted in CFuncRotating should be at offset 0x810");
		static_assert(offsetof(CS2::server::CFuncRotating, m_OnReachedStart) == 0x838, "m_OnReachedStart in CFuncRotating should be at offset 0x838");
		static_assert(offsetof(CS2::server::CFuncRotating, m_localRotationVector) == 0x860, "m_localRotationVector in CFuncRotating should be at offset 0x860");
		static_assert(offsetof(CS2::server::CFuncRotating, m_flFanFriction) == 0x86C, "m_flFanFriction in CFuncRotating should be at offset 0x86C");
		static_assert(offsetof(CS2::server::CFuncRotating, m_flAttenuation) == 0x870, "m_flAttenuation in CFuncRotating should be at offset 0x870");
		static_assert(offsetof(CS2::server::CFuncRotating, m_flVolume) == 0x874, "m_flVolume in CFuncRotating should be at offset 0x874");
		static_assert(offsetof(CS2::server::CFuncRotating, m_flTargetSpeed) == 0x878, "m_flTargetSpeed in CFuncRotating should be at offset 0x878");
		static_assert(offsetof(CS2::server::CFuncRotating, m_flMaxSpeed) == 0x87C, "m_flMaxSpeed in CFuncRotating should be at offset 0x87C");
		static_assert(offsetof(CS2::server::CFuncRotating, m_flBlockDamage) == 0x880, "m_flBlockDamage in CFuncRotating should be at offset 0x880");
		static_assert(offsetof(CS2::server::CFuncRotating, m_NoiseRunning) == 0x888, "m_NoiseRunning in CFuncRotating should be at offset 0x888");
		static_assert(offsetof(CS2::server::CFuncRotating, m_bReversed) == 0x890, "m_bReversed in CFuncRotating should be at offset 0x890");
		static_assert(offsetof(CS2::server::CFuncRotating, m_bAccelDecel) == 0x891, "m_bAccelDecel in CFuncRotating should be at offset 0x891");
		static_assert(offsetof(CS2::server::CFuncRotating, m_prevLocalAngles) == 0x8A8, "m_prevLocalAngles in CFuncRotating should be at offset 0x8A8");
		static_assert(offsetof(CS2::server::CFuncRotating, m_angStart) == 0x8B4, "m_angStart in CFuncRotating should be at offset 0x8B4");
		static_assert(offsetof(CS2::server::CFuncRotating, m_bStopAtStartPos) == 0x8C0, "m_bStopAtStartPos in CFuncRotating should be at offset 0x8C0");
		static_assert(offsetof(CS2::server::CFuncRotating, m_vecClientOrigin) == 0x8C4, "m_vecClientOrigin in CFuncRotating should be at offset 0x8C4");
		static_assert(offsetof(CS2::server::CFuncRotating, m_vecClientAngles) == 0x8D0, "m_vecClientAngles in CFuncRotating should be at offset 0x8D0");
		static_assert(sizeof(CS2::server::CFuncRotating) == 0x8E0, "CFuncRotating size should be 0x8E0");
	}
}
