// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#ifndef CUSTOM_GLOBAL_TYPES
	#include <SDK/GlobalTypes.hpp>
#else
	#include <Custom/GlobalTypes.hpp>
#endif


#include <SDK/server/CFuncBrush.hpp>



namespace CS2 {
	namespace server {
		class CFuncElectrifiedVolume : public CS2::server::CFuncBrush {
		public:
			GlobalTypes::CUtlSymbolLarge m_EffectName; // 0x7f8 | Schema_Atomic | Size: 0x8
			GlobalTypes::CUtlSymbolLarge m_EffectInterpenetrateName; // 0x800 | Schema_Atomic | Size: 0x8
			GlobalTypes::CUtlSymbolLarge m_EffectZapName; // 0x808 | Schema_Atomic | Size: 0x8
			GlobalTypes::CUtlSymbolLarge m_iszEffectSource; // 0x810 | Schema_Atomic | Size: 0x8
			S2_PAD(0x18); // End padding
		};
		static_assert(offsetof(CS2::server::CFuncElectrifiedVolume, m_EffectName) == 0x7F8, "m_EffectName in CFuncElectrifiedVolume should be at offset 0x7F8");
		static_assert(offsetof(CS2::server::CFuncElectrifiedVolume, m_EffectInterpenetrateName) == 0x800, "m_EffectInterpenetrateName in CFuncElectrifiedVolume should be at offset 0x800");
		static_assert(offsetof(CS2::server::CFuncElectrifiedVolume, m_EffectZapName) == 0x808, "m_EffectZapName in CFuncElectrifiedVolume should be at offset 0x808");
		static_assert(offsetof(CS2::server::CFuncElectrifiedVolume, m_iszEffectSource) == 0x810, "m_iszEffectSource in CFuncElectrifiedVolume should be at offset 0x810");
		static_assert(sizeof(CS2::server::CFuncElectrifiedVolume) == 0x830, "CFuncElectrifiedVolume size should be 0x830");
	}
}
