// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#ifndef CUSTOM_GLOBAL_TYPES
	#include "../GlobalTypes.hpp"
#else
	#include "../Custom/GlobalTypes.hpp"
#endif


#include "CBaseModelEntity.hpp"
#include "../entity2/GameTime_t.hpp"
#include "../entity2/CEntityIOOutput.hpp"
#include "CFuncRotator_Rotate_t.hpp"
#include "RotatorTargetSpace_t.hpp"
#include "RotatorHistoryEntry_t.hpp"
#include "RotatorQueueEntry_t.hpp"
#include "../client/SolidType_t.hpp"



namespace CS2 {
	namespace server {
		class CBaseEntity;
		class CFuncMover;
	}
}


using namespace GlobalTypes;
namespace CS2 {
	namespace server {
		class CFuncRotator : public CS2::server::CBaseModelEntity {
		public:
			GlobalTypes::CHandle<server::CBaseEntity> m_hRotatorTarget; // 0x730 | Schema_Atomic | Size: 0x4
			// char m_hRotatorTarget[0x4]; // 0x730 | Schema_Atomic | Size: 0x4
			bool m_bIsRotating; // 0x734 | Schema_Builtin | Size: 0x1
			bool m_bIsReversing; // 0x735 | Schema_Builtin | Size: 0x1
			S2_PAD(0x2);
			float32 m_flTimeToReachMaxSpeed; // 0x738 | Schema_Builtin | Size: 0x4
			float32 m_flTimeToReachZeroSpeed; // 0x73c | Schema_Builtin | Size: 0x4
			float32 m_flDistanceAlongArcTraveled; // 0x740 | Schema_Builtin | Size: 0x4
			float32 m_flTimeToWaitOscillate; // 0x744 | Schema_Builtin | Size: 0x4
			entity2::GameTime_t m_flTimeRotationStart; // 0x748 | Schema_DeclaredClass | Size: 0x4
			S2_PAD(0x4);
			GlobalTypes::Quaternion m_qLSPrevChange; // 0x750 | Schema_Atomic | Size: 0x10
			GlobalTypes::Quaternion m_qWSPrev; // 0x760 | Schema_Atomic | Size: 0x10
			GlobalTypes::Quaternion m_qWSInit; // 0x770 | Schema_Atomic | Size: 0x10
			GlobalTypes::Quaternion m_qLSInit; // 0x780 | Schema_Atomic | Size: 0x10
			GlobalTypes::Quaternion m_qLSOrientation; // 0x790 | Schema_Atomic | Size: 0x10
			entity2::CEntityIOOutput m_OnRotationStarted; // 0x7a0 | Schema_DeclaredClass | Size: 0x18
			entity2::CEntityIOOutput m_OnRotationCompleted; // 0x7b8 | Schema_DeclaredClass | Size: 0x18
			entity2::CEntityIOOutput m_OnOscillate; // 0x7d0 | Schema_DeclaredClass | Size: 0x18
			entity2::CEntityIOOutput m_OnOscillateStartArrive; // 0x7e8 | Schema_DeclaredClass | Size: 0x18
			entity2::CEntityIOOutput m_OnOscillateStartDepart; // 0x800 | Schema_DeclaredClass | Size: 0x18
			entity2::CEntityIOOutput m_OnOscillateEndArrive; // 0x818 | Schema_DeclaredClass | Size: 0x18
			entity2::CEntityIOOutput m_OnOscillateEndDepart; // 0x830 | Schema_DeclaredClass | Size: 0x18
			bool m_bOscillateDepart; // 0x848 | Schema_Builtin | Size: 0x1
			S2_PAD(0x3);
			int32_t m_nOscillateCount; // 0x84c | Schema_Builtin | Size: 0x4
			server::CFuncRotator_Rotate_t m_eRotateType; // 0x850 | Schema_DeclaredEnum | Size: 0x4
			server::CFuncRotator_Rotate_t m_ePrevRotateType; // 0x854 | Schema_DeclaredEnum | Size: 0x4
			bool m_bHasTargetOverride; // 0x858 | Schema_Builtin | Size: 0x1
			S2_PAD(0x7);
			GlobalTypes::Quaternion m_qOrientationOverride; // 0x860 | Schema_Atomic | Size: 0x10
			server::RotatorTargetSpace_t m_eSpaceOverride; // 0x870 | Schema_DeclaredEnum | Size: 0x4
			GlobalTypes::QAngle m_qAngularVelocity; // 0x874 | Schema_Atomic | Size: 0xc
			GlobalTypes::Vector m_vLookAtForcedUp; // 0x880 | Schema_Atomic | Size: 0xc
			S2_PAD(0x4);
			GlobalTypes::CUtlSymbolLarge m_strRotatorTarget; // 0x890 | Schema_Atomic | Size: 0x8
			bool m_bRecordHistory; // 0x898 | Schema_Builtin | Size: 0x1
			S2_PAD(0x7);
			GlobalTypes::CUtlVector<server::RotatorHistoryEntry_t> m_vecRotatorHistory; // 0x8a0 | Schema_Atomic | Size: 0x18
			// char m_vecRotatorHistory[0x18]; // 0x8a0 | Schema_Atomic | Size: 0x18
			bool m_bReturningToPreviousOrientation; // 0x8b8 | Schema_Builtin | Size: 0x1
			S2_PAD(0x7);
			GlobalTypes::CUtlVector<server::RotatorQueueEntry_t> m_vecRotatorQueue; // 0x8c0 | Schema_Atomic | Size: 0x18
			// char m_vecRotatorQueue[0x18]; // 0x8c0 | Schema_Atomic | Size: 0x18
			GlobalTypes::CUtlVector<server::RotatorHistoryEntry_t> m_vecRotatorQueueHistory; // 0x8d8 | Schema_Atomic | Size: 0x18
			// char m_vecRotatorQueueHistory[0x18]; // 0x8d8 | Schema_Atomic | Size: 0x18
			client::SolidType_t m_eSolidType; // 0x8f0 | Schema_DeclaredEnum | Size: 0x1
			S2_PAD(0x3);
			GlobalTypes::CHandle<server::CFuncMover> m_hSpeedFromMover; // 0x8f4 | Schema_Atomic | Size: 0x4
			// char m_hSpeedFromMover[0x4]; // 0x8f4 | Schema_Atomic | Size: 0x4
			GlobalTypes::CUtlSymbolLarge m_iszSpeedFromMover; // 0x8f8 | Schema_Atomic | Size: 0x8
			float32 m_flSpeedScale; // 0x900 | Schema_Builtin | Size: 0x4
			float32 m_flMinYawRotation; // 0x904 | Schema_Builtin | Size: 0x4
			float32 m_flMaxYawRotation; // 0x908 | Schema_Builtin | Size: 0x4
			S2_PAD(0x4); // End padding
		};
#ifdef USE_STATIC_ASSERTS
		static_assert(offsetof(CS2::server::CFuncRotator, m_hRotatorTarget) == 0x730, "m_hRotatorTarget in CFuncRotator should be at offset 0x730");
		static_assert(offsetof(CS2::server::CFuncRotator, m_bIsRotating) == 0x734, "m_bIsRotating in CFuncRotator should be at offset 0x734");
		static_assert(offsetof(CS2::server::CFuncRotator, m_bIsReversing) == 0x735, "m_bIsReversing in CFuncRotator should be at offset 0x735");
		static_assert(offsetof(CS2::server::CFuncRotator, m_flTimeToReachMaxSpeed) == 0x738, "m_flTimeToReachMaxSpeed in CFuncRotator should be at offset 0x738");
		static_assert(offsetof(CS2::server::CFuncRotator, m_flTimeToReachZeroSpeed) == 0x73C, "m_flTimeToReachZeroSpeed in CFuncRotator should be at offset 0x73C");
		static_assert(offsetof(CS2::server::CFuncRotator, m_flDistanceAlongArcTraveled) == 0x740, "m_flDistanceAlongArcTraveled in CFuncRotator should be at offset 0x740");
		static_assert(offsetof(CS2::server::CFuncRotator, m_flTimeToWaitOscillate) == 0x744, "m_flTimeToWaitOscillate in CFuncRotator should be at offset 0x744");
		static_assert(offsetof(CS2::server::CFuncRotator, m_flTimeRotationStart) == 0x748, "m_flTimeRotationStart in CFuncRotator should be at offset 0x748");
		static_assert(offsetof(CS2::server::CFuncRotator, m_qLSPrevChange) == 0x750, "m_qLSPrevChange in CFuncRotator should be at offset 0x750");
		static_assert(offsetof(CS2::server::CFuncRotator, m_qWSPrev) == 0x760, "m_qWSPrev in CFuncRotator should be at offset 0x760");
		static_assert(offsetof(CS2::server::CFuncRotator, m_qWSInit) == 0x770, "m_qWSInit in CFuncRotator should be at offset 0x770");
		static_assert(offsetof(CS2::server::CFuncRotator, m_qLSInit) == 0x780, "m_qLSInit in CFuncRotator should be at offset 0x780");
		static_assert(offsetof(CS2::server::CFuncRotator, m_qLSOrientation) == 0x790, "m_qLSOrientation in CFuncRotator should be at offset 0x790");
		static_assert(offsetof(CS2::server::CFuncRotator, m_OnRotationStarted) == 0x7A0, "m_OnRotationStarted in CFuncRotator should be at offset 0x7A0");
		static_assert(offsetof(CS2::server::CFuncRotator, m_OnRotationCompleted) == 0x7B8, "m_OnRotationCompleted in CFuncRotator should be at offset 0x7B8");
		static_assert(offsetof(CS2::server::CFuncRotator, m_OnOscillate) == 0x7D0, "m_OnOscillate in CFuncRotator should be at offset 0x7D0");
		static_assert(offsetof(CS2::server::CFuncRotator, m_OnOscillateStartArrive) == 0x7E8, "m_OnOscillateStartArrive in CFuncRotator should be at offset 0x7E8");
		static_assert(offsetof(CS2::server::CFuncRotator, m_OnOscillateStartDepart) == 0x800, "m_OnOscillateStartDepart in CFuncRotator should be at offset 0x800");
		static_assert(offsetof(CS2::server::CFuncRotator, m_OnOscillateEndArrive) == 0x818, "m_OnOscillateEndArrive in CFuncRotator should be at offset 0x818");
		static_assert(offsetof(CS2::server::CFuncRotator, m_OnOscillateEndDepart) == 0x830, "m_OnOscillateEndDepart in CFuncRotator should be at offset 0x830");
		static_assert(offsetof(CS2::server::CFuncRotator, m_bOscillateDepart) == 0x848, "m_bOscillateDepart in CFuncRotator should be at offset 0x848");
		static_assert(offsetof(CS2::server::CFuncRotator, m_nOscillateCount) == 0x84C, "m_nOscillateCount in CFuncRotator should be at offset 0x84C");
		static_assert(offsetof(CS2::server::CFuncRotator, m_eRotateType) == 0x850, "m_eRotateType in CFuncRotator should be at offset 0x850");
		static_assert(offsetof(CS2::server::CFuncRotator, m_ePrevRotateType) == 0x854, "m_ePrevRotateType in CFuncRotator should be at offset 0x854");
		static_assert(offsetof(CS2::server::CFuncRotator, m_bHasTargetOverride) == 0x858, "m_bHasTargetOverride in CFuncRotator should be at offset 0x858");
		static_assert(offsetof(CS2::server::CFuncRotator, m_qOrientationOverride) == 0x860, "m_qOrientationOverride in CFuncRotator should be at offset 0x860");
		static_assert(offsetof(CS2::server::CFuncRotator, m_eSpaceOverride) == 0x870, "m_eSpaceOverride in CFuncRotator should be at offset 0x870");
		static_assert(offsetof(CS2::server::CFuncRotator, m_qAngularVelocity) == 0x874, "m_qAngularVelocity in CFuncRotator should be at offset 0x874");
		static_assert(offsetof(CS2::server::CFuncRotator, m_vLookAtForcedUp) == 0x880, "m_vLookAtForcedUp in CFuncRotator should be at offset 0x880");
		static_assert(offsetof(CS2::server::CFuncRotator, m_strRotatorTarget) == 0x890, "m_strRotatorTarget in CFuncRotator should be at offset 0x890");
		static_assert(offsetof(CS2::server::CFuncRotator, m_bRecordHistory) == 0x898, "m_bRecordHistory in CFuncRotator should be at offset 0x898");
		static_assert(offsetof(CS2::server::CFuncRotator, m_vecRotatorHistory) == 0x8A0, "m_vecRotatorHistory in CFuncRotator should be at offset 0x8A0");
		static_assert(offsetof(CS2::server::CFuncRotator, m_bReturningToPreviousOrientation) == 0x8B8, "m_bReturningToPreviousOrientation in CFuncRotator should be at offset 0x8B8");
		static_assert(offsetof(CS2::server::CFuncRotator, m_vecRotatorQueue) == 0x8C0, "m_vecRotatorQueue in CFuncRotator should be at offset 0x8C0");
		static_assert(offsetof(CS2::server::CFuncRotator, m_vecRotatorQueueHistory) == 0x8D8, "m_vecRotatorQueueHistory in CFuncRotator should be at offset 0x8D8");
		static_assert(offsetof(CS2::server::CFuncRotator, m_eSolidType) == 0x8F0, "m_eSolidType in CFuncRotator should be at offset 0x8F0");
		static_assert(offsetof(CS2::server::CFuncRotator, m_hSpeedFromMover) == 0x8F4, "m_hSpeedFromMover in CFuncRotator should be at offset 0x8F4");
		static_assert(offsetof(CS2::server::CFuncRotator, m_iszSpeedFromMover) == 0x8F8, "m_iszSpeedFromMover in CFuncRotator should be at offset 0x8F8");
		static_assert(offsetof(CS2::server::CFuncRotator, m_flSpeedScale) == 0x900, "m_flSpeedScale in CFuncRotator should be at offset 0x900");
		static_assert(offsetof(CS2::server::CFuncRotator, m_flMinYawRotation) == 0x904, "m_flMinYawRotation in CFuncRotator should be at offset 0x904");
		static_assert(offsetof(CS2::server::CFuncRotator, m_flMaxYawRotation) == 0x908, "m_flMaxYawRotation in CFuncRotator should be at offset 0x908");
		static_assert(sizeof(CS2::server::CFuncRotator) == 0x910, "CFuncRotator size should be 0x910");

#endif
	}
}
