// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#ifndef CUSTOM_GLOBAL_TYPES
	#include "../GlobalTypes.hpp"
#else
	#include "../Custom/GlobalTypes.hpp"
#endif


#include "CBaseEntity.hpp"





using namespace GlobalTypes;
namespace CS2 {
	namespace server {
		class CFuncTimescale : public CS2::server::CBaseEntity {
		public:
			float32 m_flDesiredTimescale; // 0x4a8 | Schema_Builtin | Size: 0x4
			float32 m_flAcceleration; // 0x4ac | Schema_Builtin | Size: 0x4
			float32 m_flMinBlendRate; // 0x4b0 | Schema_Builtin | Size: 0x4
			float32 m_flBlendDeltaMultiplier; // 0x4b4 | Schema_Builtin | Size: 0x4
			bool m_isStarted; // 0x4b8 | Schema_Builtin | Size: 0x1
			S2_PAD(0x7); // End padding
		};
#ifdef USE_STATIC_ASSERTS
		static_assert(offsetof(CS2::server::CFuncTimescale, m_flDesiredTimescale) == 0x4A8, "m_flDesiredTimescale in CFuncTimescale should be at offset 0x4A8");
		static_assert(offsetof(CS2::server::CFuncTimescale, m_flAcceleration) == 0x4AC, "m_flAcceleration in CFuncTimescale should be at offset 0x4AC");
		static_assert(offsetof(CS2::server::CFuncTimescale, m_flMinBlendRate) == 0x4B0, "m_flMinBlendRate in CFuncTimescale should be at offset 0x4B0");
		static_assert(offsetof(CS2::server::CFuncTimescale, m_flBlendDeltaMultiplier) == 0x4B4, "m_flBlendDeltaMultiplier in CFuncTimescale should be at offset 0x4B4");
		static_assert(offsetof(CS2::server::CFuncTimescale, m_isStarted) == 0x4B8, "m_isStarted in CFuncTimescale should be at offset 0x4B8");
		static_assert(sizeof(CS2::server::CFuncTimescale) == 0x4C0, "CFuncTimescale size should be 0x4C0");

#endif
	}
}
