// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#include <SDK/GlobalTypes.hpp>

#include <SDK/server/CBaseModelEntity.hpp>
#include <SDK/client/BrushSolidities_e.hpp>



namespace CS2 {
	namespace server {
		class CFuncBrush : public CS2::server::CBaseModelEntity {
		public:
			client::BrushSolidities_e m_iSolidity; // 0x7f0 | Schema_DeclaredEnum | Size: 0x4
			int32_t m_iDisabled; // 0x7f4 | Schema_Builtin | Size: 0x4
			bool m_bSolidBsp; // 0x7f8 | Schema_Builtin | Size: 0x1
			S2_PAD(0x7);
			GlobalTypes::CUtlSymbolLarge m_iszExcludedClass; // 0x800 | Schema_Atomic | Size: 0x8
			bool m_bInvertExclusion; // 0x808 | Schema_Builtin | Size: 0x1
			bool m_bScriptedMovement; // 0x809 | Schema_Builtin | Size: 0x1
			S2_PAD(0x6); // End padding
		};
		static_assert(offsetof(CS2::server::CFuncBrush, m_iSolidity) == 0x7F0, "m_iSolidity in CFuncBrush should be at offset 0x7F0");
		static_assert(offsetof(CS2::server::CFuncBrush, m_iDisabled) == 0x7F4, "m_iDisabled in CFuncBrush should be at offset 0x7F4");
		static_assert(offsetof(CS2::server::CFuncBrush, m_bSolidBsp) == 0x7F8, "m_bSolidBsp in CFuncBrush should be at offset 0x7F8");
		static_assert(offsetof(CS2::server::CFuncBrush, m_iszExcludedClass) == 0x800, "m_iszExcludedClass in CFuncBrush should be at offset 0x800");
		static_assert(offsetof(CS2::server::CFuncBrush, m_bInvertExclusion) == 0x808, "m_bInvertExclusion in CFuncBrush should be at offset 0x808");
		static_assert(offsetof(CS2::server::CFuncBrush, m_bScriptedMovement) == 0x809, "m_bScriptedMovement in CFuncBrush should be at offset 0x809");
		static_assert(sizeof(CS2::server::CFuncBrush) == 0x810, "CFuncBrush size should be 0x810");
	}
}
