// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#include <SDK/GlobalTypes.hpp>

#include <SDK/server/CFuncBrush.hpp>



namespace CS2 {
	namespace server {
		class CFuncMonitor : public CS2::server::CFuncBrush {
		public:
			public:
			GlobalTypes::CUtlString m_targetCamera; // 0x808 | Schema_Atomic | Size: 0x8
			int32_t m_nResolutionEnum; // 0x810 | Schema_Builtin | Size: 0x4
			bool m_bRenderShadows; // 0x814 | Schema_Builtin | Size: 0x1
			bool m_bUseUniqueColorTarget; // 0x815 | Schema_Builtin | Size: 0x1
			S2_PAD(0x2);
			GlobalTypes::CUtlString m_brushModelName; // 0x818 | Schema_Atomic | Size: 0x8
			// server::CHandle< server::CBaseEntity > m_hTargetCamera; // 0x820 | Schema_Atomic | Size: 0x4
			char  m_hTargetCamera[0x4]; // 0x820 | Schema_Atomic | Size: 0x4
			bool m_bEnabled; // 0x824 | Schema_Builtin | Size: 0x1
			bool m_bDraw3DSkybox; // 0x825 | Schema_Builtin | Size: 0x1
			bool m_bStartEnabled; // 0x826 | Schema_Builtin | Size: 0x1
			S2_PAD(0x1); // End padding
		};
		static_assert(offsetof(CS2::server::CFuncMonitor, m_targetCamera) == 0x808, "m_targetCamera in CFuncMonitor should be at offset 0x808");
		static_assert(offsetof(CS2::server::CFuncMonitor, m_nResolutionEnum) == 0x810, "m_nResolutionEnum in CFuncMonitor should be at offset 0x810");
		static_assert(offsetof(CS2::server::CFuncMonitor, m_bRenderShadows) == 0x814, "m_bRenderShadows in CFuncMonitor should be at offset 0x814");
		static_assert(offsetof(CS2::server::CFuncMonitor, m_bUseUniqueColorTarget) == 0x815, "m_bUseUniqueColorTarget in CFuncMonitor should be at offset 0x815");
		static_assert(offsetof(CS2::server::CFuncMonitor, m_brushModelName) == 0x818, "m_brushModelName in CFuncMonitor should be at offset 0x818");
		static_assert(offsetof(CS2::server::CFuncMonitor, m_hTargetCamera) == 0x820, "m_hTargetCamera in CFuncMonitor should be at offset 0x820");
		static_assert(offsetof(CS2::server::CFuncMonitor, m_bEnabled) == 0x824, "m_bEnabled in CFuncMonitor should be at offset 0x824");
		static_assert(offsetof(CS2::server::CFuncMonitor, m_bDraw3DSkybox) == 0x825, "m_bDraw3DSkybox in CFuncMonitor should be at offset 0x825");
		static_assert(offsetof(CS2::server::CFuncMonitor, m_bStartEnabled) == 0x826, "m_bStartEnabled in CFuncMonitor should be at offset 0x826");
		static_assert(sizeof(CS2::server::CFuncMonitor) == 0x828, "CFuncMonitor size should be 0x828");
	}
}
