// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#include <SDK/GlobalTypes.hpp>

#include <SDK/server/CBaseModelEntity.hpp>
#include <SDK/entity2/GameTime_t.hpp>
#include <SDK/entity2/CEntityIOOutput.hpp>
#include <SDK/server/Rotate_t.hpp>
#include <SDK/server/RotatorTargetSpace_t.hpp>



namespace CS2 {
	namespace server {
		class CFuncRotator : public CS2::server::CBaseModelEntity {
		public:
			// server::CHandle< server::CBaseEntity > m_hRotatorTarget; // 0x7f0 | Schema_Atomic | Size: 0x4
			char  m_hRotatorTarget[0x4]; // 0x7f0 | Schema_Atomic | Size: 0x4
			bool m_bIsRotating; // 0x7f4 | Schema_Builtin | Size: 0x1
			bool m_bIsReversing; // 0x7f5 | Schema_Builtin | Size: 0x1
			S2_PAD(0x2);
			float32 m_flTimeToReachMaxSpeed; // 0x7f8 | Schema_Builtin | Size: 0x4
			float32 m_flTimeToReachZeroSpeed; // 0x7fc | Schema_Builtin | Size: 0x4
			float32 m_flDistanceAlongArcTraveled; // 0x800 | Schema_Builtin | Size: 0x4
			float32 m_flTimeToWaitOscillate; // 0x804 | Schema_Builtin | Size: 0x4
			entity2::GameTime_t m_flTimeRotationStart; // 0x808 | Schema_DeclaredClass | Size: 0x4
			S2_PAD(0x4);
			GlobalTypes::Quaternion m_qLSPrevChange; // 0x810 | Schema_Atomic | Size: 0x10
			GlobalTypes::Quaternion m_qWSPrev; // 0x820 | Schema_Atomic | Size: 0x10
			GlobalTypes::Quaternion m_qWSInit; // 0x830 | Schema_Atomic | Size: 0x10
			GlobalTypes::Quaternion m_qLSInit; // 0x840 | Schema_Atomic | Size: 0x10
			GlobalTypes::Quaternion m_qLSOrientation; // 0x850 | Schema_Atomic | Size: 0x10
			entity2::CEntityIOOutput m_OnRotationStarted; // 0x860 | Schema_DeclaredClass | Size: 0x28
			entity2::CEntityIOOutput m_OnRotationCompleted; // 0x888 | Schema_DeclaredClass | Size: 0x28
			entity2::CEntityIOOutput m_OnOscillate; // 0x8b0 | Schema_DeclaredClass | Size: 0x28
			entity2::CEntityIOOutput m_OnOscillateStartArrive; // 0x8d8 | Schema_DeclaredClass | Size: 0x28
			entity2::CEntityIOOutput m_OnOscillateStartDepart; // 0x900 | Schema_DeclaredClass | Size: 0x28
			entity2::CEntityIOOutput m_OnOscillateEndArrive; // 0x928 | Schema_DeclaredClass | Size: 0x28
			entity2::CEntityIOOutput m_OnOscillateEndDepart; // 0x950 | Schema_DeclaredClass | Size: 0x28
			bool m_bOscillateDepart; // 0x978 | Schema_Builtin | Size: 0x1
			S2_PAD(0x3);
			int32_t m_nOscillateCount; // 0x97c | Schema_Builtin | Size: 0x4
			server::Rotate_t m_eRotateType; // 0x980 | Schema_DeclaredEnum | Size: 0x4
			server::Rotate_t m_ePrevRotateType; // 0x984 | Schema_DeclaredEnum | Size: 0x4
			bool m_bHasTargetOverride; // 0x988 | Schema_Builtin | Size: 0x1
			S2_PAD(0x7);
			GlobalTypes::Quaternion m_qOrientationOverride; // 0x990 | Schema_Atomic | Size: 0x10
			server::RotatorTargetSpace_t m_eSpaceOverride; // 0x9a0 | Schema_DeclaredEnum | Size: 0x4
			GlobalTypes::QAngle m_qAngularVelocity; // 0x9a4 | Schema_Atomic | Size: 0xc
			GlobalTypes::Vector m_vLookAtForcedUp; // 0x9b0 | Schema_Atomic | Size: 0xc
			S2_PAD(0x4);
			GlobalTypes::CUtlSymbolLarge m_strRotatorTarget; // 0x9c0 | Schema_Atomic | Size: 0x8
			bool m_bRecordHistory; // 0x9c8 | Schema_Builtin | Size: 0x1
			S2_PAD(0x7);
			// GlobalTypes::CUtlVector< server::RotatorHistoryEntry_t > m_vecRotatorHistory; // 0x9d0 | Schema_Atomic | Size: 0x18
			char  m_vecRotatorHistory[0x18]; // 0x9d0 | Schema_Atomic | Size: 0x18
			bool m_bReturningToPreviousOrientation; // 0x9e8 | Schema_Builtin | Size: 0x1
			S2_PAD(0x7);
			// GlobalTypes::CUtlVector< server::RotatorQueueEntry_t > m_vecRotatorQueue; // 0x9f0 | Schema_Atomic | Size: 0x18
			char  m_vecRotatorQueue[0x18]; // 0x9f0 | Schema_Atomic | Size: 0x18
			// GlobalTypes::CUtlVector< server::RotatorHistoryEntry_t > m_vecRotatorQueueHistory; // 0xa08 | Schema_Atomic | Size: 0x18
			char  m_vecRotatorQueueHistory[0x18]; // 0xa08 | Schema_Atomic | Size: 0x18
		};
		static_assert(offsetof(CS2::server::CFuncRotator, m_hRotatorTarget) == 0x7F0, "m_hRotatorTarget in CFuncRotator should be at offset 0x7F0");
		static_assert(offsetof(CS2::server::CFuncRotator, m_bIsRotating) == 0x7F4, "m_bIsRotating in CFuncRotator should be at offset 0x7F4");
		static_assert(offsetof(CS2::server::CFuncRotator, m_bIsReversing) == 0x7F5, "m_bIsReversing in CFuncRotator should be at offset 0x7F5");
		static_assert(offsetof(CS2::server::CFuncRotator, m_flTimeToReachMaxSpeed) == 0x7F8, "m_flTimeToReachMaxSpeed in CFuncRotator should be at offset 0x7F8");
		static_assert(offsetof(CS2::server::CFuncRotator, m_flTimeToReachZeroSpeed) == 0x7FC, "m_flTimeToReachZeroSpeed in CFuncRotator should be at offset 0x7FC");
		static_assert(offsetof(CS2::server::CFuncRotator, m_flDistanceAlongArcTraveled) == 0x800, "m_flDistanceAlongArcTraveled in CFuncRotator should be at offset 0x800");
		static_assert(offsetof(CS2::server::CFuncRotator, m_flTimeToWaitOscillate) == 0x804, "m_flTimeToWaitOscillate in CFuncRotator should be at offset 0x804");
		static_assert(offsetof(CS2::server::CFuncRotator, m_flTimeRotationStart) == 0x808, "m_flTimeRotationStart in CFuncRotator should be at offset 0x808");
		static_assert(offsetof(CS2::server::CFuncRotator, m_qLSPrevChange) == 0x810, "m_qLSPrevChange in CFuncRotator should be at offset 0x810");
		static_assert(offsetof(CS2::server::CFuncRotator, m_qWSPrev) == 0x820, "m_qWSPrev in CFuncRotator should be at offset 0x820");
		static_assert(offsetof(CS2::server::CFuncRotator, m_qWSInit) == 0x830, "m_qWSInit in CFuncRotator should be at offset 0x830");
		static_assert(offsetof(CS2::server::CFuncRotator, m_qLSInit) == 0x840, "m_qLSInit in CFuncRotator should be at offset 0x840");
		static_assert(offsetof(CS2::server::CFuncRotator, m_qLSOrientation) == 0x850, "m_qLSOrientation in CFuncRotator should be at offset 0x850");
		static_assert(offsetof(CS2::server::CFuncRotator, m_OnRotationStarted) == 0x860, "m_OnRotationStarted in CFuncRotator should be at offset 0x860");
		static_assert(offsetof(CS2::server::CFuncRotator, m_OnRotationCompleted) == 0x888, "m_OnRotationCompleted in CFuncRotator should be at offset 0x888");
		static_assert(offsetof(CS2::server::CFuncRotator, m_OnOscillate) == 0x8B0, "m_OnOscillate in CFuncRotator should be at offset 0x8B0");
		static_assert(offsetof(CS2::server::CFuncRotator, m_OnOscillateStartArrive) == 0x8D8, "m_OnOscillateStartArrive in CFuncRotator should be at offset 0x8D8");
		static_assert(offsetof(CS2::server::CFuncRotator, m_OnOscillateStartDepart) == 0x900, "m_OnOscillateStartDepart in CFuncRotator should be at offset 0x900");
		static_assert(offsetof(CS2::server::CFuncRotator, m_OnOscillateEndArrive) == 0x928, "m_OnOscillateEndArrive in CFuncRotator should be at offset 0x928");
		static_assert(offsetof(CS2::server::CFuncRotator, m_OnOscillateEndDepart) == 0x950, "m_OnOscillateEndDepart in CFuncRotator should be at offset 0x950");
		static_assert(offsetof(CS2::server::CFuncRotator, m_bOscillateDepart) == 0x978, "m_bOscillateDepart in CFuncRotator should be at offset 0x978");
		static_assert(offsetof(CS2::server::CFuncRotator, m_nOscillateCount) == 0x97C, "m_nOscillateCount in CFuncRotator should be at offset 0x97C");
		static_assert(offsetof(CS2::server::CFuncRotator, m_eRotateType) == 0x980, "m_eRotateType in CFuncRotator should be at offset 0x980");
		static_assert(offsetof(CS2::server::CFuncRotator, m_ePrevRotateType) == 0x984, "m_ePrevRotateType in CFuncRotator should be at offset 0x984");
		static_assert(offsetof(CS2::server::CFuncRotator, m_bHasTargetOverride) == 0x988, "m_bHasTargetOverride in CFuncRotator should be at offset 0x988");
		static_assert(offsetof(CS2::server::CFuncRotator, m_qOrientationOverride) == 0x990, "m_qOrientationOverride in CFuncRotator should be at offset 0x990");
		static_assert(offsetof(CS2::server::CFuncRotator, m_eSpaceOverride) == 0x9A0, "m_eSpaceOverride in CFuncRotator should be at offset 0x9A0");
		static_assert(offsetof(CS2::server::CFuncRotator, m_qAngularVelocity) == 0x9A4, "m_qAngularVelocity in CFuncRotator should be at offset 0x9A4");
		static_assert(offsetof(CS2::server::CFuncRotator, m_vLookAtForcedUp) == 0x9B0, "m_vLookAtForcedUp in CFuncRotator should be at offset 0x9B0");
		static_assert(offsetof(CS2::server::CFuncRotator, m_strRotatorTarget) == 0x9C0, "m_strRotatorTarget in CFuncRotator should be at offset 0x9C0");
		static_assert(offsetof(CS2::server::CFuncRotator, m_bRecordHistory) == 0x9C8, "m_bRecordHistory in CFuncRotator should be at offset 0x9C8");
		static_assert(offsetof(CS2::server::CFuncRotator, m_vecRotatorHistory) == 0x9D0, "m_vecRotatorHistory in CFuncRotator should be at offset 0x9D0");
		static_assert(offsetof(CS2::server::CFuncRotator, m_bReturningToPreviousOrientation) == 0x9E8, "m_bReturningToPreviousOrientation in CFuncRotator should be at offset 0x9E8");
		static_assert(offsetof(CS2::server::CFuncRotator, m_vecRotatorQueue) == 0x9F0, "m_vecRotatorQueue in CFuncRotator should be at offset 0x9F0");
		static_assert(offsetof(CS2::server::CFuncRotator, m_vecRotatorQueueHistory) == 0xA08, "m_vecRotatorQueueHistory in CFuncRotator should be at offset 0xA08");
		static_assert(sizeof(CS2::server::CFuncRotator) == 0xA20, "CFuncRotator size should be 0xA20");
	}
}
