// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#ifndef CUSTOM_GLOBAL_TYPES
	#include "../GlobalTypes.hpp"
#else
	#include "../Custom/GlobalTypes.hpp"
#endif


#include "CBaseModelEntity.hpp"
#include "../client/BrushSolidities_e.hpp"





using namespace GlobalTypes;
namespace CS2 {
	namespace server {
		class CFuncBrush : public CS2::server::CBaseModelEntity {
		public:
			client::BrushSolidities_e m_iSolidity; // 0x730 | Schema_DeclaredEnum | Size: 0x4
			int32_t m_iDisabled; // 0x734 | Schema_Builtin | Size: 0x4
			bool m_bSolidBsp; // 0x738 | Schema_Builtin | Size: 0x1
			S2_PAD(0x7);
			GlobalTypes::CUtlSymbolLarge m_iszExcludedClass; // 0x740 | Schema_Atomic | Size: 0x8
			bool m_bInvertExclusion; // 0x748 | Schema_Builtin | Size: 0x1
			bool m_bScriptedMovement; // 0x749 | Schema_Builtin | Size: 0x1
			S2_PAD(0x6); // End padding
		};
#ifdef USE_STATIC_ASSERTS
		static_assert(offsetof(CS2::server::CFuncBrush, m_iSolidity) == 0x730, "m_iSolidity in CFuncBrush should be at offset 0x730");
		static_assert(offsetof(CS2::server::CFuncBrush, m_iDisabled) == 0x734, "m_iDisabled in CFuncBrush should be at offset 0x734");
		static_assert(offsetof(CS2::server::CFuncBrush, m_bSolidBsp) == 0x738, "m_bSolidBsp in CFuncBrush should be at offset 0x738");
		static_assert(offsetof(CS2::server::CFuncBrush, m_iszExcludedClass) == 0x740, "m_iszExcludedClass in CFuncBrush should be at offset 0x740");
		static_assert(offsetof(CS2::server::CFuncBrush, m_bInvertExclusion) == 0x748, "m_bInvertExclusion in CFuncBrush should be at offset 0x748");
		static_assert(offsetof(CS2::server::CFuncBrush, m_bScriptedMovement) == 0x749, "m_bScriptedMovement in CFuncBrush should be at offset 0x749");
		static_assert(sizeof(CS2::server::CFuncBrush) == 0x750, "CFuncBrush size should be 0x750");

#endif
	}
}
