// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#ifndef CUSTOM_GLOBAL_TYPES
	#include "../GlobalTypes.hpp"
#else
	#include "../Custom/GlobalTypes.hpp"
#endif


#include "CBaseModelEntity.hpp"
#include "../entity2/CEntityIOOutput.hpp"





using namespace GlobalTypes;
namespace CS2 {
	namespace server {
		class CFuncRotating : public CS2::server::CBaseModelEntity {
		public:
			entity2::CEntityIOOutput m_OnStopped; // 0x730 | Schema_DeclaredClass | Size: 0x18
			entity2::CEntityIOOutput m_OnStarted; // 0x748 | Schema_DeclaredClass | Size: 0x18
			entity2::CEntityIOOutput m_OnReachedStart; // 0x760 | Schema_DeclaredClass | Size: 0x18
			GlobalTypes::RotationVector m_localRotationVector; // 0x778 | Schema_Atomic | Size: 0xc
			float32 m_flFanFriction; // 0x784 | Schema_Builtin | Size: 0x4
			float32 m_flAttenuation; // 0x788 | Schema_Builtin | Size: 0x4
			float32 m_flVolume; // 0x78c | Schema_Builtin | Size: 0x4
			float32 m_flTargetSpeed; // 0x790 | Schema_Builtin | Size: 0x4
			float32 m_flMaxSpeed; // 0x794 | Schema_Builtin | Size: 0x4
			float32 m_flBlockDamage; // 0x798 | Schema_Builtin | Size: 0x4
			S2_PAD(0x4);
			GlobalTypes::CUtlSymbolLarge m_NoiseRunning; // 0x7a0 | Schema_Atomic | Size: 0x8
			bool m_bReversed; // 0x7a8 | Schema_Builtin | Size: 0x1
			bool m_bAccelDecel; // 0x7a9 | Schema_Builtin | Size: 0x1
			S2_PAD(0x16);
			GlobalTypes::QAngle m_prevLocalAngles; // 0x7c0 | Schema_Atomic | Size: 0xc
			GlobalTypes::QAngle m_angStart; // 0x7cc | Schema_Atomic | Size: 0xc
			bool m_bStopAtStartPos; // 0x7d8 | Schema_Builtin | Size: 0x1
			S2_PAD(0x3);
			GlobalTypes::Vector m_vecClientOrigin; // 0x7dc | Schema_Atomic | Size: 0xc
			GlobalTypes::QAngle m_vecClientAngles; // 0x7e8 | Schema_Atomic | Size: 0xc
			S2_PAD(0x4); // End padding
		};
		static_assert(offsetof(CS2::server::CFuncRotating, m_OnStopped) == 0x730, "m_OnStopped in CFuncRotating should be at offset 0x730");
		static_assert(offsetof(CS2::server::CFuncRotating, m_OnStarted) == 0x748, "m_OnStarted in CFuncRotating should be at offset 0x748");
		static_assert(offsetof(CS2::server::CFuncRotating, m_OnReachedStart) == 0x760, "m_OnReachedStart in CFuncRotating should be at offset 0x760");
		static_assert(offsetof(CS2::server::CFuncRotating, m_localRotationVector) == 0x778, "m_localRotationVector in CFuncRotating should be at offset 0x778");
		static_assert(offsetof(CS2::server::CFuncRotating, m_flFanFriction) == 0x784, "m_flFanFriction in CFuncRotating should be at offset 0x784");
		static_assert(offsetof(CS2::server::CFuncRotating, m_flAttenuation) == 0x788, "m_flAttenuation in CFuncRotating should be at offset 0x788");
		static_assert(offsetof(CS2::server::CFuncRotating, m_flVolume) == 0x78C, "m_flVolume in CFuncRotating should be at offset 0x78C");
		static_assert(offsetof(CS2::server::CFuncRotating, m_flTargetSpeed) == 0x790, "m_flTargetSpeed in CFuncRotating should be at offset 0x790");
		static_assert(offsetof(CS2::server::CFuncRotating, m_flMaxSpeed) == 0x794, "m_flMaxSpeed in CFuncRotating should be at offset 0x794");
		static_assert(offsetof(CS2::server::CFuncRotating, m_flBlockDamage) == 0x798, "m_flBlockDamage in CFuncRotating should be at offset 0x798");
		static_assert(offsetof(CS2::server::CFuncRotating, m_NoiseRunning) == 0x7A0, "m_NoiseRunning in CFuncRotating should be at offset 0x7A0");
		static_assert(offsetof(CS2::server::CFuncRotating, m_bReversed) == 0x7A8, "m_bReversed in CFuncRotating should be at offset 0x7A8");
		static_assert(offsetof(CS2::server::CFuncRotating, m_bAccelDecel) == 0x7A9, "m_bAccelDecel in CFuncRotating should be at offset 0x7A9");
		static_assert(offsetof(CS2::server::CFuncRotating, m_prevLocalAngles) == 0x7C0, "m_prevLocalAngles in CFuncRotating should be at offset 0x7C0");
		static_assert(offsetof(CS2::server::CFuncRotating, m_angStart) == 0x7CC, "m_angStart in CFuncRotating should be at offset 0x7CC");
		static_assert(offsetof(CS2::server::CFuncRotating, m_bStopAtStartPos) == 0x7D8, "m_bStopAtStartPos in CFuncRotating should be at offset 0x7D8");
		static_assert(offsetof(CS2::server::CFuncRotating, m_vecClientOrigin) == 0x7DC, "m_vecClientOrigin in CFuncRotating should be at offset 0x7DC");
		static_assert(offsetof(CS2::server::CFuncRotating, m_vecClientAngles) == 0x7E8, "m_vecClientAngles in CFuncRotating should be at offset 0x7E8");
		static_assert(sizeof(CS2::server::CFuncRotating) == 0x7F8, "CFuncRotating size should be 0x7F8");
	}
}
