// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#include <SDK/GlobalTypes.hpp>

#include <SDK/server/CBaseModelEntity.hpp>
#include <SDK/entity2/CEntityIOOutput.hpp>



namespace CS2 {
	namespace server {
		class CFuncLadder : public CS2::server::CBaseModelEntity {
		public:
			GlobalTypes::Vector m_vecLadderDir; // 0x7e8 | Schema_Atomic | Size: 0xc
			S2_PAD(0x4);
			// server::CUtlVector< server.dll::CHandle< CInfoLadderDismount > > m_Dismounts; // 0x7f8 | Schema_Atomic | Size: 0x18
			char  m_Dismounts[0x18]; // 0x7f8 | Schema_Atomic | Size: 0x18
			GlobalTypes::Vector m_vecLocalTop; // 0x810 | Schema_Atomic | Size: 0xc
			GlobalTypes::Vector m_vecPlayerMountPositionTop; // 0x81c | Schema_Atomic | Size: 0xc
			GlobalTypes::Vector m_vecPlayerMountPositionBottom; // 0x828 | Schema_Atomic | Size: 0xc
			float32 m_flAutoRideSpeed; // 0x834 | Schema_Builtin | Size: 0x4
			bool m_bDisabled; // 0x838 | Schema_Builtin | Size: 0x1
			bool m_bFakeLadder; // 0x839 | Schema_Builtin | Size: 0x1
			bool m_bHasSlack; // 0x83a | Schema_Builtin | Size: 0x1
			S2_PAD(0x5);
			GlobalTypes::CUtlSymbolLarge m_surfacePropName; // 0x840 | Schema_Atomic | Size: 0x8
			entity2::CEntityIOOutput m_OnPlayerGotOnLadder; // 0x848 | Schema_DeclaredClass | Size: 0x28
			entity2::CEntityIOOutput m_OnPlayerGotOffLadder; // 0x870 | Schema_DeclaredClass | Size: 0x28
		};
		static_assert(offsetof(CS2::server::CFuncLadder, m_vecLadderDir) == 0x7E8, "m_vecLadderDir in CFuncLadder should be at offset 0x7E8");
		static_assert(offsetof(CS2::server::CFuncLadder, m_Dismounts) == 0x7F8, "m_Dismounts in CFuncLadder should be at offset 0x7F8");
		static_assert(offsetof(CS2::server::CFuncLadder, m_vecLocalTop) == 0x810, "m_vecLocalTop in CFuncLadder should be at offset 0x810");
		static_assert(offsetof(CS2::server::CFuncLadder, m_vecPlayerMountPositionTop) == 0x81C, "m_vecPlayerMountPositionTop in CFuncLadder should be at offset 0x81C");
		static_assert(offsetof(CS2::server::CFuncLadder, m_vecPlayerMountPositionBottom) == 0x828, "m_vecPlayerMountPositionBottom in CFuncLadder should be at offset 0x828");
		static_assert(offsetof(CS2::server::CFuncLadder, m_flAutoRideSpeed) == 0x834, "m_flAutoRideSpeed in CFuncLadder should be at offset 0x834");
		static_assert(offsetof(CS2::server::CFuncLadder, m_bDisabled) == 0x838, "m_bDisabled in CFuncLadder should be at offset 0x838");
		static_assert(offsetof(CS2::server::CFuncLadder, m_bFakeLadder) == 0x839, "m_bFakeLadder in CFuncLadder should be at offset 0x839");
		static_assert(offsetof(CS2::server::CFuncLadder, m_bHasSlack) == 0x83A, "m_bHasSlack in CFuncLadder should be at offset 0x83A");
		static_assert(offsetof(CS2::server::CFuncLadder, m_surfacePropName) == 0x840, "m_surfacePropName in CFuncLadder should be at offset 0x840");
		static_assert(offsetof(CS2::server::CFuncLadder, m_OnPlayerGotOnLadder) == 0x848, "m_OnPlayerGotOnLadder in CFuncLadder should be at offset 0x848");
		static_assert(offsetof(CS2::server::CFuncLadder, m_OnPlayerGotOffLadder) == 0x870, "m_OnPlayerGotOffLadder in CFuncLadder should be at offset 0x870");
		static_assert(sizeof(CS2::server::CFuncLadder) == 0x898, "CFuncLadder size should be 0x898");
	}
}
