// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#ifndef CUSTOM_GLOBAL_TYPES
	#include <SDK/GlobalTypes.hpp>
#else
	#include <Custom/GlobalTypes.hpp>
#endif


#include <SDK/server/CBaseModelEntity.hpp>
#include <SDK/entity2/GameTime_t.hpp>
#include <SDK/entity2/CEntityIOOutput.hpp>





using namespace GlobalTypes;
namespace CS2 {
	namespace server {
		class CFuncShatterglass : public CS2::server::CBaseModelEntity {
		public:
			GlobalTypes::matrix3x4_t m_matPanelTransform; // 0x730 | Schema_Atomic | Size: 0x30
			GlobalTypes::matrix3x4_t m_matPanelTransformWsTemp; // 0x760 | Schema_Atomic | Size: 0x30
			GlobalTypes::CUtlVector< uint32 > m_vecShatterGlassShards; // 0x790 | Schema_Atomic | Size: 0x18
			// char m_vecShatterGlassShards[0x18]; // 0x790 | Schema_Atomic | Size: 0x18
			GlobalTypes::Vector2D m_PanelSize; // 0x7a8 | Schema_Atomic | Size: 0x8
			entity2::GameTime_t m_flLastShatterSoundEmitTime; // 0x7b0 | Schema_DeclaredClass | Size: 0x4
			entity2::GameTime_t m_flLastCleanupTime; // 0x7b4 | Schema_DeclaredClass | Size: 0x4
			entity2::GameTime_t m_flInitAtTime; // 0x7b8 | Schema_DeclaredClass | Size: 0x4
			float32 m_flGlassThickness; // 0x7bc | Schema_Builtin | Size: 0x4
			float32 m_flSpawnInvulnerability; // 0x7c0 | Schema_Builtin | Size: 0x4
			bool m_bBreakSilent; // 0x7c4 | Schema_Builtin | Size: 0x1
			bool m_bBreakShardless; // 0x7c5 | Schema_Builtin | Size: 0x1
			bool m_bBroken; // 0x7c6 | Schema_Builtin | Size: 0x1
			bool m_bGlassNavIgnore; // 0x7c7 | Schema_Builtin | Size: 0x1
			bool m_bGlassInFrame; // 0x7c8 | Schema_Builtin | Size: 0x1
			bool m_bStartBroken; // 0x7c9 | Schema_Builtin | Size: 0x1
			uint8_t m_iInitialDamageType; // 0x7ca | Schema_Builtin | Size: 0x1
			S2_PAD(0x5);
			GlobalTypes::CUtlSymbolLarge m_szDamagePositioningEntityName01; // 0x7d0 | Schema_Atomic | Size: 0x8
			GlobalTypes::CUtlSymbolLarge m_szDamagePositioningEntityName02; // 0x7d8 | Schema_Atomic | Size: 0x8
			GlobalTypes::CUtlSymbolLarge m_szDamagePositioningEntityName03; // 0x7e0 | Schema_Atomic | Size: 0x8
			GlobalTypes::CUtlSymbolLarge m_szDamagePositioningEntityName04; // 0x7e8 | Schema_Atomic | Size: 0x8
			GlobalTypes::CUtlVector<GlobalTypes::Vector> m_vInitialDamagePositions; // 0x7f0 | Schema_Atomic | Size: 0x18
			// char m_vInitialDamagePositions[0x18]; // 0x7f0 | Schema_Atomic | Size: 0x18
			GlobalTypes::CUtlVector<GlobalTypes::Vector> m_vExtraDamagePositions; // 0x808 | Schema_Atomic | Size: 0x18
			// char m_vExtraDamagePositions[0x18]; // 0x808 | Schema_Atomic | Size: 0x18
			GlobalTypes::CUtlVector<GlobalTypes::Vector4D> m_vInitialPanelVertices; // 0x820 | Schema_Atomic | Size: 0x18
			// char m_vInitialPanelVertices[0x18]; // 0x820 | Schema_Atomic | Size: 0x18
			entity2::CEntityIOOutput m_OnBroken; // 0x838 | Schema_DeclaredClass | Size: 0x18
			uint8_t m_iSurfaceType; // 0x850 | Schema_Builtin | Size: 0x1
			S2_PAD(0x7);
			// GlobalTypes::CStrongHandle<resourcesystem::InfoForResourceTypeIMaterial2> m_hMaterialDamageBase; // 0x858 | Schema_Atomic | Size: 0x8
			char m_hMaterialDamageBase[0x8]; // 0x858 | Schema_Atomic | Size: 0x8
		};
		static_assert(offsetof(CS2::server::CFuncShatterglass, m_matPanelTransform) == 0x730, "m_matPanelTransform in CFuncShatterglass should be at offset 0x730");
		static_assert(offsetof(CS2::server::CFuncShatterglass, m_matPanelTransformWsTemp) == 0x760, "m_matPanelTransformWsTemp in CFuncShatterglass should be at offset 0x760");
		static_assert(offsetof(CS2::server::CFuncShatterglass, m_vecShatterGlassShards) == 0x790, "m_vecShatterGlassShards in CFuncShatterglass should be at offset 0x790");
		static_assert(offsetof(CS2::server::CFuncShatterglass, m_PanelSize) == 0x7A8, "m_PanelSize in CFuncShatterglass should be at offset 0x7A8");
		static_assert(offsetof(CS2::server::CFuncShatterglass, m_flLastShatterSoundEmitTime) == 0x7B0, "m_flLastShatterSoundEmitTime in CFuncShatterglass should be at offset 0x7B0");
		static_assert(offsetof(CS2::server::CFuncShatterglass, m_flLastCleanupTime) == 0x7B4, "m_flLastCleanupTime in CFuncShatterglass should be at offset 0x7B4");
		static_assert(offsetof(CS2::server::CFuncShatterglass, m_flInitAtTime) == 0x7B8, "m_flInitAtTime in CFuncShatterglass should be at offset 0x7B8");
		static_assert(offsetof(CS2::server::CFuncShatterglass, m_flGlassThickness) == 0x7BC, "m_flGlassThickness in CFuncShatterglass should be at offset 0x7BC");
		static_assert(offsetof(CS2::server::CFuncShatterglass, m_flSpawnInvulnerability) == 0x7C0, "m_flSpawnInvulnerability in CFuncShatterglass should be at offset 0x7C0");
		static_assert(offsetof(CS2::server::CFuncShatterglass, m_bBreakSilent) == 0x7C4, "m_bBreakSilent in CFuncShatterglass should be at offset 0x7C4");
		static_assert(offsetof(CS2::server::CFuncShatterglass, m_bBreakShardless) == 0x7C5, "m_bBreakShardless in CFuncShatterglass should be at offset 0x7C5");
		static_assert(offsetof(CS2::server::CFuncShatterglass, m_bBroken) == 0x7C6, "m_bBroken in CFuncShatterglass should be at offset 0x7C6");
		static_assert(offsetof(CS2::server::CFuncShatterglass, m_bGlassNavIgnore) == 0x7C7, "m_bGlassNavIgnore in CFuncShatterglass should be at offset 0x7C7");
		static_assert(offsetof(CS2::server::CFuncShatterglass, m_bGlassInFrame) == 0x7C8, "m_bGlassInFrame in CFuncShatterglass should be at offset 0x7C8");
		static_assert(offsetof(CS2::server::CFuncShatterglass, m_bStartBroken) == 0x7C9, "m_bStartBroken in CFuncShatterglass should be at offset 0x7C9");
		static_assert(offsetof(CS2::server::CFuncShatterglass, m_iInitialDamageType) == 0x7CA, "m_iInitialDamageType in CFuncShatterglass should be at offset 0x7CA");
		static_assert(offsetof(CS2::server::CFuncShatterglass, m_szDamagePositioningEntityName01) == 0x7D0, "m_szDamagePositioningEntityName01 in CFuncShatterglass should be at offset 0x7D0");
		static_assert(offsetof(CS2::server::CFuncShatterglass, m_szDamagePositioningEntityName02) == 0x7D8, "m_szDamagePositioningEntityName02 in CFuncShatterglass should be at offset 0x7D8");
		static_assert(offsetof(CS2::server::CFuncShatterglass, m_szDamagePositioningEntityName03) == 0x7E0, "m_szDamagePositioningEntityName03 in CFuncShatterglass should be at offset 0x7E0");
		static_assert(offsetof(CS2::server::CFuncShatterglass, m_szDamagePositioningEntityName04) == 0x7E8, "m_szDamagePositioningEntityName04 in CFuncShatterglass should be at offset 0x7E8");
		static_assert(offsetof(CS2::server::CFuncShatterglass, m_vInitialDamagePositions) == 0x7F0, "m_vInitialDamagePositions in CFuncShatterglass should be at offset 0x7F0");
		static_assert(offsetof(CS2::server::CFuncShatterglass, m_vExtraDamagePositions) == 0x808, "m_vExtraDamagePositions in CFuncShatterglass should be at offset 0x808");
		static_assert(offsetof(CS2::server::CFuncShatterglass, m_vInitialPanelVertices) == 0x820, "m_vInitialPanelVertices in CFuncShatterglass should be at offset 0x820");
		static_assert(offsetof(CS2::server::CFuncShatterglass, m_OnBroken) == 0x838, "m_OnBroken in CFuncShatterglass should be at offset 0x838");
		static_assert(offsetof(CS2::server::CFuncShatterglass, m_iSurfaceType) == 0x850, "m_iSurfaceType in CFuncShatterglass should be at offset 0x850");
		static_assert(offsetof(CS2::server::CFuncShatterglass, m_hMaterialDamageBase) == 0x858, "m_hMaterialDamageBase in CFuncShatterglass should be at offset 0x858");
		static_assert(sizeof(CS2::server::CFuncShatterglass) == 0x860, "CFuncShatterglass size should be 0x860");
	}
}
