// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#include <SDK/GlobalTypes.hpp>

#include <SDK/server/CBaseToggle.hpp>
#include <SDK/server/MoveLinearAuthoredPos_t.hpp>
#include <SDK/entity2/CEntityIOOutput.hpp>



namespace CS2 {
	namespace server {
		class CFuncMoveLinear : public CS2::server::CBaseToggle {
		public:
			server::MoveLinearAuthoredPos_t m_authoredPosition; // 0x868 | Schema_DeclaredEnum | Size: 0x4
			GlobalTypes::QAngle m_angMoveEntitySpace; // 0x86c | Schema_Atomic | Size: 0xc
			GlobalTypes::Vector m_vecMoveDirParentSpace; // 0x878 | Schema_Atomic | Size: 0xc
			S2_PAD(0x4);
			GlobalTypes::CUtlSymbolLarge m_soundStart; // 0x888 | Schema_Atomic | Size: 0x8
			GlobalTypes::CUtlSymbolLarge m_soundStop; // 0x890 | Schema_Atomic | Size: 0x8
			GlobalTypes::CUtlSymbolLarge m_currentSound; // 0x898 | Schema_Atomic | Size: 0x8
			float32 m_flBlockDamage; // 0x8a0 | Schema_Builtin | Size: 0x4
			float32 m_flStartPosition; // 0x8a4 | Schema_Builtin | Size: 0x4
			S2_PAD(0x8);
			entity2::CEntityIOOutput m_OnFullyOpen; // 0x8b0 | Schema_DeclaredClass | Size: 0x28
			entity2::CEntityIOOutput m_OnFullyClosed; // 0x8d8 | Schema_DeclaredClass | Size: 0x28
			bool m_bCreateMovableNavMesh; // 0x900 | Schema_Builtin | Size: 0x1
			bool m_bAllowMovableNavMeshDockingOnEntireEntity; // 0x901 | Schema_Builtin | Size: 0x1
			bool m_bCreateNavObstacle; // 0x902 | Schema_Builtin | Size: 0x1
			S2_PAD(0xd); // End padding
		};
		static_assert(offsetof(CS2::server::CFuncMoveLinear, m_authoredPosition) == 0x868, "m_authoredPosition in CFuncMoveLinear should be at offset 0x868");
		static_assert(offsetof(CS2::server::CFuncMoveLinear, m_angMoveEntitySpace) == 0x86C, "m_angMoveEntitySpace in CFuncMoveLinear should be at offset 0x86C");
		static_assert(offsetof(CS2::server::CFuncMoveLinear, m_vecMoveDirParentSpace) == 0x878, "m_vecMoveDirParentSpace in CFuncMoveLinear should be at offset 0x878");
		static_assert(offsetof(CS2::server::CFuncMoveLinear, m_soundStart) == 0x888, "m_soundStart in CFuncMoveLinear should be at offset 0x888");
		static_assert(offsetof(CS2::server::CFuncMoveLinear, m_soundStop) == 0x890, "m_soundStop in CFuncMoveLinear should be at offset 0x890");
		static_assert(offsetof(CS2::server::CFuncMoveLinear, m_currentSound) == 0x898, "m_currentSound in CFuncMoveLinear should be at offset 0x898");
		static_assert(offsetof(CS2::server::CFuncMoveLinear, m_flBlockDamage) == 0x8A0, "m_flBlockDamage in CFuncMoveLinear should be at offset 0x8A0");
		static_assert(offsetof(CS2::server::CFuncMoveLinear, m_flStartPosition) == 0x8A4, "m_flStartPosition in CFuncMoveLinear should be at offset 0x8A4");
		static_assert(offsetof(CS2::server::CFuncMoveLinear, m_OnFullyOpen) == 0x8B0, "m_OnFullyOpen in CFuncMoveLinear should be at offset 0x8B0");
		static_assert(offsetof(CS2::server::CFuncMoveLinear, m_OnFullyClosed) == 0x8D8, "m_OnFullyClosed in CFuncMoveLinear should be at offset 0x8D8");
		static_assert(offsetof(CS2::server::CFuncMoveLinear, m_bCreateMovableNavMesh) == 0x900, "m_bCreateMovableNavMesh in CFuncMoveLinear should be at offset 0x900");
		static_assert(offsetof(CS2::server::CFuncMoveLinear, m_bAllowMovableNavMeshDockingOnEntireEntity) == 0x901, "m_bAllowMovableNavMeshDockingOnEntireEntity in CFuncMoveLinear should be at offset 0x901");
		static_assert(offsetof(CS2::server::CFuncMoveLinear, m_bCreateNavObstacle) == 0x902, "m_bCreateNavObstacle in CFuncMoveLinear should be at offset 0x902");
		static_assert(sizeof(CS2::server::CFuncMoveLinear) == 0x910, "CFuncMoveLinear size should be 0x910");
	}
}
