// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#ifndef CUSTOM_GLOBAL_TYPES
	#include <SDK/GlobalTypes.hpp>
#else
	#include <Custom/GlobalTypes.hpp>
#endif


#include <SDK/server/CBaseToggle.hpp>
#include <SDK/server/MoveLinearAuthoredPos_t.hpp>
#include <SDK/entity2/CEntityIOOutput.hpp>





using namespace GlobalTypes;
namespace CS2 {
	namespace server {
		class CFuncMoveLinear : public CS2::server::CBaseToggle {
		public:
			server::MoveLinearAuthoredPos_t m_authoredPosition; // 0x7b0 | Schema_DeclaredEnum | Size: 0x4
			GlobalTypes::QAngle m_angMoveEntitySpace; // 0x7b4 | Schema_Atomic | Size: 0xc
			GlobalTypes::Vector m_vecMoveDirParentSpace; // 0x7c0 | Schema_Atomic | Size: 0xc
			S2_PAD(0x4);
			GlobalTypes::CUtlSymbolLarge m_soundStart; // 0x7d0 | Schema_Atomic | Size: 0x8
			GlobalTypes::CUtlSymbolLarge m_soundStop; // 0x7d8 | Schema_Atomic | Size: 0x8
			GlobalTypes::CUtlSymbolLarge m_currentSound; // 0x7e0 | Schema_Atomic | Size: 0x8
			float32 m_flBlockDamage; // 0x7e8 | Schema_Builtin | Size: 0x4
			float32 m_flStartPosition; // 0x7ec | Schema_Builtin | Size: 0x4
			S2_PAD(0x8);
			entity2::CEntityIOOutput m_OnFullyOpen; // 0x7f8 | Schema_DeclaredClass | Size: 0x18
			entity2::CEntityIOOutput m_OnFullyClosed; // 0x810 | Schema_DeclaredClass | Size: 0x18
			bool m_bCreateMovableNavMesh; // 0x828 | Schema_Builtin | Size: 0x1
			bool m_bAllowMovableNavMeshDockingOnEntireEntity; // 0x829 | Schema_Builtin | Size: 0x1
			bool m_bCreateNavObstacle; // 0x82a | Schema_Builtin | Size: 0x1
			S2_PAD(0xd); // End padding
		};
		static_assert(offsetof(CS2::server::CFuncMoveLinear, m_authoredPosition) == 0x7B0, "m_authoredPosition in CFuncMoveLinear should be at offset 0x7B0");
		static_assert(offsetof(CS2::server::CFuncMoveLinear, m_angMoveEntitySpace) == 0x7B4, "m_angMoveEntitySpace in CFuncMoveLinear should be at offset 0x7B4");
		static_assert(offsetof(CS2::server::CFuncMoveLinear, m_vecMoveDirParentSpace) == 0x7C0, "m_vecMoveDirParentSpace in CFuncMoveLinear should be at offset 0x7C0");
		static_assert(offsetof(CS2::server::CFuncMoveLinear, m_soundStart) == 0x7D0, "m_soundStart in CFuncMoveLinear should be at offset 0x7D0");
		static_assert(offsetof(CS2::server::CFuncMoveLinear, m_soundStop) == 0x7D8, "m_soundStop in CFuncMoveLinear should be at offset 0x7D8");
		static_assert(offsetof(CS2::server::CFuncMoveLinear, m_currentSound) == 0x7E0, "m_currentSound in CFuncMoveLinear should be at offset 0x7E0");
		static_assert(offsetof(CS2::server::CFuncMoveLinear, m_flBlockDamage) == 0x7E8, "m_flBlockDamage in CFuncMoveLinear should be at offset 0x7E8");
		static_assert(offsetof(CS2::server::CFuncMoveLinear, m_flStartPosition) == 0x7EC, "m_flStartPosition in CFuncMoveLinear should be at offset 0x7EC");
		static_assert(offsetof(CS2::server::CFuncMoveLinear, m_OnFullyOpen) == 0x7F8, "m_OnFullyOpen in CFuncMoveLinear should be at offset 0x7F8");
		static_assert(offsetof(CS2::server::CFuncMoveLinear, m_OnFullyClosed) == 0x810, "m_OnFullyClosed in CFuncMoveLinear should be at offset 0x810");
		static_assert(offsetof(CS2::server::CFuncMoveLinear, m_bCreateMovableNavMesh) == 0x828, "m_bCreateMovableNavMesh in CFuncMoveLinear should be at offset 0x828");
		static_assert(offsetof(CS2::server::CFuncMoveLinear, m_bAllowMovableNavMeshDockingOnEntireEntity) == 0x829, "m_bAllowMovableNavMeshDockingOnEntireEntity in CFuncMoveLinear should be at offset 0x829");
		static_assert(offsetof(CS2::server::CFuncMoveLinear, m_bCreateNavObstacle) == 0x82A, "m_bCreateNavObstacle in CFuncMoveLinear should be at offset 0x82A");
		static_assert(sizeof(CS2::server::CFuncMoveLinear) == 0x838, "CFuncMoveLinear size should be 0x838");
	}
}
