// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#include <SDK/GlobalTypes.hpp>

#include <SDK/server/CRulePointEntity.hpp>
#include <SDK/entity2/CEntityIOOutput.hpp>



namespace CS2 {
	namespace server {
		class CGameMoney : public CS2::server::CRulePointEntity {
		public:
			public:
			entity2::CEntityIOOutput m_OnMoneySpent; // 0x7f8 | Schema_DeclaredClass | Size: 0x28
			entity2::CEntityIOOutput m_OnMoneySpentFail; // 0x820 | Schema_DeclaredClass | Size: 0x28
			int32_t m_nMoney; // 0x848 | Schema_Builtin | Size: 0x4
			S2_PAD(0x4);
			GlobalTypes::CUtlString m_strAwardText; // 0x850 | Schema_Atomic | Size: 0x8
		};
		static_assert(offsetof(CS2::server::CGameMoney, m_OnMoneySpent) == 0x7F8, "m_OnMoneySpent in CGameMoney should be at offset 0x7F8");
		static_assert(offsetof(CS2::server::CGameMoney, m_OnMoneySpentFail) == 0x820, "m_OnMoneySpentFail in CGameMoney should be at offset 0x820");
		static_assert(offsetof(CS2::server::CGameMoney, m_nMoney) == 0x848, "m_nMoney in CGameMoney should be at offset 0x848");
		static_assert(offsetof(CS2::server::CGameMoney, m_strAwardText) == 0x850, "m_strAwardText in CGameMoney should be at offset 0x850");
		static_assert(sizeof(CS2::server::CGameMoney) == 0x858, "CGameMoney size should be 0x858");
	}
}
