// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#include <SDK/GlobalTypes.hpp>

#include <SDK/server/CRuleBrushEntity.hpp>
#include <SDK/entity2/CEntityIOOutput.hpp>



namespace CS2 {
	namespace server {
		class CGamePlayerZone : public CS2::server::CRuleBrushEntity {
		public:
			entity2::CEntityIOOutput m_OnPlayerInZone; // 0x7f8 | Schema_DeclaredClass | Size: 0x28
			entity2::CEntityIOOutput m_OnPlayerOutZone; // 0x820 | Schema_DeclaredClass | Size: 0x28
			// GlobalTypes::CEntityOutputTemplate< int32 > m_PlayersInCount; // 0x848 | Schema_Atomic | Size: 0x28
			char  m_PlayersInCount[0x28]; // 0x848 | Schema_Atomic | Size: 0x28
			// GlobalTypes::CEntityOutputTemplate< int32 > m_PlayersOutCount; // 0x870 | Schema_Atomic | Size: 0x28
			char  m_PlayersOutCount[0x28]; // 0x870 | Schema_Atomic | Size: 0x28
		};
		static_assert(offsetof(CS2::server::CGamePlayerZone, m_OnPlayerInZone) == 0x7F8, "m_OnPlayerInZone in CGamePlayerZone should be at offset 0x7F8");
		static_assert(offsetof(CS2::server::CGamePlayerZone, m_OnPlayerOutZone) == 0x820, "m_OnPlayerOutZone in CGamePlayerZone should be at offset 0x820");
		static_assert(offsetof(CS2::server::CGamePlayerZone, m_PlayersInCount) == 0x848, "m_PlayersInCount in CGamePlayerZone should be at offset 0x848");
		static_assert(offsetof(CS2::server::CGamePlayerZone, m_PlayersOutCount) == 0x870, "m_PlayersOutCount in CGamePlayerZone should be at offset 0x870");
		static_assert(sizeof(CS2::server::CGamePlayerZone) == 0x898, "CGamePlayerZone size should be 0x898");
	}
}
