// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#ifndef CUSTOM_GLOBAL_TYPES
	#include <SDK/GlobalTypes.hpp>
#else
	#include <Custom/GlobalTypes.hpp>
#endif


#include <SDK/server/CBaseEntity.hpp>





using namespace GlobalTypes;
namespace CS2 {
	namespace server {
		class CGameGibManager : public CS2::server::CBaseEntity {
		public:
			S2_PAD(0x18);
			bool m_bAllowNewGibs; // 0x4c0 | Schema_Builtin | Size: 0x1
			S2_PAD(0x3);
			int32_t m_iCurrentMaxPieces; // 0x4c4 | Schema_Builtin | Size: 0x4
			int32_t m_iMaxPieces; // 0x4c8 | Schema_Builtin | Size: 0x4
			int32_t m_iLastFrame; // 0x4cc | Schema_Builtin | Size: 0x4
		};
		static_assert(offsetof(CS2::server::CGameGibManager, m_bAllowNewGibs) == 0x4C0, "m_bAllowNewGibs in CGameGibManager should be at offset 0x4C0");
		static_assert(offsetof(CS2::server::CGameGibManager, m_iCurrentMaxPieces) == 0x4C4, "m_iCurrentMaxPieces in CGameGibManager should be at offset 0x4C4");
		static_assert(offsetof(CS2::server::CGameGibManager, m_iMaxPieces) == 0x4C8, "m_iMaxPieces in CGameGibManager should be at offset 0x4C8");
		static_assert(offsetof(CS2::server::CGameGibManager, m_iLastFrame) == 0x4CC, "m_iLastFrame in CGameGibManager should be at offset 0x4CC");
		static_assert(sizeof(CS2::server::CGameGibManager) == 0x4D0, "CGameGibManager size should be 0x4D0");
	}
}
