// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#include <SDK/GlobalTypes.hpp>

#include <SDK/server/CBaseModelEntity.hpp>
#include <SDK/navlib/Extent.hpp>
#include <SDK/server/CountdownTimer.hpp>
#include <SDK/server/IntervalTimer.hpp>



namespace CS2 {
	namespace server {
		class CInferno : public CS2::server::CBaseModelEntity {
		public:
			GlobalTypes::Vector m_firePositions[64]; // 0x7e8 | Schema_FixedArray | Size: 0x300
			GlobalTypes::Vector m_fireParentPositions[64]; // 0xae8 | Schema_FixedArray | Size: 0x300
			bool m_bFireIsBurning[64]; // 0xde8 | Schema_FixedArray | Size: 0x40
			GlobalTypes::Vector m_BurnNormal[64]; // 0xe28 | Schema_FixedArray | Size: 0x300
			int32_t m_fireCount; // 0x1128 | Schema_Builtin | Size: 0x4
			int32_t m_nInfernoType; // 0x112c | Schema_Builtin | Size: 0x4
			int32_t m_nFireEffectTickBegin; // 0x1130 | Schema_Builtin | Size: 0x4
			float32 m_nFireLifetime; // 0x1134 | Schema_Builtin | Size: 0x4
			bool m_bInPostEffectTime; // 0x1138 | Schema_Builtin | Size: 0x1
			bool m_bWasCreatedInSmoke; // 0x1139 | Schema_Builtin | Size: 0x1
			S2_PAD(0x206);
			navlib::Extent m_extent; // 0x1340 | Schema_DeclaredClass | Size: 0x18
			server::CountdownTimer m_damageTimer; // 0x1358 | Schema_DeclaredClass | Size: 0x18
			server::CountdownTimer m_damageRampTimer; // 0x1370 | Schema_DeclaredClass | Size: 0x18
			GlobalTypes::Vector m_splashVelocity; // 0x1388 | Schema_Atomic | Size: 0xc
			GlobalTypes::Vector m_InitialSplashVelocity; // 0x1394 | Schema_Atomic | Size: 0xc
			GlobalTypes::Vector m_startPos; // 0x13a0 | Schema_Atomic | Size: 0xc
			GlobalTypes::Vector m_vecOriginalSpawnLocation; // 0x13ac | Schema_Atomic | Size: 0xc
			server::IntervalTimer m_activeTimer; // 0x13b8 | Schema_DeclaredClass | Size: 0x10
			int32_t m_fireSpawnOffset; // 0x13c8 | Schema_Builtin | Size: 0x4
			int32_t m_nMaxFlames; // 0x13cc | Schema_Builtin | Size: 0x4
			int32_t m_nSpreadCount; // 0x13d0 | Schema_Builtin | Size: 0x4
			S2_PAD(0x4);
			server::CountdownTimer m_BookkeepingTimer; // 0x13d8 | Schema_DeclaredClass | Size: 0x18
			server::CountdownTimer m_NextSpreadTimer; // 0x13f0 | Schema_DeclaredClass | Size: 0x18
			uint16_t m_nSourceItemDefIndex; // 0x1408 | Schema_Builtin | Size: 0x2
			S2_PAD(0x66); // End padding
		};
		static_assert(offsetof(CS2::server::CInferno, m_firePositions) == 0x7E8, "m_firePositions in CInferno should be at offset 0x7E8");
		static_assert(offsetof(CS2::server::CInferno, m_fireParentPositions) == 0xAE8, "m_fireParentPositions in CInferno should be at offset 0xAE8");
		static_assert(offsetof(CS2::server::CInferno, m_bFireIsBurning) == 0xDE8, "m_bFireIsBurning in CInferno should be at offset 0xDE8");
		static_assert(offsetof(CS2::server::CInferno, m_BurnNormal) == 0xE28, "m_BurnNormal in CInferno should be at offset 0xE28");
		static_assert(offsetof(CS2::server::CInferno, m_fireCount) == 0x1128, "m_fireCount in CInferno should be at offset 0x1128");
		static_assert(offsetof(CS2::server::CInferno, m_nInfernoType) == 0x112C, "m_nInfernoType in CInferno should be at offset 0x112C");
		static_assert(offsetof(CS2::server::CInferno, m_nFireEffectTickBegin) == 0x1130, "m_nFireEffectTickBegin in CInferno should be at offset 0x1130");
		static_assert(offsetof(CS2::server::CInferno, m_nFireLifetime) == 0x1134, "m_nFireLifetime in CInferno should be at offset 0x1134");
		static_assert(offsetof(CS2::server::CInferno, m_bInPostEffectTime) == 0x1138, "m_bInPostEffectTime in CInferno should be at offset 0x1138");
		static_assert(offsetof(CS2::server::CInferno, m_bWasCreatedInSmoke) == 0x1139, "m_bWasCreatedInSmoke in CInferno should be at offset 0x1139");
		static_assert(offsetof(CS2::server::CInferno, m_extent) == 0x1340, "m_extent in CInferno should be at offset 0x1340");
		static_assert(offsetof(CS2::server::CInferno, m_damageTimer) == 0x1358, "m_damageTimer in CInferno should be at offset 0x1358");
		static_assert(offsetof(CS2::server::CInferno, m_damageRampTimer) == 0x1370, "m_damageRampTimer in CInferno should be at offset 0x1370");
		static_assert(offsetof(CS2::server::CInferno, m_splashVelocity) == 0x1388, "m_splashVelocity in CInferno should be at offset 0x1388");
		static_assert(offsetof(CS2::server::CInferno, m_InitialSplashVelocity) == 0x1394, "m_InitialSplashVelocity in CInferno should be at offset 0x1394");
		static_assert(offsetof(CS2::server::CInferno, m_startPos) == 0x13A0, "m_startPos in CInferno should be at offset 0x13A0");
		static_assert(offsetof(CS2::server::CInferno, m_vecOriginalSpawnLocation) == 0x13AC, "m_vecOriginalSpawnLocation in CInferno should be at offset 0x13AC");
		static_assert(offsetof(CS2::server::CInferno, m_activeTimer) == 0x13B8, "m_activeTimer in CInferno should be at offset 0x13B8");
		static_assert(offsetof(CS2::server::CInferno, m_fireSpawnOffset) == 0x13C8, "m_fireSpawnOffset in CInferno should be at offset 0x13C8");
		static_assert(offsetof(CS2::server::CInferno, m_nMaxFlames) == 0x13CC, "m_nMaxFlames in CInferno should be at offset 0x13CC");
		static_assert(offsetof(CS2::server::CInferno, m_nSpreadCount) == 0x13D0, "m_nSpreadCount in CInferno should be at offset 0x13D0");
		static_assert(offsetof(CS2::server::CInferno, m_BookkeepingTimer) == 0x13D8, "m_BookkeepingTimer in CInferno should be at offset 0x13D8");
		static_assert(offsetof(CS2::server::CInferno, m_NextSpreadTimer) == 0x13F0, "m_NextSpreadTimer in CInferno should be at offset 0x13F0");
		static_assert(offsetof(CS2::server::CInferno, m_nSourceItemDefIndex) == 0x1408, "m_nSourceItemDefIndex in CInferno should be at offset 0x1408");
		static_assert(sizeof(CS2::server::CInferno) == 0x1470, "CInferno size should be 0x1470");
	}
}
