// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#ifndef CUSTOM_GLOBAL_TYPES
	#include "../GlobalTypes.hpp"
#else
	#include "../Custom/GlobalTypes.hpp"
#endif


#include "CPointEntity.hpp"
#include "CBaseModelEntity.hpp"





using namespace GlobalTypes;
namespace CS2 {
	namespace server {
		class CInfoOffscreenPanoramaTexture : public CS2::server::CPointEntity {
		public:
			bool m_bDisabled; // 0x4a8 | Schema_Builtin | Size: 0x1
			S2_PAD(0x3);
			int32_t m_nResolutionX; // 0x4ac | Schema_Builtin | Size: 0x4
			int32_t m_nResolutionY; // 0x4b0 | Schema_Builtin | Size: 0x4
			S2_PAD(0x4);
			GlobalTypes::CUtlSymbolLarge m_szPanelType; // 0x4b8 | Schema_Atomic | Size: 0x8
			GlobalTypes::CUtlSymbolLarge m_szLayoutFileName; // 0x4c0 | Schema_Atomic | Size: 0x8
			GlobalTypes::CUtlSymbolLarge m_RenderAttrName; // 0x4c8 | Schema_Atomic | Size: 0x8
			// server::CNetworkUtlVectorBase<GlobalTypes::CHandle<server::CBaseModelEntity>> m_TargetEntities; // 0x4d0 | Schema_Atomic | Size: 0x18
			char m_TargetEntities[0x18]; // 0x4d0 | Schema_Atomic | Size: 0x18
			int32_t m_nTargetChangeCount; // 0x4e8 | Schema_Builtin | Size: 0x4
			S2_PAD(0x4);
			// GlobalTypes::CNetworkUtlVectorBase<GlobalTypes::CUtlSymbolLarge> m_vecCSSClasses; // 0x4f0 | Schema_Atomic | Size: 0x18
			char m_vecCSSClasses[0x18]; // 0x4f0 | Schema_Atomic | Size: 0x18
			GlobalTypes::CUtlSymbolLarge m_szTargetsName; // 0x508 | Schema_Atomic | Size: 0x8
			GlobalTypes::CUtlVector<GlobalTypes::CHandle<server::CBaseModelEntity>> m_AdditionalTargetEntities; // 0x510 | Schema_Atomic | Size: 0x18
			// char m_AdditionalTargetEntities[0x18]; // 0x510 | Schema_Atomic | Size: 0x18
		};
		static_assert(offsetof(CS2::server::CInfoOffscreenPanoramaTexture, m_bDisabled) == 0x4A8, "m_bDisabled in CInfoOffscreenPanoramaTexture should be at offset 0x4A8");
		static_assert(offsetof(CS2::server::CInfoOffscreenPanoramaTexture, m_nResolutionX) == 0x4AC, "m_nResolutionX in CInfoOffscreenPanoramaTexture should be at offset 0x4AC");
		static_assert(offsetof(CS2::server::CInfoOffscreenPanoramaTexture, m_nResolutionY) == 0x4B0, "m_nResolutionY in CInfoOffscreenPanoramaTexture should be at offset 0x4B0");
		static_assert(offsetof(CS2::server::CInfoOffscreenPanoramaTexture, m_szPanelType) == 0x4B8, "m_szPanelType in CInfoOffscreenPanoramaTexture should be at offset 0x4B8");
		static_assert(offsetof(CS2::server::CInfoOffscreenPanoramaTexture, m_szLayoutFileName) == 0x4C0, "m_szLayoutFileName in CInfoOffscreenPanoramaTexture should be at offset 0x4C0");
		static_assert(offsetof(CS2::server::CInfoOffscreenPanoramaTexture, m_RenderAttrName) == 0x4C8, "m_RenderAttrName in CInfoOffscreenPanoramaTexture should be at offset 0x4C8");
		static_assert(offsetof(CS2::server::CInfoOffscreenPanoramaTexture, m_TargetEntities) == 0x4D0, "m_TargetEntities in CInfoOffscreenPanoramaTexture should be at offset 0x4D0");
		static_assert(offsetof(CS2::server::CInfoOffscreenPanoramaTexture, m_nTargetChangeCount) == 0x4E8, "m_nTargetChangeCount in CInfoOffscreenPanoramaTexture should be at offset 0x4E8");
		static_assert(offsetof(CS2::server::CInfoOffscreenPanoramaTexture, m_vecCSSClasses) == 0x4F0, "m_vecCSSClasses in CInfoOffscreenPanoramaTexture should be at offset 0x4F0");
		static_assert(offsetof(CS2::server::CInfoOffscreenPanoramaTexture, m_szTargetsName) == 0x508, "m_szTargetsName in CInfoOffscreenPanoramaTexture should be at offset 0x508");
		static_assert(offsetof(CS2::server::CInfoOffscreenPanoramaTexture, m_AdditionalTargetEntities) == 0x510, "m_AdditionalTargetEntities in CInfoOffscreenPanoramaTexture should be at offset 0x510");
		static_assert(sizeof(CS2::server::CInfoOffscreenPanoramaTexture) == 0x528, "CInfoOffscreenPanoramaTexture size should be 0x528");
	}
}
