// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#include <SDK/GlobalTypes.hpp>

#include <SDK/server/CPointEntity.hpp>



namespace CS2 {
	namespace server {
		class CInfoProjectedDecal : public CS2::server::CPointEntity {
		public:
			// GlobalTypes::CStrongHandle< resourcesystem::InfoForResourceTypeIMaterial2 > m_hMaterial; // 0x4f0 | Schema_Atomic | Size: 0x8
			char  m_hMaterial[0x8]; // 0x4f0 | Schema_Atomic | Size: 0x8
			GlobalTypes::CUtlStringToken m_sSequenceName; // 0x4f8 | Schema_Atomic | Size: 0x4
			float32 m_flDistance; // 0x4fc | Schema_Builtin | Size: 0x4
			bool m_bNotInMultiplayer; // 0x500 | Schema_Builtin | Size: 0x1
			S2_PAD(0x7); // End padding
		};
		static_assert(offsetof(CS2::server::CInfoProjectedDecal, m_hMaterial) == 0x4F0, "m_hMaterial in CInfoProjectedDecal should be at offset 0x4F0");
		static_assert(offsetof(CS2::server::CInfoProjectedDecal, m_sSequenceName) == 0x4F8, "m_sSequenceName in CInfoProjectedDecal should be at offset 0x4F8");
		static_assert(offsetof(CS2::server::CInfoProjectedDecal, m_flDistance) == 0x4FC, "m_flDistance in CInfoProjectedDecal should be at offset 0x4FC");
		static_assert(offsetof(CS2::server::CInfoProjectedDecal, m_bNotInMultiplayer) == 0x500, "m_bNotInMultiplayer in CInfoProjectedDecal should be at offset 0x500");
		static_assert(sizeof(CS2::server::CInfoProjectedDecal) == 0x508, "CInfoProjectedDecal size should be 0x508");
	}
}
