// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#ifndef CUSTOM_GLOBAL_TYPES
	#include "../GlobalTypes.hpp"
#else
	#include <Custom/GlobalTypes.hpp>
#endif


#include "CPointEntity.hpp"



namespace CS2 {
	namespace server {
		class CBaseEntity;
	}
}


using namespace GlobalTypes;
namespace CS2 {
	namespace server {
		class CInfoDynamicShadowHint : public CS2::server::CPointEntity {
		public:
			bool m_bDisabled; // 0x4a8 | Schema_Builtin | Size: 0x1
			S2_PAD(0x3);
			float32 m_flRange; // 0x4ac | Schema_Builtin | Size: 0x4
			int32_t m_nImportance; // 0x4b0 | Schema_Builtin | Size: 0x4
			int32_t m_nLightChoice; // 0x4b4 | Schema_Builtin | Size: 0x4
			GlobalTypes::CHandle<server::CBaseEntity> m_hLight; // 0x4b8 | Schema_Atomic | Size: 0x4
			// char m_hLight[0x4]; // 0x4b8 | Schema_Atomic | Size: 0x4
			S2_PAD(0x4); // End padding
		};
#ifdef USE_STATIC_ASSERTS
		static_assert(offsetof(CS2::server::CInfoDynamicShadowHint, m_bDisabled) == 0x4A8, "m_bDisabled in CInfoDynamicShadowHint should be at offset 0x4A8");
		static_assert(offsetof(CS2::server::CInfoDynamicShadowHint, m_flRange) == 0x4AC, "m_flRange in CInfoDynamicShadowHint should be at offset 0x4AC");
		static_assert(offsetof(CS2::server::CInfoDynamicShadowHint, m_nImportance) == 0x4B0, "m_nImportance in CInfoDynamicShadowHint should be at offset 0x4B0");
		static_assert(offsetof(CS2::server::CInfoDynamicShadowHint, m_nLightChoice) == 0x4B4, "m_nLightChoice in CInfoDynamicShadowHint should be at offset 0x4B4");
		static_assert(offsetof(CS2::server::CInfoDynamicShadowHint, m_hLight) == 0x4B8, "m_hLight in CInfoDynamicShadowHint should be at offset 0x4B8");
		static_assert(sizeof(CS2::server::CInfoDynamicShadowHint) == 0x4C0, "CInfoDynamicShadowHint size should be 0x4C0");

#endif
	}
}
