// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#ifndef CUSTOM_GLOBAL_TYPES
	#include "../GlobalTypes.hpp"
#else
	#include "../Custom/GlobalTypes.hpp"
#endif


#include "CSceneEntity.hpp"



namespace CS2 {
	namespace server {
		class CBaseEntity;
	}
}


using namespace GlobalTypes;
namespace CS2 {
	namespace server {
		class CInstancedSceneEntity : public CS2::server::CSceneEntity {
		public:
			GlobalTypes::CHandle<server::CBaseEntity> m_hOwner; // 0x730 | Schema_Atomic | Size: 0x4
			// char m_hOwner[0x4]; // 0x730 | Schema_Atomic | Size: 0x4
			bool m_bHadOwner; // 0x734 | Schema_Builtin | Size: 0x1
			S2_PAD(0x3);
			float32 m_flPostSpeakDelay; // 0x738 | Schema_Builtin | Size: 0x4
			float32 m_flPreDelay; // 0x73c | Schema_Builtin | Size: 0x4
			bool m_bIsBackground; // 0x740 | Schema_Builtin | Size: 0x1
			bool m_bRemoveOnCompletion; // 0x741 | Schema_Builtin | Size: 0x1
			S2_PAD(0x2);
			GlobalTypes::CHandle<server::CBaseEntity> m_hTarget; // 0x744 | Schema_Atomic | Size: 0x4
			// char m_hTarget[0x4]; // 0x744 | Schema_Atomic | Size: 0x4
		};
#ifdef USE_STATIC_ASSERTS
		static_assert(offsetof(CS2::server::CInstancedSceneEntity, m_hOwner) == 0x730, "m_hOwner in CInstancedSceneEntity should be at offset 0x730");
		static_assert(offsetof(CS2::server::CInstancedSceneEntity, m_bHadOwner) == 0x734, "m_bHadOwner in CInstancedSceneEntity should be at offset 0x734");
		static_assert(offsetof(CS2::server::CInstancedSceneEntity, m_flPostSpeakDelay) == 0x738, "m_flPostSpeakDelay in CInstancedSceneEntity should be at offset 0x738");
		static_assert(offsetof(CS2::server::CInstancedSceneEntity, m_flPreDelay) == 0x73C, "m_flPreDelay in CInstancedSceneEntity should be at offset 0x73C");
		static_assert(offsetof(CS2::server::CInstancedSceneEntity, m_bIsBackground) == 0x740, "m_bIsBackground in CInstancedSceneEntity should be at offset 0x740");
		static_assert(offsetof(CS2::server::CInstancedSceneEntity, m_bRemoveOnCompletion) == 0x741, "m_bRemoveOnCompletion in CInstancedSceneEntity should be at offset 0x741");
		static_assert(offsetof(CS2::server::CInstancedSceneEntity, m_hTarget) == 0x744, "m_hTarget in CInstancedSceneEntity should be at offset 0x744");
		static_assert(sizeof(CS2::server::CInstancedSceneEntity) == 0x748, "CInstancedSceneEntity size should be 0x748");

#endif
	}
}
