// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#include <SDK/GlobalTypes.hpp>

#include <SDK/server/CItem.hpp>
#include <SDK/entity2/GameTime_t.hpp>
#include <SDK/entity2/CEntityIOOutput.hpp>



namespace CS2 {
	namespace server {
		class CItemGeneric : public CS2::server::CItem {
		public:
			S2_PAD(0x14);
			bool m_bHasTriggerRadius; // 0xb64 | Schema_Builtin | Size: 0x1
			bool m_bHasPickupRadius; // 0xb65 | Schema_Builtin | Size: 0x1
			S2_PAD(0x2);
			float32 m_flPickupRadiusSqr; // 0xb68 | Schema_Builtin | Size: 0x4
			float32 m_flTriggerRadiusSqr; // 0xb6c | Schema_Builtin | Size: 0x4
			entity2::GameTime_t m_flLastPickupCheck; // 0xb70 | Schema_DeclaredClass | Size: 0x4
			bool m_bPlayerCounterListenerAdded; // 0xb74 | Schema_Builtin | Size: 0x1
			bool m_bPlayerInTriggerRadius; // 0xb75 | Schema_Builtin | Size: 0x1
			S2_PAD(0x2);
			// GlobalTypes::CStrongHandle< resourcesystem::InfoForResourceTypeIParticleSystemDefinition > m_hSpawnParticleEffect; // 0xb78 | Schema_Atomic | Size: 0x8
			char  m_hSpawnParticleEffect[0x8]; // 0xb78 | Schema_Atomic | Size: 0x8
			GlobalTypes::CUtlSymbolLarge m_pAmbientSoundEffect; // 0xb80 | Schema_Atomic | Size: 0x8
			bool m_bAutoStartAmbientSound; // 0xb88 | Schema_Builtin | Size: 0x1
			S2_PAD(0x7);
			GlobalTypes::CUtlSymbolLarge m_pSpawnScriptFunction; // 0xb90 | Schema_Atomic | Size: 0x8
			// GlobalTypes::CStrongHandle< resourcesystem::InfoForResourceTypeIParticleSystemDefinition > m_hPickupParticleEffect; // 0xb98 | Schema_Atomic | Size: 0x8
			char  m_hPickupParticleEffect[0x8]; // 0xb98 | Schema_Atomic | Size: 0x8
			GlobalTypes::CUtlSymbolLarge m_pPickupSoundEffect; // 0xba0 | Schema_Atomic | Size: 0x8
			GlobalTypes::CUtlSymbolLarge m_pPickupScriptFunction; // 0xba8 | Schema_Atomic | Size: 0x8
			// GlobalTypes::CStrongHandle< resourcesystem::InfoForResourceTypeIParticleSystemDefinition > m_hTimeoutParticleEffect; // 0xbb0 | Schema_Atomic | Size: 0x8
			char  m_hTimeoutParticleEffect[0x8]; // 0xbb0 | Schema_Atomic | Size: 0x8
			GlobalTypes::CUtlSymbolLarge m_pTimeoutSoundEffect; // 0xbb8 | Schema_Atomic | Size: 0x8
			GlobalTypes::CUtlSymbolLarge m_pTimeoutScriptFunction; // 0xbc0 | Schema_Atomic | Size: 0x8
			GlobalTypes::CUtlSymbolLarge m_pPickupFilterName; // 0xbc8 | Schema_Atomic | Size: 0x8
			// server::CHandle< server::CBaseFilter > m_hPickupFilter; // 0xbd0 | Schema_Atomic | Size: 0x4
			char  m_hPickupFilter[0x4]; // 0xbd0 | Schema_Atomic | Size: 0x4
			S2_PAD(0x4);
			entity2::CEntityIOOutput m_OnPickup; // 0xbd8 | Schema_DeclaredClass | Size: 0x28
			entity2::CEntityIOOutput m_OnTimeout; // 0xc00 | Schema_DeclaredClass | Size: 0x28
			entity2::CEntityIOOutput m_OnTriggerStartTouch; // 0xc28 | Schema_DeclaredClass | Size: 0x28
			entity2::CEntityIOOutput m_OnTriggerTouch; // 0xc50 | Schema_DeclaredClass | Size: 0x28
			entity2::CEntityIOOutput m_OnTriggerEndTouch; // 0xc78 | Schema_DeclaredClass | Size: 0x28
			GlobalTypes::CUtlSymbolLarge m_pAllowPickupScriptFunction; // 0xca0 | Schema_Atomic | Size: 0x8
			float32 m_flPickupRadius; // 0xca8 | Schema_Builtin | Size: 0x4
			float32 m_flTriggerRadius; // 0xcac | Schema_Builtin | Size: 0x4
			GlobalTypes::CUtlSymbolLarge m_pTriggerSoundEffect; // 0xcb0 | Schema_Atomic | Size: 0x8
			bool m_bGlowWhenInTrigger; // 0xcb8 | Schema_Builtin | Size: 0x1
			GlobalTypes::Color m_glowColor; // 0xcb9 | Schema_Atomic | Size: 0x4
			bool m_bUseable; // 0xcbd | Schema_Builtin | Size: 0x1
			S2_PAD(0x2);
			// server::CHandle< server::CItemGenericTriggerHelper > m_hTriggerHelper; // 0xcc0 | Schema_Atomic | Size: 0x4
			char  m_hTriggerHelper[0x4]; // 0xcc0 | Schema_Atomic | Size: 0x4
			S2_PAD(0x4); // End padding
		};
		static_assert(offsetof(CS2::server::CItemGeneric, m_bHasTriggerRadius) == 0xB64, "m_bHasTriggerRadius in CItemGeneric should be at offset 0xB64");
		static_assert(offsetof(CS2::server::CItemGeneric, m_bHasPickupRadius) == 0xB65, "m_bHasPickupRadius in CItemGeneric should be at offset 0xB65");
		static_assert(offsetof(CS2::server::CItemGeneric, m_flPickupRadiusSqr) == 0xB68, "m_flPickupRadiusSqr in CItemGeneric should be at offset 0xB68");
		static_assert(offsetof(CS2::server::CItemGeneric, m_flTriggerRadiusSqr) == 0xB6C, "m_flTriggerRadiusSqr in CItemGeneric should be at offset 0xB6C");
		static_assert(offsetof(CS2::server::CItemGeneric, m_flLastPickupCheck) == 0xB70, "m_flLastPickupCheck in CItemGeneric should be at offset 0xB70");
		static_assert(offsetof(CS2::server::CItemGeneric, m_bPlayerCounterListenerAdded) == 0xB74, "m_bPlayerCounterListenerAdded in CItemGeneric should be at offset 0xB74");
		static_assert(offsetof(CS2::server::CItemGeneric, m_bPlayerInTriggerRadius) == 0xB75, "m_bPlayerInTriggerRadius in CItemGeneric should be at offset 0xB75");
		static_assert(offsetof(CS2::server::CItemGeneric, m_hSpawnParticleEffect) == 0xB78, "m_hSpawnParticleEffect in CItemGeneric should be at offset 0xB78");
		static_assert(offsetof(CS2::server::CItemGeneric, m_pAmbientSoundEffect) == 0xB80, "m_pAmbientSoundEffect in CItemGeneric should be at offset 0xB80");
		static_assert(offsetof(CS2::server::CItemGeneric, m_bAutoStartAmbientSound) == 0xB88, "m_bAutoStartAmbientSound in CItemGeneric should be at offset 0xB88");
		static_assert(offsetof(CS2::server::CItemGeneric, m_pSpawnScriptFunction) == 0xB90, "m_pSpawnScriptFunction in CItemGeneric should be at offset 0xB90");
		static_assert(offsetof(CS2::server::CItemGeneric, m_hPickupParticleEffect) == 0xB98, "m_hPickupParticleEffect in CItemGeneric should be at offset 0xB98");
		static_assert(offsetof(CS2::server::CItemGeneric, m_pPickupSoundEffect) == 0xBA0, "m_pPickupSoundEffect in CItemGeneric should be at offset 0xBA0");
		static_assert(offsetof(CS2::server::CItemGeneric, m_pPickupScriptFunction) == 0xBA8, "m_pPickupScriptFunction in CItemGeneric should be at offset 0xBA8");
		static_assert(offsetof(CS2::server::CItemGeneric, m_hTimeoutParticleEffect) == 0xBB0, "m_hTimeoutParticleEffect in CItemGeneric should be at offset 0xBB0");
		static_assert(offsetof(CS2::server::CItemGeneric, m_pTimeoutSoundEffect) == 0xBB8, "m_pTimeoutSoundEffect in CItemGeneric should be at offset 0xBB8");
		static_assert(offsetof(CS2::server::CItemGeneric, m_pTimeoutScriptFunction) == 0xBC0, "m_pTimeoutScriptFunction in CItemGeneric should be at offset 0xBC0");
		static_assert(offsetof(CS2::server::CItemGeneric, m_pPickupFilterName) == 0xBC8, "m_pPickupFilterName in CItemGeneric should be at offset 0xBC8");
		static_assert(offsetof(CS2::server::CItemGeneric, m_hPickupFilter) == 0xBD0, "m_hPickupFilter in CItemGeneric should be at offset 0xBD0");
		static_assert(offsetof(CS2::server::CItemGeneric, m_OnPickup) == 0xBD8, "m_OnPickup in CItemGeneric should be at offset 0xBD8");
		static_assert(offsetof(CS2::server::CItemGeneric, m_OnTimeout) == 0xC00, "m_OnTimeout in CItemGeneric should be at offset 0xC00");
		static_assert(offsetof(CS2::server::CItemGeneric, m_OnTriggerStartTouch) == 0xC28, "m_OnTriggerStartTouch in CItemGeneric should be at offset 0xC28");
		static_assert(offsetof(CS2::server::CItemGeneric, m_OnTriggerTouch) == 0xC50, "m_OnTriggerTouch in CItemGeneric should be at offset 0xC50");
		static_assert(offsetof(CS2::server::CItemGeneric, m_OnTriggerEndTouch) == 0xC78, "m_OnTriggerEndTouch in CItemGeneric should be at offset 0xC78");
		static_assert(offsetof(CS2::server::CItemGeneric, m_pAllowPickupScriptFunction) == 0xCA0, "m_pAllowPickupScriptFunction in CItemGeneric should be at offset 0xCA0");
		static_assert(offsetof(CS2::server::CItemGeneric, m_flPickupRadius) == 0xCA8, "m_flPickupRadius in CItemGeneric should be at offset 0xCA8");
		static_assert(offsetof(CS2::server::CItemGeneric, m_flTriggerRadius) == 0xCAC, "m_flTriggerRadius in CItemGeneric should be at offset 0xCAC");
		static_assert(offsetof(CS2::server::CItemGeneric, m_pTriggerSoundEffect) == 0xCB0, "m_pTriggerSoundEffect in CItemGeneric should be at offset 0xCB0");
		static_assert(offsetof(CS2::server::CItemGeneric, m_bGlowWhenInTrigger) == 0xCB8, "m_bGlowWhenInTrigger in CItemGeneric should be at offset 0xCB8");
		static_assert(offsetof(CS2::server::CItemGeneric, m_glowColor) == 0xCB9, "m_glowColor in CItemGeneric should be at offset 0xCB9");
		static_assert(offsetof(CS2::server::CItemGeneric, m_bUseable) == 0xCBD, "m_bUseable in CItemGeneric should be at offset 0xCBD");
		static_assert(offsetof(CS2::server::CItemGeneric, m_hTriggerHelper) == 0xCC0, "m_hTriggerHelper in CItemGeneric should be at offset 0xCC0");
		static_assert(sizeof(CS2::server::CItemGeneric) == 0xCC8, "CItemGeneric size should be 0xCC8");
	}
}
