// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#include <SDK/GlobalTypes.hpp>

#include <SDK/server/CBaseAnimGraph.hpp>
#include <SDK/entity2/CEntityIOOutput.hpp>



namespace CS2 {
	namespace server {
		class CItem : public CS2::server::CBaseAnimGraph {
		public:
			public:
			S2_PAD(0x8);
			entity2::CEntityIOOutput m_OnPlayerTouch; // 0xa80 | Schema_DeclaredClass | Size: 0x28
			entity2::CEntityIOOutput m_OnPlayerPickup; // 0xaa8 | Schema_DeclaredClass | Size: 0x28
			bool m_bActivateWhenAtRest; // 0xad0 | Schema_Builtin | Size: 0x1
			S2_PAD(0x7);
			entity2::CEntityIOOutput m_OnCacheInteraction; // 0xad8 | Schema_DeclaredClass | Size: 0x28
			entity2::CEntityIOOutput m_OnGlovePulled; // 0xb00 | Schema_DeclaredClass | Size: 0x28
			GlobalTypes::Vector m_vOriginalSpawnOrigin; // 0xb28 | Schema_Atomic | Size: 0xc
			GlobalTypes::QAngle m_vOriginalSpawnAngles; // 0xb34 | Schema_Atomic | Size: 0xc
			bool m_bPhysStartAsleep; // 0xb40 | Schema_Builtin | Size: 0x1
			S2_PAD(0xf); // End padding
		};
		static_assert(offsetof(CS2::server::CItem, m_OnPlayerTouch) == 0xA80, "m_OnPlayerTouch in CItem should be at offset 0xA80");
		static_assert(offsetof(CS2::server::CItem, m_OnPlayerPickup) == 0xAA8, "m_OnPlayerPickup in CItem should be at offset 0xAA8");
		static_assert(offsetof(CS2::server::CItem, m_bActivateWhenAtRest) == 0xAD0, "m_bActivateWhenAtRest in CItem should be at offset 0xAD0");
		static_assert(offsetof(CS2::server::CItem, m_OnCacheInteraction) == 0xAD8, "m_OnCacheInteraction in CItem should be at offset 0xAD8");
		static_assert(offsetof(CS2::server::CItem, m_OnGlovePulled) == 0xB00, "m_OnGlovePulled in CItem should be at offset 0xB00");
		static_assert(offsetof(CS2::server::CItem, m_vOriginalSpawnOrigin) == 0xB28, "m_vOriginalSpawnOrigin in CItem should be at offset 0xB28");
		static_assert(offsetof(CS2::server::CItem, m_vOriginalSpawnAngles) == 0xB34, "m_vOriginalSpawnAngles in CItem should be at offset 0xB34");
		static_assert(offsetof(CS2::server::CItem, m_bPhysStartAsleep) == 0xB40, "m_bPhysStartAsleep in CItem should be at offset 0xB40");
		static_assert(sizeof(CS2::server::CItem) == 0xB50, "CItem size should be 0xB50");
	}
}
