// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#ifndef CUSTOM_GLOBAL_TYPES
	#include <SDK/GlobalTypes.hpp>
#else
	#include <Custom/GlobalTypes.hpp>
#endif


#include <SDK/server/CBaseAnimGraph.hpp>
#include <SDK/entity2/CEntityIOOutput.hpp>





using namespace GlobalTypes;
namespace CS2 {
	namespace server {
		class CItem : public CS2::server::CBaseAnimGraph {
		public:
			S2_PAD(0x8);
			entity2::CEntityIOOutput m_OnPlayerTouch; // 0xa28 | Schema_DeclaredClass | Size: 0x18
			entity2::CEntityIOOutput m_OnPlayerPickup; // 0xa40 | Schema_DeclaredClass | Size: 0x18
			bool m_bActivateWhenAtRest; // 0xa58 | Schema_Builtin | Size: 0x1
			S2_PAD(0x7);
			entity2::CEntityIOOutput m_OnCacheInteraction; // 0xa60 | Schema_DeclaredClass | Size: 0x18
			entity2::CEntityIOOutput m_OnGlovePulled; // 0xa78 | Schema_DeclaredClass | Size: 0x18
			GlobalTypes::VectorWS m_vOriginalSpawnOrigin; // 0xa90 | Schema_Atomic | Size: 0xc
			GlobalTypes::QAngle m_vOriginalSpawnAngles; // 0xa9c | Schema_Atomic | Size: 0xc
			bool m_bPhysStartAsleep; // 0xaa8 | Schema_Builtin | Size: 0x1
			S2_PAD(0x17); // End padding
		};
		static_assert(offsetof(CS2::server::CItem, m_OnPlayerTouch) == 0xA28, "m_OnPlayerTouch in CItem should be at offset 0xA28");
		static_assert(offsetof(CS2::server::CItem, m_OnPlayerPickup) == 0xA40, "m_OnPlayerPickup in CItem should be at offset 0xA40");
		static_assert(offsetof(CS2::server::CItem, m_bActivateWhenAtRest) == 0xA58, "m_bActivateWhenAtRest in CItem should be at offset 0xA58");
		static_assert(offsetof(CS2::server::CItem, m_OnCacheInteraction) == 0xA60, "m_OnCacheInteraction in CItem should be at offset 0xA60");
		static_assert(offsetof(CS2::server::CItem, m_OnGlovePulled) == 0xA78, "m_OnGlovePulled in CItem should be at offset 0xA78");
		static_assert(offsetof(CS2::server::CItem, m_vOriginalSpawnOrigin) == 0xA90, "m_vOriginalSpawnOrigin in CItem should be at offset 0xA90");
		static_assert(offsetof(CS2::server::CItem, m_vOriginalSpawnAngles) == 0xA9C, "m_vOriginalSpawnAngles in CItem should be at offset 0xA9C");
		static_assert(offsetof(CS2::server::CItem, m_bPhysStartAsleep) == 0xAA8, "m_bPhysStartAsleep in CItem should be at offset 0xAA8");
		static_assert(sizeof(CS2::server::CItem) == 0xAC0, "CItem size should be 0xAC0");
	}
}
