// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#include <SDK/GlobalTypes.hpp>

#include <SDK/server/CBaseAnimGraph.hpp>
#include <SDK/entity2/CEntityIOOutput.hpp>



namespace CS2 {
	namespace server {
		class CItem : public CS2::server::CBaseAnimGraph {
		public:
			S2_PAD(0x8);
			entity2::CEntityIOOutput m_OnPlayerTouch; // 0xa98 | Schema_DeclaredClass | Size: 0x28
			entity2::CEntityIOOutput m_OnPlayerPickup; // 0xac0 | Schema_DeclaredClass | Size: 0x28
			bool m_bActivateWhenAtRest; // 0xae8 | Schema_Builtin | Size: 0x1
			S2_PAD(0x7);
			entity2::CEntityIOOutput m_OnCacheInteraction; // 0xaf0 | Schema_DeclaredClass | Size: 0x28
			entity2::CEntityIOOutput m_OnGlovePulled; // 0xb18 | Schema_DeclaredClass | Size: 0x28
			GlobalTypes::VectorWS m_vOriginalSpawnOrigin; // 0xb40 | Schema_Atomic | Size: 0xc
			GlobalTypes::QAngle m_vOriginalSpawnAngles; // 0xb4c | Schema_Atomic | Size: 0xc
			bool m_bPhysStartAsleep; // 0xb58 | Schema_Builtin | Size: 0x1
			S2_PAD(0x17); // End padding
		};
		static_assert(offsetof(CS2::server::CItem, m_OnPlayerTouch) == 0xA98, "m_OnPlayerTouch in CItem should be at offset 0xA98");
		static_assert(offsetof(CS2::server::CItem, m_OnPlayerPickup) == 0xAC0, "m_OnPlayerPickup in CItem should be at offset 0xAC0");
		static_assert(offsetof(CS2::server::CItem, m_bActivateWhenAtRest) == 0xAE8, "m_bActivateWhenAtRest in CItem should be at offset 0xAE8");
		static_assert(offsetof(CS2::server::CItem, m_OnCacheInteraction) == 0xAF0, "m_OnCacheInteraction in CItem should be at offset 0xAF0");
		static_assert(offsetof(CS2::server::CItem, m_OnGlovePulled) == 0xB18, "m_OnGlovePulled in CItem should be at offset 0xB18");
		static_assert(offsetof(CS2::server::CItem, m_vOriginalSpawnOrigin) == 0xB40, "m_vOriginalSpawnOrigin in CItem should be at offset 0xB40");
		static_assert(offsetof(CS2::server::CItem, m_vOriginalSpawnAngles) == 0xB4C, "m_vOriginalSpawnAngles in CItem should be at offset 0xB4C");
		static_assert(offsetof(CS2::server::CItem, m_bPhysStartAsleep) == 0xB58, "m_bPhysStartAsleep in CItem should be at offset 0xB58");
		static_assert(sizeof(CS2::server::CItem) == 0xB70, "CItem size should be 0xB70");
	}
}
