// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#ifndef CUSTOM_GLOBAL_TYPES
	#include "../GlobalTypes.hpp"
#else
	#include "../Custom/GlobalTypes.hpp"
#endif


#include "CPointEntity.hpp"



namespace CS2 {
	namespace server {
		class CBaseEntity;
	}
}


using namespace GlobalTypes;
namespace CS2 {
	namespace server {
		class CKeepUpright : public CS2::server::CPointEntity {
		public:
			S2_PAD(0x8);
			GlobalTypes::Vector m_worldGoalAxis; // 0x4b0 | Schema_Atomic | Size: 0xc
			GlobalTypes::Vector m_localTestAxis; // 0x4bc | Schema_Atomic | Size: 0xc
			S2_PAD(0x8);
			GlobalTypes::CUtlSymbolLarge m_nameAttach; // 0x4d0 | Schema_Atomic | Size: 0x8
			GlobalTypes::CHandle<server::CBaseEntity> m_attachedObject; // 0x4d8 | Schema_Atomic | Size: 0x4
			// char m_attachedObject[0x4]; // 0x4d8 | Schema_Atomic | Size: 0x4
			float32 m_angularLimit; // 0x4dc | Schema_Builtin | Size: 0x4
			bool m_bActive; // 0x4e0 | Schema_Builtin | Size: 0x1
			bool m_bDampAllRotation; // 0x4e1 | Schema_Builtin | Size: 0x1
			S2_PAD(0x6); // End padding
		};
#ifdef USE_STATIC_ASSERTS
		static_assert(offsetof(CS2::server::CKeepUpright, m_worldGoalAxis) == 0x4B0, "m_worldGoalAxis in CKeepUpright should be at offset 0x4B0");
		static_assert(offsetof(CS2::server::CKeepUpright, m_localTestAxis) == 0x4BC, "m_localTestAxis in CKeepUpright should be at offset 0x4BC");
		static_assert(offsetof(CS2::server::CKeepUpright, m_nameAttach) == 0x4D0, "m_nameAttach in CKeepUpright should be at offset 0x4D0");
		static_assert(offsetof(CS2::server::CKeepUpright, m_attachedObject) == 0x4D8, "m_attachedObject in CKeepUpright should be at offset 0x4D8");
		static_assert(offsetof(CS2::server::CKeepUpright, m_angularLimit) == 0x4DC, "m_angularLimit in CKeepUpright should be at offset 0x4DC");
		static_assert(offsetof(CS2::server::CKeepUpright, m_bActive) == 0x4E0, "m_bActive in CKeepUpright should be at offset 0x4E0");
		static_assert(offsetof(CS2::server::CKeepUpright, m_bDampAllRotation) == 0x4E1, "m_bDampAllRotation in CKeepUpright should be at offset 0x4E1");
		static_assert(sizeof(CS2::server::CKeepUpright) == 0x4E8, "CKeepUpright size should be 0x4E8");

#endif
	}
}
