// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#ifndef CUSTOM_GLOBAL_TYPES
	#include <SDK/GlobalTypes.hpp>
#else
	#include <Custom/GlobalTypes.hpp>
#endif


#include <SDK/server/CLogicAutosave.hpp>
#include <SDK/entity2/GameTime_t.hpp>





using namespace GlobalTypes;
namespace CS2 {
	namespace server {
		class CLogicActiveAutosave : public CS2::server::CLogicAutosave {
		public:
			int32_t m_TriggerHitPoints; // 0x500 | Schema_Builtin | Size: 0x4
			float32 m_flTimeToTrigger; // 0x504 | Schema_Builtin | Size: 0x4
			entity2::GameTime_t m_flStartTime; // 0x508 | Schema_DeclaredClass | Size: 0x4
			float32 m_flDangerousTime; // 0x50c | Schema_Builtin | Size: 0x4
		};
		static_assert(offsetof(CS2::server::CLogicActiveAutosave, m_TriggerHitPoints) == 0x500, "m_TriggerHitPoints in CLogicActiveAutosave should be at offset 0x500");
		static_assert(offsetof(CS2::server::CLogicActiveAutosave, m_flTimeToTrigger) == 0x504, "m_flTimeToTrigger in CLogicActiveAutosave should be at offset 0x504");
		static_assert(offsetof(CS2::server::CLogicActiveAutosave, m_flStartTime) == 0x508, "m_flStartTime in CLogicActiveAutosave should be at offset 0x508");
		static_assert(offsetof(CS2::server::CLogicActiveAutosave, m_flDangerousTime) == 0x50C, "m_flDangerousTime in CLogicActiveAutosave should be at offset 0x50C");
		static_assert(sizeof(CS2::server::CLogicActiveAutosave) == 0x510, "CLogicActiveAutosave size should be 0x510");
	}
}
