// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#ifndef CUSTOM_GLOBAL_TYPES
	#include "../GlobalTypes.hpp"
#else
	#include "../Custom/GlobalTypes.hpp"
#endif


#include "CLogicalEntity.hpp"
#include "../entity2/CEntityIOOutput.hpp"





using namespace GlobalTypes;
namespace CS2 {
	namespace server {
		class CLogicCase : public CS2::server::CLogicalEntity {
		public:
			GlobalTypes::CUtlSymbolLarge m_nCase[32]; // 0x4a8 | Schema_FixedArray | Size: 0x100
			int32_t m_nShuffleCases; // 0x5a8 | Schema_Builtin | Size: 0x4
			int32_t m_nLastShuffleCase; // 0x5ac | Schema_Builtin | Size: 0x4
			uint8_t m_uchShuffleCaseMap[32]; // 0x5b0 | Schema_FixedArray | Size: 0x20
			entity2::CEntityIOOutput m_OnCase[32]; // 0x5d0 | Schema_FixedArray | Size: 0x300
			GlobalTypes::CEntityOutputTemplate< CUtlString, char* > m_OnDefault; // 0x8d0 | Schema_Atomic | Size: 0x20
			// char m_OnDefault[0x20]; // 0x8d0 | Schema_Atomic | Size: 0x20
		};
		static_assert(offsetof(CS2::server::CLogicCase, m_nCase) == 0x4A8, "m_nCase in CLogicCase should be at offset 0x4A8");
		static_assert(offsetof(CS2::server::CLogicCase, m_nShuffleCases) == 0x5A8, "m_nShuffleCases in CLogicCase should be at offset 0x5A8");
		static_assert(offsetof(CS2::server::CLogicCase, m_nLastShuffleCase) == 0x5AC, "m_nLastShuffleCase in CLogicCase should be at offset 0x5AC");
		static_assert(offsetof(CS2::server::CLogicCase, m_uchShuffleCaseMap) == 0x5B0, "m_uchShuffleCaseMap in CLogicCase should be at offset 0x5B0");
		static_assert(offsetof(CS2::server::CLogicCase, m_OnCase) == 0x5D0, "m_OnCase in CLogicCase should be at offset 0x5D0");
		static_assert(offsetof(CS2::server::CLogicCase, m_OnDefault) == 0x8D0, "m_OnDefault in CLogicCase should be at offset 0x8D0");
		static_assert(sizeof(CS2::server::CLogicCase) == 0x8F0, "CLogicCase size should be 0x8F0");
	}
}
