// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#ifndef CUSTOM_GLOBAL_TYPES
	#include <SDK/GlobalTypes.hpp>
#else
	#include <Custom/GlobalTypes.hpp>
#endif


#include <SDK/server/CLogicalEntity.hpp>





using namespace GlobalTypes;
namespace CS2 {
	namespace server {
		class CLogicCompare : public CS2::server::CLogicalEntity {
		public:
			float32 m_flInValue; // 0x4f0 | Schema_Builtin | Size: 0x4
			float32 m_flCompareValue; // 0x4f4 | Schema_Builtin | Size: 0x4
			// GlobalTypes::CEntityOutputTemplate< float32 > m_OnLessThan; // 0x4f8 | Schema_Atomic | Size: 0x28
			char  m_OnLessThan[0x28]; // 0x4f8 | Schema_Atomic | Size: 0x28
			// GlobalTypes::CEntityOutputTemplate< float32 > m_OnEqualTo; // 0x520 | Schema_Atomic | Size: 0x28
			char  m_OnEqualTo[0x28]; // 0x520 | Schema_Atomic | Size: 0x28
			// GlobalTypes::CEntityOutputTemplate< float32 > m_OnNotEqualTo; // 0x548 | Schema_Atomic | Size: 0x28
			char  m_OnNotEqualTo[0x28]; // 0x548 | Schema_Atomic | Size: 0x28
			// GlobalTypes::CEntityOutputTemplate< float32 > m_OnGreaterThan; // 0x570 | Schema_Atomic | Size: 0x28
			char  m_OnGreaterThan[0x28]; // 0x570 | Schema_Atomic | Size: 0x28
		};
		static_assert(offsetof(CS2::server::CLogicCompare, m_flInValue) == 0x4F0, "m_flInValue in CLogicCompare should be at offset 0x4F0");
		static_assert(offsetof(CS2::server::CLogicCompare, m_flCompareValue) == 0x4F4, "m_flCompareValue in CLogicCompare should be at offset 0x4F4");
		static_assert(offsetof(CS2::server::CLogicCompare, m_OnLessThan) == 0x4F8, "m_OnLessThan in CLogicCompare should be at offset 0x4F8");
		static_assert(offsetof(CS2::server::CLogicCompare, m_OnEqualTo) == 0x520, "m_OnEqualTo in CLogicCompare should be at offset 0x520");
		static_assert(offsetof(CS2::server::CLogicCompare, m_OnNotEqualTo) == 0x548, "m_OnNotEqualTo in CLogicCompare should be at offset 0x548");
		static_assert(offsetof(CS2::server::CLogicCompare, m_OnGreaterThan) == 0x570, "m_OnGreaterThan in CLogicCompare should be at offset 0x570");
		static_assert(sizeof(CS2::server::CLogicCompare) == 0x598, "CLogicCompare size should be 0x598");
	}
}
