// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#ifndef CUSTOM_GLOBAL_TYPES
	#include "../GlobalTypes.hpp"
#else
	#include "../Custom/GlobalTypes.hpp"
#endif


#include "CLogicalEntity.hpp"



namespace CS2 {
	namespace server {
		class CBaseEntity;
	}
}


using namespace GlobalTypes;
namespace CS2 {
	namespace server {
		class CLogicMeasureMovement : public CS2::server::CLogicalEntity {
		public:
			GlobalTypes::CUtlSymbolLarge m_strMeasureTarget; // 0x4a8 | Schema_Atomic | Size: 0x8
			GlobalTypes::CUtlSymbolLarge m_strMeasureReference; // 0x4b0 | Schema_Atomic | Size: 0x8
			GlobalTypes::CUtlSymbolLarge m_strTargetReference; // 0x4b8 | Schema_Atomic | Size: 0x8
			GlobalTypes::CHandle<server::CBaseEntity> m_hMeasureTarget; // 0x4c0 | Schema_Atomic | Size: 0x4
			// char m_hMeasureTarget[0x4]; // 0x4c0 | Schema_Atomic | Size: 0x4
			GlobalTypes::CHandle<server::CBaseEntity> m_hMeasureReference; // 0x4c4 | Schema_Atomic | Size: 0x4
			// char m_hMeasureReference[0x4]; // 0x4c4 | Schema_Atomic | Size: 0x4
			GlobalTypes::CHandle<server::CBaseEntity> m_hTarget; // 0x4c8 | Schema_Atomic | Size: 0x4
			// char m_hTarget[0x4]; // 0x4c8 | Schema_Atomic | Size: 0x4
			GlobalTypes::CHandle<server::CBaseEntity> m_hTargetReference; // 0x4cc | Schema_Atomic | Size: 0x4
			// char m_hTargetReference[0x4]; // 0x4cc | Schema_Atomic | Size: 0x4
			float32 m_flScale; // 0x4d0 | Schema_Builtin | Size: 0x4
			int32_t m_nMeasureType; // 0x4d4 | Schema_Builtin | Size: 0x4
		};
		static_assert(offsetof(CS2::server::CLogicMeasureMovement, m_strMeasureTarget) == 0x4A8, "m_strMeasureTarget in CLogicMeasureMovement should be at offset 0x4A8");
		static_assert(offsetof(CS2::server::CLogicMeasureMovement, m_strMeasureReference) == 0x4B0, "m_strMeasureReference in CLogicMeasureMovement should be at offset 0x4B0");
		static_assert(offsetof(CS2::server::CLogicMeasureMovement, m_strTargetReference) == 0x4B8, "m_strTargetReference in CLogicMeasureMovement should be at offset 0x4B8");
		static_assert(offsetof(CS2::server::CLogicMeasureMovement, m_hMeasureTarget) == 0x4C0, "m_hMeasureTarget in CLogicMeasureMovement should be at offset 0x4C0");
		static_assert(offsetof(CS2::server::CLogicMeasureMovement, m_hMeasureReference) == 0x4C4, "m_hMeasureReference in CLogicMeasureMovement should be at offset 0x4C4");
		static_assert(offsetof(CS2::server::CLogicMeasureMovement, m_hTarget) == 0x4C8, "m_hTarget in CLogicMeasureMovement should be at offset 0x4C8");
		static_assert(offsetof(CS2::server::CLogicMeasureMovement, m_hTargetReference) == 0x4CC, "m_hTargetReference in CLogicMeasureMovement should be at offset 0x4CC");
		static_assert(offsetof(CS2::server::CLogicMeasureMovement, m_flScale) == 0x4D0, "m_flScale in CLogicMeasureMovement should be at offset 0x4D0");
		static_assert(offsetof(CS2::server::CLogicMeasureMovement, m_nMeasureType) == 0x4D4, "m_nMeasureType in CLogicMeasureMovement should be at offset 0x4D4");
		static_assert(sizeof(CS2::server::CLogicMeasureMovement) == 0x4D8, "CLogicMeasureMovement size should be 0x4D8");
	}
}
