// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#ifndef CUSTOM_GLOBAL_TYPES
	#include "../GlobalTypes.hpp"
#else
	#include <Custom/GlobalTypes.hpp>
#endif


#include "CLogicalEntity.hpp"
#include "../entity2/CEntityIOOutput.hpp"





using namespace GlobalTypes;
namespace CS2 {
	namespace server {
		class CLogicGameEventListener : public CS2::server::CLogicalEntity {
		public:
			S2_PAD(0x10);
			entity2::CEntityIOOutput m_OnEventFired; // 0x4b8 | Schema_DeclaredClass | Size: 0x18
			GlobalTypes::CUtlSymbolLarge m_iszGameEventName; // 0x4d0 | Schema_Atomic | Size: 0x8
			GlobalTypes::CUtlSymbolLarge m_iszGameEventItem; // 0x4d8 | Schema_Atomic | Size: 0x8
			bool m_bEnabled; // 0x4e0 | Schema_Builtin | Size: 0x1
			bool m_bStartDisabled; // 0x4e1 | Schema_Builtin | Size: 0x1
			S2_PAD(0x6); // End padding
		};
#ifdef USE_STATIC_ASSERTS
		static_assert(offsetof(CS2::server::CLogicGameEventListener, m_OnEventFired) == 0x4B8, "m_OnEventFired in CLogicGameEventListener should be at offset 0x4B8");
		static_assert(offsetof(CS2::server::CLogicGameEventListener, m_iszGameEventName) == 0x4D0, "m_iszGameEventName in CLogicGameEventListener should be at offset 0x4D0");
		static_assert(offsetof(CS2::server::CLogicGameEventListener, m_iszGameEventItem) == 0x4D8, "m_iszGameEventItem in CLogicGameEventListener should be at offset 0x4D8");
		static_assert(offsetof(CS2::server::CLogicGameEventListener, m_bEnabled) == 0x4E0, "m_bEnabled in CLogicGameEventListener should be at offset 0x4E0");
		static_assert(offsetof(CS2::server::CLogicGameEventListener, m_bStartDisabled) == 0x4E1, "m_bStartDisabled in CLogicGameEventListener should be at offset 0x4E1");
		static_assert(sizeof(CS2::server::CLogicGameEventListener) == 0x4E8, "CLogicGameEventListener size should be 0x4E8");

#endif
	}
}
