// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#ifndef CUSTOM_GLOBAL_TYPES
	#include "../GlobalTypes.hpp"
#else
	#include <Custom/GlobalTypes.hpp>
#endif


#include "CLogicalEntity.hpp"





using namespace GlobalTypes;
namespace CS2 {
	namespace server {
		class CLogicCompare : public CS2::server::CLogicalEntity {
		public:
			float32 m_flInValue; // 0x4a8 | Schema_Builtin | Size: 0x4
			float32 m_flCompareValue; // 0x4ac | Schema_Builtin | Size: 0x4
			// GlobalTypes::CEntityOutputTemplate< float32, float32 > m_OnLessThan; // 0x4b0 | Schema_Atomic | Size: 0x20
			char m_OnLessThan[0x20]; // 0x4b0 | Schema_Atomic | Size: 0x20
			// GlobalTypes::CEntityOutputTemplate< float32, float32 > m_OnEqualTo; // 0x4d0 | Schema_Atomic | Size: 0x20
			char m_OnEqualTo[0x20]; // 0x4d0 | Schema_Atomic | Size: 0x20
			// GlobalTypes::CEntityOutputTemplate< float32, float32 > m_OnNotEqualTo; // 0x4f0 | Schema_Atomic | Size: 0x20
			char m_OnNotEqualTo[0x20]; // 0x4f0 | Schema_Atomic | Size: 0x20
			// GlobalTypes::CEntityOutputTemplate< float32, float32 > m_OnGreaterThan; // 0x510 | Schema_Atomic | Size: 0x20
			char m_OnGreaterThan[0x20]; // 0x510 | Schema_Atomic | Size: 0x20
		};
#ifdef USE_STATIC_ASSERTS
		static_assert(offsetof(CS2::server::CLogicCompare, m_flInValue) == 0x4A8, "m_flInValue in CLogicCompare should be at offset 0x4A8");
		static_assert(offsetof(CS2::server::CLogicCompare, m_flCompareValue) == 0x4AC, "m_flCompareValue in CLogicCompare should be at offset 0x4AC");
		static_assert(offsetof(CS2::server::CLogicCompare, m_OnLessThan) == 0x4B0, "m_OnLessThan in CLogicCompare should be at offset 0x4B0");
		static_assert(offsetof(CS2::server::CLogicCompare, m_OnEqualTo) == 0x4D0, "m_OnEqualTo in CLogicCompare should be at offset 0x4D0");
		static_assert(offsetof(CS2::server::CLogicCompare, m_OnNotEqualTo) == 0x4F0, "m_OnNotEqualTo in CLogicCompare should be at offset 0x4F0");
		static_assert(offsetof(CS2::server::CLogicCompare, m_OnGreaterThan) == 0x510, "m_OnGreaterThan in CLogicCompare should be at offset 0x510");
		static_assert(sizeof(CS2::server::CLogicCompare) == 0x530, "CLogicCompare size should be 0x530");

#endif
	}
}
