// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#ifndef CUSTOM_GLOBAL_TYPES
	#include "../GlobalTypes.hpp"
#else
	#include <Custom/GlobalTypes.hpp>
#endif


#include "CLogicalEntity.hpp"





using namespace GlobalTypes;
namespace CS2 {
	namespace server {
		class CLogicCollisionPair : public CS2::server::CLogicalEntity {
		public:
			GlobalTypes::CUtlSymbolLarge m_nameAttach1; // 0x4a8 | Schema_Atomic | Size: 0x8
			GlobalTypes::CUtlSymbolLarge m_nameAttach2; // 0x4b0 | Schema_Atomic | Size: 0x8
			bool m_includeHierarchy; // 0x4b8 | Schema_Builtin | Size: 0x1
			bool m_supportMultipleEntitiesWithSameName; // 0x4b9 | Schema_Builtin | Size: 0x1
			bool m_disabled; // 0x4ba | Schema_Builtin | Size: 0x1
			bool m_succeeded; // 0x4bb | Schema_Builtin | Size: 0x1
			S2_PAD(0x4); // End padding
		};
#ifdef USE_STATIC_ASSERTS
		static_assert(offsetof(CS2::server::CLogicCollisionPair, m_nameAttach1) == 0x4A8, "m_nameAttach1 in CLogicCollisionPair should be at offset 0x4A8");
		static_assert(offsetof(CS2::server::CLogicCollisionPair, m_nameAttach2) == 0x4B0, "m_nameAttach2 in CLogicCollisionPair should be at offset 0x4B0");
		static_assert(offsetof(CS2::server::CLogicCollisionPair, m_includeHierarchy) == 0x4B8, "m_includeHierarchy in CLogicCollisionPair should be at offset 0x4B8");
		static_assert(offsetof(CS2::server::CLogicCollisionPair, m_supportMultipleEntitiesWithSameName) == 0x4B9, "m_supportMultipleEntitiesWithSameName in CLogicCollisionPair should be at offset 0x4B9");
		static_assert(offsetof(CS2::server::CLogicCollisionPair, m_disabled) == 0x4BA, "m_disabled in CLogicCollisionPair should be at offset 0x4BA");
		static_assert(offsetof(CS2::server::CLogicCollisionPair, m_succeeded) == 0x4BB, "m_succeeded in CLogicCollisionPair should be at offset 0x4BB");
		static_assert(sizeof(CS2::server::CLogicCollisionPair) == 0x4C0, "CLogicCollisionPair size should be 0x4C0");

#endif
	}
}
