// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#include <SDK/GlobalTypes.hpp>

#include <SDK/server/CLogicalEntity.hpp>



namespace CS2 {
	namespace server {
		class CLogicDistanceAutosave : public CS2::server::CLogicalEntity {
		public:
			GlobalTypes::CUtlSymbolLarge m_iszTargetEntity; // 0x4f0 | Schema_Atomic | Size: 0x8
			float32 m_flDistanceToPlayer; // 0x4f8 | Schema_Builtin | Size: 0x4
			bool m_bForceNewLevelUnit; // 0x4fc | Schema_Builtin | Size: 0x1
			bool m_bCheckCough; // 0x4fd | Schema_Builtin | Size: 0x1
			bool m_bThinkDangerous; // 0x4fe | Schema_Builtin | Size: 0x1
			S2_PAD(0x1);
			float32 m_flDangerousTime; // 0x500 | Schema_Builtin | Size: 0x4
			S2_PAD(0x4); // End padding
		};
		static_assert(offsetof(CS2::server::CLogicDistanceAutosave, m_iszTargetEntity) == 0x4F0, "m_iszTargetEntity in CLogicDistanceAutosave should be at offset 0x4F0");
		static_assert(offsetof(CS2::server::CLogicDistanceAutosave, m_flDistanceToPlayer) == 0x4F8, "m_flDistanceToPlayer in CLogicDistanceAutosave should be at offset 0x4F8");
		static_assert(offsetof(CS2::server::CLogicDistanceAutosave, m_bForceNewLevelUnit) == 0x4FC, "m_bForceNewLevelUnit in CLogicDistanceAutosave should be at offset 0x4FC");
		static_assert(offsetof(CS2::server::CLogicDistanceAutosave, m_bCheckCough) == 0x4FD, "m_bCheckCough in CLogicDistanceAutosave should be at offset 0x4FD");
		static_assert(offsetof(CS2::server::CLogicDistanceAutosave, m_bThinkDangerous) == 0x4FE, "m_bThinkDangerous in CLogicDistanceAutosave should be at offset 0x4FE");
		static_assert(offsetof(CS2::server::CLogicDistanceAutosave, m_flDangerousTime) == 0x500, "m_flDangerousTime in CLogicDistanceAutosave should be at offset 0x500");
		static_assert(sizeof(CS2::server::CLogicDistanceAutosave) == 0x508, "CLogicDistanceAutosave size should be 0x508");
	}
}
