// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#ifndef CUSTOM_GLOBAL_TYPES
	#include <SDK/GlobalTypes.hpp>
#else
	#include <Custom/GlobalTypes.hpp>
#endif


#include <SDK/server/CLogicalEntity.hpp>





using namespace GlobalTypes;
namespace CS2 {
	namespace server {
		class CLogicRelay : public CS2::server::CLogicalEntity {
		public:
			bool m_bDisabled; // 0x4f0 | Schema_Builtin | Size: 0x1
			bool m_bWaitForRefire; // 0x4f1 | Schema_Builtin | Size: 0x1
			bool m_bTriggerOnce; // 0x4f2 | Schema_Builtin | Size: 0x1
			bool m_bFastRetrigger; // 0x4f3 | Schema_Builtin | Size: 0x1
			bool m_bPassthoughCaller; // 0x4f4 | Schema_Builtin | Size: 0x1
			S2_PAD(0x3); // End padding
		};
		static_assert(offsetof(CS2::server::CLogicRelay, m_bDisabled) == 0x4F0, "m_bDisabled in CLogicRelay should be at offset 0x4F0");
		static_assert(offsetof(CS2::server::CLogicRelay, m_bWaitForRefire) == 0x4F1, "m_bWaitForRefire in CLogicRelay should be at offset 0x4F1");
		static_assert(offsetof(CS2::server::CLogicRelay, m_bTriggerOnce) == 0x4F2, "m_bTriggerOnce in CLogicRelay should be at offset 0x4F2");
		static_assert(offsetof(CS2::server::CLogicRelay, m_bFastRetrigger) == 0x4F3, "m_bFastRetrigger in CLogicRelay should be at offset 0x4F3");
		static_assert(offsetof(CS2::server::CLogicRelay, m_bPassthoughCaller) == 0x4F4, "m_bPassthoughCaller in CLogicRelay should be at offset 0x4F4");
		static_assert(sizeof(CS2::server::CLogicRelay) == 0x4F8, "CLogicRelay size should be 0x4F8");
	}
}
