// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#include <SDK/GlobalTypes.hpp>

#include <SDK/server/CLogicNPCCounter.hpp>



namespace CS2 {
	namespace server {
		class CLogicNPCCounterAABB : public CS2::server::CLogicNPCCounter {
		public:
			GlobalTypes::Vector m_vDistanceOuterMins; // 0x830 | Schema_Atomic | Size: 0xc
			GlobalTypes::Vector m_vDistanceOuterMaxs; // 0x83c | Schema_Atomic | Size: 0xc
			GlobalTypes::Vector m_vOuterMins; // 0x848 | Schema_Atomic | Size: 0xc
			GlobalTypes::Vector m_vOuterMaxs; // 0x854 | Schema_Atomic | Size: 0xc
		};
		static_assert(offsetof(CS2::server::CLogicNPCCounterAABB, m_vDistanceOuterMins) == 0x830, "m_vDistanceOuterMins in CLogicNPCCounterAABB should be at offset 0x830");
		static_assert(offsetof(CS2::server::CLogicNPCCounterAABB, m_vDistanceOuterMaxs) == 0x83C, "m_vDistanceOuterMaxs in CLogicNPCCounterAABB should be at offset 0x83C");
		static_assert(offsetof(CS2::server::CLogicNPCCounterAABB, m_vOuterMins) == 0x848, "m_vOuterMins in CLogicNPCCounterAABB should be at offset 0x848");
		static_assert(offsetof(CS2::server::CLogicNPCCounterAABB, m_vOuterMaxs) == 0x854, "m_vOuterMaxs in CLogicNPCCounterAABB should be at offset 0x854");
		static_assert(sizeof(CS2::server::CLogicNPCCounterAABB) == 0x860, "CLogicNPCCounterAABB size should be 0x860");
	}
}
