// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#ifndef CUSTOM_GLOBAL_TYPES
	#include "../GlobalTypes.hpp"
#else
	#include "../Custom/GlobalTypes.hpp"
#endif


#include "CLogicalEntity.hpp"





using namespace GlobalTypes;
namespace CS2 {
	namespace server {
		class CLogicDistanceAutosave : public CS2::server::CLogicalEntity {
		public:
			GlobalTypes::CUtlSymbolLarge m_iszTargetEntity; // 0x4a8 | Schema_Atomic | Size: 0x8
			float32 m_flDistanceToPlayer; // 0x4b0 | Schema_Builtin | Size: 0x4
			bool m_bForceNewLevelUnit; // 0x4b4 | Schema_Builtin | Size: 0x1
			bool m_bCheckCough; // 0x4b5 | Schema_Builtin | Size: 0x1
			bool m_bThinkDangerous; // 0x4b6 | Schema_Builtin | Size: 0x1
			S2_PAD(0x1);
			float32 m_flDangerousTime; // 0x4b8 | Schema_Builtin | Size: 0x4
			S2_PAD(0x4); // End padding
		};
		static_assert(offsetof(CS2::server::CLogicDistanceAutosave, m_iszTargetEntity) == 0x4A8, "m_iszTargetEntity in CLogicDistanceAutosave should be at offset 0x4A8");
		static_assert(offsetof(CS2::server::CLogicDistanceAutosave, m_flDistanceToPlayer) == 0x4B0, "m_flDistanceToPlayer in CLogicDistanceAutosave should be at offset 0x4B0");
		static_assert(offsetof(CS2::server::CLogicDistanceAutosave, m_bForceNewLevelUnit) == 0x4B4, "m_bForceNewLevelUnit in CLogicDistanceAutosave should be at offset 0x4B4");
		static_assert(offsetof(CS2::server::CLogicDistanceAutosave, m_bCheckCough) == 0x4B5, "m_bCheckCough in CLogicDistanceAutosave should be at offset 0x4B5");
		static_assert(offsetof(CS2::server::CLogicDistanceAutosave, m_bThinkDangerous) == 0x4B6, "m_bThinkDangerous in CLogicDistanceAutosave should be at offset 0x4B6");
		static_assert(offsetof(CS2::server::CLogicDistanceAutosave, m_flDangerousTime) == 0x4B8, "m_flDangerousTime in CLogicDistanceAutosave should be at offset 0x4B8");
		static_assert(sizeof(CS2::server::CLogicDistanceAutosave) == 0x4C0, "CLogicDistanceAutosave size should be 0x4C0");
	}
}
