// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#ifndef CUSTOM_GLOBAL_TYPES
	#include <SDK/GlobalTypes.hpp>
#else
	#include <Custom/GlobalTypes.hpp>
#endif


#include <SDK/server/CLogicalEntity.hpp>
#include <SDK/entity2/CEntityIOOutput.hpp>





using namespace GlobalTypes;
namespace CS2 {
	namespace server {
		class CLogicBranch : public CS2::server::CLogicalEntity {
		public:
			bool m_bInValue; // 0x4f0 | Schema_Builtin | Size: 0x1
			S2_PAD(0x7);
			// server::CUtlVector< server.dll::CHandle< CBaseEntity > > m_Listeners; // 0x4f8 | Schema_Atomic | Size: 0x18
			char  m_Listeners[0x18]; // 0x4f8 | Schema_Atomic | Size: 0x18
			entity2::CEntityIOOutput m_OnTrue; // 0x510 | Schema_DeclaredClass | Size: 0x28
			entity2::CEntityIOOutput m_OnFalse; // 0x538 | Schema_DeclaredClass | Size: 0x28
		};
		static_assert(offsetof(CS2::server::CLogicBranch, m_bInValue) == 0x4F0, "m_bInValue in CLogicBranch should be at offset 0x4F0");
		static_assert(offsetof(CS2::server::CLogicBranch, m_Listeners) == 0x4F8, "m_Listeners in CLogicBranch should be at offset 0x4F8");
		static_assert(offsetof(CS2::server::CLogicBranch, m_OnTrue) == 0x510, "m_OnTrue in CLogicBranch should be at offset 0x510");
		static_assert(offsetof(CS2::server::CLogicBranch, m_OnFalse) == 0x538, "m_OnFalse in CLogicBranch should be at offset 0x538");
		static_assert(sizeof(CS2::server::CLogicBranch) == 0x560, "CLogicBranch size should be 0x560");
	}
}
