// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#ifndef CUSTOM_GLOBAL_TYPES
	#include "../GlobalTypes.hpp"
#else
	#include <Custom/GlobalTypes.hpp>
#endif


#include "CLogicNPCCounter.hpp"





using namespace GlobalTypes;
namespace CS2 {
	namespace server {
		class CLogicNPCCounterAABB : public CS2::server::CLogicNPCCounter {
		public:
			GlobalTypes::Vector m_vDistanceOuterMins; // 0x728 | Schema_Atomic | Size: 0xc
			GlobalTypes::Vector m_vDistanceOuterMaxs; // 0x734 | Schema_Atomic | Size: 0xc
			GlobalTypes::Vector m_vOuterMins; // 0x740 | Schema_Atomic | Size: 0xc
			GlobalTypes::Vector m_vOuterMaxs; // 0x74c | Schema_Atomic | Size: 0xc
		};
#ifdef USE_STATIC_ASSERTS
		static_assert(offsetof(CS2::server::CLogicNPCCounterAABB, m_vDistanceOuterMins) == 0x728, "m_vDistanceOuterMins in CLogicNPCCounterAABB should be at offset 0x728");
		static_assert(offsetof(CS2::server::CLogicNPCCounterAABB, m_vDistanceOuterMaxs) == 0x734, "m_vDistanceOuterMaxs in CLogicNPCCounterAABB should be at offset 0x734");
		static_assert(offsetof(CS2::server::CLogicNPCCounterAABB, m_vOuterMins) == 0x740, "m_vOuterMins in CLogicNPCCounterAABB should be at offset 0x740");
		static_assert(offsetof(CS2::server::CLogicNPCCounterAABB, m_vOuterMaxs) == 0x74C, "m_vOuterMaxs in CLogicNPCCounterAABB should be at offset 0x74C");
		static_assert(sizeof(CS2::server::CLogicNPCCounterAABB) == 0x758, "CLogicNPCCounterAABB size should be 0x758");

#endif
	}
}
