// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#ifndef CUSTOM_GLOBAL_TYPES
	#include "../GlobalTypes.hpp"
#else
	#include <Custom/GlobalTypes.hpp>
#endif


#include "CLogicalEntity.hpp"



namespace CS2 {
	namespace server {
		class CBaseEntity;
	}
}


using namespace GlobalTypes;
namespace CS2 {
	namespace server {
		class CLogicLineToEntity : public CS2::server::CLogicalEntity {
		public:
			// GlobalTypes::CEntityOutputTemplate< Vector, Vector > m_Line; // 0x4a8 | Schema_Atomic | Size: 0x28
			char m_Line[0x28]; // 0x4a8 | Schema_Atomic | Size: 0x28
			GlobalTypes::CUtlSymbolLarge m_SourceName; // 0x4d0 | Schema_Atomic | Size: 0x8
			GlobalTypes::CHandle<server::CBaseEntity> m_StartEntity; // 0x4d8 | Schema_Atomic | Size: 0x4
			// char m_StartEntity[0x4]; // 0x4d8 | Schema_Atomic | Size: 0x4
			GlobalTypes::CHandle<server::CBaseEntity> m_EndEntity; // 0x4dc | Schema_Atomic | Size: 0x4
			// char m_EndEntity[0x4]; // 0x4dc | Schema_Atomic | Size: 0x4
		};
#ifdef USE_STATIC_ASSERTS
		static_assert(offsetof(CS2::server::CLogicLineToEntity, m_Line) == 0x4A8, "m_Line in CLogicLineToEntity should be at offset 0x4A8");
		static_assert(offsetof(CS2::server::CLogicLineToEntity, m_SourceName) == 0x4D0, "m_SourceName in CLogicLineToEntity should be at offset 0x4D0");
		static_assert(offsetof(CS2::server::CLogicLineToEntity, m_StartEntity) == 0x4D8, "m_StartEntity in CLogicLineToEntity should be at offset 0x4D8");
		static_assert(offsetof(CS2::server::CLogicLineToEntity, m_EndEntity) == 0x4DC, "m_EndEntity in CLogicLineToEntity should be at offset 0x4DC");
		static_assert(sizeof(CS2::server::CLogicLineToEntity) == 0x4E0, "CLogicLineToEntity size should be 0x4E0");

#endif
	}
}
