// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#ifndef CUSTOM_GLOBAL_TYPES
	#include <SDK/GlobalTypes.hpp>
#else
	#include <Custom/GlobalTypes.hpp>
#endif


#include <SDK/server/CPointEntity.hpp>





using namespace GlobalTypes;
namespace CS2 {
	namespace server {
		class CMapInfo : public CS2::server::CPointEntity {
		public:
			int32_t m_iBuyingStatus; // 0x4a8 | Schema_Builtin | Size: 0x4
			float32 m_flBombRadius; // 0x4ac | Schema_Builtin | Size: 0x4
			int32_t m_iPetPopulation; // 0x4b0 | Schema_Builtin | Size: 0x4
			bool m_bUseNormalSpawnsForDM; // 0x4b4 | Schema_Builtin | Size: 0x1
			bool m_bDisableAutoGeneratedDMSpawns; // 0x4b5 | Schema_Builtin | Size: 0x1
			S2_PAD(0x2);
			float32 m_flBotMaxVisionDistance; // 0x4b8 | Schema_Builtin | Size: 0x4
			int32_t m_iHostageCount; // 0x4bc | Schema_Builtin | Size: 0x4
			bool m_bFadePlayerVisibilityFarZ; // 0x4c0 | Schema_Builtin | Size: 0x1
			bool m_bRainTraceToSkyEnabled; // 0x4c1 | Schema_Builtin | Size: 0x1
			S2_PAD(0x2);
			float32 m_flEnvRainStrength; // 0x4c4 | Schema_Builtin | Size: 0x4
			float32 m_flEnvPuddleRippleStrength; // 0x4c8 | Schema_Builtin | Size: 0x4
			float32 m_flEnvPuddleRippleDirection; // 0x4cc | Schema_Builtin | Size: 0x4
			float32 m_flEnvWetnessCoverage; // 0x4d0 | Schema_Builtin | Size: 0x4
			float32 m_flEnvWetnessDryingAmount; // 0x4d4 | Schema_Builtin | Size: 0x4
		};
		static_assert(offsetof(CS2::server::CMapInfo, m_iBuyingStatus) == 0x4A8, "m_iBuyingStatus in CMapInfo should be at offset 0x4A8");
		static_assert(offsetof(CS2::server::CMapInfo, m_flBombRadius) == 0x4AC, "m_flBombRadius in CMapInfo should be at offset 0x4AC");
		static_assert(offsetof(CS2::server::CMapInfo, m_iPetPopulation) == 0x4B0, "m_iPetPopulation in CMapInfo should be at offset 0x4B0");
		static_assert(offsetof(CS2::server::CMapInfo, m_bUseNormalSpawnsForDM) == 0x4B4, "m_bUseNormalSpawnsForDM in CMapInfo should be at offset 0x4B4");
		static_assert(offsetof(CS2::server::CMapInfo, m_bDisableAutoGeneratedDMSpawns) == 0x4B5, "m_bDisableAutoGeneratedDMSpawns in CMapInfo should be at offset 0x4B5");
		static_assert(offsetof(CS2::server::CMapInfo, m_flBotMaxVisionDistance) == 0x4B8, "m_flBotMaxVisionDistance in CMapInfo should be at offset 0x4B8");
		static_assert(offsetof(CS2::server::CMapInfo, m_iHostageCount) == 0x4BC, "m_iHostageCount in CMapInfo should be at offset 0x4BC");
		static_assert(offsetof(CS2::server::CMapInfo, m_bFadePlayerVisibilityFarZ) == 0x4C0, "m_bFadePlayerVisibilityFarZ in CMapInfo should be at offset 0x4C0");
		static_assert(offsetof(CS2::server::CMapInfo, m_bRainTraceToSkyEnabled) == 0x4C1, "m_bRainTraceToSkyEnabled in CMapInfo should be at offset 0x4C1");
		static_assert(offsetof(CS2::server::CMapInfo, m_flEnvRainStrength) == 0x4C4, "m_flEnvRainStrength in CMapInfo should be at offset 0x4C4");
		static_assert(offsetof(CS2::server::CMapInfo, m_flEnvPuddleRippleStrength) == 0x4C8, "m_flEnvPuddleRippleStrength in CMapInfo should be at offset 0x4C8");
		static_assert(offsetof(CS2::server::CMapInfo, m_flEnvPuddleRippleDirection) == 0x4CC, "m_flEnvPuddleRippleDirection in CMapInfo should be at offset 0x4CC");
		static_assert(offsetof(CS2::server::CMapInfo, m_flEnvWetnessCoverage) == 0x4D0, "m_flEnvWetnessCoverage in CMapInfo should be at offset 0x4D0");
		static_assert(offsetof(CS2::server::CMapInfo, m_flEnvWetnessDryingAmount) == 0x4D4, "m_flEnvWetnessDryingAmount in CMapInfo should be at offset 0x4D4");
		static_assert(sizeof(CS2::server::CMapInfo) == 0x4D8, "CMapInfo size should be 0x4D8");
	}
}
