// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#ifndef CUSTOM_GLOBAL_TYPES
	#include "../GlobalTypes.hpp"
#else
	#include "../Custom/GlobalTypes.hpp"
#endif


#include "CBaseEntity.hpp"





using namespace GlobalTypes;
namespace CS2 {
	namespace server {
		class CMapVetoPickController : public CS2::server::CBaseEntity {
		public:
			bool m_bPlayedIntroVcd; // 0x4a8 | Schema_Builtin | Size: 0x1
			bool m_bNeedToPlayFiveSecondsRemaining; // 0x4a9 | Schema_Builtin | Size: 0x1
			S2_PAD(0x1e);
			float64 m_dblPreMatchDraftSequenceTime; // 0x4c8 | Schema_Builtin | Size: 0x8
			bool m_bPreMatchDraftStateChanged; // 0x4d0 | Schema_Builtin | Size: 0x1
			S2_PAD(0x3);
			int32_t m_nDraftType; // 0x4d4 | Schema_Builtin | Size: 0x4
			int32_t m_nTeamWinningCoinToss; // 0x4d8 | Schema_Builtin | Size: 0x4
			int32_t m_nTeamWithFirstChoice[64]; // 0x4dc | Schema_FixedArray | Size: 0x100
			int32_t m_nVoteMapIdsList[7]; // 0x5dc | Schema_FixedArray | Size: 0x1c
			int32_t m_nAccountIDs[64]; // 0x5f8 | Schema_FixedArray | Size: 0x100
			int32_t m_nMapId0[64]; // 0x6f8 | Schema_FixedArray | Size: 0x100
			int32_t m_nMapId1[64]; // 0x7f8 | Schema_FixedArray | Size: 0x100
			int32_t m_nMapId2[64]; // 0x8f8 | Schema_FixedArray | Size: 0x100
			int32_t m_nMapId3[64]; // 0x9f8 | Schema_FixedArray | Size: 0x100
			int32_t m_nMapId4[64]; // 0xaf8 | Schema_FixedArray | Size: 0x100
			int32_t m_nMapId5[64]; // 0xbf8 | Schema_FixedArray | Size: 0x100
			int32_t m_nStartingSide0[64]; // 0xcf8 | Schema_FixedArray | Size: 0x100
			int32_t m_nCurrentPhase; // 0xdf8 | Schema_Builtin | Size: 0x4
			int32_t m_nPhaseStartTick; // 0xdfc | Schema_Builtin | Size: 0x4
			int32_t m_nPhaseDurationTicks; // 0xe00 | Schema_Builtin | Size: 0x4
			S2_PAD(0x4);
			// GlobalTypes::CEntityOutputTemplate< CUtlSymbolLarge, CUtlSymbolLarge > m_OnMapVetoed; // 0xe08 | Schema_Atomic | Size: 0x20
			char m_OnMapVetoed[0x20]; // 0xe08 | Schema_Atomic | Size: 0x20
			// GlobalTypes::CEntityOutputTemplate< CUtlSymbolLarge, CUtlSymbolLarge > m_OnMapPicked; // 0xe28 | Schema_Atomic | Size: 0x20
			char m_OnMapPicked[0x20]; // 0xe28 | Schema_Atomic | Size: 0x20
			// GlobalTypes::CEntityOutputTemplate< int32, int32 > m_OnSidesPicked; // 0xe48 | Schema_Atomic | Size: 0x20
			char m_OnSidesPicked[0x20]; // 0xe48 | Schema_Atomic | Size: 0x20
			// GlobalTypes::CEntityOutputTemplate< int32, int32 > m_OnNewPhaseStarted; // 0xe68 | Schema_Atomic | Size: 0x20
			char m_OnNewPhaseStarted[0x20]; // 0xe68 | Schema_Atomic | Size: 0x20
			// GlobalTypes::CEntityOutputTemplate< int32, int32 > m_OnLevelTransition; // 0xe88 | Schema_Atomic | Size: 0x20
			char m_OnLevelTransition[0x20]; // 0xe88 | Schema_Atomic | Size: 0x20
		};
		static_assert(offsetof(CS2::server::CMapVetoPickController, m_bPlayedIntroVcd) == 0x4A8, "m_bPlayedIntroVcd in CMapVetoPickController should be at offset 0x4A8");
		static_assert(offsetof(CS2::server::CMapVetoPickController, m_bNeedToPlayFiveSecondsRemaining) == 0x4A9, "m_bNeedToPlayFiveSecondsRemaining in CMapVetoPickController should be at offset 0x4A9");
		static_assert(offsetof(CS2::server::CMapVetoPickController, m_dblPreMatchDraftSequenceTime) == 0x4C8, "m_dblPreMatchDraftSequenceTime in CMapVetoPickController should be at offset 0x4C8");
		static_assert(offsetof(CS2::server::CMapVetoPickController, m_bPreMatchDraftStateChanged) == 0x4D0, "m_bPreMatchDraftStateChanged in CMapVetoPickController should be at offset 0x4D0");
		static_assert(offsetof(CS2::server::CMapVetoPickController, m_nDraftType) == 0x4D4, "m_nDraftType in CMapVetoPickController should be at offset 0x4D4");
		static_assert(offsetof(CS2::server::CMapVetoPickController, m_nTeamWinningCoinToss) == 0x4D8, "m_nTeamWinningCoinToss in CMapVetoPickController should be at offset 0x4D8");
		static_assert(offsetof(CS2::server::CMapVetoPickController, m_nTeamWithFirstChoice) == 0x4DC, "m_nTeamWithFirstChoice in CMapVetoPickController should be at offset 0x4DC");
		static_assert(offsetof(CS2::server::CMapVetoPickController, m_nVoteMapIdsList) == 0x5DC, "m_nVoteMapIdsList in CMapVetoPickController should be at offset 0x5DC");
		static_assert(offsetof(CS2::server::CMapVetoPickController, m_nAccountIDs) == 0x5F8, "m_nAccountIDs in CMapVetoPickController should be at offset 0x5F8");
		static_assert(offsetof(CS2::server::CMapVetoPickController, m_nMapId0) == 0x6F8, "m_nMapId0 in CMapVetoPickController should be at offset 0x6F8");
		static_assert(offsetof(CS2::server::CMapVetoPickController, m_nMapId1) == 0x7F8, "m_nMapId1 in CMapVetoPickController should be at offset 0x7F8");
		static_assert(offsetof(CS2::server::CMapVetoPickController, m_nMapId2) == 0x8F8, "m_nMapId2 in CMapVetoPickController should be at offset 0x8F8");
		static_assert(offsetof(CS2::server::CMapVetoPickController, m_nMapId3) == 0x9F8, "m_nMapId3 in CMapVetoPickController should be at offset 0x9F8");
		static_assert(offsetof(CS2::server::CMapVetoPickController, m_nMapId4) == 0xAF8, "m_nMapId4 in CMapVetoPickController should be at offset 0xAF8");
		static_assert(offsetof(CS2::server::CMapVetoPickController, m_nMapId5) == 0xBF8, "m_nMapId5 in CMapVetoPickController should be at offset 0xBF8");
		static_assert(offsetof(CS2::server::CMapVetoPickController, m_nStartingSide0) == 0xCF8, "m_nStartingSide0 in CMapVetoPickController should be at offset 0xCF8");
		static_assert(offsetof(CS2::server::CMapVetoPickController, m_nCurrentPhase) == 0xDF8, "m_nCurrentPhase in CMapVetoPickController should be at offset 0xDF8");
		static_assert(offsetof(CS2::server::CMapVetoPickController, m_nPhaseStartTick) == 0xDFC, "m_nPhaseStartTick in CMapVetoPickController should be at offset 0xDFC");
		static_assert(offsetof(CS2::server::CMapVetoPickController, m_nPhaseDurationTicks) == 0xE00, "m_nPhaseDurationTicks in CMapVetoPickController should be at offset 0xE00");
		static_assert(offsetof(CS2::server::CMapVetoPickController, m_OnMapVetoed) == 0xE08, "m_OnMapVetoed in CMapVetoPickController should be at offset 0xE08");
		static_assert(offsetof(CS2::server::CMapVetoPickController, m_OnMapPicked) == 0xE28, "m_OnMapPicked in CMapVetoPickController should be at offset 0xE28");
		static_assert(offsetof(CS2::server::CMapVetoPickController, m_OnSidesPicked) == 0xE48, "m_OnSidesPicked in CMapVetoPickController should be at offset 0xE48");
		static_assert(offsetof(CS2::server::CMapVetoPickController, m_OnNewPhaseStarted) == 0xE68, "m_OnNewPhaseStarted in CMapVetoPickController should be at offset 0xE68");
		static_assert(offsetof(CS2::server::CMapVetoPickController, m_OnLevelTransition) == 0xE88, "m_OnLevelTransition in CMapVetoPickController should be at offset 0xE88");
		static_assert(sizeof(CS2::server::CMapVetoPickController) == 0xEA8, "CMapVetoPickController size should be 0xEA8");
	}
}
