// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#include <SDK/GlobalTypes.hpp>

#include <SDK/server/CMarkupVolumeTagged.hpp>



namespace CS2 {
	namespace server {
		class CMarkupVolumeWithRef : public CS2::server::CMarkupVolumeTagged {
		public:
			S2_PAD(0x8);
			bool m_bUseRef; // 0x830 | Schema_Builtin | Size: 0x1
			S2_PAD(0x3);
			GlobalTypes::Vector m_vRefPosEntitySpace; // 0x834 | Schema_Atomic | Size: 0xc
			GlobalTypes::Vector m_vRefPosWorldSpace; // 0x840 | Schema_Atomic | Size: 0xc
			float32 m_flRefDot; // 0x84c | Schema_Builtin | Size: 0x4
		};
		static_assert(offsetof(CS2::server::CMarkupVolumeWithRef, m_bUseRef) == 0x830, "m_bUseRef in CMarkupVolumeWithRef should be at offset 0x830");
		static_assert(offsetof(CS2::server::CMarkupVolumeWithRef, m_vRefPosEntitySpace) == 0x834, "m_vRefPosEntitySpace in CMarkupVolumeWithRef should be at offset 0x834");
		static_assert(offsetof(CS2::server::CMarkupVolumeWithRef, m_vRefPosWorldSpace) == 0x840, "m_vRefPosWorldSpace in CMarkupVolumeWithRef should be at offset 0x840");
		static_assert(offsetof(CS2::server::CMarkupVolumeWithRef, m_flRefDot) == 0x84C, "m_flRefDot in CMarkupVolumeWithRef should be at offset 0x84C");
		static_assert(sizeof(CS2::server::CMarkupVolumeWithRef) == 0x850, "CMarkupVolumeWithRef size should be 0x850");
	}
}
