// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#ifndef CUSTOM_GLOBAL_TYPES
	#include "../GlobalTypes.hpp"
#else
	#include <Custom/GlobalTypes.hpp>
#endif


#include "CMarkupVolume.hpp"





using namespace GlobalTypes;
namespace CS2 {
	namespace server {
		class CMarkupVolumeTagged : public CS2::server::CMarkupVolume {
		public:
			GlobalTypes::CUtlVector<GlobalTypes::CGlobalSymbol> m_GroupNames; // 0x738 | Schema_Atomic | Size: 0x18
			// char m_GroupNames[0x18]; // 0x738 | Schema_Atomic | Size: 0x18
			GlobalTypes::CUtlVector<GlobalTypes::CGlobalSymbol> m_Tags; // 0x750 | Schema_Atomic | Size: 0x18
			// char m_Tags[0x18]; // 0x750 | Schema_Atomic | Size: 0x18
			bool m_bIsGroup; // 0x768 | Schema_Builtin | Size: 0x1
			bool m_bGroupByPrefab; // 0x769 | Schema_Builtin | Size: 0x1
			bool m_bGroupByVolume; // 0x76a | Schema_Builtin | Size: 0x1
			bool m_bGroupOtherGroups; // 0x76b | Schema_Builtin | Size: 0x1
			bool m_bIsInGroup; // 0x76c | Schema_Builtin | Size: 0x1
			S2_PAD(0x3); // End padding
		};
#ifdef USE_STATIC_ASSERTS
		static_assert(offsetof(CS2::server::CMarkupVolumeTagged, m_GroupNames) == 0x738, "m_GroupNames in CMarkupVolumeTagged should be at offset 0x738");
		static_assert(offsetof(CS2::server::CMarkupVolumeTagged, m_Tags) == 0x750, "m_Tags in CMarkupVolumeTagged should be at offset 0x750");
		static_assert(offsetof(CS2::server::CMarkupVolumeTagged, m_bIsGroup) == 0x768, "m_bIsGroup in CMarkupVolumeTagged should be at offset 0x768");
		static_assert(offsetof(CS2::server::CMarkupVolumeTagged, m_bGroupByPrefab) == 0x769, "m_bGroupByPrefab in CMarkupVolumeTagged should be at offset 0x769");
		static_assert(offsetof(CS2::server::CMarkupVolumeTagged, m_bGroupByVolume) == 0x76A, "m_bGroupByVolume in CMarkupVolumeTagged should be at offset 0x76A");
		static_assert(offsetof(CS2::server::CMarkupVolumeTagged, m_bGroupOtherGroups) == 0x76B, "m_bGroupOtherGroups in CMarkupVolumeTagged should be at offset 0x76B");
		static_assert(offsetof(CS2::server::CMarkupVolumeTagged, m_bIsInGroup) == 0x76C, "m_bIsInGroup in CMarkupVolumeTagged should be at offset 0x76C");
		static_assert(sizeof(CS2::server::CMarkupVolumeTagged) == 0x770, "CMarkupVolumeTagged size should be 0x770");

#endif
	}
}
