// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#include <SDK/GlobalTypes.hpp>

#include <SDK/server/CMarkupVolume.hpp>



namespace CS2 {
	namespace server {
		class CMarkupVolumeTagged : public CS2::server::CMarkupVolume {
		public:
			// GlobalTypes::CUtlVector< GlobalTypes::CGlobalSymbol > m_GroupNames; // 0x7f0 | Schema_Atomic | Size: 0x18
			char  m_GroupNames[0x18]; // 0x7f0 | Schema_Atomic | Size: 0x18
			// GlobalTypes::CUtlVector< GlobalTypes::CGlobalSymbol > m_Tags; // 0x808 | Schema_Atomic | Size: 0x18
			char  m_Tags[0x18]; // 0x808 | Schema_Atomic | Size: 0x18
			bool m_bIsGroup; // 0x820 | Schema_Builtin | Size: 0x1
			bool m_bGroupByPrefab; // 0x821 | Schema_Builtin | Size: 0x1
			bool m_bGroupByVolume; // 0x822 | Schema_Builtin | Size: 0x1
			bool m_bGroupOtherGroups; // 0x823 | Schema_Builtin | Size: 0x1
			bool m_bIsInGroup; // 0x824 | Schema_Builtin | Size: 0x1
			S2_PAD(0x3); // End padding
		};
		static_assert(offsetof(CS2::server::CMarkupVolumeTagged, m_GroupNames) == 0x7F0, "m_GroupNames in CMarkupVolumeTagged should be at offset 0x7F0");
		static_assert(offsetof(CS2::server::CMarkupVolumeTagged, m_Tags) == 0x808, "m_Tags in CMarkupVolumeTagged should be at offset 0x808");
		static_assert(offsetof(CS2::server::CMarkupVolumeTagged, m_bIsGroup) == 0x820, "m_bIsGroup in CMarkupVolumeTagged should be at offset 0x820");
		static_assert(offsetof(CS2::server::CMarkupVolumeTagged, m_bGroupByPrefab) == 0x821, "m_bGroupByPrefab in CMarkupVolumeTagged should be at offset 0x821");
		static_assert(offsetof(CS2::server::CMarkupVolumeTagged, m_bGroupByVolume) == 0x822, "m_bGroupByVolume in CMarkupVolumeTagged should be at offset 0x822");
		static_assert(offsetof(CS2::server::CMarkupVolumeTagged, m_bGroupOtherGroups) == 0x823, "m_bGroupOtherGroups in CMarkupVolumeTagged should be at offset 0x823");
		static_assert(offsetof(CS2::server::CMarkupVolumeTagged, m_bIsInGroup) == 0x824, "m_bIsInGroup in CMarkupVolumeTagged should be at offset 0x824");
		static_assert(sizeof(CS2::server::CMarkupVolumeTagged) == 0x828, "CMarkupVolumeTagged size should be 0x828");
	}
}
