// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#ifndef CUSTOM_GLOBAL_TYPES
	#include <SDK/GlobalTypes.hpp>
#else
	#include <Custom/GlobalTypes.hpp>
#endif


#include <SDK/server/CMarkupVolumeTagged.hpp>





using namespace GlobalTypes;
namespace CS2 {
	namespace server {
		class CMarkupVolumeWithRef : public CS2::server::CMarkupVolumeTagged {
		public:
			S2_PAD(0x8);
			bool m_bUseRef; // 0x778 | Schema_Builtin | Size: 0x1
			S2_PAD(0x3);
			GlobalTypes::Vector m_vRefPosEntitySpace; // 0x77c | Schema_Atomic | Size: 0xc
			GlobalTypes::VectorWS m_vRefPosWorldSpace; // 0x788 | Schema_Atomic | Size: 0xc
			float32 m_flRefDot; // 0x794 | Schema_Builtin | Size: 0x4
		};
		static_assert(offsetof(CS2::server::CMarkupVolumeWithRef, m_bUseRef) == 0x778, "m_bUseRef in CMarkupVolumeWithRef should be at offset 0x778");
		static_assert(offsetof(CS2::server::CMarkupVolumeWithRef, m_vRefPosEntitySpace) == 0x77C, "m_vRefPosEntitySpace in CMarkupVolumeWithRef should be at offset 0x77C");
		static_assert(offsetof(CS2::server::CMarkupVolumeWithRef, m_vRefPosWorldSpace) == 0x788, "m_vRefPosWorldSpace in CMarkupVolumeWithRef should be at offset 0x788");
		static_assert(offsetof(CS2::server::CMarkupVolumeWithRef, m_flRefDot) == 0x794, "m_flRefDot in CMarkupVolumeWithRef should be at offset 0x794");
		static_assert(sizeof(CS2::server::CMarkupVolumeWithRef) == 0x798, "CMarkupVolumeWithRef size should be 0x798");
	}
}
