// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#ifndef CUSTOM_GLOBAL_TYPES
	#include "../GlobalTypes.hpp"
#else
	#include "../Custom/GlobalTypes.hpp"
#endif


#include "CLogicalEntity.hpp"
#include "../entity2/CEntityIOOutput.hpp"





using namespace GlobalTypes;
namespace CS2 {
	namespace server {
		class CMathCounter : public CS2::server::CLogicalEntity {
		public:
			float32 m_flMin; // 0x4a8 | Schema_Builtin | Size: 0x4
			float32 m_flMax; // 0x4ac | Schema_Builtin | Size: 0x4
			bool m_bHitMin; // 0x4b0 | Schema_Builtin | Size: 0x1
			bool m_bHitMax; // 0x4b1 | Schema_Builtin | Size: 0x1
			bool m_bDisabled; // 0x4b2 | Schema_Builtin | Size: 0x1
			S2_PAD(0x5);
			// GlobalTypes::CEntityOutputTemplate< float32, float32 > m_OutValue; // 0x4b8 | Schema_Atomic | Size: 0x20
			char m_OutValue[0x20]; // 0x4b8 | Schema_Atomic | Size: 0x20
			// GlobalTypes::CEntityOutputTemplate< float32, float32 > m_OnGetValue; // 0x4d8 | Schema_Atomic | Size: 0x20
			char m_OnGetValue[0x20]; // 0x4d8 | Schema_Atomic | Size: 0x20
			entity2::CEntityIOOutput m_OnHitMin; // 0x4f8 | Schema_DeclaredClass | Size: 0x18
			entity2::CEntityIOOutput m_OnHitMax; // 0x510 | Schema_DeclaredClass | Size: 0x18
			entity2::CEntityIOOutput m_OnChangedFromMin; // 0x528 | Schema_DeclaredClass | Size: 0x18
			entity2::CEntityIOOutput m_OnChangedFromMax; // 0x540 | Schema_DeclaredClass | Size: 0x18
		};
#ifdef USE_STATIC_ASSERTS
		static_assert(offsetof(CS2::server::CMathCounter, m_flMin) == 0x4A8, "m_flMin in CMathCounter should be at offset 0x4A8");
		static_assert(offsetof(CS2::server::CMathCounter, m_flMax) == 0x4AC, "m_flMax in CMathCounter should be at offset 0x4AC");
		static_assert(offsetof(CS2::server::CMathCounter, m_bHitMin) == 0x4B0, "m_bHitMin in CMathCounter should be at offset 0x4B0");
		static_assert(offsetof(CS2::server::CMathCounter, m_bHitMax) == 0x4B1, "m_bHitMax in CMathCounter should be at offset 0x4B1");
		static_assert(offsetof(CS2::server::CMathCounter, m_bDisabled) == 0x4B2, "m_bDisabled in CMathCounter should be at offset 0x4B2");
		static_assert(offsetof(CS2::server::CMathCounter, m_OutValue) == 0x4B8, "m_OutValue in CMathCounter should be at offset 0x4B8");
		static_assert(offsetof(CS2::server::CMathCounter, m_OnGetValue) == 0x4D8, "m_OnGetValue in CMathCounter should be at offset 0x4D8");
		static_assert(offsetof(CS2::server::CMathCounter, m_OnHitMin) == 0x4F8, "m_OnHitMin in CMathCounter should be at offset 0x4F8");
		static_assert(offsetof(CS2::server::CMathCounter, m_OnHitMax) == 0x510, "m_OnHitMax in CMathCounter should be at offset 0x510");
		static_assert(offsetof(CS2::server::CMathCounter, m_OnChangedFromMin) == 0x528, "m_OnChangedFromMin in CMathCounter should be at offset 0x528");
		static_assert(offsetof(CS2::server::CMathCounter, m_OnChangedFromMax) == 0x540, "m_OnChangedFromMax in CMathCounter should be at offset 0x540");
		static_assert(sizeof(CS2::server::CMathCounter) == 0x558, "CMathCounter size should be 0x558");

#endif
	}
}
