// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#ifndef CUSTOM_GLOBAL_TYPES
	#include <SDK/GlobalTypes.hpp>
#else
	#include <Custom/GlobalTypes.hpp>
#endif


#include <SDK/server/CPointEntity.hpp>





using namespace GlobalTypes;
namespace CS2 {
	namespace server {
		class CMessageEntity : public CS2::server::CPointEntity {
		public:
			int32_t m_radius; // 0x4a8 | Schema_Builtin | Size: 0x4
			S2_PAD(0x4);
			GlobalTypes::CUtlSymbolLarge m_messageText; // 0x4b0 | Schema_Atomic | Size: 0x8
			bool m_drawText; // 0x4b8 | Schema_Builtin | Size: 0x1
			bool m_bDeveloperOnly; // 0x4b9 | Schema_Builtin | Size: 0x1
			bool m_bEnabled; // 0x4ba | Schema_Builtin | Size: 0x1
			S2_PAD(0x5); // End padding
		};
		static_assert(offsetof(CS2::server::CMessageEntity, m_radius) == 0x4A8, "m_radius in CMessageEntity should be at offset 0x4A8");
		static_assert(offsetof(CS2::server::CMessageEntity, m_messageText) == 0x4B0, "m_messageText in CMessageEntity should be at offset 0x4B0");
		static_assert(offsetof(CS2::server::CMessageEntity, m_drawText) == 0x4B8, "m_drawText in CMessageEntity should be at offset 0x4B8");
		static_assert(offsetof(CS2::server::CMessageEntity, m_bDeveloperOnly) == 0x4B9, "m_bDeveloperOnly in CMessageEntity should be at offset 0x4B9");
		static_assert(offsetof(CS2::server::CMessageEntity, m_bEnabled) == 0x4BA, "m_bEnabled in CMessageEntity should be at offset 0x4BA");
		static_assert(sizeof(CS2::server::CMessageEntity) == 0x4C0, "CMessageEntity size should be 0x4C0");
	}
}
