// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#ifndef CUSTOM_GLOBAL_TYPES
	#include <SDK/GlobalTypes.hpp>
#else
	#include <Custom/GlobalTypes.hpp>
#endif







using namespace GlobalTypes;
namespace CS2 {
	namespace server {
		class CModelState  {
		public:
			S2_PAD(0xa0);
			// GlobalTypes::CStrongHandle<resourcesystem::InfoForResourceTypeCModel> m_hModel; // 0xa0 | Schema_Atomic | Size: 0x8
			char m_hModel[0x8]; // 0xa0 | Schema_Atomic | Size: 0x8
			GlobalTypes::CUtlSymbolLarge m_ModelName; // 0xa8 | Schema_Atomic | Size: 0x8
			S2_PAD(0x45);
			bool m_bClientClothCreationSuppressed; // 0xf5 | Schema_Builtin | Size: 0x1
			S2_PAD(0xaa);
			uint64_t m_MeshGroupMask; // 0x1a0 | Schema_Builtin | Size: 0x8
			S2_PAD(0x48);
			// GlobalTypes::CNetworkUtlVectorBase< int32 > m_nBodyGroupChoices; // 0x1f0 | Schema_Atomic | Size: 0x18
			char m_nBodyGroupChoices[0x18]; // 0x1f0 | Schema_Atomic | Size: 0x18
			S2_PAD(0x32);
			int8_t m_nIdealMotionType; // 0x23a | Schema_Builtin | Size: 0x1
			int8_t m_nForceLOD; // 0x23b | Schema_Builtin | Size: 0x1
			int8_t m_nClothUpdateFlags; // 0x23c | Schema_Builtin | Size: 0x1
			S2_PAD(0x13); // End padding
		};
		static_assert(offsetof(CS2::server::CModelState, m_hModel) == 0xA0, "m_hModel in CModelState should be at offset 0xA0");
		static_assert(offsetof(CS2::server::CModelState, m_ModelName) == 0xA8, "m_ModelName in CModelState should be at offset 0xA8");
		static_assert(offsetof(CS2::server::CModelState, m_bClientClothCreationSuppressed) == 0xF5, "m_bClientClothCreationSuppressed in CModelState should be at offset 0xF5");
		static_assert(offsetof(CS2::server::CModelState, m_MeshGroupMask) == 0x1A0, "m_MeshGroupMask in CModelState should be at offset 0x1A0");
		static_assert(offsetof(CS2::server::CModelState, m_nBodyGroupChoices) == 0x1F0, "m_nBodyGroupChoices in CModelState should be at offset 0x1F0");
		static_assert(offsetof(CS2::server::CModelState, m_nIdealMotionType) == 0x23A, "m_nIdealMotionType in CModelState should be at offset 0x23A");
		static_assert(offsetof(CS2::server::CModelState, m_nForceLOD) == 0x23B, "m_nForceLOD in CModelState should be at offset 0x23B");
		static_assert(offsetof(CS2::server::CModelState, m_nClothUpdateFlags) == 0x23C, "m_nClothUpdateFlags in CModelState should be at offset 0x23C");
		static_assert(sizeof(CS2::server::CModelState) == 0x250, "CModelState size should be 0x250");
	}
}
