// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#include <SDK/GlobalTypes.hpp>

#include <SDK/server/CBaseCSGrenadeProjectile.hpp>
#include <SDK/server/IntervalTimer.hpp>



namespace CS2 {
	namespace server {
		class CMolotovProjectile : public CS2::server::CBaseCSGrenadeProjectile {
		public:
			bool m_bIsIncGrenade; // 0xc20 | Schema_Builtin | Size: 0x1
			S2_PAD(0x17);
			bool m_bDetonated; // 0xc38 | Schema_Builtin | Size: 0x1
			S2_PAD(0x7);
			server::IntervalTimer m_stillTimer; // 0xc40 | Schema_DeclaredClass | Size: 0x10
			S2_PAD(0xd0);
			bool m_bHasBouncedOffPlayer; // 0xd20 | Schema_Builtin | Size: 0x1
			S2_PAD(0x7); // End padding
		};
		static_assert(offsetof(CS2::server::CMolotovProjectile, m_bIsIncGrenade) == 0xC20, "m_bIsIncGrenade in CMolotovProjectile should be at offset 0xC20");
		static_assert(offsetof(CS2::server::CMolotovProjectile, m_bDetonated) == 0xC38, "m_bDetonated in CMolotovProjectile should be at offset 0xC38");
		static_assert(offsetof(CS2::server::CMolotovProjectile, m_stillTimer) == 0xC40, "m_stillTimer in CMolotovProjectile should be at offset 0xC40");
		static_assert(offsetof(CS2::server::CMolotovProjectile, m_bHasBouncedOffPlayer) == 0xD20, "m_bHasBouncedOffPlayer in CMolotovProjectile should be at offset 0xD20");
		static_assert(sizeof(CS2::server::CMolotovProjectile) == 0xD28, "CMolotovProjectile size should be 0xD28");
	}
}
