// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#include <SDK/GlobalTypes.hpp>




namespace CS2 {
	namespace server {
		class CMotorController  {
		public:
			S2_PAD(0x8);
			float32 m_speed; // 0x8 | Schema_Builtin | Size: 0x4
			float32 m_maxTorque; // 0xc | Schema_Builtin | Size: 0x4
			GlobalTypes::VectorWS m_axis; // 0x10 | Schema_Atomic | Size: 0xc
			float32 m_inertiaFactor; // 0x1c | Schema_Builtin | Size: 0x4
		};
		static_assert(offsetof(CS2::server::CMotorController, m_speed) == 0x8, "m_speed in CMotorController should be at offset 0x8");
		static_assert(offsetof(CS2::server::CMotorController, m_maxTorque) == 0xC, "m_maxTorque in CMotorController should be at offset 0xC");
		static_assert(offsetof(CS2::server::CMotorController, m_axis) == 0x10, "m_axis in CMotorController should be at offset 0x10");
		static_assert(offsetof(CS2::server::CMotorController, m_inertiaFactor) == 0x1C, "m_inertiaFactor in CMotorController should be at offset 0x1C");
		static_assert(sizeof(CS2::server::CMotorController) == 0x20, "CMotorController size should be 0x20");
	}
}
