// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#include <SDK/GlobalTypes.hpp>

#include <SDK/server/CLogicalEntity.hpp>
#include <SDK/server/CHandle< CBaseEntity >.hpp>
#include <SDK/entity2/CEntityIOOutput.hpp>



namespace CS2 {
	namespace server {
		class CMultiSource : public CS2::server::CLogicalEntity {
		public:
			// server::CHandle< CBaseEntity > m_rgEntities[32]; // 0x4f0 | Schema_FixedArray | Size: 0x80
			char  m_rgEntities[0x4]; // 0x4f0 | Schema_FixedArray | Size: 0x4
			int32_t m_rgTriggered[32]; // 0x570 | Schema_FixedArray | Size: 0x80
			entity2::CEntityIOOutput m_OnTrigger; // 0x5f0 | Schema_DeclaredClass | Size: 0x28
			int32_t m_iTotal; // 0x618 | Schema_Builtin | Size: 0x4
			S2_PAD(0x4);
			GlobalTypes::CUtlSymbolLarge m_globalstate; // 0x620 | Schema_Atomic | Size: 0x8
		};
		static_assert(offsetof(CS2::server::CMultiSource, m_rgEntities) == 0x4F0, "m_rgEntities in CMultiSource should be at offset 0x4F0");
		static_assert(offsetof(CS2::server::CMultiSource, m_rgTriggered) == 0x570, "m_rgTriggered in CMultiSource should be at offset 0x570");
		static_assert(offsetof(CS2::server::CMultiSource, m_OnTrigger) == 0x5F0, "m_OnTrigger in CMultiSource should be at offset 0x5F0");
		static_assert(offsetof(CS2::server::CMultiSource, m_iTotal) == 0x618, "m_iTotal in CMultiSource should be at offset 0x618");
		static_assert(offsetof(CS2::server::CMultiSource, m_globalstate) == 0x620, "m_globalstate in CMultiSource should be at offset 0x620");
		static_assert(sizeof(CS2::server::CMultiSource) == 0x628, "CMultiSource size should be 0x628");
	}
}
