// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#ifndef CUSTOM_GLOBAL_TYPES
	#include <SDK/GlobalTypes.hpp>
#else
	#include <Custom/GlobalTypes.hpp>
#endif


#include <SDK/server/CLogicalEntity.hpp>
#include <SDK/server/CLightEntity.hpp>





using namespace GlobalTypes;
namespace CS2 {
	namespace server {
		class CMultiLightProxy : public CS2::server::CLogicalEntity {
		public:
			GlobalTypes::CUtlSymbolLarge m_iszLightNameFilter; // 0x4a8 | Schema_Atomic | Size: 0x8
			GlobalTypes::CUtlSymbolLarge m_iszLightClassFilter; // 0x4b0 | Schema_Atomic | Size: 0x8
			float32 m_flLightRadiusFilter; // 0x4b8 | Schema_Builtin | Size: 0x4
			float32 m_flBrightnessDelta; // 0x4bc | Schema_Builtin | Size: 0x4
			bool m_bPerformScreenFade; // 0x4c0 | Schema_Builtin | Size: 0x1
			S2_PAD(0x3);
			float32 m_flTargetBrightnessMultiplier; // 0x4c4 | Schema_Builtin | Size: 0x4
			float32 m_flCurrentBrightnessMultiplier; // 0x4c8 | Schema_Builtin | Size: 0x4
			S2_PAD(0x4);
			server::CUtlVector<GlobalTypes::CHandle<server::CLightEntity>> m_vecLights; // 0x4d0 | Schema_Atomic | Size: 0x18
			// char m_vecLights[0x18]; // 0x4d0 | Schema_Atomic | Size: 0x18
		};
		static_assert(offsetof(CS2::server::CMultiLightProxy, m_iszLightNameFilter) == 0x4A8, "m_iszLightNameFilter in CMultiLightProxy should be at offset 0x4A8");
		static_assert(offsetof(CS2::server::CMultiLightProxy, m_iszLightClassFilter) == 0x4B0, "m_iszLightClassFilter in CMultiLightProxy should be at offset 0x4B0");
		static_assert(offsetof(CS2::server::CMultiLightProxy, m_flLightRadiusFilter) == 0x4B8, "m_flLightRadiusFilter in CMultiLightProxy should be at offset 0x4B8");
		static_assert(offsetof(CS2::server::CMultiLightProxy, m_flBrightnessDelta) == 0x4BC, "m_flBrightnessDelta in CMultiLightProxy should be at offset 0x4BC");
		static_assert(offsetof(CS2::server::CMultiLightProxy, m_bPerformScreenFade) == 0x4C0, "m_bPerformScreenFade in CMultiLightProxy should be at offset 0x4C0");
		static_assert(offsetof(CS2::server::CMultiLightProxy, m_flTargetBrightnessMultiplier) == 0x4C4, "m_flTargetBrightnessMultiplier in CMultiLightProxy should be at offset 0x4C4");
		static_assert(offsetof(CS2::server::CMultiLightProxy, m_flCurrentBrightnessMultiplier) == 0x4C8, "m_flCurrentBrightnessMultiplier in CMultiLightProxy should be at offset 0x4C8");
		static_assert(offsetof(CS2::server::CMultiLightProxy, m_vecLights) == 0x4D0, "m_vecLights in CMultiLightProxy should be at offset 0x4D0");
		static_assert(sizeof(CS2::server::CMultiLightProxy) == 0x4E8, "CMultiLightProxy size should be 0x4E8");
	}
}
