// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#include <SDK/GlobalTypes.hpp>

#include <SDK/server/VelocitySampler.hpp>
#include <SDK/server/SimpleConstraintSoundProfile.hpp>



namespace CS2 {
	namespace server {
		class ConstraintSoundInfo  {
		public:
			S2_PAD(0x8);
			server::VelocitySampler m_vSampler; // 0x8 | Schema_DeclaredClass | Size: 0x14
			S2_PAD(0x4);
			server::SimpleConstraintSoundProfile m_soundProfile; // 0x20 | Schema_DeclaredClass | Size: 0x20
			GlobalTypes::Vector m_forwardAxis; // 0x40 | Schema_Atomic | Size: 0xc
			S2_PAD(0x4);
			GlobalTypes::CUtlSymbolLarge m_iszTravelSoundFwd; // 0x50 | Schema_Atomic | Size: 0x8
			GlobalTypes::CUtlSymbolLarge m_iszTravelSoundBack; // 0x58 | Schema_Atomic | Size: 0x8
			S2_PAD(0x18);
			GlobalTypes::CUtlSymbolLarge m_iszReversalSounds[3]; // 0x78 | Schema_FixedArray | Size: 0x18
			bool m_bPlayTravelSound; // 0x90 | Schema_Builtin | Size: 0x1
			bool m_bPlayReversalSound; // 0x91 | Schema_Builtin | Size: 0x1
			S2_PAD(0x6); // End padding
		};
		static_assert(offsetof(CS2::server::ConstraintSoundInfo, m_vSampler) == 0x8, "m_vSampler in ConstraintSoundInfo should be at offset 0x8");
		static_assert(offsetof(CS2::server::ConstraintSoundInfo, m_soundProfile) == 0x20, "m_soundProfile in ConstraintSoundInfo should be at offset 0x20");
		static_assert(offsetof(CS2::server::ConstraintSoundInfo, m_forwardAxis) == 0x40, "m_forwardAxis in ConstraintSoundInfo should be at offset 0x40");
		static_assert(offsetof(CS2::server::ConstraintSoundInfo, m_iszTravelSoundFwd) == 0x50, "m_iszTravelSoundFwd in ConstraintSoundInfo should be at offset 0x50");
		static_assert(offsetof(CS2::server::ConstraintSoundInfo, m_iszTravelSoundBack) == 0x58, "m_iszTravelSoundBack in ConstraintSoundInfo should be at offset 0x58");
		static_assert(offsetof(CS2::server::ConstraintSoundInfo, m_iszReversalSounds) == 0x78, "m_iszReversalSounds in ConstraintSoundInfo should be at offset 0x78");
		static_assert(offsetof(CS2::server::ConstraintSoundInfo, m_bPlayTravelSound) == 0x90, "m_bPlayTravelSound in ConstraintSoundInfo should be at offset 0x90");
		static_assert(offsetof(CS2::server::ConstraintSoundInfo, m_bPlayReversalSound) == 0x91, "m_bPlayReversalSound in ConstraintSoundInfo should be at offset 0x91");
		static_assert(sizeof(CS2::server::ConstraintSoundInfo) == 0x98, "ConstraintSoundInfo size should be 0x98");
	}
}
