// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#include <SDK/GlobalTypes.hpp>

#include <SDK/server/CBaseModelEntity.hpp>
#include <SDK/entity2/GameTime_t.hpp>
#include <SDK/server/CHandle< CBaseEntity >.hpp>



namespace CS2 {
	namespace server {
		class CParticleSystem : public CS2::server::CBaseModelEntity {
		public:
			public:
			char m_szSnapshotFileName[512]; // 0x7e8 | Schema_FixedArray | Size: 0x200
			bool m_bActive; // 0x9e8 | Schema_Builtin | Size: 0x1
			bool m_bFrozen; // 0x9e9 | Schema_Builtin | Size: 0x1
			S2_PAD(0x2);
			float32 m_flFreezeTransitionDuration; // 0x9ec | Schema_Builtin | Size: 0x4
			int32_t m_nStopType; // 0x9f0 | Schema_Builtin | Size: 0x4
			bool m_bAnimateDuringGameplayPause; // 0x9f4 | Schema_Builtin | Size: 0x1
			S2_PAD(0x3);
			// GlobalTypes::CStrongHandle< resourcesystem::InfoForResourceTypeIParticleSystemDefinition > m_iEffectIndex; // 0x9f8 | Schema_Atomic | Size: 0x8
			char  m_iEffectIndex[0x8]; // 0x9f8 | Schema_Atomic | Size: 0x8
			entity2::GameTime_t m_flStartTime; // 0xa00 | Schema_DeclaredClass | Size: 0x4
			float32 m_flPreSimTime; // 0xa04 | Schema_Builtin | Size: 0x4
			GlobalTypes::Vector m_vServerControlPoints[4]; // 0xa08 | Schema_FixedArray | Size: 0x30
			uint8_t m_iServerControlPointAssignments[4]; // 0xa38 | Schema_FixedArray | Size: 0x4
			// server::CHandle< CBaseEntity > m_hControlPointEnts[64]; // 0xa3c | Schema_FixedArray | Size: 0x100
			char  m_hControlPointEnts[0x4]; // 0xa3c | Schema_FixedArray | Size: 0x4
			bool m_bNoSave; // 0xb3c | Schema_Builtin | Size: 0x1
			bool m_bNoFreeze; // 0xb3d | Schema_Builtin | Size: 0x1
			bool m_bNoRamp; // 0xb3e | Schema_Builtin | Size: 0x1
			bool m_bStartActive; // 0xb3f | Schema_Builtin | Size: 0x1
			GlobalTypes::CUtlSymbolLarge m_iszEffectName; // 0xb40 | Schema_Atomic | Size: 0x8
			GlobalTypes::CUtlSymbolLarge m_iszControlPointNames[64]; // 0xb48 | Schema_FixedArray | Size: 0x200
			int32_t m_nDataCP; // 0xd48 | Schema_Builtin | Size: 0x4
			GlobalTypes::Vector m_vecDataCPValue; // 0xd4c | Schema_Atomic | Size: 0xc
			int32_t m_nTintCP; // 0xd58 | Schema_Builtin | Size: 0x4
			GlobalTypes::Color m_clrTint; // 0xd5c | Schema_Atomic | Size: 0x4
		};
		static_assert(offsetof(CS2::server::CParticleSystem, m_szSnapshotFileName) == 0x7E8, "m_szSnapshotFileName in CParticleSystem should be at offset 0x7E8");
		static_assert(offsetof(CS2::server::CParticleSystem, m_bActive) == 0x9E8, "m_bActive in CParticleSystem should be at offset 0x9E8");
		static_assert(offsetof(CS2::server::CParticleSystem, m_bFrozen) == 0x9E9, "m_bFrozen in CParticleSystem should be at offset 0x9E9");
		static_assert(offsetof(CS2::server::CParticleSystem, m_flFreezeTransitionDuration) == 0x9EC, "m_flFreezeTransitionDuration in CParticleSystem should be at offset 0x9EC");
		static_assert(offsetof(CS2::server::CParticleSystem, m_nStopType) == 0x9F0, "m_nStopType in CParticleSystem should be at offset 0x9F0");
		static_assert(offsetof(CS2::server::CParticleSystem, m_bAnimateDuringGameplayPause) == 0x9F4, "m_bAnimateDuringGameplayPause in CParticleSystem should be at offset 0x9F4");
		static_assert(offsetof(CS2::server::CParticleSystem, m_iEffectIndex) == 0x9F8, "m_iEffectIndex in CParticleSystem should be at offset 0x9F8");
		static_assert(offsetof(CS2::server::CParticleSystem, m_flStartTime) == 0xA00, "m_flStartTime in CParticleSystem should be at offset 0xA00");
		static_assert(offsetof(CS2::server::CParticleSystem, m_flPreSimTime) == 0xA04, "m_flPreSimTime in CParticleSystem should be at offset 0xA04");
		static_assert(offsetof(CS2::server::CParticleSystem, m_vServerControlPoints) == 0xA08, "m_vServerControlPoints in CParticleSystem should be at offset 0xA08");
		static_assert(offsetof(CS2::server::CParticleSystem, m_iServerControlPointAssignments) == 0xA38, "m_iServerControlPointAssignments in CParticleSystem should be at offset 0xA38");
		static_assert(offsetof(CS2::server::CParticleSystem, m_hControlPointEnts) == 0xA3C, "m_hControlPointEnts in CParticleSystem should be at offset 0xA3C");
		static_assert(offsetof(CS2::server::CParticleSystem, m_bNoSave) == 0xB3C, "m_bNoSave in CParticleSystem should be at offset 0xB3C");
		static_assert(offsetof(CS2::server::CParticleSystem, m_bNoFreeze) == 0xB3D, "m_bNoFreeze in CParticleSystem should be at offset 0xB3D");
		static_assert(offsetof(CS2::server::CParticleSystem, m_bNoRamp) == 0xB3E, "m_bNoRamp in CParticleSystem should be at offset 0xB3E");
		static_assert(offsetof(CS2::server::CParticleSystem, m_bStartActive) == 0xB3F, "m_bStartActive in CParticleSystem should be at offset 0xB3F");
		static_assert(offsetof(CS2::server::CParticleSystem, m_iszEffectName) == 0xB40, "m_iszEffectName in CParticleSystem should be at offset 0xB40");
		static_assert(offsetof(CS2::server::CParticleSystem, m_iszControlPointNames) == 0xB48, "m_iszControlPointNames in CParticleSystem should be at offset 0xB48");
		static_assert(offsetof(CS2::server::CParticleSystem, m_nDataCP) == 0xD48, "m_nDataCP in CParticleSystem should be at offset 0xD48");
		static_assert(offsetof(CS2::server::CParticleSystem, m_vecDataCPValue) == 0xD4C, "m_vecDataCPValue in CParticleSystem should be at offset 0xD4C");
		static_assert(offsetof(CS2::server::CParticleSystem, m_nTintCP) == 0xD58, "m_nTintCP in CParticleSystem should be at offset 0xD58");
		static_assert(offsetof(CS2::server::CParticleSystem, m_clrTint) == 0xD5C, "m_clrTint in CParticleSystem should be at offset 0xD5C");
		static_assert(sizeof(CS2::server::CParticleSystem) == 0xD60, "CParticleSystem size should be 0xD60");
	}
}
