// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#ifndef CUSTOM_GLOBAL_TYPES
	#include <SDK/GlobalTypes.hpp>
#else
	#include <Custom/GlobalTypes.hpp>
#endif


#include <SDK/server/CLogicalEntity.hpp>



namespace CS2 {
	namespace server {
		class CPathKeyFrame : public CS2::server::CLogicalEntity {
		public:
			GlobalTypes::Vector m_Origin; // 0x4f0 | Schema_Atomic | Size: 0xc
			GlobalTypes::QAngle m_Angles; // 0x4fc | Schema_Atomic | Size: 0xc
			S2_PAD(0x8);
			GlobalTypes::Quaternion m_qAngle; // 0x510 | Schema_Atomic | Size: 0x10
			GlobalTypes::CUtlSymbolLarge m_iNextKey; // 0x520 | Schema_Atomic | Size: 0x8
			float32 m_flNextTime; // 0x528 | Schema_Builtin | Size: 0x4
			S2_PAD(0x4);
			server::CPathKeyFrame* m_pNextKey; // 0x530 | Schema_Ptr | Size: 0x8
			server::CPathKeyFrame* m_pPrevKey; // 0x538 | Schema_Ptr | Size: 0x8
			float32 m_flMoveSpeed; // 0x540 | Schema_Builtin | Size: 0x4
			S2_PAD(0xc); // End padding
		};
		static_assert(offsetof(CS2::server::CPathKeyFrame, m_Origin) == 0x4F0, "m_Origin in CPathKeyFrame should be at offset 0x4F0");
		static_assert(offsetof(CS2::server::CPathKeyFrame, m_Angles) == 0x4FC, "m_Angles in CPathKeyFrame should be at offset 0x4FC");
		static_assert(offsetof(CS2::server::CPathKeyFrame, m_qAngle) == 0x510, "m_qAngle in CPathKeyFrame should be at offset 0x510");
		static_assert(offsetof(CS2::server::CPathKeyFrame, m_iNextKey) == 0x520, "m_iNextKey in CPathKeyFrame should be at offset 0x520");
		static_assert(offsetof(CS2::server::CPathKeyFrame, m_flNextTime) == 0x528, "m_flNextTime in CPathKeyFrame should be at offset 0x528");
		static_assert(offsetof(CS2::server::CPathKeyFrame, m_pNextKey) == 0x530, "m_pNextKey in CPathKeyFrame should be at offset 0x530");
		static_assert(offsetof(CS2::server::CPathKeyFrame, m_pPrevKey) == 0x538, "m_pPrevKey in CPathKeyFrame should be at offset 0x538");
		static_assert(offsetof(CS2::server::CPathKeyFrame, m_flMoveSpeed) == 0x540, "m_flMoveSpeed in CPathKeyFrame should be at offset 0x540");
		static_assert(sizeof(CS2::server::CPathKeyFrame) == 0x550, "CPathKeyFrame size should be 0x550");
	}
}
