// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#ifndef CUSTOM_GLOBAL_TYPES
	#include "../GlobalTypes.hpp"
#else
	#include <Custom/GlobalTypes.hpp>
#endif


#include "CPointEntity.hpp"



namespace CS2 {
	namespace server {
		class CPathWithDynamicNodes;
	}
}


using namespace GlobalTypes;
namespace CS2 {
	namespace server {
		class CPathNode : public CS2::server::CPointEntity {
		public:
			GlobalTypes::Vector m_vInTangentLocal; // 0x4a8 | Schema_Atomic | Size: 0xc
			GlobalTypes::Vector m_vOutTangentLocal; // 0x4b4 | Schema_Atomic | Size: 0xc
			GlobalTypes::CUtlString m_strParentPathUniqueID; // 0x4c0 | Schema_Atomic | Size: 0x8
			GlobalTypes::CUtlString m_strPathNodeParameter; // 0x4c8 | Schema_Atomic | Size: 0x8
			GlobalTypes::CTransform m_xWSPrevParent; // 0x4d0 | Schema_Atomic | Size: 0x20
			GlobalTypes::CHandle<server::CPathWithDynamicNodes> m_hPath; // 0x4f0 | Schema_Atomic | Size: 0x4
			// char m_hPath[0x4]; // 0x4f0 | Schema_Atomic | Size: 0x4
			S2_PAD(0xc); // End padding
		};
#ifdef USE_STATIC_ASSERTS
		static_assert(offsetof(CS2::server::CPathNode, m_vInTangentLocal) == 0x4A8, "m_vInTangentLocal in CPathNode should be at offset 0x4A8");
		static_assert(offsetof(CS2::server::CPathNode, m_vOutTangentLocal) == 0x4B4, "m_vOutTangentLocal in CPathNode should be at offset 0x4B4");
		static_assert(offsetof(CS2::server::CPathNode, m_strParentPathUniqueID) == 0x4C0, "m_strParentPathUniqueID in CPathNode should be at offset 0x4C0");
		static_assert(offsetof(CS2::server::CPathNode, m_strPathNodeParameter) == 0x4C8, "m_strPathNodeParameter in CPathNode should be at offset 0x4C8");
		static_assert(offsetof(CS2::server::CPathNode, m_xWSPrevParent) == 0x4D0, "m_xWSPrevParent in CPathNode should be at offset 0x4D0");
		static_assert(offsetof(CS2::server::CPathNode, m_hPath) == 0x4F0, "m_hPath in CPathNode should be at offset 0x4F0");
		static_assert(sizeof(CS2::server::CPathNode) == 0x500, "CPathNode size should be 0x500");

#endif
	}
}
