// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#ifndef CUSTOM_GLOBAL_TYPES
	#include <SDK/GlobalTypes.hpp>
#else
	#include <Custom/GlobalTypes.hpp>
#endif


#include <SDK/server/CLogicalEntity.hpp>
#include <SDK/entity2/GameTime_t.hpp>



namespace CS2 {
	namespace server {
		class CPathMover;
	}
}


using namespace GlobalTypes;
namespace CS2 {
	namespace server {
		class CPathMoverEntitySpawner : public CS2::server::CLogicalEntity {
		public:
			GlobalTypes::CUtlSymbolLarge m_szSpawnTemplates[4]; // 0x4a8 | Schema_FixedArray | Size: 0x20
			int32_t m_nSpawnIndex; // 0x4c8 | Schema_Builtin | Size: 0x4
			GlobalTypes::CHandle<server::CPathMover> m_hPathMover; // 0x4cc | Schema_Atomic | Size: 0x4
			// char m_hPathMover[0x4]; // 0x4cc | Schema_Atomic | Size: 0x4
			float32 m_flSpawnFrequencySeconds; // 0x4d0 | Schema_Builtin | Size: 0x4
			float32 m_flSpawnFrequencyDistToNearestMover; // 0x4d4 | Schema_Builtin | Size: 0x4
			// server::CUtlHashtable< CHandle< CFuncMover >, CPathMoverEntitySpawn > m_mapSpawnedMoverTemplates; // 0x4d8 | Schema_Atomic | Size: 0x20
			char m_mapSpawnedMoverTemplates[0x20]; // 0x4d8 | Schema_Atomic | Size: 0x20
			int32_t m_nMaxActive; // 0x4f8 | Schema_Builtin | Size: 0x4
			entity2::GameTime_t m_flLastSpawnTime; // 0x4fc | Schema_DeclaredClass | Size: 0x4
			bool m_bEnabled; // 0x500 | Schema_Builtin | Size: 0x1
			S2_PAD(0x7); // End padding
		};
		static_assert(offsetof(CS2::server::CPathMoverEntitySpawner, m_szSpawnTemplates) == 0x4A8, "m_szSpawnTemplates in CPathMoverEntitySpawner should be at offset 0x4A8");
		static_assert(offsetof(CS2::server::CPathMoverEntitySpawner, m_nSpawnIndex) == 0x4C8, "m_nSpawnIndex in CPathMoverEntitySpawner should be at offset 0x4C8");
		static_assert(offsetof(CS2::server::CPathMoverEntitySpawner, m_hPathMover) == 0x4CC, "m_hPathMover in CPathMoverEntitySpawner should be at offset 0x4CC");
		static_assert(offsetof(CS2::server::CPathMoverEntitySpawner, m_flSpawnFrequencySeconds) == 0x4D0, "m_flSpawnFrequencySeconds in CPathMoverEntitySpawner should be at offset 0x4D0");
		static_assert(offsetof(CS2::server::CPathMoverEntitySpawner, m_flSpawnFrequencyDistToNearestMover) == 0x4D4, "m_flSpawnFrequencyDistToNearestMover in CPathMoverEntitySpawner should be at offset 0x4D4");
		static_assert(offsetof(CS2::server::CPathMoverEntitySpawner, m_mapSpawnedMoverTemplates) == 0x4D8, "m_mapSpawnedMoverTemplates in CPathMoverEntitySpawner should be at offset 0x4D8");
		static_assert(offsetof(CS2::server::CPathMoverEntitySpawner, m_nMaxActive) == 0x4F8, "m_nMaxActive in CPathMoverEntitySpawner should be at offset 0x4F8");
		static_assert(offsetof(CS2::server::CPathMoverEntitySpawner, m_flLastSpawnTime) == 0x4FC, "m_flLastSpawnTime in CPathMoverEntitySpawner should be at offset 0x4FC");
		static_assert(offsetof(CS2::server::CPathMoverEntitySpawner, m_bEnabled) == 0x500, "m_bEnabled in CPathMoverEntitySpawner should be at offset 0x500");
		static_assert(sizeof(CS2::server::CPathMoverEntitySpawner) == 0x508, "CPathMoverEntitySpawner size should be 0x508");
	}
}
