// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#ifndef CUSTOM_GLOBAL_TYPES
	#include "../GlobalTypes.hpp"
#else
	#include "../Custom/GlobalTypes.hpp"
#endif


#include "CLogicalEntity.hpp"





using namespace GlobalTypes;
namespace CS2 {
	namespace server {
		class CPathKeyFrame : public CS2::server::CLogicalEntity {
		public:
			GlobalTypes::Vector m_Origin; // 0x4a8 | Schema_Atomic | Size: 0xc
			GlobalTypes::QAngle m_Angles; // 0x4b4 | Schema_Atomic | Size: 0xc
			GlobalTypes::Quaternion m_qAngle; // 0x4c0 | Schema_Atomic | Size: 0x10
			GlobalTypes::CUtlSymbolLarge m_iNextKey; // 0x4d0 | Schema_Atomic | Size: 0x8
			float32 m_flNextTime; // 0x4d8 | Schema_Builtin | Size: 0x4
			S2_PAD(0x4);
			server::CPathKeyFrame* m_pNextKey; // 0x4e0 | Schema_Ptr | Size: 0x8
			server::CPathKeyFrame* m_pPrevKey; // 0x4e8 | Schema_Ptr | Size: 0x8
			float32 m_flMoveSpeed; // 0x4f0 | Schema_Builtin | Size: 0x4
			S2_PAD(0xc); // End padding
		};
		static_assert(offsetof(CS2::server::CPathKeyFrame, m_Origin) == 0x4A8, "m_Origin in CPathKeyFrame should be at offset 0x4A8");
		static_assert(offsetof(CS2::server::CPathKeyFrame, m_Angles) == 0x4B4, "m_Angles in CPathKeyFrame should be at offset 0x4B4");
		static_assert(offsetof(CS2::server::CPathKeyFrame, m_qAngle) == 0x4C0, "m_qAngle in CPathKeyFrame should be at offset 0x4C0");
		static_assert(offsetof(CS2::server::CPathKeyFrame, m_iNextKey) == 0x4D0, "m_iNextKey in CPathKeyFrame should be at offset 0x4D0");
		static_assert(offsetof(CS2::server::CPathKeyFrame, m_flNextTime) == 0x4D8, "m_flNextTime in CPathKeyFrame should be at offset 0x4D8");
		static_assert(offsetof(CS2::server::CPathKeyFrame, m_pNextKey) == 0x4E0, "m_pNextKey in CPathKeyFrame should be at offset 0x4E0");
		static_assert(offsetof(CS2::server::CPathKeyFrame, m_pPrevKey) == 0x4E8, "m_pPrevKey in CPathKeyFrame should be at offset 0x4E8");
		static_assert(offsetof(CS2::server::CPathKeyFrame, m_flMoveSpeed) == 0x4F0, "m_flMoveSpeed in CPathKeyFrame should be at offset 0x4F0");
		static_assert(sizeof(CS2::server::CPathKeyFrame) == 0x500, "CPathKeyFrame size should be 0x500");
	}
}
