// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#ifndef CUSTOM_GLOBAL_TYPES
	#include <SDK/GlobalTypes.hpp>
#else
	#include <Custom/GlobalTypes.hpp>
#endif


#include <SDK/server/CPointEntity.hpp>
#include <SDK/server/TrackOrientationType_t.hpp>
#include <SDK/entity2/CEntityIOOutput.hpp>



namespace CS2 {
	namespace server {
		class CPathTrack : public CS2::server::CPointEntity {
		public:
			server::CPathTrack* m_pnext; // 0x4f0 | Schema_Ptr | Size: 0x8
			server::CPathTrack* m_pprevious; // 0x4f8 | Schema_Ptr | Size: 0x8
			server::CPathTrack* m_paltpath; // 0x500 | Schema_Ptr | Size: 0x8
			float32 m_flRadius; // 0x508 | Schema_Builtin | Size: 0x4
			float32 m_length; // 0x50c | Schema_Builtin | Size: 0x4
			GlobalTypes::CUtlSymbolLarge m_altName; // 0x510 | Schema_Atomic | Size: 0x8
			int32_t m_nIterVal; // 0x518 | Schema_Builtin | Size: 0x4
			server::TrackOrientationType_t m_eOrientationType; // 0x51c | Schema_DeclaredEnum | Size: 0x4
			entity2::CEntityIOOutput m_OnPass; // 0x520 | Schema_DeclaredClass | Size: 0x28
		};
		static_assert(offsetof(CS2::server::CPathTrack, m_pnext) == 0x4F0, "m_pnext in CPathTrack should be at offset 0x4F0");
		static_assert(offsetof(CS2::server::CPathTrack, m_pprevious) == 0x4F8, "m_pprevious in CPathTrack should be at offset 0x4F8");
		static_assert(offsetof(CS2::server::CPathTrack, m_paltpath) == 0x500, "m_paltpath in CPathTrack should be at offset 0x500");
		static_assert(offsetof(CS2::server::CPathTrack, m_flRadius) == 0x508, "m_flRadius in CPathTrack should be at offset 0x508");
		static_assert(offsetof(CS2::server::CPathTrack, m_length) == 0x50C, "m_length in CPathTrack should be at offset 0x50C");
		static_assert(offsetof(CS2::server::CPathTrack, m_altName) == 0x510, "m_altName in CPathTrack should be at offset 0x510");
		static_assert(offsetof(CS2::server::CPathTrack, m_nIterVal) == 0x518, "m_nIterVal in CPathTrack should be at offset 0x518");
		static_assert(offsetof(CS2::server::CPathTrack, m_eOrientationType) == 0x51C, "m_eOrientationType in CPathTrack should be at offset 0x51C");
		static_assert(offsetof(CS2::server::CPathTrack, m_OnPass) == 0x520, "m_OnPass in CPathTrack should be at offset 0x520");
		static_assert(sizeof(CS2::server::CPathTrack) == 0x548, "CPathTrack size should be 0x548");
	}
}
