// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#ifndef CUSTOM_GLOBAL_TYPES
	#include <SDK/GlobalTypes.hpp>
#else
	#include <Custom/GlobalTypes.hpp>
#endif


#include <SDK/server/CLogicalEntity.hpp>
#include <SDK/entity2/GameTime_t.hpp>



namespace CS2 {
	namespace server {
		class CBaseEntity;
	}
}


using namespace GlobalTypes;
namespace CS2 {
	namespace server {
		class CPhysicsEntitySolver : public CS2::server::CLogicalEntity {
		public:
			S2_PAD(0x18);
			GlobalTypes::CHandle<server::CBaseEntity> m_hMovingEntity; // 0x508 | Schema_Atomic | Size: 0x4
			// char  m_hMovingEntity[0x4]; // 0x508 | Schema_Atomic | Size: 0x4
			GlobalTypes::CHandle<server::CBaseEntity> m_hPhysicsBlocker; // 0x50c | Schema_Atomic | Size: 0x4
			// char  m_hPhysicsBlocker[0x4]; // 0x50c | Schema_Atomic | Size: 0x4
			float32 m_separationDuration; // 0x510 | Schema_Builtin | Size: 0x4
			entity2::GameTime_t m_cancelTime; // 0x514 | Schema_DeclaredClass | Size: 0x4
		};
		static_assert(offsetof(CS2::server::CPhysicsEntitySolver, m_hMovingEntity) == 0x508, "m_hMovingEntity in CPhysicsEntitySolver should be at offset 0x508");
		static_assert(offsetof(CS2::server::CPhysicsEntitySolver, m_hPhysicsBlocker) == 0x50C, "m_hPhysicsBlocker in CPhysicsEntitySolver should be at offset 0x50C");
		static_assert(offsetof(CS2::server::CPhysicsEntitySolver, m_separationDuration) == 0x510, "m_separationDuration in CPhysicsEntitySolver should be at offset 0x510");
		static_assert(offsetof(CS2::server::CPhysicsEntitySolver, m_cancelTime) == 0x514, "m_cancelTime in CPhysicsEntitySolver should be at offset 0x514");
		static_assert(sizeof(CS2::server::CPhysicsEntitySolver) == 0x518, "CPhysicsEntitySolver size should be 0x518");
	}
}
