// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#ifndef CUSTOM_GLOBAL_TYPES
	#include <SDK/GlobalTypes.hpp>
#else
	#include <Custom/GlobalTypes.hpp>
#endif


#include <SDK/server/CPhysicsProp.hpp>





using namespace GlobalTypes;
namespace CS2 {
	namespace server {
		class CPhysicsPropRespawnable : public CS2::server::CPhysicsProp {
		public:
			GlobalTypes::VectorWS m_vOriginalSpawnOrigin; // 0xce0 | Schema_Atomic | Size: 0xc
			GlobalTypes::QAngle m_vOriginalSpawnAngles; // 0xcec | Schema_Atomic | Size: 0xc
			GlobalTypes::Vector m_vOriginalMins; // 0xcf8 | Schema_Atomic | Size: 0xc
			GlobalTypes::Vector m_vOriginalMaxs; // 0xd04 | Schema_Atomic | Size: 0xc
			float32 m_flRespawnDuration; // 0xd10 | Schema_Builtin | Size: 0x4
			S2_PAD(0xc); // End padding
		};
		static_assert(offsetof(CS2::server::CPhysicsPropRespawnable, m_vOriginalSpawnOrigin) == 0xCE0, "m_vOriginalSpawnOrigin in CPhysicsPropRespawnable should be at offset 0xCE0");
		static_assert(offsetof(CS2::server::CPhysicsPropRespawnable, m_vOriginalSpawnAngles) == 0xCEC, "m_vOriginalSpawnAngles in CPhysicsPropRespawnable should be at offset 0xCEC");
		static_assert(offsetof(CS2::server::CPhysicsPropRespawnable, m_vOriginalMins) == 0xCF8, "m_vOriginalMins in CPhysicsPropRespawnable should be at offset 0xCF8");
		static_assert(offsetof(CS2::server::CPhysicsPropRespawnable, m_vOriginalMaxs) == 0xD04, "m_vOriginalMaxs in CPhysicsPropRespawnable should be at offset 0xD04");
		static_assert(offsetof(CS2::server::CPhysicsPropRespawnable, m_flRespawnDuration) == 0xD10, "m_flRespawnDuration in CPhysicsPropRespawnable should be at offset 0xD10");
		static_assert(sizeof(CS2::server::CPhysicsPropRespawnable) == 0xD20, "CPhysicsPropRespawnable size should be 0xD20");
	}
}
