// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#ifndef CUSTOM_GLOBAL_TYPES
	#include <SDK/GlobalTypes.hpp>
#else
	#include <Custom/GlobalTypes.hpp>
#endif


#include <SDK/server/CLogicalEntity.hpp>
#include <SDK/entity2/GameTime_t.hpp>



namespace CS2 {
	namespace server {
		class CBaseEntity;
	}
}


using namespace GlobalTypes;
namespace CS2 {
	namespace server {
		class CPhysicsEntitySolver : public CS2::server::CLogicalEntity {
		public:
			S2_PAD(0x18);
			GlobalTypes::CHandle<server::CBaseEntity> m_hMovingEntity; // 0x4c0 | Schema_Atomic | Size: 0x4
			// char m_hMovingEntity[0x4]; // 0x4c0 | Schema_Atomic | Size: 0x4
			GlobalTypes::CHandle<server::CBaseEntity> m_hPhysicsBlocker; // 0x4c4 | Schema_Atomic | Size: 0x4
			// char m_hPhysicsBlocker[0x4]; // 0x4c4 | Schema_Atomic | Size: 0x4
			float32 m_separationDuration; // 0x4c8 | Schema_Builtin | Size: 0x4
			entity2::GameTime_t m_cancelTime; // 0x4cc | Schema_DeclaredClass | Size: 0x4
		};
		static_assert(offsetof(CS2::server::CPhysicsEntitySolver, m_hMovingEntity) == 0x4C0, "m_hMovingEntity in CPhysicsEntitySolver should be at offset 0x4C0");
		static_assert(offsetof(CS2::server::CPhysicsEntitySolver, m_hPhysicsBlocker) == 0x4C4, "m_hPhysicsBlocker in CPhysicsEntitySolver should be at offset 0x4C4");
		static_assert(offsetof(CS2::server::CPhysicsEntitySolver, m_separationDuration) == 0x4C8, "m_separationDuration in CPhysicsEntitySolver should be at offset 0x4C8");
		static_assert(offsetof(CS2::server::CPhysicsEntitySolver, m_cancelTime) == 0x4CC, "m_cancelTime in CPhysicsEntitySolver should be at offset 0x4CC");
		static_assert(sizeof(CS2::server::CPhysicsEntitySolver) == 0x4D0, "CPhysicsEntitySolver size should be 0x4D0");
	}
}
