// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#ifndef CUSTOM_GLOBAL_TYPES
	#include "../GlobalTypes.hpp"
#else
	#include "../Custom/GlobalTypes.hpp"
#endif


#include "CLogicalEntity.hpp"
#include "CMotorController.hpp"



namespace CS2 {
	namespace server {
		class CBaseEntity;
	}
}


using namespace GlobalTypes;
namespace CS2 {
	namespace server {
		class CPhysMotor : public CS2::server::CLogicalEntity {
		public:
			GlobalTypes::CUtlSymbolLarge m_nameAttach; // 0x4a8 | Schema_Atomic | Size: 0x8
			GlobalTypes::CUtlSymbolLarge m_nameAnchor; // 0x4b0 | Schema_Atomic | Size: 0x8
			GlobalTypes::CHandle<server::CBaseEntity> m_hAttachedObject; // 0x4b8 | Schema_Atomic | Size: 0x4
			// char m_hAttachedObject[0x4]; // 0x4b8 | Schema_Atomic | Size: 0x4
			GlobalTypes::CHandle<server::CBaseEntity> m_hAnchorObject; // 0x4bc | Schema_Atomic | Size: 0x4
			// char m_hAnchorObject[0x4]; // 0x4bc | Schema_Atomic | Size: 0x4
			float32 m_spinUp; // 0x4c0 | Schema_Builtin | Size: 0x4
			float32 m_spinDown; // 0x4c4 | Schema_Builtin | Size: 0x4
			float32 m_flMotorFriction; // 0x4c8 | Schema_Builtin | Size: 0x4
			float32 m_additionalAcceleration; // 0x4cc | Schema_Builtin | Size: 0x4
			float32 m_angularAcceleration; // 0x4d0 | Schema_Builtin | Size: 0x4
			float32 m_flTorqueScale; // 0x4d4 | Schema_Builtin | Size: 0x4
			float32 m_flTargetSpeed; // 0x4d8 | Schema_Builtin | Size: 0x4
			float32 m_flSpeedWhenSpinUpOrSpinDownStarted; // 0x4dc | Schema_Builtin | Size: 0x4
			S2_PAD(0x10);
			server::CMotorController m_motor; // 0x4f0 | Schema_DeclaredClass | Size: 0x20
		};
#ifdef USE_STATIC_ASSERTS
		static_assert(offsetof(CS2::server::CPhysMotor, m_nameAttach) == 0x4A8, "m_nameAttach in CPhysMotor should be at offset 0x4A8");
		static_assert(offsetof(CS2::server::CPhysMotor, m_nameAnchor) == 0x4B0, "m_nameAnchor in CPhysMotor should be at offset 0x4B0");
		static_assert(offsetof(CS2::server::CPhysMotor, m_hAttachedObject) == 0x4B8, "m_hAttachedObject in CPhysMotor should be at offset 0x4B8");
		static_assert(offsetof(CS2::server::CPhysMotor, m_hAnchorObject) == 0x4BC, "m_hAnchorObject in CPhysMotor should be at offset 0x4BC");
		static_assert(offsetof(CS2::server::CPhysMotor, m_spinUp) == 0x4C0, "m_spinUp in CPhysMotor should be at offset 0x4C0");
		static_assert(offsetof(CS2::server::CPhysMotor, m_spinDown) == 0x4C4, "m_spinDown in CPhysMotor should be at offset 0x4C4");
		static_assert(offsetof(CS2::server::CPhysMotor, m_flMotorFriction) == 0x4C8, "m_flMotorFriction in CPhysMotor should be at offset 0x4C8");
		static_assert(offsetof(CS2::server::CPhysMotor, m_additionalAcceleration) == 0x4CC, "m_additionalAcceleration in CPhysMotor should be at offset 0x4CC");
		static_assert(offsetof(CS2::server::CPhysMotor, m_angularAcceleration) == 0x4D0, "m_angularAcceleration in CPhysMotor should be at offset 0x4D0");
		static_assert(offsetof(CS2::server::CPhysMotor, m_flTorqueScale) == 0x4D4, "m_flTorqueScale in CPhysMotor should be at offset 0x4D4");
		static_assert(offsetof(CS2::server::CPhysMotor, m_flTargetSpeed) == 0x4D8, "m_flTargetSpeed in CPhysMotor should be at offset 0x4D8");
		static_assert(offsetof(CS2::server::CPhysMotor, m_flSpeedWhenSpinUpOrSpinDownStarted) == 0x4DC, "m_flSpeedWhenSpinUpOrSpinDownStarted in CPhysMotor should be at offset 0x4DC");
		static_assert(offsetof(CS2::server::CPhysMotor, m_motor) == 0x4F0, "m_motor in CPhysMotor should be at offset 0x4F0");
		static_assert(sizeof(CS2::server::CPhysMotor) == 0x510, "CPhysMotor size should be 0x510");

#endif
	}
}
