// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#ifndef CUSTOM_GLOBAL_TYPES
	#include <SDK/GlobalTypes.hpp>
#else
	#include <Custom/GlobalTypes.hpp>
#endif


#include <SDK/server/CPhysConstraint.hpp>
#include <SDK/server/ConstraintSoundInfo.hpp>





using namespace GlobalTypes;
namespace CS2 {
	namespace server {
		class CPhysSlideConstraint : public CS2::server::CPhysConstraint {
		public:
			S2_PAD(0x8);
			GlobalTypes::VectorWS m_axisEnd; // 0x510 | Schema_Atomic | Size: 0xc
			float32 m_slideFriction; // 0x51c | Schema_Builtin | Size: 0x4
			float32 m_systemLoadScale; // 0x520 | Schema_Builtin | Size: 0x4
			float32 m_initialOffset; // 0x524 | Schema_Builtin | Size: 0x4
			bool m_bEnableLinearConstraint; // 0x528 | Schema_Builtin | Size: 0x1
			bool m_bEnableAngularConstraint; // 0x529 | Schema_Builtin | Size: 0x1
			S2_PAD(0x2);
			float32 m_flMotorFrequency; // 0x52c | Schema_Builtin | Size: 0x4
			float32 m_flMotorDampingRatio; // 0x530 | Schema_Builtin | Size: 0x4
			bool m_bUseEntityPivot; // 0x534 | Schema_Builtin | Size: 0x1
			S2_PAD(0x3);
			server::ConstraintSoundInfo m_soundInfo; // 0x538 | Schema_DeclaredClass | Size: 0x98
		};
		static_assert(offsetof(CS2::server::CPhysSlideConstraint, m_axisEnd) == 0x510, "m_axisEnd in CPhysSlideConstraint should be at offset 0x510");
		static_assert(offsetof(CS2::server::CPhysSlideConstraint, m_slideFriction) == 0x51C, "m_slideFriction in CPhysSlideConstraint should be at offset 0x51C");
		static_assert(offsetof(CS2::server::CPhysSlideConstraint, m_systemLoadScale) == 0x520, "m_systemLoadScale in CPhysSlideConstraint should be at offset 0x520");
		static_assert(offsetof(CS2::server::CPhysSlideConstraint, m_initialOffset) == 0x524, "m_initialOffset in CPhysSlideConstraint should be at offset 0x524");
		static_assert(offsetof(CS2::server::CPhysSlideConstraint, m_bEnableLinearConstraint) == 0x528, "m_bEnableLinearConstraint in CPhysSlideConstraint should be at offset 0x528");
		static_assert(offsetof(CS2::server::CPhysSlideConstraint, m_bEnableAngularConstraint) == 0x529, "m_bEnableAngularConstraint in CPhysSlideConstraint should be at offset 0x529");
		static_assert(offsetof(CS2::server::CPhysSlideConstraint, m_flMotorFrequency) == 0x52C, "m_flMotorFrequency in CPhysSlideConstraint should be at offset 0x52C");
		static_assert(offsetof(CS2::server::CPhysSlideConstraint, m_flMotorDampingRatio) == 0x530, "m_flMotorDampingRatio in CPhysSlideConstraint should be at offset 0x530");
		static_assert(offsetof(CS2::server::CPhysSlideConstraint, m_bUseEntityPivot) == 0x534, "m_bUseEntityPivot in CPhysSlideConstraint should be at offset 0x534");
		static_assert(offsetof(CS2::server::CPhysSlideConstraint, m_soundInfo) == 0x538, "m_soundInfo in CPhysSlideConstraint should be at offset 0x538");
		static_assert(sizeof(CS2::server::CPhysSlideConstraint) == 0x5D0, "CPhysSlideConstraint size should be 0x5D0");
	}
}
