// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#ifndef CUSTOM_GLOBAL_TYPES
	#include "../GlobalTypes.hpp"
#else
	#include "../Custom/GlobalTypes.hpp"
#endif


#include "CBaseAnimGraph.hpp"
#include "../entity2/CEntityIOOutput.hpp"
#include "magnetted_objects_t.hpp"
#include "../entity2/GameTime_t.hpp"





using namespace GlobalTypes;
namespace CS2 {
	namespace server {
		class CPhysMagnet : public CS2::server::CBaseAnimGraph {
		public:
			entity2::CEntityIOOutput m_OnMagnetAttach; // 0xa20 | Schema_DeclaredClass | Size: 0x18
			entity2::CEntityIOOutput m_OnMagnetDetach; // 0xa38 | Schema_DeclaredClass | Size: 0x18
			float32 m_massScale; // 0xa50 | Schema_Builtin | Size: 0x4
			float32 m_forceLimit; // 0xa54 | Schema_Builtin | Size: 0x4
			float32 m_torqueLimit; // 0xa58 | Schema_Builtin | Size: 0x4
			S2_PAD(0x4);
			GlobalTypes::CUtlVector<server::magnetted_objects_t> m_MagnettedEntities; // 0xa60 | Schema_Atomic | Size: 0x18
			// char m_MagnettedEntities[0x18]; // 0xa60 | Schema_Atomic | Size: 0x18
			bool m_bActive; // 0xa78 | Schema_Builtin | Size: 0x1
			bool m_bHasHitSomething; // 0xa79 | Schema_Builtin | Size: 0x1
			S2_PAD(0x2);
			float32 m_flTotalMass; // 0xa7c | Schema_Builtin | Size: 0x4
			float32 m_flRadius; // 0xa80 | Schema_Builtin | Size: 0x4
			entity2::GameTime_t m_flNextSuckTime; // 0xa84 | Schema_DeclaredClass | Size: 0x4
			int32_t m_iMaxObjectsAttached; // 0xa88 | Schema_Builtin | Size: 0x4
			S2_PAD(0x4); // End padding
		};
		static_assert(offsetof(CS2::server::CPhysMagnet, m_OnMagnetAttach) == 0xA20, "m_OnMagnetAttach in CPhysMagnet should be at offset 0xA20");
		static_assert(offsetof(CS2::server::CPhysMagnet, m_OnMagnetDetach) == 0xA38, "m_OnMagnetDetach in CPhysMagnet should be at offset 0xA38");
		static_assert(offsetof(CS2::server::CPhysMagnet, m_massScale) == 0xA50, "m_massScale in CPhysMagnet should be at offset 0xA50");
		static_assert(offsetof(CS2::server::CPhysMagnet, m_forceLimit) == 0xA54, "m_forceLimit in CPhysMagnet should be at offset 0xA54");
		static_assert(offsetof(CS2::server::CPhysMagnet, m_torqueLimit) == 0xA58, "m_torqueLimit in CPhysMagnet should be at offset 0xA58");
		static_assert(offsetof(CS2::server::CPhysMagnet, m_MagnettedEntities) == 0xA60, "m_MagnettedEntities in CPhysMagnet should be at offset 0xA60");
		static_assert(offsetof(CS2::server::CPhysMagnet, m_bActive) == 0xA78, "m_bActive in CPhysMagnet should be at offset 0xA78");
		static_assert(offsetof(CS2::server::CPhysMagnet, m_bHasHitSomething) == 0xA79, "m_bHasHitSomething in CPhysMagnet should be at offset 0xA79");
		static_assert(offsetof(CS2::server::CPhysMagnet, m_flTotalMass) == 0xA7C, "m_flTotalMass in CPhysMagnet should be at offset 0xA7C");
		static_assert(offsetof(CS2::server::CPhysMagnet, m_flRadius) == 0xA80, "m_flRadius in CPhysMagnet should be at offset 0xA80");
		static_assert(offsetof(CS2::server::CPhysMagnet, m_flNextSuckTime) == 0xA84, "m_flNextSuckTime in CPhysMagnet should be at offset 0xA84");
		static_assert(offsetof(CS2::server::CPhysMagnet, m_iMaxObjectsAttached) == 0xA88, "m_iMaxObjectsAttached in CPhysMagnet should be at offset 0xA88");
		static_assert(sizeof(CS2::server::CPhysMagnet) == 0xA90, "CPhysMagnet size should be 0xA90");
	}
}
