// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#include <SDK/GlobalTypes.hpp>

#include <SDK/server/CBreakable.hpp>
#include <SDK/server/HoverPoseFlags_t.hpp>
#include <SDK/entity2/CEntityIOOutput.hpp>



namespace CS2 {
	namespace server {
		class CPhysBox : public CS2::server::CBreakable {
		public:
			int32_t m_damageType; // 0x8c0 | Schema_Builtin | Size: 0x4
			int32_t m_damageToEnableMotion; // 0x8c4 | Schema_Builtin | Size: 0x4
			float32 m_flForceToEnableMotion; // 0x8c8 | Schema_Builtin | Size: 0x4
			GlobalTypes::Vector m_vHoverPosePosition; // 0x8cc | Schema_Atomic | Size: 0xc
			GlobalTypes::QAngle m_angHoverPoseAngles; // 0x8d8 | Schema_Atomic | Size: 0xc
			bool m_bNotSolidToWorld; // 0x8e4 | Schema_Builtin | Size: 0x1
			bool m_bEnableUseOutput; // 0x8e5 | Schema_Builtin | Size: 0x1
			server::HoverPoseFlags_t m_nHoverPoseFlags; // 0x8e6 | Schema_DeclaredEnum | Size: 0x1
			S2_PAD(0x1);
			float32 m_flTouchOutputPerEntityDelay; // 0x8e8 | Schema_Builtin | Size: 0x4
			S2_PAD(0x4);
			entity2::CEntityIOOutput m_OnDamaged; // 0x8f0 | Schema_DeclaredClass | Size: 0x28
			entity2::CEntityIOOutput m_OnAwakened; // 0x918 | Schema_DeclaredClass | Size: 0x28
			entity2::CEntityIOOutput m_OnMotionEnabled; // 0x940 | Schema_DeclaredClass | Size: 0x28
			entity2::CEntityIOOutput m_OnPlayerUse; // 0x968 | Schema_DeclaredClass | Size: 0x28
			entity2::CEntityIOOutput m_OnStartTouch; // 0x990 | Schema_DeclaredClass | Size: 0x28
			// server::CHandle< server::CBasePlayerPawn > m_hCarryingPlayer; // 0x9b8 | Schema_Atomic | Size: 0x4
			char  m_hCarryingPlayer[0x4]; // 0x9b8 | Schema_Atomic | Size: 0x4
			S2_PAD(0x1c); // End padding
		};
		static_assert(offsetof(CS2::server::CPhysBox, m_damageType) == 0x8C0, "m_damageType in CPhysBox should be at offset 0x8C0");
		static_assert(offsetof(CS2::server::CPhysBox, m_damageToEnableMotion) == 0x8C4, "m_damageToEnableMotion in CPhysBox should be at offset 0x8C4");
		static_assert(offsetof(CS2::server::CPhysBox, m_flForceToEnableMotion) == 0x8C8, "m_flForceToEnableMotion in CPhysBox should be at offset 0x8C8");
		static_assert(offsetof(CS2::server::CPhysBox, m_vHoverPosePosition) == 0x8CC, "m_vHoverPosePosition in CPhysBox should be at offset 0x8CC");
		static_assert(offsetof(CS2::server::CPhysBox, m_angHoverPoseAngles) == 0x8D8, "m_angHoverPoseAngles in CPhysBox should be at offset 0x8D8");
		static_assert(offsetof(CS2::server::CPhysBox, m_bNotSolidToWorld) == 0x8E4, "m_bNotSolidToWorld in CPhysBox should be at offset 0x8E4");
		static_assert(offsetof(CS2::server::CPhysBox, m_bEnableUseOutput) == 0x8E5, "m_bEnableUseOutput in CPhysBox should be at offset 0x8E5");
		static_assert(offsetof(CS2::server::CPhysBox, m_nHoverPoseFlags) == 0x8E6, "m_nHoverPoseFlags in CPhysBox should be at offset 0x8E6");
		static_assert(offsetof(CS2::server::CPhysBox, m_flTouchOutputPerEntityDelay) == 0x8E8, "m_flTouchOutputPerEntityDelay in CPhysBox should be at offset 0x8E8");
		static_assert(offsetof(CS2::server::CPhysBox, m_OnDamaged) == 0x8F0, "m_OnDamaged in CPhysBox should be at offset 0x8F0");
		static_assert(offsetof(CS2::server::CPhysBox, m_OnAwakened) == 0x918, "m_OnAwakened in CPhysBox should be at offset 0x918");
		static_assert(offsetof(CS2::server::CPhysBox, m_OnMotionEnabled) == 0x940, "m_OnMotionEnabled in CPhysBox should be at offset 0x940");
		static_assert(offsetof(CS2::server::CPhysBox, m_OnPlayerUse) == 0x968, "m_OnPlayerUse in CPhysBox should be at offset 0x968");
		static_assert(offsetof(CS2::server::CPhysBox, m_OnStartTouch) == 0x990, "m_OnStartTouch in CPhysBox should be at offset 0x990");
		static_assert(offsetof(CS2::server::CPhysBox, m_hCarryingPlayer) == 0x9B8, "m_hCarryingPlayer in CPhysBox should be at offset 0x9B8");
		static_assert(sizeof(CS2::server::CPhysBox) == 0x9D8, "CPhysBox size should be 0x9D8");
	}
}
