// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#ifndef CUSTOM_GLOBAL_TYPES
	#include "../GlobalTypes.hpp"
#else
	#include <Custom/GlobalTypes.hpp>
#endif


#include "CPointEntity.hpp"
#include "CConstantForceController.hpp"



namespace CS2 {
	namespace server {
		class CBaseEntity;
	}
}


using namespace GlobalTypes;
namespace CS2 {
	namespace server {
		class CPhysForce : public CS2::server::CPointEntity {
		public:
			S2_PAD(0x8);
			GlobalTypes::CUtlSymbolLarge m_nameAttach; // 0x4b0 | Schema_Atomic | Size: 0x8
			float32 m_force; // 0x4b8 | Schema_Builtin | Size: 0x4
			float32 m_forceTime; // 0x4bc | Schema_Builtin | Size: 0x4
			GlobalTypes::CHandle<server::CBaseEntity> m_attachedObject; // 0x4c0 | Schema_Atomic | Size: 0x4
			// char m_attachedObject[0x4]; // 0x4c0 | Schema_Atomic | Size: 0x4
			bool m_wasRestored; // 0x4c4 | Schema_Builtin | Size: 0x1
			S2_PAD(0x3);
			server::CConstantForceController m_integrator; // 0x4c8 | Schema_DeclaredClass | Size: 0x40
		};
#ifdef USE_STATIC_ASSERTS
		static_assert(offsetof(CS2::server::CPhysForce, m_nameAttach) == 0x4B0, "m_nameAttach in CPhysForce should be at offset 0x4B0");
		static_assert(offsetof(CS2::server::CPhysForce, m_force) == 0x4B8, "m_force in CPhysForce should be at offset 0x4B8");
		static_assert(offsetof(CS2::server::CPhysForce, m_forceTime) == 0x4BC, "m_forceTime in CPhysForce should be at offset 0x4BC");
		static_assert(offsetof(CS2::server::CPhysForce, m_attachedObject) == 0x4C0, "m_attachedObject in CPhysForce should be at offset 0x4C0");
		static_assert(offsetof(CS2::server::CPhysForce, m_wasRestored) == 0x4C4, "m_wasRestored in CPhysForce should be at offset 0x4C4");
		static_assert(offsetof(CS2::server::CPhysForce, m_integrator) == 0x4C8, "m_integrator in CPhysForce should be at offset 0x4C8");
		static_assert(sizeof(CS2::server::CPhysForce) == 0x508, "CPhysForce size should be 0x508");

#endif
	}
}
