// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#ifndef CUSTOM_GLOBAL_TYPES
	#include "../GlobalTypes.hpp"
#else
	#include "../Custom/GlobalTypes.hpp"
#endif


#include "CBaseEntity.hpp"





using namespace GlobalTypes;
namespace CS2 {
	namespace server {
		class CPhysicsSpring : public CS2::server::CBaseEntity {
		public:
			S2_PAD(0x8);
			float32 m_flFrequency; // 0x4b0 | Schema_Builtin | Size: 0x4
			float32 m_flDampingRatio; // 0x4b4 | Schema_Builtin | Size: 0x4
			float32 m_flRestLength; // 0x4b8 | Schema_Builtin | Size: 0x4
			S2_PAD(0x4);
			GlobalTypes::CUtlSymbolLarge m_nameAttachStart; // 0x4c0 | Schema_Atomic | Size: 0x8
			GlobalTypes::CUtlSymbolLarge m_nameAttachEnd; // 0x4c8 | Schema_Atomic | Size: 0x8
			GlobalTypes::VectorWS m_start; // 0x4d0 | Schema_Atomic | Size: 0xc
			GlobalTypes::VectorWS m_end; // 0x4dc | Schema_Atomic | Size: 0xc
			uint32_t m_teleportTick; // 0x4e8 | Schema_Builtin | Size: 0x4
			S2_PAD(0x4); // End padding
		};
#ifdef USE_STATIC_ASSERTS
		static_assert(offsetof(CS2::server::CPhysicsSpring, m_flFrequency) == 0x4B0, "m_flFrequency in CPhysicsSpring should be at offset 0x4B0");
		static_assert(offsetof(CS2::server::CPhysicsSpring, m_flDampingRatio) == 0x4B4, "m_flDampingRatio in CPhysicsSpring should be at offset 0x4B4");
		static_assert(offsetof(CS2::server::CPhysicsSpring, m_flRestLength) == 0x4B8, "m_flRestLength in CPhysicsSpring should be at offset 0x4B8");
		static_assert(offsetof(CS2::server::CPhysicsSpring, m_nameAttachStart) == 0x4C0, "m_nameAttachStart in CPhysicsSpring should be at offset 0x4C0");
		static_assert(offsetof(CS2::server::CPhysicsSpring, m_nameAttachEnd) == 0x4C8, "m_nameAttachEnd in CPhysicsSpring should be at offset 0x4C8");
		static_assert(offsetof(CS2::server::CPhysicsSpring, m_start) == 0x4D0, "m_start in CPhysicsSpring should be at offset 0x4D0");
		static_assert(offsetof(CS2::server::CPhysicsSpring, m_end) == 0x4DC, "m_end in CPhysicsSpring should be at offset 0x4DC");
		static_assert(offsetof(CS2::server::CPhysicsSpring, m_teleportTick) == 0x4E8, "m_teleportTick in CPhysicsSpring should be at offset 0x4E8");
		static_assert(sizeof(CS2::server::CPhysicsSpring) == 0x4F0, "CPhysicsSpring size should be 0x4F0");

#endif
	}
}
