// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#ifndef CUSTOM_GLOBAL_TYPES
	#include "../GlobalTypes.hpp"
#else
	#include "../Custom/GlobalTypes.hpp"
#endif


#include "CLogicalEntity.hpp"
#include "../entity2/CEntityIOOutput.hpp"



namespace CS2 {
	namespace server {
		class CBaseEntity;
	}
}


using namespace GlobalTypes;
namespace CS2 {
	namespace server {
		class CPhysConstraint : public CS2::server::CLogicalEntity {
		public:
			S2_PAD(0x8);
			GlobalTypes::CUtlSymbolLarge m_nameAttach1; // 0x4b0 | Schema_Atomic | Size: 0x8
			GlobalTypes::CUtlSymbolLarge m_nameAttach2; // 0x4b8 | Schema_Atomic | Size: 0x8
			GlobalTypes::CHandle<server::CBaseEntity> m_hAttach1; // 0x4c0 | Schema_Atomic | Size: 0x4
			// char m_hAttach1[0x4]; // 0x4c0 | Schema_Atomic | Size: 0x4
			GlobalTypes::CHandle<server::CBaseEntity> m_hAttach2; // 0x4c4 | Schema_Atomic | Size: 0x4
			// char m_hAttach2[0x4]; // 0x4c4 | Schema_Atomic | Size: 0x4
			GlobalTypes::CUtlSymbolLarge m_nameAttachment1; // 0x4c8 | Schema_Atomic | Size: 0x8
			GlobalTypes::CUtlSymbolLarge m_nameAttachment2; // 0x4d0 | Schema_Atomic | Size: 0x8
			GlobalTypes::CUtlSymbolLarge m_breakSound; // 0x4d8 | Schema_Atomic | Size: 0x8
			float32 m_forceLimit; // 0x4e0 | Schema_Builtin | Size: 0x4
			float32 m_torqueLimit; // 0x4e4 | Schema_Builtin | Size: 0x4
			float32 m_minTeleportDistance; // 0x4e8 | Schema_Builtin | Size: 0x4
			bool m_bSnapObjectPositions; // 0x4ec | Schema_Builtin | Size: 0x1
			bool m_bTreatEntity1AsInfiniteMass; // 0x4ed | Schema_Builtin | Size: 0x1
			S2_PAD(0x2);
			entity2::CEntityIOOutput m_OnBreak; // 0x4f0 | Schema_DeclaredClass | Size: 0x18
		};
#ifdef USE_STATIC_ASSERTS
		static_assert(offsetof(CS2::server::CPhysConstraint, m_nameAttach1) == 0x4B0, "m_nameAttach1 in CPhysConstraint should be at offset 0x4B0");
		static_assert(offsetof(CS2::server::CPhysConstraint, m_nameAttach2) == 0x4B8, "m_nameAttach2 in CPhysConstraint should be at offset 0x4B8");
		static_assert(offsetof(CS2::server::CPhysConstraint, m_hAttach1) == 0x4C0, "m_hAttach1 in CPhysConstraint should be at offset 0x4C0");
		static_assert(offsetof(CS2::server::CPhysConstraint, m_hAttach2) == 0x4C4, "m_hAttach2 in CPhysConstraint should be at offset 0x4C4");
		static_assert(offsetof(CS2::server::CPhysConstraint, m_nameAttachment1) == 0x4C8, "m_nameAttachment1 in CPhysConstraint should be at offset 0x4C8");
		static_assert(offsetof(CS2::server::CPhysConstraint, m_nameAttachment2) == 0x4D0, "m_nameAttachment2 in CPhysConstraint should be at offset 0x4D0");
		static_assert(offsetof(CS2::server::CPhysConstraint, m_breakSound) == 0x4D8, "m_breakSound in CPhysConstraint should be at offset 0x4D8");
		static_assert(offsetof(CS2::server::CPhysConstraint, m_forceLimit) == 0x4E0, "m_forceLimit in CPhysConstraint should be at offset 0x4E0");
		static_assert(offsetof(CS2::server::CPhysConstraint, m_torqueLimit) == 0x4E4, "m_torqueLimit in CPhysConstraint should be at offset 0x4E4");
		static_assert(offsetof(CS2::server::CPhysConstraint, m_minTeleportDistance) == 0x4E8, "m_minTeleportDistance in CPhysConstraint should be at offset 0x4E8");
		static_assert(offsetof(CS2::server::CPhysConstraint, m_bSnapObjectPositions) == 0x4EC, "m_bSnapObjectPositions in CPhysConstraint should be at offset 0x4EC");
		static_assert(offsetof(CS2::server::CPhysConstraint, m_bTreatEntity1AsInfiniteMass) == 0x4ED, "m_bTreatEntity1AsInfiniteMass in CPhysConstraint should be at offset 0x4ED");
		static_assert(offsetof(CS2::server::CPhysConstraint, m_OnBreak) == 0x4F0, "m_OnBreak in CPhysConstraint should be at offset 0x4F0");
		static_assert(sizeof(CS2::server::CPhysConstraint) == 0x508, "CPhysConstraint size should be 0x508");

#endif
	}
}
