// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#ifndef CUSTOM_GLOBAL_TYPES
	#include "../GlobalTypes.hpp"
#else
	#include "../Custom/GlobalTypes.hpp"
#endif


#include "CPointEntity.hpp"
#include "../entity2/CEntityIOOutput.hpp"





using namespace GlobalTypes;
namespace CS2 {
	namespace server {
		class CPhysExplosion : public CS2::server::CPointEntity {
		public:
			bool m_bExplodeOnSpawn; // 0x4a8 | Schema_Builtin | Size: 0x1
			S2_PAD(0x3);
			float32 m_flMagnitude; // 0x4ac | Schema_Builtin | Size: 0x4
			float32 m_flDamage; // 0x4b0 | Schema_Builtin | Size: 0x4
			float32 m_radius; // 0x4b4 | Schema_Builtin | Size: 0x4
			GlobalTypes::CUtlSymbolLarge m_targetEntityName; // 0x4b8 | Schema_Atomic | Size: 0x8
			float32 m_flInnerRadius; // 0x4c0 | Schema_Builtin | Size: 0x4
			float32 m_flPushScale; // 0x4c4 | Schema_Builtin | Size: 0x4
			bool m_bConvertToDebrisWhenPossible; // 0x4c8 | Schema_Builtin | Size: 0x1
			bool m_bAffectInvulnerableEnts; // 0x4c9 | Schema_Builtin | Size: 0x1
			S2_PAD(0x6);
			entity2::CEntityIOOutput m_OnPushedPlayer; // 0x4d0 | Schema_DeclaredClass | Size: 0x18
		};
		static_assert(offsetof(CS2::server::CPhysExplosion, m_bExplodeOnSpawn) == 0x4A8, "m_bExplodeOnSpawn in CPhysExplosion should be at offset 0x4A8");
		static_assert(offsetof(CS2::server::CPhysExplosion, m_flMagnitude) == 0x4AC, "m_flMagnitude in CPhysExplosion should be at offset 0x4AC");
		static_assert(offsetof(CS2::server::CPhysExplosion, m_flDamage) == 0x4B0, "m_flDamage in CPhysExplosion should be at offset 0x4B0");
		static_assert(offsetof(CS2::server::CPhysExplosion, m_radius) == 0x4B4, "m_radius in CPhysExplosion should be at offset 0x4B4");
		static_assert(offsetof(CS2::server::CPhysExplosion, m_targetEntityName) == 0x4B8, "m_targetEntityName in CPhysExplosion should be at offset 0x4B8");
		static_assert(offsetof(CS2::server::CPhysExplosion, m_flInnerRadius) == 0x4C0, "m_flInnerRadius in CPhysExplosion should be at offset 0x4C0");
		static_assert(offsetof(CS2::server::CPhysExplosion, m_flPushScale) == 0x4C4, "m_flPushScale in CPhysExplosion should be at offset 0x4C4");
		static_assert(offsetof(CS2::server::CPhysExplosion, m_bConvertToDebrisWhenPossible) == 0x4C8, "m_bConvertToDebrisWhenPossible in CPhysExplosion should be at offset 0x4C8");
		static_assert(offsetof(CS2::server::CPhysExplosion, m_bAffectInvulnerableEnts) == 0x4C9, "m_bAffectInvulnerableEnts in CPhysExplosion should be at offset 0x4C9");
		static_assert(offsetof(CS2::server::CPhysExplosion, m_OnPushedPlayer) == 0x4D0, "m_OnPushedPlayer in CPhysExplosion should be at offset 0x4D0");
		static_assert(sizeof(CS2::server::CPhysExplosion) == 0x4E8, "CPhysExplosion size should be 0x4E8");
	}
}
