// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#include <SDK/GlobalTypes.hpp>

#include <SDK/server/CPhysicsProp.hpp>



namespace CS2 {
	namespace server {
		class CPhysicsPropRespawnable : public CS2::server::CPhysicsProp {
		public:
			GlobalTypes::Vector m_vOriginalSpawnOrigin; // 0xdf0 | Schema_Atomic | Size: 0xc
			GlobalTypes::QAngle m_vOriginalSpawnAngles; // 0xdfc | Schema_Atomic | Size: 0xc
			GlobalTypes::Vector m_vOriginalMins; // 0xe08 | Schema_Atomic | Size: 0xc
			GlobalTypes::Vector m_vOriginalMaxs; // 0xe14 | Schema_Atomic | Size: 0xc
			float32 m_flRespawnDuration; // 0xe20 | Schema_Builtin | Size: 0x4
			S2_PAD(0xc); // End padding
		};
		static_assert(offsetof(CS2::server::CPhysicsPropRespawnable, m_vOriginalSpawnOrigin) == 0xDF0, "m_vOriginalSpawnOrigin in CPhysicsPropRespawnable should be at offset 0xDF0");
		static_assert(offsetof(CS2::server::CPhysicsPropRespawnable, m_vOriginalSpawnAngles) == 0xDFC, "m_vOriginalSpawnAngles in CPhysicsPropRespawnable should be at offset 0xDFC");
		static_assert(offsetof(CS2::server::CPhysicsPropRespawnable, m_vOriginalMins) == 0xE08, "m_vOriginalMins in CPhysicsPropRespawnable should be at offset 0xE08");
		static_assert(offsetof(CS2::server::CPhysicsPropRespawnable, m_vOriginalMaxs) == 0xE14, "m_vOriginalMaxs in CPhysicsPropRespawnable should be at offset 0xE14");
		static_assert(offsetof(CS2::server::CPhysicsPropRespawnable, m_flRespawnDuration) == 0xE20, "m_flRespawnDuration in CPhysicsPropRespawnable should be at offset 0xE20");
		static_assert(sizeof(CS2::server::CPhysicsPropRespawnable) == 0xE30, "CPhysicsPropRespawnable size should be 0xE30");
	}
}
