// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#include <SDK/GlobalTypes.hpp>

#include <SDK/server/CPhysConstraint.hpp>



namespace CS2 {
	namespace server {
		class CPhysPulley : public CS2::server::CPhysConstraint {
		public:
			GlobalTypes::VectorWS m_position2; // 0x560 | Schema_Atomic | Size: 0xc
			GlobalTypes::Vector m_offset[2]; // 0x56c | Schema_FixedArray | Size: 0x18
			float32 m_addLength; // 0x584 | Schema_Builtin | Size: 0x4
			float32 m_gearRatio; // 0x588 | Schema_Builtin | Size: 0x4
			S2_PAD(0x4); // End padding
		};
		static_assert(offsetof(CS2::server::CPhysPulley, m_position2) == 0x560, "m_position2 in CPhysPulley should be at offset 0x560");
		static_assert(offsetof(CS2::server::CPhysPulley, m_offset) == 0x56C, "m_offset in CPhysPulley should be at offset 0x56C");
		static_assert(offsetof(CS2::server::CPhysPulley, m_addLength) == 0x584, "m_addLength in CPhysPulley should be at offset 0x584");
		static_assert(offsetof(CS2::server::CPhysPulley, m_gearRatio) == 0x588, "m_gearRatio in CPhysPulley should be at offset 0x588");
		static_assert(sizeof(CS2::server::CPhysPulley) == 0x590, "CPhysPulley size should be 0x590");
	}
}
