// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#ifndef CUSTOM_GLOBAL_TYPES
	#include "../GlobalTypes.hpp"
#else
	#include "../Custom/GlobalTypes.hpp"
#endif


#include "CPhysConstraint.hpp"





using namespace GlobalTypes;
namespace CS2 {
	namespace server {
		class CPhysPulley : public CS2::server::CPhysConstraint {
		public:
			GlobalTypes::VectorWS m_position2; // 0x508 | Schema_Atomic | Size: 0xc
			GlobalTypes::Vector m_offset[2]; // 0x514 | Schema_FixedArray | Size: 0x18
			float32 m_addLength; // 0x52c | Schema_Builtin | Size: 0x4
			float32 m_gearRatio; // 0x530 | Schema_Builtin | Size: 0x4
			S2_PAD(0x4); // End padding
		};
		static_assert(offsetof(CS2::server::CPhysPulley, m_position2) == 0x508, "m_position2 in CPhysPulley should be at offset 0x508");
		static_assert(offsetof(CS2::server::CPhysPulley, m_offset) == 0x514, "m_offset in CPhysPulley should be at offset 0x514");
		static_assert(offsetof(CS2::server::CPhysPulley, m_addLength) == 0x52C, "m_addLength in CPhysPulley should be at offset 0x52C");
		static_assert(offsetof(CS2::server::CPhysPulley, m_gearRatio) == 0x530, "m_gearRatio in CPhysPulley should be at offset 0x530");
		static_assert(sizeof(CS2::server::CPhysPulley) == 0x538, "CPhysPulley size should be 0x538");
	}
}
