// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#ifndef CUSTOM_GLOBAL_TYPES
	#include <SDK/GlobalTypes.hpp>
#else
	#include <Custom/GlobalTypes.hpp>
#endif


#include <SDK/client/CPlayerPawnComponent.hpp>
#include <SDK/client/ObserverMode_t.hpp>





using namespace GlobalTypes;
namespace CS2 {
	namespace server {
		class CPlayer_ObserverServices : public CS2::client::CPlayerPawnComponent {
		public:
			uint8_t m_iObserverMode; // 0x40 | Schema_Builtin | Size: 0x1
			S2_PAD(0x3);
			// server::CHandle< server::CBaseEntity > m_hObserverTarget; // 0x44 | Schema_Atomic | Size: 0x4
			char  m_hObserverTarget[0x4]; // 0x44 | Schema_Atomic | Size: 0x4
			client::ObserverMode_t m_iObserverLastMode; // 0x48 | Schema_DeclaredEnum | Size: 0x4
			bool m_bForcedObserverMode; // 0x4c | Schema_Builtin | Size: 0x1
			S2_PAD(0x3); // End padding
		};
		static_assert(offsetof(CS2::server::CPlayer_ObserverServices, m_iObserverMode) == 0x40, "m_iObserverMode in CPlayer_ObserverServices should be at offset 0x40");
		static_assert(offsetof(CS2::server::CPlayer_ObserverServices, m_hObserverTarget) == 0x44, "m_hObserverTarget in CPlayer_ObserverServices should be at offset 0x44");
		static_assert(offsetof(CS2::server::CPlayer_ObserverServices, m_iObserverLastMode) == 0x48, "m_iObserverLastMode in CPlayer_ObserverServices should be at offset 0x48");
		static_assert(offsetof(CS2::server::CPlayer_ObserverServices, m_bForcedObserverMode) == 0x4C, "m_bForcedObserverMode in CPlayer_ObserverServices should be at offset 0x4C");
		static_assert(sizeof(CS2::server::CPlayer_ObserverServices) == 0x50, "CPlayer_ObserverServices size should be 0x50");
	}
}
