// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#ifndef CUSTOM_GLOBAL_TYPES
	#include <SDK/GlobalTypes.hpp>
#else
	#include <Custom/GlobalTypes.hpp>
#endif


#include <SDK/server/CPlayer_MovementServices.hpp>





using namespace GlobalTypes;
namespace CS2 {
	namespace server {
		class CPlayer_MovementServices_Humanoid : public CS2::server::CPlayer_MovementServices {
		public:
			float32 m_flStepSoundTime; // 0x240 | Schema_Builtin | Size: 0x4
			float32 m_flFallVelocity; // 0x244 | Schema_Builtin | Size: 0x4
			GlobalTypes::Vector m_groundNormal; // 0x248 | Schema_Atomic | Size: 0xc
			float32 m_flSurfaceFriction; // 0x254 | Schema_Builtin | Size: 0x4
			GlobalTypes::CUtlStringToken m_surfaceProps; // 0x258 | Schema_Atomic | Size: 0x4
			S2_PAD(0xc);
			int32_t m_nStepside; // 0x268 | Schema_Builtin | Size: 0x4
			GlobalTypes::Vector m_vecSmoothedVelocity; // 0x26c | Schema_Atomic | Size: 0xc
		};
		static_assert(offsetof(CS2::server::CPlayer_MovementServices_Humanoid, m_flStepSoundTime) == 0x240, "m_flStepSoundTime in CPlayer_MovementServices_Humanoid should be at offset 0x240");
		static_assert(offsetof(CS2::server::CPlayer_MovementServices_Humanoid, m_flFallVelocity) == 0x244, "m_flFallVelocity in CPlayer_MovementServices_Humanoid should be at offset 0x244");
		static_assert(offsetof(CS2::server::CPlayer_MovementServices_Humanoid, m_groundNormal) == 0x248, "m_groundNormal in CPlayer_MovementServices_Humanoid should be at offset 0x248");
		static_assert(offsetof(CS2::server::CPlayer_MovementServices_Humanoid, m_flSurfaceFriction) == 0x254, "m_flSurfaceFriction in CPlayer_MovementServices_Humanoid should be at offset 0x254");
		static_assert(offsetof(CS2::server::CPlayer_MovementServices_Humanoid, m_surfaceProps) == 0x258, "m_surfaceProps in CPlayer_MovementServices_Humanoid should be at offset 0x258");
		static_assert(offsetof(CS2::server::CPlayer_MovementServices_Humanoid, m_nStepside) == 0x268, "m_nStepside in CPlayer_MovementServices_Humanoid should be at offset 0x268");
		static_assert(offsetof(CS2::server::CPlayer_MovementServices_Humanoid, m_vecSmoothedVelocity) == 0x26C, "m_vecSmoothedVelocity in CPlayer_MovementServices_Humanoid should be at offset 0x26C");
		static_assert(sizeof(CS2::server::CPlayer_MovementServices_Humanoid) == 0x278, "CPlayer_MovementServices_Humanoid size should be 0x278");
	}
}
