// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#ifndef CUSTOM_GLOBAL_TYPES
	#include "../GlobalTypes.hpp"
#else
	#include "../Custom/GlobalTypes.hpp"
#endif


#include "CBaseEntity.hpp"





using namespace GlobalTypes;
namespace CS2 {
	namespace server {
		class CPlayerVisibility : public CS2::server::CBaseEntity {
		public:
			float32 m_flVisibilityStrength; // 0x4a8 | Schema_Builtin | Size: 0x4
			float32 m_flFogDistanceMultiplier; // 0x4ac | Schema_Builtin | Size: 0x4
			float32 m_flFogMaxDensityMultiplier; // 0x4b0 | Schema_Builtin | Size: 0x4
			float32 m_flFadeTime; // 0x4b4 | Schema_Builtin | Size: 0x4
			bool m_bStartDisabled; // 0x4b8 | Schema_Builtin | Size: 0x1
			bool m_bIsEnabled; // 0x4b9 | Schema_Builtin | Size: 0x1
			S2_PAD(0x6); // End padding
		};
#ifdef USE_STATIC_ASSERTS
		static_assert(offsetof(CS2::server::CPlayerVisibility, m_flVisibilityStrength) == 0x4A8, "m_flVisibilityStrength in CPlayerVisibility should be at offset 0x4A8");
		static_assert(offsetof(CS2::server::CPlayerVisibility, m_flFogDistanceMultiplier) == 0x4AC, "m_flFogDistanceMultiplier in CPlayerVisibility should be at offset 0x4AC");
		static_assert(offsetof(CS2::server::CPlayerVisibility, m_flFogMaxDensityMultiplier) == 0x4B0, "m_flFogMaxDensityMultiplier in CPlayerVisibility should be at offset 0x4B0");
		static_assert(offsetof(CS2::server::CPlayerVisibility, m_flFadeTime) == 0x4B4, "m_flFadeTime in CPlayerVisibility should be at offset 0x4B4");
		static_assert(offsetof(CS2::server::CPlayerVisibility, m_bStartDisabled) == 0x4B8, "m_bStartDisabled in CPlayerVisibility should be at offset 0x4B8");
		static_assert(offsetof(CS2::server::CPlayerVisibility, m_bIsEnabled) == 0x4B9, "m_bIsEnabled in CPlayerVisibility should be at offset 0x4B9");
		static_assert(sizeof(CS2::server::CPlayerVisibility) == 0x4C0, "CPlayerVisibility size should be 0x4C0");

#endif
	}
}
