// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#ifndef CUSTOM_GLOBAL_TYPES
	#include "../GlobalTypes.hpp"
#else
	#include "../Custom/GlobalTypes.hpp"
#endif


#include "CModelPointEntity.hpp"





using namespace GlobalTypes;
namespace CS2 {
	namespace server {
		class CPlayerSprayDecal : public CS2::server::CModelPointEntity {
		public:
			int32_t m_nUniqueID; // 0x730 | Schema_Builtin | Size: 0x4
			uint32_t m_unAccountID; // 0x734 | Schema_Builtin | Size: 0x4
			uint32_t m_unTraceID; // 0x738 | Schema_Builtin | Size: 0x4
			uint32_t m_rtGcTime; // 0x73c | Schema_Builtin | Size: 0x4
			GlobalTypes::Vector m_vecEndPos; // 0x740 | Schema_Atomic | Size: 0xc
			GlobalTypes::Vector m_vecStart; // 0x74c | Schema_Atomic | Size: 0xc
			GlobalTypes::Vector m_vecLeft; // 0x758 | Schema_Atomic | Size: 0xc
			GlobalTypes::Vector m_vecNormal; // 0x764 | Schema_Atomic | Size: 0xc
			int32_t m_nPlayer; // 0x770 | Schema_Builtin | Size: 0x4
			int32_t m_nEntity; // 0x774 | Schema_Builtin | Size: 0x4
			int32_t m_nHitbox; // 0x778 | Schema_Builtin | Size: 0x4
			float32 m_flCreationTime; // 0x77c | Schema_Builtin | Size: 0x4
			int32_t m_nTintID; // 0x780 | Schema_Builtin | Size: 0x4
			uint8_t m_nVersion; // 0x784 | Schema_Builtin | Size: 0x1
			uint8_t m_ubSignature[128]; // 0x785 | Schema_FixedArray | Size: 0x80
			S2_PAD(0x3); // End padding
		};
		static_assert(offsetof(CS2::server::CPlayerSprayDecal, m_nUniqueID) == 0x730, "m_nUniqueID in CPlayerSprayDecal should be at offset 0x730");
		static_assert(offsetof(CS2::server::CPlayerSprayDecal, m_unAccountID) == 0x734, "m_unAccountID in CPlayerSprayDecal should be at offset 0x734");
		static_assert(offsetof(CS2::server::CPlayerSprayDecal, m_unTraceID) == 0x738, "m_unTraceID in CPlayerSprayDecal should be at offset 0x738");
		static_assert(offsetof(CS2::server::CPlayerSprayDecal, m_rtGcTime) == 0x73C, "m_rtGcTime in CPlayerSprayDecal should be at offset 0x73C");
		static_assert(offsetof(CS2::server::CPlayerSprayDecal, m_vecEndPos) == 0x740, "m_vecEndPos in CPlayerSprayDecal should be at offset 0x740");
		static_assert(offsetof(CS2::server::CPlayerSprayDecal, m_vecStart) == 0x74C, "m_vecStart in CPlayerSprayDecal should be at offset 0x74C");
		static_assert(offsetof(CS2::server::CPlayerSprayDecal, m_vecLeft) == 0x758, "m_vecLeft in CPlayerSprayDecal should be at offset 0x758");
		static_assert(offsetof(CS2::server::CPlayerSprayDecal, m_vecNormal) == 0x764, "m_vecNormal in CPlayerSprayDecal should be at offset 0x764");
		static_assert(offsetof(CS2::server::CPlayerSprayDecal, m_nPlayer) == 0x770, "m_nPlayer in CPlayerSprayDecal should be at offset 0x770");
		static_assert(offsetof(CS2::server::CPlayerSprayDecal, m_nEntity) == 0x774, "m_nEntity in CPlayerSprayDecal should be at offset 0x774");
		static_assert(offsetof(CS2::server::CPlayerSprayDecal, m_nHitbox) == 0x778, "m_nHitbox in CPlayerSprayDecal should be at offset 0x778");
		static_assert(offsetof(CS2::server::CPlayerSprayDecal, m_flCreationTime) == 0x77C, "m_flCreationTime in CPlayerSprayDecal should be at offset 0x77C");
		static_assert(offsetof(CS2::server::CPlayerSprayDecal, m_nTintID) == 0x780, "m_nTintID in CPlayerSprayDecal should be at offset 0x780");
		static_assert(offsetof(CS2::server::CPlayerSprayDecal, m_nVersion) == 0x784, "m_nVersion in CPlayerSprayDecal should be at offset 0x784");
		static_assert(offsetof(CS2::server::CPlayerSprayDecal, m_ubSignature) == 0x785, "m_ubSignature in CPlayerSprayDecal should be at offset 0x785");
		static_assert(sizeof(CS2::server::CPlayerSprayDecal) == 0x808, "CPlayerSprayDecal size should be 0x808");
	}
}
