// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#include <SDK/GlobalTypes.hpp>

#include <SDK/server/CModelPointEntity.hpp>



namespace CS2 {
	namespace server {
		class CPlayerSprayDecal : public CS2::server::CModelPointEntity {
		public:
			int32_t m_nUniqueID; // 0x7e8 | Schema_Builtin | Size: 0x4
			uint32_t m_unAccountID; // 0x7ec | Schema_Builtin | Size: 0x4
			uint32_t m_unTraceID; // 0x7f0 | Schema_Builtin | Size: 0x4
			uint32_t m_rtGcTime; // 0x7f4 | Schema_Builtin | Size: 0x4
			GlobalTypes::Vector m_vecEndPos; // 0x7f8 | Schema_Atomic | Size: 0xc
			GlobalTypes::Vector m_vecStart; // 0x804 | Schema_Atomic | Size: 0xc
			GlobalTypes::Vector m_vecLeft; // 0x810 | Schema_Atomic | Size: 0xc
			GlobalTypes::Vector m_vecNormal; // 0x81c | Schema_Atomic | Size: 0xc
			int32_t m_nPlayer; // 0x828 | Schema_Builtin | Size: 0x4
			int32_t m_nEntity; // 0x82c | Schema_Builtin | Size: 0x4
			int32_t m_nHitbox; // 0x830 | Schema_Builtin | Size: 0x4
			float32 m_flCreationTime; // 0x834 | Schema_Builtin | Size: 0x4
			int32_t m_nTintID; // 0x838 | Schema_Builtin | Size: 0x4
			uint8_t m_nVersion; // 0x83c | Schema_Builtin | Size: 0x1
			uint8_t m_ubSignature[128]; // 0x83d | Schema_FixedArray | Size: 0x80
			S2_PAD(0x3); // End padding
		};
		static_assert(offsetof(CS2::server::CPlayerSprayDecal, m_nUniqueID) == 0x7E8, "m_nUniqueID in CPlayerSprayDecal should be at offset 0x7E8");
		static_assert(offsetof(CS2::server::CPlayerSprayDecal, m_unAccountID) == 0x7EC, "m_unAccountID in CPlayerSprayDecal should be at offset 0x7EC");
		static_assert(offsetof(CS2::server::CPlayerSprayDecal, m_unTraceID) == 0x7F0, "m_unTraceID in CPlayerSprayDecal should be at offset 0x7F0");
		static_assert(offsetof(CS2::server::CPlayerSprayDecal, m_rtGcTime) == 0x7F4, "m_rtGcTime in CPlayerSprayDecal should be at offset 0x7F4");
		static_assert(offsetof(CS2::server::CPlayerSprayDecal, m_vecEndPos) == 0x7F8, "m_vecEndPos in CPlayerSprayDecal should be at offset 0x7F8");
		static_assert(offsetof(CS2::server::CPlayerSprayDecal, m_vecStart) == 0x804, "m_vecStart in CPlayerSprayDecal should be at offset 0x804");
		static_assert(offsetof(CS2::server::CPlayerSprayDecal, m_vecLeft) == 0x810, "m_vecLeft in CPlayerSprayDecal should be at offset 0x810");
		static_assert(offsetof(CS2::server::CPlayerSprayDecal, m_vecNormal) == 0x81C, "m_vecNormal in CPlayerSprayDecal should be at offset 0x81C");
		static_assert(offsetof(CS2::server::CPlayerSprayDecal, m_nPlayer) == 0x828, "m_nPlayer in CPlayerSprayDecal should be at offset 0x828");
		static_assert(offsetof(CS2::server::CPlayerSprayDecal, m_nEntity) == 0x82C, "m_nEntity in CPlayerSprayDecal should be at offset 0x82C");
		static_assert(offsetof(CS2::server::CPlayerSprayDecal, m_nHitbox) == 0x830, "m_nHitbox in CPlayerSprayDecal should be at offset 0x830");
		static_assert(offsetof(CS2::server::CPlayerSprayDecal, m_flCreationTime) == 0x834, "m_flCreationTime in CPlayerSprayDecal should be at offset 0x834");
		static_assert(offsetof(CS2::server::CPlayerSprayDecal, m_nTintID) == 0x838, "m_nTintID in CPlayerSprayDecal should be at offset 0x838");
		static_assert(offsetof(CS2::server::CPlayerSprayDecal, m_nVersion) == 0x83C, "m_nVersion in CPlayerSprayDecal should be at offset 0x83C");
		static_assert(offsetof(CS2::server::CPlayerSprayDecal, m_ubSignature) == 0x83D, "m_ubSignature in CPlayerSprayDecal should be at offset 0x83D");
		static_assert(sizeof(CS2::server::CPlayerSprayDecal) == 0x8C0, "CPlayerSprayDecal size should be 0x8C0");
	}
}
