// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#ifndef CUSTOM_GLOBAL_TYPES
	#include "../GlobalTypes.hpp"
#else
	#include "../Custom/GlobalTypes.hpp"
#endif


#include "CBaseEntity.hpp"





using namespace GlobalTypes;
namespace CS2 {
	namespace server {
		class CPointCamera : public CS2::server::CBaseEntity {
		public:
			float32 m_FOV; // 0x4a8 | Schema_Builtin | Size: 0x4
			float32 m_Resolution; // 0x4ac | Schema_Builtin | Size: 0x4
			bool m_bFogEnable; // 0x4b0 | Schema_Builtin | Size: 0x1
			GlobalTypes::Color m_FogColor; // 0x4b1 | Schema_Atomic | Size: 0x4
			S2_PAD(0x3);
			float32 m_flFogStart; // 0x4b8 | Schema_Builtin | Size: 0x4
			float32 m_flFogEnd; // 0x4bc | Schema_Builtin | Size: 0x4
			float32 m_flFogMaxDensity; // 0x4c0 | Schema_Builtin | Size: 0x4
			bool m_bActive; // 0x4c4 | Schema_Builtin | Size: 0x1
			bool m_bUseScreenAspectRatio; // 0x4c5 | Schema_Builtin | Size: 0x1
			S2_PAD(0x2);
			float32 m_flAspectRatio; // 0x4c8 | Schema_Builtin | Size: 0x4
			bool m_bNoSky; // 0x4cc | Schema_Builtin | Size: 0x1
			S2_PAD(0x3);
			float32 m_fBrightness; // 0x4d0 | Schema_Builtin | Size: 0x4
			float32 m_flZFar; // 0x4d4 | Schema_Builtin | Size: 0x4
			float32 m_flZNear; // 0x4d8 | Schema_Builtin | Size: 0x4
			bool m_bCanHLTVUse; // 0x4dc | Schema_Builtin | Size: 0x1
			bool m_bAlignWithParent; // 0x4dd | Schema_Builtin | Size: 0x1
			bool m_bDofEnabled; // 0x4de | Schema_Builtin | Size: 0x1
			S2_PAD(0x1);
			float32 m_flDofNearBlurry; // 0x4e0 | Schema_Builtin | Size: 0x4
			float32 m_flDofNearCrisp; // 0x4e4 | Schema_Builtin | Size: 0x4
			float32 m_flDofFarCrisp; // 0x4e8 | Schema_Builtin | Size: 0x4
			float32 m_flDofFarBlurry; // 0x4ec | Schema_Builtin | Size: 0x4
			float32 m_flDofTiltToGround; // 0x4f0 | Schema_Builtin | Size: 0x4
			float32 m_TargetFOV; // 0x4f4 | Schema_Builtin | Size: 0x4
			float32 m_DegreesPerSecond; // 0x4f8 | Schema_Builtin | Size: 0x4
			bool m_bIsOn; // 0x4fc | Schema_Builtin | Size: 0x1
			S2_PAD(0x3);
			server::CPointCamera* m_pNext; // 0x500 | Schema_Ptr | Size: 0x8
		};
		static_assert(offsetof(CS2::server::CPointCamera, m_FOV) == 0x4A8, "m_FOV in CPointCamera should be at offset 0x4A8");
		static_assert(offsetof(CS2::server::CPointCamera, m_Resolution) == 0x4AC, "m_Resolution in CPointCamera should be at offset 0x4AC");
		static_assert(offsetof(CS2::server::CPointCamera, m_bFogEnable) == 0x4B0, "m_bFogEnable in CPointCamera should be at offset 0x4B0");
		static_assert(offsetof(CS2::server::CPointCamera, m_FogColor) == 0x4B1, "m_FogColor in CPointCamera should be at offset 0x4B1");
		static_assert(offsetof(CS2::server::CPointCamera, m_flFogStart) == 0x4B8, "m_flFogStart in CPointCamera should be at offset 0x4B8");
		static_assert(offsetof(CS2::server::CPointCamera, m_flFogEnd) == 0x4BC, "m_flFogEnd in CPointCamera should be at offset 0x4BC");
		static_assert(offsetof(CS2::server::CPointCamera, m_flFogMaxDensity) == 0x4C0, "m_flFogMaxDensity in CPointCamera should be at offset 0x4C0");
		static_assert(offsetof(CS2::server::CPointCamera, m_bActive) == 0x4C4, "m_bActive in CPointCamera should be at offset 0x4C4");
		static_assert(offsetof(CS2::server::CPointCamera, m_bUseScreenAspectRatio) == 0x4C5, "m_bUseScreenAspectRatio in CPointCamera should be at offset 0x4C5");
		static_assert(offsetof(CS2::server::CPointCamera, m_flAspectRatio) == 0x4C8, "m_flAspectRatio in CPointCamera should be at offset 0x4C8");
		static_assert(offsetof(CS2::server::CPointCamera, m_bNoSky) == 0x4CC, "m_bNoSky in CPointCamera should be at offset 0x4CC");
		static_assert(offsetof(CS2::server::CPointCamera, m_fBrightness) == 0x4D0, "m_fBrightness in CPointCamera should be at offset 0x4D0");
		static_assert(offsetof(CS2::server::CPointCamera, m_flZFar) == 0x4D4, "m_flZFar in CPointCamera should be at offset 0x4D4");
		static_assert(offsetof(CS2::server::CPointCamera, m_flZNear) == 0x4D8, "m_flZNear in CPointCamera should be at offset 0x4D8");
		static_assert(offsetof(CS2::server::CPointCamera, m_bCanHLTVUse) == 0x4DC, "m_bCanHLTVUse in CPointCamera should be at offset 0x4DC");
		static_assert(offsetof(CS2::server::CPointCamera, m_bAlignWithParent) == 0x4DD, "m_bAlignWithParent in CPointCamera should be at offset 0x4DD");
		static_assert(offsetof(CS2::server::CPointCamera, m_bDofEnabled) == 0x4DE, "m_bDofEnabled in CPointCamera should be at offset 0x4DE");
		static_assert(offsetof(CS2::server::CPointCamera, m_flDofNearBlurry) == 0x4E0, "m_flDofNearBlurry in CPointCamera should be at offset 0x4E0");
		static_assert(offsetof(CS2::server::CPointCamera, m_flDofNearCrisp) == 0x4E4, "m_flDofNearCrisp in CPointCamera should be at offset 0x4E4");
		static_assert(offsetof(CS2::server::CPointCamera, m_flDofFarCrisp) == 0x4E8, "m_flDofFarCrisp in CPointCamera should be at offset 0x4E8");
		static_assert(offsetof(CS2::server::CPointCamera, m_flDofFarBlurry) == 0x4EC, "m_flDofFarBlurry in CPointCamera should be at offset 0x4EC");
		static_assert(offsetof(CS2::server::CPointCamera, m_flDofTiltToGround) == 0x4F0, "m_flDofTiltToGround in CPointCamera should be at offset 0x4F0");
		static_assert(offsetof(CS2::server::CPointCamera, m_TargetFOV) == 0x4F4, "m_TargetFOV in CPointCamera should be at offset 0x4F4");
		static_assert(offsetof(CS2::server::CPointCamera, m_DegreesPerSecond) == 0x4F8, "m_DegreesPerSecond in CPointCamera should be at offset 0x4F8");
		static_assert(offsetof(CS2::server::CPointCamera, m_bIsOn) == 0x4FC, "m_bIsOn in CPointCamera should be at offset 0x4FC");
		static_assert(offsetof(CS2::server::CPointCamera, m_pNext) == 0x500, "m_pNext in CPointCamera should be at offset 0x500");
		static_assert(sizeof(CS2::server::CPointCamera) == 0x508, "CPointCamera size should be 0x508");
	}
}
