// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#include <SDK/GlobalTypes.hpp>

#include <SDK/server/CBaseAnimGraph.hpp>
#include <SDK/entity2/GameTime_t.hpp>
#include <SDK/entity2/CEntityIOOutput.hpp>



namespace CS2 {
	namespace server {
		class CPointCommentaryNode : public CS2::server::CBaseAnimGraph {
		public:
			public:
			GlobalTypes::CUtlSymbolLarge m_iszPreCommands; // 0xa78 | Schema_Atomic | Size: 0x8
			GlobalTypes::CUtlSymbolLarge m_iszPostCommands; // 0xa80 | Schema_Atomic | Size: 0x8
			GlobalTypes::CUtlSymbolLarge m_iszCommentaryFile; // 0xa88 | Schema_Atomic | Size: 0x8
			GlobalTypes::CUtlSymbolLarge m_iszViewTarget; // 0xa90 | Schema_Atomic | Size: 0x8
			// server::CHandle< server::CBaseEntity > m_hViewTarget; // 0xa98 | Schema_Atomic | Size: 0x4
			char  m_hViewTarget[0x4]; // 0xa98 | Schema_Atomic | Size: 0x4
			// server::CHandle< server::CBaseEntity > m_hViewTargetAngles; // 0xa9c | Schema_Atomic | Size: 0x4
			char  m_hViewTargetAngles[0x4]; // 0xa9c | Schema_Atomic | Size: 0x4
			GlobalTypes::CUtlSymbolLarge m_iszViewPosition; // 0xaa0 | Schema_Atomic | Size: 0x8
			// server::CHandle< server::CBaseEntity > m_hViewPosition; // 0xaa8 | Schema_Atomic | Size: 0x4
			char  m_hViewPosition[0x4]; // 0xaa8 | Schema_Atomic | Size: 0x4
			// server::CHandle< server::CBaseEntity > m_hViewPositionMover; // 0xaac | Schema_Atomic | Size: 0x4
			char  m_hViewPositionMover[0x4]; // 0xaac | Schema_Atomic | Size: 0x4
			bool m_bPreventMovement; // 0xab0 | Schema_Builtin | Size: 0x1
			bool m_bUnderCrosshair; // 0xab1 | Schema_Builtin | Size: 0x1
			bool m_bUnstoppable; // 0xab2 | Schema_Builtin | Size: 0x1
			S2_PAD(0x1);
			entity2::GameTime_t m_flFinishedTime; // 0xab4 | Schema_DeclaredClass | Size: 0x4
			GlobalTypes::Vector m_vecFinishOrigin; // 0xab8 | Schema_Atomic | Size: 0xc
			GlobalTypes::QAngle m_vecOriginalAngles; // 0xac4 | Schema_Atomic | Size: 0xc
			GlobalTypes::QAngle m_vecFinishAngles; // 0xad0 | Schema_Atomic | Size: 0xc
			bool m_bPreventChangesWhileMoving; // 0xadc | Schema_Builtin | Size: 0x1
			bool m_bDisabled; // 0xadd | Schema_Builtin | Size: 0x1
			S2_PAD(0x2);
			GlobalTypes::Vector m_vecTeleportOrigin; // 0xae0 | Schema_Atomic | Size: 0xc
			entity2::GameTime_t m_flAbortedPlaybackAt; // 0xaec | Schema_DeclaredClass | Size: 0x4
			entity2::CEntityIOOutput m_pOnCommentaryStarted; // 0xaf0 | Schema_DeclaredClass | Size: 0x28
			entity2::CEntityIOOutput m_pOnCommentaryStopped; // 0xb18 | Schema_DeclaredClass | Size: 0x28
			bool m_bActive; // 0xb40 | Schema_Builtin | Size: 0x1
			S2_PAD(0x3);
			entity2::GameTime_t m_flStartTime; // 0xb44 | Schema_DeclaredClass | Size: 0x4
			float32 m_flStartTimeInCommentary; // 0xb48 | Schema_Builtin | Size: 0x4
			S2_PAD(0x4);
			GlobalTypes::CUtlSymbolLarge m_iszTitle; // 0xb50 | Schema_Atomic | Size: 0x8
			GlobalTypes::CUtlSymbolLarge m_iszSpeakers; // 0xb58 | Schema_Atomic | Size: 0x8
			int32_t m_iNodeNumber; // 0xb60 | Schema_Builtin | Size: 0x4
			int32_t m_iNodeNumberMax; // 0xb64 | Schema_Builtin | Size: 0x4
			bool m_bListenedTo; // 0xb68 | Schema_Builtin | Size: 0x1
			S2_PAD(0x7); // End padding
		};
		static_assert(offsetof(CS2::server::CPointCommentaryNode, m_iszPreCommands) == 0xA78, "m_iszPreCommands in CPointCommentaryNode should be at offset 0xA78");
		static_assert(offsetof(CS2::server::CPointCommentaryNode, m_iszPostCommands) == 0xA80, "m_iszPostCommands in CPointCommentaryNode should be at offset 0xA80");
		static_assert(offsetof(CS2::server::CPointCommentaryNode, m_iszCommentaryFile) == 0xA88, "m_iszCommentaryFile in CPointCommentaryNode should be at offset 0xA88");
		static_assert(offsetof(CS2::server::CPointCommentaryNode, m_iszViewTarget) == 0xA90, "m_iszViewTarget in CPointCommentaryNode should be at offset 0xA90");
		static_assert(offsetof(CS2::server::CPointCommentaryNode, m_hViewTarget) == 0xA98, "m_hViewTarget in CPointCommentaryNode should be at offset 0xA98");
		static_assert(offsetof(CS2::server::CPointCommentaryNode, m_hViewTargetAngles) == 0xA9C, "m_hViewTargetAngles in CPointCommentaryNode should be at offset 0xA9C");
		static_assert(offsetof(CS2::server::CPointCommentaryNode, m_iszViewPosition) == 0xAA0, "m_iszViewPosition in CPointCommentaryNode should be at offset 0xAA0");
		static_assert(offsetof(CS2::server::CPointCommentaryNode, m_hViewPosition) == 0xAA8, "m_hViewPosition in CPointCommentaryNode should be at offset 0xAA8");
		static_assert(offsetof(CS2::server::CPointCommentaryNode, m_hViewPositionMover) == 0xAAC, "m_hViewPositionMover in CPointCommentaryNode should be at offset 0xAAC");
		static_assert(offsetof(CS2::server::CPointCommentaryNode, m_bPreventMovement) == 0xAB0, "m_bPreventMovement in CPointCommentaryNode should be at offset 0xAB0");
		static_assert(offsetof(CS2::server::CPointCommentaryNode, m_bUnderCrosshair) == 0xAB1, "m_bUnderCrosshair in CPointCommentaryNode should be at offset 0xAB1");
		static_assert(offsetof(CS2::server::CPointCommentaryNode, m_bUnstoppable) == 0xAB2, "m_bUnstoppable in CPointCommentaryNode should be at offset 0xAB2");
		static_assert(offsetof(CS2::server::CPointCommentaryNode, m_flFinishedTime) == 0xAB4, "m_flFinishedTime in CPointCommentaryNode should be at offset 0xAB4");
		static_assert(offsetof(CS2::server::CPointCommentaryNode, m_vecFinishOrigin) == 0xAB8, "m_vecFinishOrigin in CPointCommentaryNode should be at offset 0xAB8");
		static_assert(offsetof(CS2::server::CPointCommentaryNode, m_vecOriginalAngles) == 0xAC4, "m_vecOriginalAngles in CPointCommentaryNode should be at offset 0xAC4");
		static_assert(offsetof(CS2::server::CPointCommentaryNode, m_vecFinishAngles) == 0xAD0, "m_vecFinishAngles in CPointCommentaryNode should be at offset 0xAD0");
		static_assert(offsetof(CS2::server::CPointCommentaryNode, m_bPreventChangesWhileMoving) == 0xADC, "m_bPreventChangesWhileMoving in CPointCommentaryNode should be at offset 0xADC");
		static_assert(offsetof(CS2::server::CPointCommentaryNode, m_bDisabled) == 0xADD, "m_bDisabled in CPointCommentaryNode should be at offset 0xADD");
		static_assert(offsetof(CS2::server::CPointCommentaryNode, m_vecTeleportOrigin) == 0xAE0, "m_vecTeleportOrigin in CPointCommentaryNode should be at offset 0xAE0");
		static_assert(offsetof(CS2::server::CPointCommentaryNode, m_flAbortedPlaybackAt) == 0xAEC, "m_flAbortedPlaybackAt in CPointCommentaryNode should be at offset 0xAEC");
		static_assert(offsetof(CS2::server::CPointCommentaryNode, m_pOnCommentaryStarted) == 0xAF0, "m_pOnCommentaryStarted in CPointCommentaryNode should be at offset 0xAF0");
		static_assert(offsetof(CS2::server::CPointCommentaryNode, m_pOnCommentaryStopped) == 0xB18, "m_pOnCommentaryStopped in CPointCommentaryNode should be at offset 0xB18");
		static_assert(offsetof(CS2::server::CPointCommentaryNode, m_bActive) == 0xB40, "m_bActive in CPointCommentaryNode should be at offset 0xB40");
		static_assert(offsetof(CS2::server::CPointCommentaryNode, m_flStartTime) == 0xB44, "m_flStartTime in CPointCommentaryNode should be at offset 0xB44");
		static_assert(offsetof(CS2::server::CPointCommentaryNode, m_flStartTimeInCommentary) == 0xB48, "m_flStartTimeInCommentary in CPointCommentaryNode should be at offset 0xB48");
		static_assert(offsetof(CS2::server::CPointCommentaryNode, m_iszTitle) == 0xB50, "m_iszTitle in CPointCommentaryNode should be at offset 0xB50");
		static_assert(offsetof(CS2::server::CPointCommentaryNode, m_iszSpeakers) == 0xB58, "m_iszSpeakers in CPointCommentaryNode should be at offset 0xB58");
		static_assert(offsetof(CS2::server::CPointCommentaryNode, m_iNodeNumber) == 0xB60, "m_iNodeNumber in CPointCommentaryNode should be at offset 0xB60");
		static_assert(offsetof(CS2::server::CPointCommentaryNode, m_iNodeNumberMax) == 0xB64, "m_iNodeNumberMax in CPointCommentaryNode should be at offset 0xB64");
		static_assert(offsetof(CS2::server::CPointCommentaryNode, m_bListenedTo) == 0xB68, "m_bListenedTo in CPointCommentaryNode should be at offset 0xB68");
		static_assert(sizeof(CS2::server::CPointCommentaryNode) == 0xB70, "CPointCommentaryNode size should be 0xB70");
	}
}
