// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#ifndef CUSTOM_GLOBAL_TYPES
	#include "../GlobalTypes.hpp"
#else
	#include "../Custom/GlobalTypes.hpp"
#endif


#include "CModelPointEntity.hpp"
#include "../client/PointWorldTextJustifyHorizontal_t.hpp"
#include "../client/PointWorldTextJustifyVertical_t.hpp"
#include "../client/PointWorldTextReorientMode_t.hpp"





using namespace GlobalTypes;
namespace CS2 {
	namespace server {
		class CPointWorldText : public CS2::server::CModelPointEntity {
		public:
			char m_messageText[512]; // 0x730 | Schema_FixedArray | Size: 0x200
			char m_FontName[64]; // 0x930 | Schema_FixedArray | Size: 0x40
			char m_BackgroundMaterialName[64]; // 0x970 | Schema_FixedArray | Size: 0x40
			bool m_bEnabled; // 0x9b0 | Schema_Builtin | Size: 0x1
			bool m_bFullbright; // 0x9b1 | Schema_Builtin | Size: 0x1
			S2_PAD(0x2);
			float32 m_flWorldUnitsPerPx; // 0x9b4 | Schema_Builtin | Size: 0x4
			float32 m_flFontSize; // 0x9b8 | Schema_Builtin | Size: 0x4
			float32 m_flDepthOffset; // 0x9bc | Schema_Builtin | Size: 0x4
			bool m_bDrawBackground; // 0x9c0 | Schema_Builtin | Size: 0x1
			S2_PAD(0x3);
			float32 m_flBackgroundBorderWidth; // 0x9c4 | Schema_Builtin | Size: 0x4
			float32 m_flBackgroundBorderHeight; // 0x9c8 | Schema_Builtin | Size: 0x4
			float32 m_flBackgroundWorldToUV; // 0x9cc | Schema_Builtin | Size: 0x4
			GlobalTypes::Color m_Color; // 0x9d0 | Schema_Atomic | Size: 0x4
			client::PointWorldTextJustifyHorizontal_t m_nJustifyHorizontal; // 0x9d4 | Schema_DeclaredEnum | Size: 0x4
			client::PointWorldTextJustifyVertical_t m_nJustifyVertical; // 0x9d8 | Schema_DeclaredEnum | Size: 0x4
			client::PointWorldTextReorientMode_t m_nReorientMode; // 0x9dc | Schema_DeclaredEnum | Size: 0x4
		};
		static_assert(offsetof(CS2::server::CPointWorldText, m_messageText) == 0x730, "m_messageText in CPointWorldText should be at offset 0x730");
		static_assert(offsetof(CS2::server::CPointWorldText, m_FontName) == 0x930, "m_FontName in CPointWorldText should be at offset 0x930");
		static_assert(offsetof(CS2::server::CPointWorldText, m_BackgroundMaterialName) == 0x970, "m_BackgroundMaterialName in CPointWorldText should be at offset 0x970");
		static_assert(offsetof(CS2::server::CPointWorldText, m_bEnabled) == 0x9B0, "m_bEnabled in CPointWorldText should be at offset 0x9B0");
		static_assert(offsetof(CS2::server::CPointWorldText, m_bFullbright) == 0x9B1, "m_bFullbright in CPointWorldText should be at offset 0x9B1");
		static_assert(offsetof(CS2::server::CPointWorldText, m_flWorldUnitsPerPx) == 0x9B4, "m_flWorldUnitsPerPx in CPointWorldText should be at offset 0x9B4");
		static_assert(offsetof(CS2::server::CPointWorldText, m_flFontSize) == 0x9B8, "m_flFontSize in CPointWorldText should be at offset 0x9B8");
		static_assert(offsetof(CS2::server::CPointWorldText, m_flDepthOffset) == 0x9BC, "m_flDepthOffset in CPointWorldText should be at offset 0x9BC");
		static_assert(offsetof(CS2::server::CPointWorldText, m_bDrawBackground) == 0x9C0, "m_bDrawBackground in CPointWorldText should be at offset 0x9C0");
		static_assert(offsetof(CS2::server::CPointWorldText, m_flBackgroundBorderWidth) == 0x9C4, "m_flBackgroundBorderWidth in CPointWorldText should be at offset 0x9C4");
		static_assert(offsetof(CS2::server::CPointWorldText, m_flBackgroundBorderHeight) == 0x9C8, "m_flBackgroundBorderHeight in CPointWorldText should be at offset 0x9C8");
		static_assert(offsetof(CS2::server::CPointWorldText, m_flBackgroundWorldToUV) == 0x9CC, "m_flBackgroundWorldToUV in CPointWorldText should be at offset 0x9CC");
		static_assert(offsetof(CS2::server::CPointWorldText, m_Color) == 0x9D0, "m_Color in CPointWorldText should be at offset 0x9D0");
		static_assert(offsetof(CS2::server::CPointWorldText, m_nJustifyHorizontal) == 0x9D4, "m_nJustifyHorizontal in CPointWorldText should be at offset 0x9D4");
		static_assert(offsetof(CS2::server::CPointWorldText, m_nJustifyVertical) == 0x9D8, "m_nJustifyVertical in CPointWorldText should be at offset 0x9D8");
		static_assert(offsetof(CS2::server::CPointWorldText, m_nReorientMode) == 0x9DC, "m_nReorientMode in CPointWorldText should be at offset 0x9DC");
		static_assert(sizeof(CS2::server::CPointWorldText) == 0x9E0, "CPointWorldText size should be 0x9E0");
	}
}
