// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#ifndef CUSTOM_GLOBAL_TYPES
	#include <SDK/GlobalTypes.hpp>
#else
	#include <Custom/GlobalTypes.hpp>
#endif


#include <SDK/server/CBaseEntity.hpp>
#include <SDK/server/EntFinderMethod_t.hpp>
#include <SDK/entity2/CEntityIOOutput.hpp>



namespace CS2 {
	namespace server {
		class CBaseFilter;
	}
}


using namespace GlobalTypes;
namespace CS2 {
	namespace server {
		class CPointEntityFinder : public CS2::server::CBaseEntity {
		public:
			GlobalTypes::CHandle<server::CBaseEntity> m_hEntity; // 0x4a8 | Schema_Atomic | Size: 0x4
			// char m_hEntity[0x4]; // 0x4a8 | Schema_Atomic | Size: 0x4
			S2_PAD(0x4);
			GlobalTypes::CUtlSymbolLarge m_iFilterName; // 0x4b0 | Schema_Atomic | Size: 0x8
			GlobalTypes::CHandle<server::CBaseFilter> m_hFilter; // 0x4b8 | Schema_Atomic | Size: 0x4
			// char m_hFilter[0x4]; // 0x4b8 | Schema_Atomic | Size: 0x4
			S2_PAD(0x4);
			GlobalTypes::CUtlSymbolLarge m_iRefName; // 0x4c0 | Schema_Atomic | Size: 0x8
			GlobalTypes::CHandle<server::CBaseEntity> m_hReference; // 0x4c8 | Schema_Atomic | Size: 0x4
			// char m_hReference[0x4]; // 0x4c8 | Schema_Atomic | Size: 0x4
			server::EntFinderMethod_t m_FindMethod; // 0x4cc | Schema_DeclaredEnum | Size: 0x4
			entity2::CEntityIOOutput m_OnFoundEntity; // 0x4d0 | Schema_DeclaredClass | Size: 0x18
		};
		static_assert(offsetof(CS2::server::CPointEntityFinder, m_hEntity) == 0x4A8, "m_hEntity in CPointEntityFinder should be at offset 0x4A8");
		static_assert(offsetof(CS2::server::CPointEntityFinder, m_iFilterName) == 0x4B0, "m_iFilterName in CPointEntityFinder should be at offset 0x4B0");
		static_assert(offsetof(CS2::server::CPointEntityFinder, m_hFilter) == 0x4B8, "m_hFilter in CPointEntityFinder should be at offset 0x4B8");
		static_assert(offsetof(CS2::server::CPointEntityFinder, m_iRefName) == 0x4C0, "m_iRefName in CPointEntityFinder should be at offset 0x4C0");
		static_assert(offsetof(CS2::server::CPointEntityFinder, m_hReference) == 0x4C8, "m_hReference in CPointEntityFinder should be at offset 0x4C8");
		static_assert(offsetof(CS2::server::CPointEntityFinder, m_FindMethod) == 0x4CC, "m_FindMethod in CPointEntityFinder should be at offset 0x4CC");
		static_assert(offsetof(CS2::server::CPointEntityFinder, m_OnFoundEntity) == 0x4D0, "m_OnFoundEntity in CPointEntityFinder should be at offset 0x4D0");
		static_assert(sizeof(CS2::server::CPointEntityFinder) == 0x4E8, "CPointEntityFinder size should be 0x4E8");
	}
}
