// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#ifndef CUSTOM_GLOBAL_TYPES
	#include "../GlobalTypes.hpp"
#else
	#include <Custom/GlobalTypes.hpp>
#endif


#include "CPointEntity.hpp"



namespace CS2 {
	namespace server {
		class CBaseFilter;
	}
}


using namespace GlobalTypes;
namespace CS2 {
	namespace server {
		class CPointPush : public CS2::server::CPointEntity {
		public:
			bool m_bEnabled; // 0x4a8 | Schema_Builtin | Size: 0x1
			S2_PAD(0x3);
			float32 m_flMagnitude; // 0x4ac | Schema_Builtin | Size: 0x4
			float32 m_flRadius; // 0x4b0 | Schema_Builtin | Size: 0x4
			float32 m_flInnerRadius; // 0x4b4 | Schema_Builtin | Size: 0x4
			float32 m_flConeOfInfluence; // 0x4b8 | Schema_Builtin | Size: 0x4
			S2_PAD(0x4);
			GlobalTypes::CUtlSymbolLarge m_iszFilterName; // 0x4c0 | Schema_Atomic | Size: 0x8
			GlobalTypes::CHandle<server::CBaseFilter> m_hFilter; // 0x4c8 | Schema_Atomic | Size: 0x4
			// char m_hFilter[0x4]; // 0x4c8 | Schema_Atomic | Size: 0x4
			S2_PAD(0x4); // End padding
		};
#ifdef USE_STATIC_ASSERTS
		static_assert(offsetof(CS2::server::CPointPush, m_bEnabled) == 0x4A8, "m_bEnabled in CPointPush should be at offset 0x4A8");
		static_assert(offsetof(CS2::server::CPointPush, m_flMagnitude) == 0x4AC, "m_flMagnitude in CPointPush should be at offset 0x4AC");
		static_assert(offsetof(CS2::server::CPointPush, m_flRadius) == 0x4B0, "m_flRadius in CPointPush should be at offset 0x4B0");
		static_assert(offsetof(CS2::server::CPointPush, m_flInnerRadius) == 0x4B4, "m_flInnerRadius in CPointPush should be at offset 0x4B4");
		static_assert(offsetof(CS2::server::CPointPush, m_flConeOfInfluence) == 0x4B8, "m_flConeOfInfluence in CPointPush should be at offset 0x4B8");
		static_assert(offsetof(CS2::server::CPointPush, m_iszFilterName) == 0x4C0, "m_iszFilterName in CPointPush should be at offset 0x4C0");
		static_assert(offsetof(CS2::server::CPointPush, m_hFilter) == 0x4C8, "m_hFilter in CPointPush should be at offset 0x4C8");
		static_assert(sizeof(CS2::server::CPointPush) == 0x4D0, "CPointPush size should be 0x4D0");

#endif
	}
}
