// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#ifndef CUSTOM_GLOBAL_TYPES
	#include "../GlobalTypes.hpp"
#else
	#include <Custom/GlobalTypes.hpp>
#endif


#include "CPointEntity.hpp"



namespace CS2 {
	namespace server {
		class CBaseEntity;
	}
}


using namespace GlobalTypes;
namespace CS2 {
	namespace server {
		class CPointVelocitySensor : public CS2::server::CPointEntity {
		public:
			GlobalTypes::CHandle<server::CBaseEntity> m_hTargetEntity; // 0x4a8 | Schema_Atomic | Size: 0x4
			// char m_hTargetEntity[0x4]; // 0x4a8 | Schema_Atomic | Size: 0x4
			GlobalTypes::Vector m_vecAxis; // 0x4ac | Schema_Atomic | Size: 0xc
			bool m_bEnabled; // 0x4b8 | Schema_Builtin | Size: 0x1
			S2_PAD(0x3);
			float32 m_fPrevVelocity; // 0x4bc | Schema_Builtin | Size: 0x4
			float32 m_flAvgInterval; // 0x4c0 | Schema_Builtin | Size: 0x4
			S2_PAD(0x4);
			// GlobalTypes::CEntityOutputTemplate< float32, float32 > m_Velocity; // 0x4c8 | Schema_Atomic | Size: 0x20
			char m_Velocity[0x20]; // 0x4c8 | Schema_Atomic | Size: 0x20
		};
#ifdef USE_STATIC_ASSERTS
		static_assert(offsetof(CS2::server::CPointVelocitySensor, m_hTargetEntity) == 0x4A8, "m_hTargetEntity in CPointVelocitySensor should be at offset 0x4A8");
		static_assert(offsetof(CS2::server::CPointVelocitySensor, m_vecAxis) == 0x4AC, "m_vecAxis in CPointVelocitySensor should be at offset 0x4AC");
		static_assert(offsetof(CS2::server::CPointVelocitySensor, m_bEnabled) == 0x4B8, "m_bEnabled in CPointVelocitySensor should be at offset 0x4B8");
		static_assert(offsetof(CS2::server::CPointVelocitySensor, m_fPrevVelocity) == 0x4BC, "m_fPrevVelocity in CPointVelocitySensor should be at offset 0x4BC");
		static_assert(offsetof(CS2::server::CPointVelocitySensor, m_flAvgInterval) == 0x4C0, "m_flAvgInterval in CPointVelocitySensor should be at offset 0x4C0");
		static_assert(offsetof(CS2::server::CPointVelocitySensor, m_Velocity) == 0x4C8, "m_Velocity in CPointVelocitySensor should be at offset 0x4C8");
		static_assert(sizeof(CS2::server::CPointVelocitySensor) == 0x4E8, "CPointVelocitySensor size should be 0x4E8");

#endif
	}
}
