// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#ifndef CUSTOM_GLOBAL_TYPES
	#include <SDK/GlobalTypes.hpp>
#else
	#include <Custom/GlobalTypes.hpp>
#endif


#include <SDK/server/CPointEntity.hpp>



namespace CS2 {
	namespace server {
		class CBaseEntity;
	}
}


using namespace GlobalTypes;
namespace CS2 {
	namespace server {
		class CPointVelocitySensor : public CS2::server::CPointEntity {
		public:
			GlobalTypes::CHandle<server::CBaseEntity> m_hTargetEntity; // 0x4f0 | Schema_Atomic | Size: 0x4
			// char  m_hTargetEntity[0x4]; // 0x4f0 | Schema_Atomic | Size: 0x4
			GlobalTypes::Vector m_vecAxis; // 0x4f4 | Schema_Atomic | Size: 0xc
			bool m_bEnabled; // 0x500 | Schema_Builtin | Size: 0x1
			S2_PAD(0x3);
			float32 m_fPrevVelocity; // 0x504 | Schema_Builtin | Size: 0x4
			float32 m_flAvgInterval; // 0x508 | Schema_Builtin | Size: 0x4
			S2_PAD(0x4);
			// GlobalTypes::CEntityOutputTemplate< float32 > m_Velocity; // 0x510 | Schema_Atomic | Size: 0x28
			char  m_Velocity[0x28]; // 0x510 | Schema_Atomic | Size: 0x28
		};
		static_assert(offsetof(CS2::server::CPointVelocitySensor, m_hTargetEntity) == 0x4F0, "m_hTargetEntity in CPointVelocitySensor should be at offset 0x4F0");
		static_assert(offsetof(CS2::server::CPointVelocitySensor, m_vecAxis) == 0x4F4, "m_vecAxis in CPointVelocitySensor should be at offset 0x4F4");
		static_assert(offsetof(CS2::server::CPointVelocitySensor, m_bEnabled) == 0x500, "m_bEnabled in CPointVelocitySensor should be at offset 0x500");
		static_assert(offsetof(CS2::server::CPointVelocitySensor, m_fPrevVelocity) == 0x504, "m_fPrevVelocity in CPointVelocitySensor should be at offset 0x504");
		static_assert(offsetof(CS2::server::CPointVelocitySensor, m_flAvgInterval) == 0x508, "m_flAvgInterval in CPointVelocitySensor should be at offset 0x508");
		static_assert(offsetof(CS2::server::CPointVelocitySensor, m_Velocity) == 0x510, "m_Velocity in CPointVelocitySensor should be at offset 0x510");
		static_assert(sizeof(CS2::server::CPointVelocitySensor) == 0x538, "CPointVelocitySensor size should be 0x538");
	}
}
