// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#include <SDK/GlobalTypes.hpp>

#include <SDK/client/CEntitySubclassVDataBase.hpp>
#include <SDK/animationsystem/ParticleAttachment_t.hpp>



namespace CS2 {
	namespace server {
		class CPrecipitationVData : public CS2::client::CEntitySubclassVDataBase {
		public:
			// GlobalTypes::CResourceNameTyped< GlobalTypes::CWeakHandle< InfoForResourceTypeIParticleSystemDefinition > > m_szParticlePrecipitationEffect; // 0x28 | Schema_Atomic | Size: 0xe0
			char  m_szParticlePrecipitationEffect[0xe0]; // 0x28 | Schema_Atomic | Size: 0xe0
			float32 m_flInnerDistance; // 0x108 | Schema_Builtin | Size: 0x4
			animationsystem::ParticleAttachment_t m_nAttachType; // 0x10c | Schema_DeclaredEnum | Size: 0x4
			bool m_bBatchSameVolumeType; // 0x110 | Schema_Builtin | Size: 0x1
			S2_PAD(0x3);
			int32_t m_nRTEnvCP; // 0x114 | Schema_Builtin | Size: 0x4
			int32_t m_nRTEnvCPComponent; // 0x118 | Schema_Builtin | Size: 0x4
			S2_PAD(0x4);
			GlobalTypes::CUtlString m_szModifier; // 0x120 | Schema_Atomic | Size: 0x8
		};
		static_assert(offsetof(CS2::server::CPrecipitationVData, m_szParticlePrecipitationEffect) == 0x28, "m_szParticlePrecipitationEffect in CPrecipitationVData should be at offset 0x28");
		static_assert(offsetof(CS2::server::CPrecipitationVData, m_flInnerDistance) == 0x108, "m_flInnerDistance in CPrecipitationVData should be at offset 0x108");
		static_assert(offsetof(CS2::server::CPrecipitationVData, m_nAttachType) == 0x10C, "m_nAttachType in CPrecipitationVData should be at offset 0x10C");
		static_assert(offsetof(CS2::server::CPrecipitationVData, m_bBatchSameVolumeType) == 0x110, "m_bBatchSameVolumeType in CPrecipitationVData should be at offset 0x110");
		static_assert(offsetof(CS2::server::CPrecipitationVData, m_nRTEnvCP) == 0x114, "m_nRTEnvCP in CPrecipitationVData should be at offset 0x114");
		static_assert(offsetof(CS2::server::CPrecipitationVData, m_nRTEnvCPComponent) == 0x118, "m_nRTEnvCPComponent in CPrecipitationVData should be at offset 0x118");
		static_assert(offsetof(CS2::server::CPrecipitationVData, m_szModifier) == 0x120, "m_szModifier in CPrecipitationVData should be at offset 0x120");
		static_assert(sizeof(CS2::server::CPrecipitationVData) == 0x128, "CPrecipitationVData size should be 0x128");
	}
}
