// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#ifndef CUSTOM_GLOBAL_TYPES
	#include "../GlobalTypes.hpp"
#else
	#include <Custom/GlobalTypes.hpp>
#endif


#include "CPropDoorRotating.hpp"





using namespace GlobalTypes;
namespace CS2 {
	namespace server {
		class CPropDoorRotatingBreakable : public CS2::server::CPropDoorRotating {
		public:
			bool m_bBreakable; // 0xef0 | Schema_Builtin | Size: 0x1
			bool m_isAbleToCloseAreaPortals; // 0xef1 | Schema_Builtin | Size: 0x1
			S2_PAD(0x2);
			int32_t m_currentDamageState; // 0xef4 | Schema_Builtin | Size: 0x4
			GlobalTypes::CUtlVector<GlobalTypes::CUtlSymbolLarge> m_damageStates; // 0xef8 | Schema_Atomic | Size: 0x18
			// char m_damageStates[0x18]; // 0xef8 | Schema_Atomic | Size: 0x18
		};
#ifdef USE_STATIC_ASSERTS
		static_assert(offsetof(CS2::server::CPropDoorRotatingBreakable, m_bBreakable) == 0xEF0, "m_bBreakable in CPropDoorRotatingBreakable should be at offset 0xEF0");
		static_assert(offsetof(CS2::server::CPropDoorRotatingBreakable, m_isAbleToCloseAreaPortals) == 0xEF1, "m_isAbleToCloseAreaPortals in CPropDoorRotatingBreakable should be at offset 0xEF1");
		static_assert(offsetof(CS2::server::CPropDoorRotatingBreakable, m_currentDamageState) == 0xEF4, "m_currentDamageState in CPropDoorRotatingBreakable should be at offset 0xEF4");
		static_assert(offsetof(CS2::server::CPropDoorRotatingBreakable, m_damageStates) == 0xEF8, "m_damageStates in CPropDoorRotatingBreakable should be at offset 0xEF8");
		static_assert(sizeof(CS2::server::CPropDoorRotatingBreakable) == 0xF10, "CPropDoorRotatingBreakable size should be 0xF10");

#endif
	}
}
