// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#ifndef CUSTOM_GLOBAL_TYPES
	#include "../GlobalTypes.hpp"
#else
	#include "../Custom/GlobalTypes.hpp"
#endif


#include "CBasePropDoor.hpp"
#include "PropDoorRotatingSpawnPos_t.hpp"
#include "PropDoorRotatingOpenDirection_e.hpp"
#include "doorCheck_e.hpp"



namespace CS2 {
	namespace server {
		class CEntityBlocker;
	}
}


using namespace GlobalTypes;
namespace CS2 {
	namespace server {
		class CPropDoorRotating : public CS2::server::CBasePropDoor {
		public:
			GlobalTypes::Vector m_vecAxis; // 0xe50 | Schema_Atomic | Size: 0xc
			float32 m_flDistance; // 0xe5c | Schema_Builtin | Size: 0x4
			server::PropDoorRotatingSpawnPos_t m_eSpawnPosition; // 0xe60 | Schema_DeclaredEnum | Size: 0x4
			server::PropDoorRotatingOpenDirection_e m_eOpenDirection; // 0xe64 | Schema_DeclaredEnum | Size: 0x4
			server::PropDoorRotatingOpenDirection_e m_eCurrentOpenDirection; // 0xe68 | Schema_DeclaredEnum | Size: 0x4
			server::doorCheck_e m_eDefaultCheckDirection; // 0xe6c | Schema_DeclaredEnum | Size: 0x4
			float32 m_flAjarAngle; // 0xe70 | Schema_Builtin | Size: 0x4
			GlobalTypes::QAngle m_angRotationAjarDeprecated; // 0xe74 | Schema_Atomic | Size: 0xc
			GlobalTypes::QAngle m_angRotationClosed; // 0xe80 | Schema_Atomic | Size: 0xc
			GlobalTypes::QAngle m_angRotationOpenForward; // 0xe8c | Schema_Atomic | Size: 0xc
			GlobalTypes::QAngle m_angRotationOpenBack; // 0xe98 | Schema_Atomic | Size: 0xc
			GlobalTypes::QAngle m_angGoal; // 0xea4 | Schema_Atomic | Size: 0xc
			GlobalTypes::Vector m_vecForwardBoundsMin; // 0xeb0 | Schema_Atomic | Size: 0xc
			GlobalTypes::Vector m_vecForwardBoundsMax; // 0xebc | Schema_Atomic | Size: 0xc
			GlobalTypes::Vector m_vecBackBoundsMin; // 0xec8 | Schema_Atomic | Size: 0xc
			GlobalTypes::Vector m_vecBackBoundsMax; // 0xed4 | Schema_Atomic | Size: 0xc
			bool m_bAjarDoorShouldntAlwaysOpen; // 0xee0 | Schema_Builtin | Size: 0x1
			S2_PAD(0x3);
			GlobalTypes::CHandle<server::CEntityBlocker> m_hEntityBlocker; // 0xee4 | Schema_Atomic | Size: 0x4
			// char m_hEntityBlocker[0x4]; // 0xee4 | Schema_Atomic | Size: 0x4
			S2_PAD(0x8); // End padding
		};
		static_assert(offsetof(CS2::server::CPropDoorRotating, m_vecAxis) == 0xE50, "m_vecAxis in CPropDoorRotating should be at offset 0xE50");
		static_assert(offsetof(CS2::server::CPropDoorRotating, m_flDistance) == 0xE5C, "m_flDistance in CPropDoorRotating should be at offset 0xE5C");
		static_assert(offsetof(CS2::server::CPropDoorRotating, m_eSpawnPosition) == 0xE60, "m_eSpawnPosition in CPropDoorRotating should be at offset 0xE60");
		static_assert(offsetof(CS2::server::CPropDoorRotating, m_eOpenDirection) == 0xE64, "m_eOpenDirection in CPropDoorRotating should be at offset 0xE64");
		static_assert(offsetof(CS2::server::CPropDoorRotating, m_eCurrentOpenDirection) == 0xE68, "m_eCurrentOpenDirection in CPropDoorRotating should be at offset 0xE68");
		static_assert(offsetof(CS2::server::CPropDoorRotating, m_eDefaultCheckDirection) == 0xE6C, "m_eDefaultCheckDirection in CPropDoorRotating should be at offset 0xE6C");
		static_assert(offsetof(CS2::server::CPropDoorRotating, m_flAjarAngle) == 0xE70, "m_flAjarAngle in CPropDoorRotating should be at offset 0xE70");
		static_assert(offsetof(CS2::server::CPropDoorRotating, m_angRotationAjarDeprecated) == 0xE74, "m_angRotationAjarDeprecated in CPropDoorRotating should be at offset 0xE74");
		static_assert(offsetof(CS2::server::CPropDoorRotating, m_angRotationClosed) == 0xE80, "m_angRotationClosed in CPropDoorRotating should be at offset 0xE80");
		static_assert(offsetof(CS2::server::CPropDoorRotating, m_angRotationOpenForward) == 0xE8C, "m_angRotationOpenForward in CPropDoorRotating should be at offset 0xE8C");
		static_assert(offsetof(CS2::server::CPropDoorRotating, m_angRotationOpenBack) == 0xE98, "m_angRotationOpenBack in CPropDoorRotating should be at offset 0xE98");
		static_assert(offsetof(CS2::server::CPropDoorRotating, m_angGoal) == 0xEA4, "m_angGoal in CPropDoorRotating should be at offset 0xEA4");
		static_assert(offsetof(CS2::server::CPropDoorRotating, m_vecForwardBoundsMin) == 0xEB0, "m_vecForwardBoundsMin in CPropDoorRotating should be at offset 0xEB0");
		static_assert(offsetof(CS2::server::CPropDoorRotating, m_vecForwardBoundsMax) == 0xEBC, "m_vecForwardBoundsMax in CPropDoorRotating should be at offset 0xEBC");
		static_assert(offsetof(CS2::server::CPropDoorRotating, m_vecBackBoundsMin) == 0xEC8, "m_vecBackBoundsMin in CPropDoorRotating should be at offset 0xEC8");
		static_assert(offsetof(CS2::server::CPropDoorRotating, m_vecBackBoundsMax) == 0xED4, "m_vecBackBoundsMax in CPropDoorRotating should be at offset 0xED4");
		static_assert(offsetof(CS2::server::CPropDoorRotating, m_bAjarDoorShouldntAlwaysOpen) == 0xEE0, "m_bAjarDoorShouldntAlwaysOpen in CPropDoorRotating should be at offset 0xEE0");
		static_assert(offsetof(CS2::server::CPropDoorRotating, m_hEntityBlocker) == 0xEE4, "m_hEntityBlocker in CPropDoorRotating should be at offset 0xEE4");
		static_assert(sizeof(CS2::server::CPropDoorRotating) == 0xEF0, "CPropDoorRotating size should be 0xEF0");
	}
}
