// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#ifndef CUSTOM_GLOBAL_TYPES
	#include <SDK/GlobalTypes.hpp>
#else
	#include <Custom/GlobalTypes.hpp>
#endif


#include <SDK/entity2/CEntityComponent.hpp>





using namespace GlobalTypes;
namespace CS2 {
	namespace server {
		class CPropDataComponent : public CS2::entity2::CEntityComponent {
		public:
			S2_PAD(0x8);
			float32 m_flDmgModBullet; // 0x10 | Schema_Builtin | Size: 0x4
			float32 m_flDmgModClub; // 0x14 | Schema_Builtin | Size: 0x4
			float32 m_flDmgModExplosive; // 0x18 | Schema_Builtin | Size: 0x4
			float32 m_flDmgModFire; // 0x1c | Schema_Builtin | Size: 0x4
			GlobalTypes::CUtlSymbolLarge m_iszPhysicsDamageTableName; // 0x20 | Schema_Atomic | Size: 0x8
			GlobalTypes::CUtlSymbolLarge m_iszBasePropData; // 0x28 | Schema_Atomic | Size: 0x8
			int32_t m_nInteractions; // 0x30 | Schema_Builtin | Size: 0x4
			bool m_bSpawnMotionDisabled; // 0x34 | Schema_Builtin | Size: 0x1
			S2_PAD(0x3);
			int32_t m_nDisableTakePhysicsDamageSpawnFlag; // 0x38 | Schema_Builtin | Size: 0x4
			int32_t m_nMotionDisabledSpawnFlag; // 0x3c | Schema_Builtin | Size: 0x4
		};
		static_assert(offsetof(CS2::server::CPropDataComponent, m_flDmgModBullet) == 0x10, "m_flDmgModBullet in CPropDataComponent should be at offset 0x10");
		static_assert(offsetof(CS2::server::CPropDataComponent, m_flDmgModClub) == 0x14, "m_flDmgModClub in CPropDataComponent should be at offset 0x14");
		static_assert(offsetof(CS2::server::CPropDataComponent, m_flDmgModExplosive) == 0x18, "m_flDmgModExplosive in CPropDataComponent should be at offset 0x18");
		static_assert(offsetof(CS2::server::CPropDataComponent, m_flDmgModFire) == 0x1C, "m_flDmgModFire in CPropDataComponent should be at offset 0x1C");
		static_assert(offsetof(CS2::server::CPropDataComponent, m_iszPhysicsDamageTableName) == 0x20, "m_iszPhysicsDamageTableName in CPropDataComponent should be at offset 0x20");
		static_assert(offsetof(CS2::server::CPropDataComponent, m_iszBasePropData) == 0x28, "m_iszBasePropData in CPropDataComponent should be at offset 0x28");
		static_assert(offsetof(CS2::server::CPropDataComponent, m_nInteractions) == 0x30, "m_nInteractions in CPropDataComponent should be at offset 0x30");
		static_assert(offsetof(CS2::server::CPropDataComponent, m_bSpawnMotionDisabled) == 0x34, "m_bSpawnMotionDisabled in CPropDataComponent should be at offset 0x34");
		static_assert(offsetof(CS2::server::CPropDataComponent, m_nDisableTakePhysicsDamageSpawnFlag) == 0x38, "m_nDisableTakePhysicsDamageSpawnFlag in CPropDataComponent should be at offset 0x38");
		static_assert(offsetof(CS2::server::CPropDataComponent, m_nMotionDisabledSpawnFlag) == 0x3C, "m_nMotionDisabledSpawnFlag in CPropDataComponent should be at offset 0x3C");
		static_assert(sizeof(CS2::server::CPropDataComponent) == 0x40, "CPropDataComponent size should be 0x40");
	}
}
