// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#ifndef CUSTOM_GLOBAL_TYPES
	#include <SDK/GlobalTypes.hpp>
#else
	#include <Custom/GlobalTypes.hpp>
#endif


#include <SDK/pulse_runtime_lib/CPulseCell_BaseYieldingInflow.hpp>
#include <SDK/pulse_runtime_lib/CPulse_ResumePoint.hpp>



namespace CS2 {
	namespace server {
		class CPulseCell_Outflow_ListenForAnimgraphTag : public CS2::pulse_runtime_lib::CPulseCell_BaseYieldingInflow {
		public:
			pulse_runtime_lib::CPulse_ResumePoint m_OnStart; // 0x48 | Schema_DeclaredClass | Size: 0x48
			pulse_runtime_lib::CPulse_ResumePoint m_OnEnd; // 0x90 | Schema_DeclaredClass | Size: 0x48
			pulse_runtime_lib::CPulse_ResumePoint m_OnCanceled; // 0xd8 | Schema_DeclaredClass | Size: 0x48
			GlobalTypes::CGlobalSymbol m_TagName; // 0x120 | Schema_Atomic | Size: 0x8
		};
		static_assert(offsetof(CS2::server::CPulseCell_Outflow_ListenForAnimgraphTag, m_OnStart) == 0x48, "m_OnStart in CPulseCell_Outflow_ListenForAnimgraphTag should be at offset 0x48");
		static_assert(offsetof(CS2::server::CPulseCell_Outflow_ListenForAnimgraphTag, m_OnEnd) == 0x90, "m_OnEnd in CPulseCell_Outflow_ListenForAnimgraphTag should be at offset 0x90");
		static_assert(offsetof(CS2::server::CPulseCell_Outflow_ListenForAnimgraphTag, m_OnCanceled) == 0xD8, "m_OnCanceled in CPulseCell_Outflow_ListenForAnimgraphTag should be at offset 0xD8");
		static_assert(offsetof(CS2::server::CPulseCell_Outflow_ListenForAnimgraphTag, m_TagName) == 0x120, "m_TagName in CPulseCell_Outflow_ListenForAnimgraphTag should be at offset 0x120");
		static_assert(sizeof(CS2::server::CPulseCell_Outflow_ListenForAnimgraphTag) == 0x128, "CPulseCell_Outflow_ListenForAnimgraphTag size should be 0x128");
	}
}
