// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#include <SDK/GlobalTypes.hpp>

#include <SDK/server/CBaseEntity.hpp>



namespace CS2 {
	namespace server {
		class CRagdollManager : public CS2::server::CBaseEntity {
		public:
			int8_t m_iCurrentMaxRagdollCount; // 0x4f0 | Schema_Builtin | Size: 0x1
			S2_PAD(0x3);
			int32_t m_iMaxRagdollCount; // 0x4f4 | Schema_Builtin | Size: 0x4
			bool m_bSaveImportant; // 0x4f8 | Schema_Builtin | Size: 0x1
			bool m_bCanTakeDamage; // 0x4f9 | Schema_Builtin | Size: 0x1
			S2_PAD(0x6); // End padding
		};
		static_assert(offsetof(CS2::server::CRagdollManager, m_iCurrentMaxRagdollCount) == 0x4F0, "m_iCurrentMaxRagdollCount in CRagdollManager should be at offset 0x4F0");
		static_assert(offsetof(CS2::server::CRagdollManager, m_iMaxRagdollCount) == 0x4F4, "m_iMaxRagdollCount in CRagdollManager should be at offset 0x4F4");
		static_assert(offsetof(CS2::server::CRagdollManager, m_bSaveImportant) == 0x4F8, "m_bSaveImportant in CRagdollManager should be at offset 0x4F8");
		static_assert(offsetof(CS2::server::CRagdollManager, m_bCanTakeDamage) == 0x4F9, "m_bCanTakeDamage in CRagdollManager should be at offset 0x4F9");
		static_assert(sizeof(CS2::server::CRagdollManager) == 0x500, "CRagdollManager size should be 0x500");
	}
}
