// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#include <SDK/GlobalTypes.hpp>

#include <SDK/server/CRagdollProp.hpp>



namespace CS2 {
	namespace server {
		class CRagdollPropAttached : public CS2::server::CRagdollProp {
		public:
			uint32_t m_boneIndexAttached; // 0xc48 | Schema_Builtin | Size: 0x4
			uint32_t m_ragdollAttachedObjectIndex; // 0xc4c | Schema_Builtin | Size: 0x4
			GlobalTypes::Vector m_attachmentPointBoneSpace; // 0xc50 | Schema_Atomic | Size: 0xc
			GlobalTypes::Vector m_attachmentPointRagdollSpace; // 0xc5c | Schema_Atomic | Size: 0xc
			bool m_bShouldDetach; // 0xc68 | Schema_Builtin | Size: 0x1
			S2_PAD(0xf);
			bool m_bShouldDeleteAttachedActivationRecord; // 0xc78 | Schema_Builtin | Size: 0x1
			S2_PAD(0xf); // End padding
		};
		static_assert(offsetof(CS2::server::CRagdollPropAttached, m_boneIndexAttached) == 0xC48, "m_boneIndexAttached in CRagdollPropAttached should be at offset 0xC48");
		static_assert(offsetof(CS2::server::CRagdollPropAttached, m_ragdollAttachedObjectIndex) == 0xC4C, "m_ragdollAttachedObjectIndex in CRagdollPropAttached should be at offset 0xC4C");
		static_assert(offsetof(CS2::server::CRagdollPropAttached, m_attachmentPointBoneSpace) == 0xC50, "m_attachmentPointBoneSpace in CRagdollPropAttached should be at offset 0xC50");
		static_assert(offsetof(CS2::server::CRagdollPropAttached, m_attachmentPointRagdollSpace) == 0xC5C, "m_attachmentPointRagdollSpace in CRagdollPropAttached should be at offset 0xC5C");
		static_assert(offsetof(CS2::server::CRagdollPropAttached, m_bShouldDetach) == 0xC68, "m_bShouldDetach in CRagdollPropAttached should be at offset 0xC68");
		static_assert(offsetof(CS2::server::CRagdollPropAttached, m_bShouldDeleteAttachedActivationRecord) == 0xC78, "m_bShouldDeleteAttachedActivationRecord in CRagdollPropAttached should be at offset 0xC78");
		static_assert(sizeof(CS2::server::CRagdollPropAttached) == 0xC88, "CRagdollPropAttached size should be 0xC88");
	}
}
