// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#ifndef CUSTOM_GLOBAL_TYPES
	#include "../GlobalTypes.hpp"
#else
	#include "../Custom/GlobalTypes.hpp"
#endif


#include "CPointEntity.hpp"





using namespace GlobalTypes;
namespace CS2 {
	namespace server {
		class CRagdollMagnet : public CS2::server::CPointEntity {
		public:
			bool m_bDisabled; // 0x4a8 | Schema_Builtin | Size: 0x1
			S2_PAD(0x3);
			float32 m_radius; // 0x4ac | Schema_Builtin | Size: 0x4
			float32 m_force; // 0x4b0 | Schema_Builtin | Size: 0x4
			GlobalTypes::VectorWS m_axis; // 0x4b4 | Schema_Atomic | Size: 0xc
		};
		static_assert(offsetof(CS2::server::CRagdollMagnet, m_bDisabled) == 0x4A8, "m_bDisabled in CRagdollMagnet should be at offset 0x4A8");
		static_assert(offsetof(CS2::server::CRagdollMagnet, m_radius) == 0x4AC, "m_radius in CRagdollMagnet should be at offset 0x4AC");
		static_assert(offsetof(CS2::server::CRagdollMagnet, m_force) == 0x4B0, "m_force in CRagdollMagnet should be at offset 0x4B0");
		static_assert(offsetof(CS2::server::CRagdollMagnet, m_axis) == 0x4B4, "m_axis in CRagdollMagnet should be at offset 0x4B4");
		static_assert(sizeof(CS2::server::CRagdollMagnet) == 0x4C0, "CRagdollMagnet size should be 0x4C0");
	}
}
