// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#ifndef CUSTOM_GLOBAL_TYPES
	#include "../GlobalTypes.hpp"
#else
	#include "../Custom/GlobalTypes.hpp"
#endif


#include "CBaseAnimGraph.hpp"
#include "../client/ragdoll_t.hpp"
#include "../entity2/GameTime_t.hpp"



namespace CS2 {
	namespace server {
		class CBaseEntity;
		class CBasePlayerPawn;
	}
}


using namespace GlobalTypes;
namespace CS2 {
	namespace server {
		class CRagdollProp : public CS2::server::CBaseAnimGraph {
		public:
			S2_PAD(0x10);
			client::ragdoll_t m_ragdoll; // 0xa30 | Schema_DeclaredClass | Size: 0x50
			bool m_bStartDisabled; // 0xa80 | Schema_Builtin | Size: 0x1
			S2_PAD(0x7);
			// GlobalTypes::CNetworkUtlVectorBase< bool > m_ragEnabled; // 0xa88 | Schema_Atomic | Size: 0x18
			char m_ragEnabled[0x18]; // 0xa88 | Schema_Atomic | Size: 0x18
			// GlobalTypes::CNetworkUtlVectorBase<GlobalTypes::Vector> m_ragPos; // 0xaa0 | Schema_Atomic | Size: 0x18
			char m_ragPos[0x18]; // 0xaa0 | Schema_Atomic | Size: 0x18
			// GlobalTypes::CNetworkUtlVectorBase<GlobalTypes::QAngle> m_ragAngles; // 0xab8 | Schema_Atomic | Size: 0x18
			char m_ragAngles[0x18]; // 0xab8 | Schema_Atomic | Size: 0x18
			uint32_t m_lastUpdateTickCount; // 0xad0 | Schema_Builtin | Size: 0x4
			bool m_allAsleep; // 0xad4 | Schema_Builtin | Size: 0x1
			bool m_bFirstCollisionAfterLaunch; // 0xad5 | Schema_Builtin | Size: 0x1
			S2_PAD(0x2);
			GlobalTypes::CHandle<server::CBaseEntity> m_hDamageEntity; // 0xad8 | Schema_Atomic | Size: 0x4
			// char m_hDamageEntity[0x4]; // 0xad8 | Schema_Atomic | Size: 0x4
			GlobalTypes::CHandle<server::CBaseEntity> m_hKiller; // 0xadc | Schema_Atomic | Size: 0x4
			// char m_hKiller[0x4]; // 0xadc | Schema_Atomic | Size: 0x4
			GlobalTypes::CHandle<server::CBasePlayerPawn> m_hPhysicsAttacker; // 0xae0 | Schema_Atomic | Size: 0x4
			// char m_hPhysicsAttacker[0x4]; // 0xae0 | Schema_Atomic | Size: 0x4
			entity2::GameTime_t m_flLastPhysicsInfluenceTime; // 0xae4 | Schema_DeclaredClass | Size: 0x4
			entity2::GameTime_t m_flFadeOutStartTime; // 0xae8 | Schema_DeclaredClass | Size: 0x4
			float32 m_flFadeTime; // 0xaec | Schema_Builtin | Size: 0x4
			GlobalTypes::VectorWS m_vecLastOrigin; // 0xaf0 | Schema_Atomic | Size: 0xc
			entity2::GameTime_t m_flAwakeTime; // 0xafc | Schema_DeclaredClass | Size: 0x4
			entity2::GameTime_t m_flLastOriginChangeTime; // 0xb00 | Schema_DeclaredClass | Size: 0x4
			S2_PAD(0x4);
			GlobalTypes::CUtlSymbolLarge m_strOriginClassName; // 0xb08 | Schema_Atomic | Size: 0x8
			GlobalTypes::CUtlSymbolLarge m_strSourceClassName; // 0xb10 | Schema_Atomic | Size: 0x8
			bool m_bHasBeenPhysgunned; // 0xb18 | Schema_Builtin | Size: 0x1
			bool m_bAllowStretch; // 0xb19 | Schema_Builtin | Size: 0x1
			S2_PAD(0x2);
			float32 m_flBlendWeight; // 0xb1c | Schema_Builtin | Size: 0x4
			float32 m_flDefaultFadeScale; // 0xb20 | Schema_Builtin | Size: 0x4
			S2_PAD(0x4);
			GlobalTypes::CUtlVector<GlobalTypes::Vector> m_ragdollMins; // 0xb28 | Schema_Atomic | Size: 0x18
			// char m_ragdollMins[0x18]; // 0xb28 | Schema_Atomic | Size: 0x18
			GlobalTypes::CUtlVector<GlobalTypes::Vector> m_ragdollMaxs; // 0xb40 | Schema_Atomic | Size: 0x18
			// char m_ragdollMaxs[0x18]; // 0xb40 | Schema_Atomic | Size: 0x18
			bool m_bShouldDeleteActivationRecord; // 0xb58 | Schema_Builtin | Size: 0x1
			S2_PAD(0x17); // End padding
		};
#ifdef USE_STATIC_ASSERTS
		static_assert(offsetof(CS2::server::CRagdollProp, m_ragdoll) == 0xA30, "m_ragdoll in CRagdollProp should be at offset 0xA30");
		static_assert(offsetof(CS2::server::CRagdollProp, m_bStartDisabled) == 0xA80, "m_bStartDisabled in CRagdollProp should be at offset 0xA80");
		static_assert(offsetof(CS2::server::CRagdollProp, m_ragEnabled) == 0xA88, "m_ragEnabled in CRagdollProp should be at offset 0xA88");
		static_assert(offsetof(CS2::server::CRagdollProp, m_ragPos) == 0xAA0, "m_ragPos in CRagdollProp should be at offset 0xAA0");
		static_assert(offsetof(CS2::server::CRagdollProp, m_ragAngles) == 0xAB8, "m_ragAngles in CRagdollProp should be at offset 0xAB8");
		static_assert(offsetof(CS2::server::CRagdollProp, m_lastUpdateTickCount) == 0xAD0, "m_lastUpdateTickCount in CRagdollProp should be at offset 0xAD0");
		static_assert(offsetof(CS2::server::CRagdollProp, m_allAsleep) == 0xAD4, "m_allAsleep in CRagdollProp should be at offset 0xAD4");
		static_assert(offsetof(CS2::server::CRagdollProp, m_bFirstCollisionAfterLaunch) == 0xAD5, "m_bFirstCollisionAfterLaunch in CRagdollProp should be at offset 0xAD5");
		static_assert(offsetof(CS2::server::CRagdollProp, m_hDamageEntity) == 0xAD8, "m_hDamageEntity in CRagdollProp should be at offset 0xAD8");
		static_assert(offsetof(CS2::server::CRagdollProp, m_hKiller) == 0xADC, "m_hKiller in CRagdollProp should be at offset 0xADC");
		static_assert(offsetof(CS2::server::CRagdollProp, m_hPhysicsAttacker) == 0xAE0, "m_hPhysicsAttacker in CRagdollProp should be at offset 0xAE0");
		static_assert(offsetof(CS2::server::CRagdollProp, m_flLastPhysicsInfluenceTime) == 0xAE4, "m_flLastPhysicsInfluenceTime in CRagdollProp should be at offset 0xAE4");
		static_assert(offsetof(CS2::server::CRagdollProp, m_flFadeOutStartTime) == 0xAE8, "m_flFadeOutStartTime in CRagdollProp should be at offset 0xAE8");
		static_assert(offsetof(CS2::server::CRagdollProp, m_flFadeTime) == 0xAEC, "m_flFadeTime in CRagdollProp should be at offset 0xAEC");
		static_assert(offsetof(CS2::server::CRagdollProp, m_vecLastOrigin) == 0xAF0, "m_vecLastOrigin in CRagdollProp should be at offset 0xAF0");
		static_assert(offsetof(CS2::server::CRagdollProp, m_flAwakeTime) == 0xAFC, "m_flAwakeTime in CRagdollProp should be at offset 0xAFC");
		static_assert(offsetof(CS2::server::CRagdollProp, m_flLastOriginChangeTime) == 0xB00, "m_flLastOriginChangeTime in CRagdollProp should be at offset 0xB00");
		static_assert(offsetof(CS2::server::CRagdollProp, m_strOriginClassName) == 0xB08, "m_strOriginClassName in CRagdollProp should be at offset 0xB08");
		static_assert(offsetof(CS2::server::CRagdollProp, m_strSourceClassName) == 0xB10, "m_strSourceClassName in CRagdollProp should be at offset 0xB10");
		static_assert(offsetof(CS2::server::CRagdollProp, m_bHasBeenPhysgunned) == 0xB18, "m_bHasBeenPhysgunned in CRagdollProp should be at offset 0xB18");
		static_assert(offsetof(CS2::server::CRagdollProp, m_bAllowStretch) == 0xB19, "m_bAllowStretch in CRagdollProp should be at offset 0xB19");
		static_assert(offsetof(CS2::server::CRagdollProp, m_flBlendWeight) == 0xB1C, "m_flBlendWeight in CRagdollProp should be at offset 0xB1C");
		static_assert(offsetof(CS2::server::CRagdollProp, m_flDefaultFadeScale) == 0xB20, "m_flDefaultFadeScale in CRagdollProp should be at offset 0xB20");
		static_assert(offsetof(CS2::server::CRagdollProp, m_ragdollMins) == 0xB28, "m_ragdollMins in CRagdollProp should be at offset 0xB28");
		static_assert(offsetof(CS2::server::CRagdollProp, m_ragdollMaxs) == 0xB40, "m_ragdollMaxs in CRagdollProp should be at offset 0xB40");
		static_assert(offsetof(CS2::server::CRagdollProp, m_bShouldDeleteActivationRecord) == 0xB58, "m_bShouldDeleteActivationRecord in CRagdollProp should be at offset 0xB58");
		static_assert(sizeof(CS2::server::CRagdollProp) == 0xB70, "CRagdollProp size should be 0xB70");

#endif
	}
}
