// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#ifndef CUSTOM_GLOBAL_TYPES
	#include "../GlobalTypes.hpp"
#else
	#include <Custom/GlobalTypes.hpp>
#endif


#include "CRagdollProp.hpp"





using namespace GlobalTypes;
namespace CS2 {
	namespace server {
		class CRagdollPropAttached : public CS2::server::CRagdollProp {
		public:
			uint32_t m_boneIndexAttached; // 0xb70 | Schema_Builtin | Size: 0x4
			uint32_t m_ragdollAttachedObjectIndex; // 0xb74 | Schema_Builtin | Size: 0x4
			GlobalTypes::Vector m_attachmentPointBoneSpace; // 0xb78 | Schema_Atomic | Size: 0xc
			GlobalTypes::Vector m_attachmentPointRagdollSpace; // 0xb84 | Schema_Atomic | Size: 0xc
			bool m_bShouldDetach; // 0xb90 | Schema_Builtin | Size: 0x1
			S2_PAD(0xf);
			bool m_bShouldDeleteAttachedActivationRecord; // 0xba0 | Schema_Builtin | Size: 0x1
			S2_PAD(0xf); // End padding
		};
#ifdef USE_STATIC_ASSERTS
		static_assert(offsetof(CS2::server::CRagdollPropAttached, m_boneIndexAttached) == 0xB70, "m_boneIndexAttached in CRagdollPropAttached should be at offset 0xB70");
		static_assert(offsetof(CS2::server::CRagdollPropAttached, m_ragdollAttachedObjectIndex) == 0xB74, "m_ragdollAttachedObjectIndex in CRagdollPropAttached should be at offset 0xB74");
		static_assert(offsetof(CS2::server::CRagdollPropAttached, m_attachmentPointBoneSpace) == 0xB78, "m_attachmentPointBoneSpace in CRagdollPropAttached should be at offset 0xB78");
		static_assert(offsetof(CS2::server::CRagdollPropAttached, m_attachmentPointRagdollSpace) == 0xB84, "m_attachmentPointRagdollSpace in CRagdollPropAttached should be at offset 0xB84");
		static_assert(offsetof(CS2::server::CRagdollPropAttached, m_bShouldDetach) == 0xB90, "m_bShouldDetach in CRagdollPropAttached should be at offset 0xB90");
		static_assert(offsetof(CS2::server::CRagdollPropAttached, m_bShouldDeleteAttachedActivationRecord) == 0xBA0, "m_bShouldDeleteAttachedActivationRecord in CRagdollPropAttached should be at offset 0xBA0");
		static_assert(sizeof(CS2::server::CRagdollPropAttached) == 0xBB0, "CRagdollPropAttached size should be 0xBB0");

#endif
	}
}
