// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#include <SDK/GlobalTypes.hpp>

#include <SDK/server/CPointEntity.hpp>



namespace CS2 {
	namespace server {
		class CRagdollMagnet : public CS2::server::CPointEntity {
		public:
			bool m_bDisabled; // 0x4f0 | Schema_Builtin | Size: 0x1
			S2_PAD(0x3);
			float32 m_radius; // 0x4f4 | Schema_Builtin | Size: 0x4
			float32 m_force; // 0x4f8 | Schema_Builtin | Size: 0x4
			GlobalTypes::Vector m_axis; // 0x4fc | Schema_Atomic | Size: 0xc
		};
		static_assert(offsetof(CS2::server::CRagdollMagnet, m_bDisabled) == 0x4F0, "m_bDisabled in CRagdollMagnet should be at offset 0x4F0");
		static_assert(offsetof(CS2::server::CRagdollMagnet, m_radius) == 0x4F4, "m_radius in CRagdollMagnet should be at offset 0x4F4");
		static_assert(offsetof(CS2::server::CRagdollMagnet, m_force) == 0x4F8, "m_force in CRagdollMagnet should be at offset 0x4F8");
		static_assert(offsetof(CS2::server::CRagdollMagnet, m_axis) == 0x4FC, "m_axis in CRagdollMagnet should be at offset 0x4FC");
		static_assert(sizeof(CS2::server::CRagdollMagnet) == 0x508, "CRagdollMagnet size should be 0x508");
	}
}
