// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#ifndef CUSTOM_GLOBAL_TYPES
	#include "../GlobalTypes.hpp"
#else
	#include "../Custom/GlobalTypes.hpp"
#endif


#include "CBaseEntity.hpp"





using namespace GlobalTypes;
namespace CS2 {
	namespace server {
		class CRagdollManager : public CS2::server::CBaseEntity {
		public:
			int8_t m_iCurrentMaxRagdollCount; // 0x4a8 | Schema_Builtin | Size: 0x1
			S2_PAD(0x3);
			int32_t m_iMaxRagdollCount; // 0x4ac | Schema_Builtin | Size: 0x4
			bool m_bSaveImportant; // 0x4b0 | Schema_Builtin | Size: 0x1
			bool m_bCanTakeDamage; // 0x4b1 | Schema_Builtin | Size: 0x1
			S2_PAD(0x6); // End padding
		};
#ifdef USE_STATIC_ASSERTS
		static_assert(offsetof(CS2::server::CRagdollManager, m_iCurrentMaxRagdollCount) == 0x4A8, "m_iCurrentMaxRagdollCount in CRagdollManager should be at offset 0x4A8");
		static_assert(offsetof(CS2::server::CRagdollManager, m_iMaxRagdollCount) == 0x4AC, "m_iMaxRagdollCount in CRagdollManager should be at offset 0x4AC");
		static_assert(offsetof(CS2::server::CRagdollManager, m_bSaveImportant) == 0x4B0, "m_bSaveImportant in CRagdollManager should be at offset 0x4B0");
		static_assert(offsetof(CS2::server::CRagdollManager, m_bCanTakeDamage) == 0x4B1, "m_bCanTakeDamage in CRagdollManager should be at offset 0x4B1");
		static_assert(sizeof(CS2::server::CRagdollManager) == 0x4B8, "CRagdollManager size should be 0x4B8");

#endif
	}
}
