// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#ifndef CUSTOM_GLOBAL_TYPES
	#include <SDK/GlobalTypes.hpp>
#else
	#include <Custom/GlobalTypes.hpp>
#endif





namespace CS2 {
	namespace server {
		class CCSPlayerPawn;
	}
}


using namespace GlobalTypes;
namespace CS2 {
	namespace server {
		class CRetakeGameRules  {
		public:
			S2_PAD(0xf8);
			int32_t m_nMatchSeed; // 0xf8 | Schema_Builtin | Size: 0x4
			bool m_bBlockersPresent; // 0xfc | Schema_Builtin | Size: 0x1
			bool m_bRoundInProgress; // 0xfd | Schema_Builtin | Size: 0x1
			S2_PAD(0x2);
			int32_t m_iFirstSecondHalfRound; // 0x100 | Schema_Builtin | Size: 0x4
			int32_t m_iBombSite; // 0x104 | Schema_Builtin | Size: 0x4
			GlobalTypes::CHandle<server::CCSPlayerPawn> m_hBombPlanter; // 0x108 | Schema_Atomic | Size: 0x4
			// char  m_hBombPlanter[0x4]; // 0x108 | Schema_Atomic | Size: 0x4
			S2_PAD(0xa4); // End padding
		};
		static_assert(offsetof(CS2::server::CRetakeGameRules, m_nMatchSeed) == 0xF8, "m_nMatchSeed in CRetakeGameRules should be at offset 0xF8");
		static_assert(offsetof(CS2::server::CRetakeGameRules, m_bBlockersPresent) == 0xFC, "m_bBlockersPresent in CRetakeGameRules should be at offset 0xFC");
		static_assert(offsetof(CS2::server::CRetakeGameRules, m_bRoundInProgress) == 0xFD, "m_bRoundInProgress in CRetakeGameRules should be at offset 0xFD");
		static_assert(offsetof(CS2::server::CRetakeGameRules, m_iFirstSecondHalfRound) == 0x100, "m_iFirstSecondHalfRound in CRetakeGameRules should be at offset 0x100");
		static_assert(offsetof(CS2::server::CRetakeGameRules, m_iBombSite) == 0x104, "m_iBombSite in CRetakeGameRules should be at offset 0x104");
		static_assert(offsetof(CS2::server::CRetakeGameRules, m_hBombPlanter) == 0x108, "m_hBombPlanter in CRetakeGameRules should be at offset 0x108");
		static_assert(sizeof(CS2::server::CRetakeGameRules) == 0x1B0, "CRetakeGameRules size should be 0x1B0");
	}
}
