// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#include <SDK/GlobalTypes.hpp>




namespace CS2 {
	namespace server {
		class CSAdditionalPerRoundStats_t  {
		public:
			public:
			int32_t m_numChickensKilled; // 0x0 | Schema_Builtin | Size: 0x4
			int32_t m_killsWhileBlind; // 0x4 | Schema_Builtin | Size: 0x4
			int32_t m_bombCarrierkills; // 0x8 | Schema_Builtin | Size: 0x4
			int32_t m_iBurnDamageInflicted; // 0xc | Schema_Builtin | Size: 0x4
			int32_t m_iBlastDamageInflicted; // 0x10 | Schema_Builtin | Size: 0x4
			int32_t m_iDinks; // 0x14 | Schema_Builtin | Size: 0x4
		};
		static_assert(offsetof(CS2::server::CSAdditionalPerRoundStats_t, m_numChickensKilled) == 0x0, "m_numChickensKilled in CSAdditionalPerRoundStats_t should be at offset 0x0");
		static_assert(offsetof(CS2::server::CSAdditionalPerRoundStats_t, m_killsWhileBlind) == 0x4, "m_killsWhileBlind in CSAdditionalPerRoundStats_t should be at offset 0x4");
		static_assert(offsetof(CS2::server::CSAdditionalPerRoundStats_t, m_bombCarrierkills) == 0x8, "m_bombCarrierkills in CSAdditionalPerRoundStats_t should be at offset 0x8");
		static_assert(offsetof(CS2::server::CSAdditionalPerRoundStats_t, m_iBurnDamageInflicted) == 0xC, "m_iBurnDamageInflicted in CSAdditionalPerRoundStats_t should be at offset 0xC");
		static_assert(offsetof(CS2::server::CSAdditionalPerRoundStats_t, m_iBlastDamageInflicted) == 0x10, "m_iBlastDamageInflicted in CSAdditionalPerRoundStats_t should be at offset 0x10");
		static_assert(offsetof(CS2::server::CSAdditionalPerRoundStats_t, m_iDinks) == 0x14, "m_iDinks in CSAdditionalPerRoundStats_t should be at offset 0x14");
		static_assert(sizeof(CS2::server::CSAdditionalPerRoundStats_t) == 0x18, "CSAdditionalPerRoundStats_t size should be 0x18");
	}
}
