// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#ifndef CUSTOM_GLOBAL_TYPES
	#include "../GlobalTypes.hpp"
#else
	#include "../Custom/GlobalTypes.hpp"
#endif


#include "CPointEntity.hpp"
#include "CBaseEntity.hpp"
#include "CBaseFlex.hpp"
#include "../entity2/CEntityIOOutput.hpp"
#include "CSceneListManager.hpp"
#include "SceneOnPlayerDeath_t.hpp"





using namespace GlobalTypes;
namespace CS2 {
	namespace server {
		class CSceneEntity : public CS2::server::CPointEntity {
		public:
			S2_PAD(0x8);
			GlobalTypes::CUtlSymbolLarge m_iszSceneFile; // 0x4b0 | Schema_Atomic | Size: 0x8
			GlobalTypes::CUtlSymbolLarge m_iszTarget1; // 0x4b8 | Schema_Atomic | Size: 0x8
			GlobalTypes::CUtlSymbolLarge m_iszTarget2; // 0x4c0 | Schema_Atomic | Size: 0x8
			GlobalTypes::CUtlSymbolLarge m_iszTarget3; // 0x4c8 | Schema_Atomic | Size: 0x8
			GlobalTypes::CUtlSymbolLarge m_iszTarget4; // 0x4d0 | Schema_Atomic | Size: 0x8
			GlobalTypes::CUtlSymbolLarge m_iszTarget5; // 0x4d8 | Schema_Atomic | Size: 0x8
			GlobalTypes::CUtlSymbolLarge m_iszTarget6; // 0x4e0 | Schema_Atomic | Size: 0x8
			GlobalTypes::CUtlSymbolLarge m_iszTarget7; // 0x4e8 | Schema_Atomic | Size: 0x8
			GlobalTypes::CUtlSymbolLarge m_iszTarget8; // 0x4f0 | Schema_Atomic | Size: 0x8
			GlobalTypes::CHandle<server::CBaseEntity> m_hTarget1; // 0x4f8 | Schema_Atomic | Size: 0x4
			// char m_hTarget1[0x4]; // 0x4f8 | Schema_Atomic | Size: 0x4
			GlobalTypes::CHandle<server::CBaseEntity> m_hTarget2; // 0x4fc | Schema_Atomic | Size: 0x4
			// char m_hTarget2[0x4]; // 0x4fc | Schema_Atomic | Size: 0x4
			GlobalTypes::CHandle<server::CBaseEntity> m_hTarget3; // 0x500 | Schema_Atomic | Size: 0x4
			// char m_hTarget3[0x4]; // 0x500 | Schema_Atomic | Size: 0x4
			GlobalTypes::CHandle<server::CBaseEntity> m_hTarget4; // 0x504 | Schema_Atomic | Size: 0x4
			// char m_hTarget4[0x4]; // 0x504 | Schema_Atomic | Size: 0x4
			GlobalTypes::CHandle<server::CBaseEntity> m_hTarget5; // 0x508 | Schema_Atomic | Size: 0x4
			// char m_hTarget5[0x4]; // 0x508 | Schema_Atomic | Size: 0x4
			GlobalTypes::CHandle<server::CBaseEntity> m_hTarget6; // 0x50c | Schema_Atomic | Size: 0x4
			// char m_hTarget6[0x4]; // 0x50c | Schema_Atomic | Size: 0x4
			GlobalTypes::CHandle<server::CBaseEntity> m_hTarget7; // 0x510 | Schema_Atomic | Size: 0x4
			// char m_hTarget7[0x4]; // 0x510 | Schema_Atomic | Size: 0x4
			GlobalTypes::CHandle<server::CBaseEntity> m_hTarget8; // 0x514 | Schema_Atomic | Size: 0x4
			// char m_hTarget8[0x4]; // 0x514 | Schema_Atomic | Size: 0x4
			GlobalTypes::CUtlSymbolLarge m_sTargetAttachment; // 0x518 | Schema_Atomic | Size: 0x8
			bool m_bIsPlayingBack; // 0x520 | Schema_Builtin | Size: 0x1
			bool m_bPaused; // 0x521 | Schema_Builtin | Size: 0x1
			bool m_bMultiplayer; // 0x522 | Schema_Builtin | Size: 0x1
			bool m_bAutogenerated; // 0x523 | Schema_Builtin | Size: 0x1
			float32 m_flForceClientTime; // 0x524 | Schema_Builtin | Size: 0x4
			float32 m_flCurrentTime; // 0x528 | Schema_Builtin | Size: 0x4
			float32 m_flFrameTime; // 0x52c | Schema_Builtin | Size: 0x4
			bool m_bCancelAtNextInterrupt; // 0x530 | Schema_Builtin | Size: 0x1
			S2_PAD(0x3);
			float32 m_fPitch; // 0x534 | Schema_Builtin | Size: 0x4
			bool m_bAutomated; // 0x538 | Schema_Builtin | Size: 0x1
			S2_PAD(0x3);
			int32_t m_nAutomatedAction; // 0x53c | Schema_Builtin | Size: 0x4
			float32 m_flAutomationDelay; // 0x540 | Schema_Builtin | Size: 0x4
			float32 m_flAutomationTime; // 0x544 | Schema_Builtin | Size: 0x4
			int32_t m_nSpeechPriority; // 0x548 | Schema_Builtin | Size: 0x4
			bool m_bPausedViaInput; // 0x54c | Schema_Builtin | Size: 0x1
			bool m_bPauseAtNextInterrupt; // 0x54d | Schema_Builtin | Size: 0x1
			bool m_bWaitingForActor; // 0x54e | Schema_Builtin | Size: 0x1
			bool m_bWaitingForInterrupt; // 0x54f | Schema_Builtin | Size: 0x1
			bool m_bInterruptedActorsScenes; // 0x550 | Schema_Builtin | Size: 0x1
			bool m_bBreakOnNonIdle; // 0x551 | Schema_Builtin | Size: 0x1
			bool m_bSceneFinished; // 0x552 | Schema_Builtin | Size: 0x1
			S2_PAD(0x5);
			// server::CNetworkUtlVectorBase<GlobalTypes::CHandle<server::CBaseFlex>> m_hActorList; // 0x558 | Schema_Atomic | Size: 0x18
			char m_hActorList[0x18]; // 0x558 | Schema_Atomic | Size: 0x18
			GlobalTypes::CUtlVector<GlobalTypes::CHandle<server::CBaseEntity>> m_hRemoveActorList; // 0x570 | Schema_Atomic | Size: 0x18
			// char m_hRemoveActorList[0x18]; // 0x570 | Schema_Atomic | Size: 0x18
			S2_PAD(0x30);
			uint16_t m_nSceneStringIndex; // 0x5b8 | Schema_Builtin | Size: 0x2
			S2_PAD(0x6);
			entity2::CEntityIOOutput m_OnStart; // 0x5c0 | Schema_DeclaredClass | Size: 0x18
			entity2::CEntityIOOutput m_OnCompletion; // 0x5d8 | Schema_DeclaredClass | Size: 0x18
			entity2::CEntityIOOutput m_OnCanceled; // 0x5f0 | Schema_DeclaredClass | Size: 0x18
			entity2::CEntityIOOutput m_OnPaused; // 0x608 | Schema_DeclaredClass | Size: 0x18
			entity2::CEntityIOOutput m_OnResumed; // 0x620 | Schema_DeclaredClass | Size: 0x18
			S2_PAD(0x90);
			GlobalTypes::CHandle<server::CSceneEntity> m_hInterruptScene; // 0x6c8 | Schema_Atomic | Size: 0x4
			// char m_hInterruptScene[0x4]; // 0x6c8 | Schema_Atomic | Size: 0x4
			int32_t m_nInterruptCount; // 0x6cc | Schema_Builtin | Size: 0x4
			bool m_bSceneMissing; // 0x6d0 | Schema_Builtin | Size: 0x1
			bool m_bInterrupted; // 0x6d1 | Schema_Builtin | Size: 0x1
			bool m_bCompletedEarly; // 0x6d2 | Schema_Builtin | Size: 0x1
			bool m_bInterruptSceneFinished; // 0x6d3 | Schema_Builtin | Size: 0x1
			bool m_bRestoring; // 0x6d4 | Schema_Builtin | Size: 0x1
			S2_PAD(0x3);
			GlobalTypes::CUtlVector<GlobalTypes::CHandle<server::CSceneEntity>> m_hNotifySceneCompletion; // 0x6d8 | Schema_Atomic | Size: 0x18
			// char m_hNotifySceneCompletion[0x18]; // 0x6d8 | Schema_Atomic | Size: 0x18
			GlobalTypes::CUtlVector<GlobalTypes::CHandle<server::CSceneListManager>> m_hListManagers; // 0x6f0 | Schema_Atomic | Size: 0x18
			// char m_hListManagers[0x18]; // 0x6f0 | Schema_Atomic | Size: 0x18
			GlobalTypes::CUtlSymbolLarge m_iszSoundName; // 0x708 | Schema_Atomic | Size: 0x8
			GlobalTypes::CUtlSymbolLarge m_iszSequenceName; // 0x710 | Schema_Atomic | Size: 0x8
			GlobalTypes::CHandle<server::CBaseFlex> m_hActor; // 0x718 | Schema_Atomic | Size: 0x4
			// char m_hActor[0x4]; // 0x718 | Schema_Atomic | Size: 0x4
			GlobalTypes::CHandle<server::CBaseEntity> m_hActivator; // 0x71c | Schema_Atomic | Size: 0x4
			// char m_hActivator[0x4]; // 0x71c | Schema_Atomic | Size: 0x4
			int32_t m_BusyActor; // 0x720 | Schema_Builtin | Size: 0x4
			server::SceneOnPlayerDeath_t m_iPlayerDeathBehavior; // 0x724 | Schema_DeclaredEnum | Size: 0x4
			S2_PAD(0x8); // End padding
		};
#ifdef USE_STATIC_ASSERTS
		static_assert(offsetof(CS2::server::CSceneEntity, m_iszSceneFile) == 0x4B0, "m_iszSceneFile in CSceneEntity should be at offset 0x4B0");
		static_assert(offsetof(CS2::server::CSceneEntity, m_iszTarget1) == 0x4B8, "m_iszTarget1 in CSceneEntity should be at offset 0x4B8");
		static_assert(offsetof(CS2::server::CSceneEntity, m_iszTarget2) == 0x4C0, "m_iszTarget2 in CSceneEntity should be at offset 0x4C0");
		static_assert(offsetof(CS2::server::CSceneEntity, m_iszTarget3) == 0x4C8, "m_iszTarget3 in CSceneEntity should be at offset 0x4C8");
		static_assert(offsetof(CS2::server::CSceneEntity, m_iszTarget4) == 0x4D0, "m_iszTarget4 in CSceneEntity should be at offset 0x4D0");
		static_assert(offsetof(CS2::server::CSceneEntity, m_iszTarget5) == 0x4D8, "m_iszTarget5 in CSceneEntity should be at offset 0x4D8");
		static_assert(offsetof(CS2::server::CSceneEntity, m_iszTarget6) == 0x4E0, "m_iszTarget6 in CSceneEntity should be at offset 0x4E0");
		static_assert(offsetof(CS2::server::CSceneEntity, m_iszTarget7) == 0x4E8, "m_iszTarget7 in CSceneEntity should be at offset 0x4E8");
		static_assert(offsetof(CS2::server::CSceneEntity, m_iszTarget8) == 0x4F0, "m_iszTarget8 in CSceneEntity should be at offset 0x4F0");
		static_assert(offsetof(CS2::server::CSceneEntity, m_hTarget1) == 0x4F8, "m_hTarget1 in CSceneEntity should be at offset 0x4F8");
		static_assert(offsetof(CS2::server::CSceneEntity, m_hTarget2) == 0x4FC, "m_hTarget2 in CSceneEntity should be at offset 0x4FC");
		static_assert(offsetof(CS2::server::CSceneEntity, m_hTarget3) == 0x500, "m_hTarget3 in CSceneEntity should be at offset 0x500");
		static_assert(offsetof(CS2::server::CSceneEntity, m_hTarget4) == 0x504, "m_hTarget4 in CSceneEntity should be at offset 0x504");
		static_assert(offsetof(CS2::server::CSceneEntity, m_hTarget5) == 0x508, "m_hTarget5 in CSceneEntity should be at offset 0x508");
		static_assert(offsetof(CS2::server::CSceneEntity, m_hTarget6) == 0x50C, "m_hTarget6 in CSceneEntity should be at offset 0x50C");
		static_assert(offsetof(CS2::server::CSceneEntity, m_hTarget7) == 0x510, "m_hTarget7 in CSceneEntity should be at offset 0x510");
		static_assert(offsetof(CS2::server::CSceneEntity, m_hTarget8) == 0x514, "m_hTarget8 in CSceneEntity should be at offset 0x514");
		static_assert(offsetof(CS2::server::CSceneEntity, m_sTargetAttachment) == 0x518, "m_sTargetAttachment in CSceneEntity should be at offset 0x518");
		static_assert(offsetof(CS2::server::CSceneEntity, m_bIsPlayingBack) == 0x520, "m_bIsPlayingBack in CSceneEntity should be at offset 0x520");
		static_assert(offsetof(CS2::server::CSceneEntity, m_bPaused) == 0x521, "m_bPaused in CSceneEntity should be at offset 0x521");
		static_assert(offsetof(CS2::server::CSceneEntity, m_bMultiplayer) == 0x522, "m_bMultiplayer in CSceneEntity should be at offset 0x522");
		static_assert(offsetof(CS2::server::CSceneEntity, m_bAutogenerated) == 0x523, "m_bAutogenerated in CSceneEntity should be at offset 0x523");
		static_assert(offsetof(CS2::server::CSceneEntity, m_flForceClientTime) == 0x524, "m_flForceClientTime in CSceneEntity should be at offset 0x524");
		static_assert(offsetof(CS2::server::CSceneEntity, m_flCurrentTime) == 0x528, "m_flCurrentTime in CSceneEntity should be at offset 0x528");
		static_assert(offsetof(CS2::server::CSceneEntity, m_flFrameTime) == 0x52C, "m_flFrameTime in CSceneEntity should be at offset 0x52C");
		static_assert(offsetof(CS2::server::CSceneEntity, m_bCancelAtNextInterrupt) == 0x530, "m_bCancelAtNextInterrupt in CSceneEntity should be at offset 0x530");
		static_assert(offsetof(CS2::server::CSceneEntity, m_fPitch) == 0x534, "m_fPitch in CSceneEntity should be at offset 0x534");
		static_assert(offsetof(CS2::server::CSceneEntity, m_bAutomated) == 0x538, "m_bAutomated in CSceneEntity should be at offset 0x538");
		static_assert(offsetof(CS2::server::CSceneEntity, m_nAutomatedAction) == 0x53C, "m_nAutomatedAction in CSceneEntity should be at offset 0x53C");
		static_assert(offsetof(CS2::server::CSceneEntity, m_flAutomationDelay) == 0x540, "m_flAutomationDelay in CSceneEntity should be at offset 0x540");
		static_assert(offsetof(CS2::server::CSceneEntity, m_flAutomationTime) == 0x544, "m_flAutomationTime in CSceneEntity should be at offset 0x544");
		static_assert(offsetof(CS2::server::CSceneEntity, m_nSpeechPriority) == 0x548, "m_nSpeechPriority in CSceneEntity should be at offset 0x548");
		static_assert(offsetof(CS2::server::CSceneEntity, m_bPausedViaInput) == 0x54C, "m_bPausedViaInput in CSceneEntity should be at offset 0x54C");
		static_assert(offsetof(CS2::server::CSceneEntity, m_bPauseAtNextInterrupt) == 0x54D, "m_bPauseAtNextInterrupt in CSceneEntity should be at offset 0x54D");
		static_assert(offsetof(CS2::server::CSceneEntity, m_bWaitingForActor) == 0x54E, "m_bWaitingForActor in CSceneEntity should be at offset 0x54E");
		static_assert(offsetof(CS2::server::CSceneEntity, m_bWaitingForInterrupt) == 0x54F, "m_bWaitingForInterrupt in CSceneEntity should be at offset 0x54F");
		static_assert(offsetof(CS2::server::CSceneEntity, m_bInterruptedActorsScenes) == 0x550, "m_bInterruptedActorsScenes in CSceneEntity should be at offset 0x550");
		static_assert(offsetof(CS2::server::CSceneEntity, m_bBreakOnNonIdle) == 0x551, "m_bBreakOnNonIdle in CSceneEntity should be at offset 0x551");
		static_assert(offsetof(CS2::server::CSceneEntity, m_bSceneFinished) == 0x552, "m_bSceneFinished in CSceneEntity should be at offset 0x552");
		static_assert(offsetof(CS2::server::CSceneEntity, m_hActorList) == 0x558, "m_hActorList in CSceneEntity should be at offset 0x558");
		static_assert(offsetof(CS2::server::CSceneEntity, m_hRemoveActorList) == 0x570, "m_hRemoveActorList in CSceneEntity should be at offset 0x570");
		static_assert(offsetof(CS2::server::CSceneEntity, m_nSceneStringIndex) == 0x5B8, "m_nSceneStringIndex in CSceneEntity should be at offset 0x5B8");
		static_assert(offsetof(CS2::server::CSceneEntity, m_OnStart) == 0x5C0, "m_OnStart in CSceneEntity should be at offset 0x5C0");
		static_assert(offsetof(CS2::server::CSceneEntity, m_OnCompletion) == 0x5D8, "m_OnCompletion in CSceneEntity should be at offset 0x5D8");
		static_assert(offsetof(CS2::server::CSceneEntity, m_OnCanceled) == 0x5F0, "m_OnCanceled in CSceneEntity should be at offset 0x5F0");
		static_assert(offsetof(CS2::server::CSceneEntity, m_OnPaused) == 0x608, "m_OnPaused in CSceneEntity should be at offset 0x608");
		static_assert(offsetof(CS2::server::CSceneEntity, m_OnResumed) == 0x620, "m_OnResumed in CSceneEntity should be at offset 0x620");
		static_assert(offsetof(CS2::server::CSceneEntity, m_hInterruptScene) == 0x6C8, "m_hInterruptScene in CSceneEntity should be at offset 0x6C8");
		static_assert(offsetof(CS2::server::CSceneEntity, m_nInterruptCount) == 0x6CC, "m_nInterruptCount in CSceneEntity should be at offset 0x6CC");
		static_assert(offsetof(CS2::server::CSceneEntity, m_bSceneMissing) == 0x6D0, "m_bSceneMissing in CSceneEntity should be at offset 0x6D0");
		static_assert(offsetof(CS2::server::CSceneEntity, m_bInterrupted) == 0x6D1, "m_bInterrupted in CSceneEntity should be at offset 0x6D1");
		static_assert(offsetof(CS2::server::CSceneEntity, m_bCompletedEarly) == 0x6D2, "m_bCompletedEarly in CSceneEntity should be at offset 0x6D2");
		static_assert(offsetof(CS2::server::CSceneEntity, m_bInterruptSceneFinished) == 0x6D3, "m_bInterruptSceneFinished in CSceneEntity should be at offset 0x6D3");
		static_assert(offsetof(CS2::server::CSceneEntity, m_bRestoring) == 0x6D4, "m_bRestoring in CSceneEntity should be at offset 0x6D4");
		static_assert(offsetof(CS2::server::CSceneEntity, m_hNotifySceneCompletion) == 0x6D8, "m_hNotifySceneCompletion in CSceneEntity should be at offset 0x6D8");
		static_assert(offsetof(CS2::server::CSceneEntity, m_hListManagers) == 0x6F0, "m_hListManagers in CSceneEntity should be at offset 0x6F0");
		static_assert(offsetof(CS2::server::CSceneEntity, m_iszSoundName) == 0x708, "m_iszSoundName in CSceneEntity should be at offset 0x708");
		static_assert(offsetof(CS2::server::CSceneEntity, m_iszSequenceName) == 0x710, "m_iszSequenceName in CSceneEntity should be at offset 0x710");
		static_assert(offsetof(CS2::server::CSceneEntity, m_hActor) == 0x718, "m_hActor in CSceneEntity should be at offset 0x718");
		static_assert(offsetof(CS2::server::CSceneEntity, m_hActivator) == 0x71C, "m_hActivator in CSceneEntity should be at offset 0x71C");
		static_assert(offsetof(CS2::server::CSceneEntity, m_BusyActor) == 0x720, "m_BusyActor in CSceneEntity should be at offset 0x720");
		static_assert(offsetof(CS2::server::CSceneEntity, m_iPlayerDeathBehavior) == 0x724, "m_iPlayerDeathBehavior in CSceneEntity should be at offset 0x724");
		static_assert(sizeof(CS2::server::CSceneEntity) == 0x730, "CSceneEntity size should be 0x730");

#endif
	}
}
