// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#ifndef CUSTOM_GLOBAL_TYPES
	#include <SDK/GlobalTypes.hpp>
#else
	#include <Custom/GlobalTypes.hpp>
#endif


#include <SDK/server/CSoundEventEntity.hpp>
#include <SDK/client/SoundeventPathCornerPairNetworked_t.hpp>





using namespace GlobalTypes;
namespace CS2 {
	namespace server {
		class CSoundEventPathCornerEntity : public CS2::server::CSoundEventEntity {
		public:
			GlobalTypes::CUtlSymbolLarge m_iszPathCorner; // 0x558 | Schema_Atomic | Size: 0x8
			int32_t m_iCountMax; // 0x560 | Schema_Builtin | Size: 0x4
			float32 m_flDistanceMax; // 0x564 | Schema_Builtin | Size: 0x4
			float32 m_flDistMaxSqr; // 0x568 | Schema_Builtin | Size: 0x4
			float32 m_flDotProductMax; // 0x56c | Schema_Builtin | Size: 0x4
			bool m_bPlaying; // 0x570 | Schema_Builtin | Size: 0x1
			S2_PAD(0x27);
			// GlobalTypes::CNetworkUtlVectorBase<client::SoundeventPathCornerPairNetworked_t> m_vecCornerPairsNetworked; // 0x598 | Schema_Atomic | Size: 0x60
			char m_vecCornerPairsNetworked[0x60]; // 0x598 | Schema_Atomic | Size: 0x60
		};
		static_assert(offsetof(CS2::server::CSoundEventPathCornerEntity, m_iszPathCorner) == 0x558, "m_iszPathCorner in CSoundEventPathCornerEntity should be at offset 0x558");
		static_assert(offsetof(CS2::server::CSoundEventPathCornerEntity, m_iCountMax) == 0x560, "m_iCountMax in CSoundEventPathCornerEntity should be at offset 0x560");
		static_assert(offsetof(CS2::server::CSoundEventPathCornerEntity, m_flDistanceMax) == 0x564, "m_flDistanceMax in CSoundEventPathCornerEntity should be at offset 0x564");
		static_assert(offsetof(CS2::server::CSoundEventPathCornerEntity, m_flDistMaxSqr) == 0x568, "m_flDistMaxSqr in CSoundEventPathCornerEntity should be at offset 0x568");
		static_assert(offsetof(CS2::server::CSoundEventPathCornerEntity, m_flDotProductMax) == 0x56C, "m_flDotProductMax in CSoundEventPathCornerEntity should be at offset 0x56C");
		static_assert(offsetof(CS2::server::CSoundEventPathCornerEntity, m_bPlaying) == 0x570, "m_bPlaying in CSoundEventPathCornerEntity should be at offset 0x570");
		static_assert(offsetof(CS2::server::CSoundEventPathCornerEntity, m_vecCornerPairsNetworked) == 0x598, "m_vecCornerPairsNetworked in CSoundEventPathCornerEntity should be at offset 0x598");
		static_assert(sizeof(CS2::server::CSoundEventPathCornerEntity) == 0x5F8, "CSoundEventPathCornerEntity size should be 0x5F8");
	}
}
