// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#ifndef CUSTOM_GLOBAL_TYPES
	#include <SDK/GlobalTypes.hpp>
#else
	#include <Custom/GlobalTypes.hpp>
#endif


#include <SDK/server/CSoundOpvarSetPointBase.hpp>





using namespace GlobalTypes;
namespace CS2 {
	namespace server {
		class CSoundOpvarSetOBBWindEntity : public CS2::server::CSoundOpvarSetPointBase {
		public:
			GlobalTypes::Vector m_vMins; // 0x550 | Schema_Atomic | Size: 0xc
			GlobalTypes::Vector m_vMaxs; // 0x55c | Schema_Atomic | Size: 0xc
			GlobalTypes::Vector m_vDistanceMins; // 0x568 | Schema_Atomic | Size: 0xc
			GlobalTypes::Vector m_vDistanceMaxs; // 0x574 | Schema_Atomic | Size: 0xc
			float32 m_flWindMin; // 0x580 | Schema_Builtin | Size: 0x4
			float32 m_flWindMax; // 0x584 | Schema_Builtin | Size: 0x4
			float32 m_flWindMapMin; // 0x588 | Schema_Builtin | Size: 0x4
			float32 m_flWindMapMax; // 0x58c | Schema_Builtin | Size: 0x4
		};
		static_assert(offsetof(CS2::server::CSoundOpvarSetOBBWindEntity, m_vMins) == 0x550, "m_vMins in CSoundOpvarSetOBBWindEntity should be at offset 0x550");
		static_assert(offsetof(CS2::server::CSoundOpvarSetOBBWindEntity, m_vMaxs) == 0x55C, "m_vMaxs in CSoundOpvarSetOBBWindEntity should be at offset 0x55C");
		static_assert(offsetof(CS2::server::CSoundOpvarSetOBBWindEntity, m_vDistanceMins) == 0x568, "m_vDistanceMins in CSoundOpvarSetOBBWindEntity should be at offset 0x568");
		static_assert(offsetof(CS2::server::CSoundOpvarSetOBBWindEntity, m_vDistanceMaxs) == 0x574, "m_vDistanceMaxs in CSoundOpvarSetOBBWindEntity should be at offset 0x574");
		static_assert(offsetof(CS2::server::CSoundOpvarSetOBBWindEntity, m_flWindMin) == 0x580, "m_flWindMin in CSoundOpvarSetOBBWindEntity should be at offset 0x580");
		static_assert(offsetof(CS2::server::CSoundOpvarSetOBBWindEntity, m_flWindMax) == 0x584, "m_flWindMax in CSoundOpvarSetOBBWindEntity should be at offset 0x584");
		static_assert(offsetof(CS2::server::CSoundOpvarSetOBBWindEntity, m_flWindMapMin) == 0x588, "m_flWindMapMin in CSoundOpvarSetOBBWindEntity should be at offset 0x588");
		static_assert(offsetof(CS2::server::CSoundOpvarSetOBBWindEntity, m_flWindMapMax) == 0x58C, "m_flWindMapMax in CSoundOpvarSetOBBWindEntity should be at offset 0x58C");
		static_assert(sizeof(CS2::server::CSoundOpvarSetOBBWindEntity) == 0x590, "CSoundOpvarSetOBBWindEntity size should be 0x590");
	}
}
