// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#ifndef CUSTOM_GLOBAL_TYPES
	#include "../GlobalTypes.hpp"
#else
	#include <Custom/GlobalTypes.hpp>
#endif


#include "CBaseEntity.hpp"





using namespace GlobalTypes;
namespace CS2 {
	namespace server {
		class CSoundOpvarSetEntity : public CS2::server::CBaseEntity {
		public:
			S2_PAD(0x18);
			GlobalTypes::CUtlSymbolLarge m_iszStackName; // 0x4c0 | Schema_Atomic | Size: 0x8
			GlobalTypes::CUtlSymbolLarge m_iszOperatorName; // 0x4c8 | Schema_Atomic | Size: 0x8
			GlobalTypes::CUtlSymbolLarge m_iszOpvarName; // 0x4d0 | Schema_Atomic | Size: 0x8
			int32_t m_nOpvarType; // 0x4d8 | Schema_Builtin | Size: 0x4
			int32_t m_nOpvarIndex; // 0x4dc | Schema_Builtin | Size: 0x4
			float32 m_flOpvarValue; // 0x4e0 | Schema_Builtin | Size: 0x4
			S2_PAD(0x4);
			GlobalTypes::CUtlSymbolLarge m_OpvarValueString; // 0x4e8 | Schema_Atomic | Size: 0x8
			bool m_bSetOnSpawn; // 0x4f0 | Schema_Builtin | Size: 0x1
			S2_PAD(0xf); // End padding
		};
#ifdef USE_STATIC_ASSERTS
		static_assert(offsetof(CS2::server::CSoundOpvarSetEntity, m_iszStackName) == 0x4C0, "m_iszStackName in CSoundOpvarSetEntity should be at offset 0x4C0");
		static_assert(offsetof(CS2::server::CSoundOpvarSetEntity, m_iszOperatorName) == 0x4C8, "m_iszOperatorName in CSoundOpvarSetEntity should be at offset 0x4C8");
		static_assert(offsetof(CS2::server::CSoundOpvarSetEntity, m_iszOpvarName) == 0x4D0, "m_iszOpvarName in CSoundOpvarSetEntity should be at offset 0x4D0");
		static_assert(offsetof(CS2::server::CSoundOpvarSetEntity, m_nOpvarType) == 0x4D8, "m_nOpvarType in CSoundOpvarSetEntity should be at offset 0x4D8");
		static_assert(offsetof(CS2::server::CSoundOpvarSetEntity, m_nOpvarIndex) == 0x4DC, "m_nOpvarIndex in CSoundOpvarSetEntity should be at offset 0x4DC");
		static_assert(offsetof(CS2::server::CSoundOpvarSetEntity, m_flOpvarValue) == 0x4E0, "m_flOpvarValue in CSoundOpvarSetEntity should be at offset 0x4E0");
		static_assert(offsetof(CS2::server::CSoundOpvarSetEntity, m_OpvarValueString) == 0x4E8, "m_OpvarValueString in CSoundOpvarSetEntity should be at offset 0x4E8");
		static_assert(offsetof(CS2::server::CSoundOpvarSetEntity, m_bSetOnSpawn) == 0x4F0, "m_bSetOnSpawn in CSoundOpvarSetEntity should be at offset 0x4F0");
		static_assert(sizeof(CS2::server::CSoundOpvarSetEntity) == 0x500, "CSoundOpvarSetEntity size should be 0x500");

#endif
	}
}
