// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#ifndef CUSTOM_GLOBAL_TYPES
	#include "../GlobalTypes.hpp"
#else
	#include "../Custom/GlobalTypes.hpp"
#endif


#include "CBaseEntity.hpp"
#include "../entity2/CEntityIOOutput.hpp"





using namespace GlobalTypes;
namespace CS2 {
	namespace server {
		class CSoundEventEntity : public CS2::server::CBaseEntity {
		public:
			bool m_bStartOnSpawn; // 0x4a8 | Schema_Builtin | Size: 0x1
			bool m_bToLocalPlayer; // 0x4a9 | Schema_Builtin | Size: 0x1
			bool m_bStopOnNew; // 0x4aa | Schema_Builtin | Size: 0x1
			bool m_bSaveRestore; // 0x4ab | Schema_Builtin | Size: 0x1
			bool m_bSavedIsPlaying; // 0x4ac | Schema_Builtin | Size: 0x1
			S2_PAD(0x3);
			float32 m_flSavedElapsedTime; // 0x4b0 | Schema_Builtin | Size: 0x4
			S2_PAD(0x4);
			GlobalTypes::CUtlSymbolLarge m_iszSourceEntityName; // 0x4b8 | Schema_Atomic | Size: 0x8
			GlobalTypes::CUtlSymbolLarge m_iszAttachmentName; // 0x4c0 | Schema_Atomic | Size: 0x8
			// GlobalTypes::CEntityOutputTemplate< uint64, uint64 > m_onGUIDChanged; // 0x4c8 | Schema_Atomic | Size: 0x20
			char m_onGUIDChanged[0x20]; // 0x4c8 | Schema_Atomic | Size: 0x20
			entity2::CEntityIOOutput m_onSoundFinished; // 0x4e8 | Schema_DeclaredClass | Size: 0x18
			float32 m_flClientCullRadius; // 0x500 | Schema_Builtin | Size: 0x4
			S2_PAD(0x2c);
			GlobalTypes::CUtlSymbolLarge m_iszSoundName; // 0x530 | Schema_Atomic | Size: 0x8
			S2_PAD(0x14);
			GlobalTypes::CEntityHandle m_hSource; // 0x54c | Schema_Atomic | Size: 0x4
			int32_t m_nEntityIndexSelection; // 0x550 | Schema_Builtin | Size: 0x4
			S2_PAD(0x4); // End padding
		};
		static_assert(offsetof(CS2::server::CSoundEventEntity, m_bStartOnSpawn) == 0x4A8, "m_bStartOnSpawn in CSoundEventEntity should be at offset 0x4A8");
		static_assert(offsetof(CS2::server::CSoundEventEntity, m_bToLocalPlayer) == 0x4A9, "m_bToLocalPlayer in CSoundEventEntity should be at offset 0x4A9");
		static_assert(offsetof(CS2::server::CSoundEventEntity, m_bStopOnNew) == 0x4AA, "m_bStopOnNew in CSoundEventEntity should be at offset 0x4AA");
		static_assert(offsetof(CS2::server::CSoundEventEntity, m_bSaveRestore) == 0x4AB, "m_bSaveRestore in CSoundEventEntity should be at offset 0x4AB");
		static_assert(offsetof(CS2::server::CSoundEventEntity, m_bSavedIsPlaying) == 0x4AC, "m_bSavedIsPlaying in CSoundEventEntity should be at offset 0x4AC");
		static_assert(offsetof(CS2::server::CSoundEventEntity, m_flSavedElapsedTime) == 0x4B0, "m_flSavedElapsedTime in CSoundEventEntity should be at offset 0x4B0");
		static_assert(offsetof(CS2::server::CSoundEventEntity, m_iszSourceEntityName) == 0x4B8, "m_iszSourceEntityName in CSoundEventEntity should be at offset 0x4B8");
		static_assert(offsetof(CS2::server::CSoundEventEntity, m_iszAttachmentName) == 0x4C0, "m_iszAttachmentName in CSoundEventEntity should be at offset 0x4C0");
		static_assert(offsetof(CS2::server::CSoundEventEntity, m_onGUIDChanged) == 0x4C8, "m_onGUIDChanged in CSoundEventEntity should be at offset 0x4C8");
		static_assert(offsetof(CS2::server::CSoundEventEntity, m_onSoundFinished) == 0x4E8, "m_onSoundFinished in CSoundEventEntity should be at offset 0x4E8");
		static_assert(offsetof(CS2::server::CSoundEventEntity, m_flClientCullRadius) == 0x500, "m_flClientCullRadius in CSoundEventEntity should be at offset 0x500");
		static_assert(offsetof(CS2::server::CSoundEventEntity, m_iszSoundName) == 0x530, "m_iszSoundName in CSoundEventEntity should be at offset 0x530");
		static_assert(offsetof(CS2::server::CSoundEventEntity, m_hSource) == 0x54C, "m_hSource in CSoundEventEntity should be at offset 0x54C");
		static_assert(offsetof(CS2::server::CSoundEventEntity, m_nEntityIndexSelection) == 0x550, "m_nEntityIndexSelection in CSoundEventEntity should be at offset 0x550");
		static_assert(sizeof(CS2::server::CSoundEventEntity) == 0x558, "CSoundEventEntity size should be 0x558");
	}
}
