// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#ifndef CUSTOM_GLOBAL_TYPES
	#include <SDK/GlobalTypes.hpp>
#else
	#include <Custom/GlobalTypes.hpp>
#endif


#include <SDK/server/CBaseModelEntity.hpp>





using namespace GlobalTypes;
namespace CS2 {
	namespace server {
		class CSpotlightEnd : public CS2::server::CBaseModelEntity {
		public:
			float32 m_flLightScale; // 0x7d8 | Schema_Builtin | Size: 0x4
			float32 m_Radius; // 0x7dc | Schema_Builtin | Size: 0x4
			GlobalTypes::Vector m_vSpotlightDir; // 0x7e0 | Schema_Atomic | Size: 0xc
			GlobalTypes::VectorWS m_vSpotlightOrg; // 0x7ec | Schema_Atomic | Size: 0xc
		};
		static_assert(offsetof(CS2::server::CSpotlightEnd, m_flLightScale) == 0x7D8, "m_flLightScale in CSpotlightEnd should be at offset 0x7D8");
		static_assert(offsetof(CS2::server::CSpotlightEnd, m_Radius) == 0x7DC, "m_Radius in CSpotlightEnd should be at offset 0x7DC");
		static_assert(offsetof(CS2::server::CSpotlightEnd, m_vSpotlightDir) == 0x7E0, "m_vSpotlightDir in CSpotlightEnd should be at offset 0x7E0");
		static_assert(offsetof(CS2::server::CSpotlightEnd, m_vSpotlightOrg) == 0x7EC, "m_vSpotlightOrg in CSpotlightEnd should be at offset 0x7EC");
		static_assert(sizeof(CS2::server::CSpotlightEnd) == 0x7F8, "CSpotlightEnd size should be 0x7F8");
	}
}
