// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#include <SDK/GlobalTypes.hpp>

#include <SDK/server/CBaseModelEntity.hpp>



namespace CS2 {
	namespace server {
		class CSpotlightEnd : public CS2::server::CBaseModelEntity {
		public:
			float32 m_flLightScale; // 0x7e8 | Schema_Builtin | Size: 0x4
			float32 m_Radius; // 0x7ec | Schema_Builtin | Size: 0x4
			GlobalTypes::Vector m_vSpotlightDir; // 0x7f0 | Schema_Atomic | Size: 0xc
			GlobalTypes::Vector m_vSpotlightOrg; // 0x7fc | Schema_Atomic | Size: 0xc
		};
		static_assert(offsetof(CS2::server::CSpotlightEnd, m_flLightScale) == 0x7E8, "m_flLightScale in CSpotlightEnd should be at offset 0x7E8");
		static_assert(offsetof(CS2::server::CSpotlightEnd, m_Radius) == 0x7EC, "m_Radius in CSpotlightEnd should be at offset 0x7EC");
		static_assert(offsetof(CS2::server::CSpotlightEnd, m_vSpotlightDir) == 0x7F0, "m_vSpotlightDir in CSpotlightEnd should be at offset 0x7F0");
		static_assert(offsetof(CS2::server::CSpotlightEnd, m_vSpotlightOrg) == 0x7FC, "m_vSpotlightOrg in CSpotlightEnd should be at offset 0x7FC");
		static_assert(sizeof(CS2::server::CSpotlightEnd) == 0x808, "CSpotlightEnd size should be 0x808");
	}
}
