// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#ifndef CUSTOM_GLOBAL_TYPES
	#include "../GlobalTypes.hpp"
#else
	#include "../Custom/GlobalTypes.hpp"
#endif


#include "CPointEntity.hpp"



namespace CS2 {
	namespace server {
		class CFuncTrackTrain;
		class CBaseEntity;
	}
}


using namespace GlobalTypes;
namespace CS2 {
	namespace server {
		class CTankTrainAI : public CS2::server::CPointEntity {
		public:
			GlobalTypes::CHandle<server::CFuncTrackTrain> m_hTrain; // 0x4a8 | Schema_Atomic | Size: 0x4
			// char m_hTrain[0x4]; // 0x4a8 | Schema_Atomic | Size: 0x4
			GlobalTypes::CHandle<server::CBaseEntity> m_hTargetEntity; // 0x4ac | Schema_Atomic | Size: 0x4
			// char m_hTargetEntity[0x4]; // 0x4ac | Schema_Atomic | Size: 0x4
			int32_t m_soundPlaying; // 0x4b0 | Schema_Builtin | Size: 0x4
			S2_PAD(0x14);
			GlobalTypes::CUtlSymbolLarge m_startSoundName; // 0x4c8 | Schema_Atomic | Size: 0x8
			GlobalTypes::CUtlSymbolLarge m_engineSoundName; // 0x4d0 | Schema_Atomic | Size: 0x8
			GlobalTypes::CUtlSymbolLarge m_movementSoundName; // 0x4d8 | Schema_Atomic | Size: 0x8
			GlobalTypes::CUtlSymbolLarge m_targetEntityName; // 0x4e0 | Schema_Atomic | Size: 0x8
		};
#ifdef USE_STATIC_ASSERTS
		static_assert(offsetof(CS2::server::CTankTrainAI, m_hTrain) == 0x4A8, "m_hTrain in CTankTrainAI should be at offset 0x4A8");
		static_assert(offsetof(CS2::server::CTankTrainAI, m_hTargetEntity) == 0x4AC, "m_hTargetEntity in CTankTrainAI should be at offset 0x4AC");
		static_assert(offsetof(CS2::server::CTankTrainAI, m_soundPlaying) == 0x4B0, "m_soundPlaying in CTankTrainAI should be at offset 0x4B0");
		static_assert(offsetof(CS2::server::CTankTrainAI, m_startSoundName) == 0x4C8, "m_startSoundName in CTankTrainAI should be at offset 0x4C8");
		static_assert(offsetof(CS2::server::CTankTrainAI, m_engineSoundName) == 0x4D0, "m_engineSoundName in CTankTrainAI should be at offset 0x4D0");
		static_assert(offsetof(CS2::server::CTankTrainAI, m_movementSoundName) == 0x4D8, "m_movementSoundName in CTankTrainAI should be at offset 0x4D8");
		static_assert(offsetof(CS2::server::CTankTrainAI, m_targetEntityName) == 0x4E0, "m_targetEntityName in CTankTrainAI should be at offset 0x4E0");
		static_assert(sizeof(CS2::server::CTankTrainAI) == 0x4E8, "CTankTrainAI size should be 0x4E8");

#endif
	}
}
