// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#ifndef CUSTOM_GLOBAL_TYPES
	#include <SDK/GlobalTypes.hpp>
#else
	#include <Custom/GlobalTypes.hpp>
#endif


#include <SDK/server/CLogicalEntity.hpp>
#include <SDK/entity2/CEntityIOOutput.hpp>





using namespace GlobalTypes;
namespace CS2 {
	namespace server {
		class CTimerEntity : public CS2::server::CLogicalEntity {
		public:
			entity2::CEntityIOOutput m_OnTimer; // 0x4a8 | Schema_DeclaredClass | Size: 0x18
			entity2::CEntityIOOutput m_OnTimerHigh; // 0x4c0 | Schema_DeclaredClass | Size: 0x18
			entity2::CEntityIOOutput m_OnTimerLow; // 0x4d8 | Schema_DeclaredClass | Size: 0x18
			int32_t m_iDisabled; // 0x4f0 | Schema_Builtin | Size: 0x4
			float32 m_flInitialDelay; // 0x4f4 | Schema_Builtin | Size: 0x4
			float32 m_flRefireTime; // 0x4f8 | Schema_Builtin | Size: 0x4
			bool m_bUpDownState; // 0x4fc | Schema_Builtin | Size: 0x1
			S2_PAD(0x3);
			int32_t m_iUseRandomTime; // 0x500 | Schema_Builtin | Size: 0x4
			bool m_bPauseAfterFiring; // 0x504 | Schema_Builtin | Size: 0x1
			S2_PAD(0x3);
			float32 m_flLowerRandomBound; // 0x508 | Schema_Builtin | Size: 0x4
			float32 m_flUpperRandomBound; // 0x50c | Schema_Builtin | Size: 0x4
			float32 m_flRemainingTime; // 0x510 | Schema_Builtin | Size: 0x4
			bool m_bPaused; // 0x514 | Schema_Builtin | Size: 0x1
			S2_PAD(0x3); // End padding
		};
		static_assert(offsetof(CS2::server::CTimerEntity, m_OnTimer) == 0x4A8, "m_OnTimer in CTimerEntity should be at offset 0x4A8");
		static_assert(offsetof(CS2::server::CTimerEntity, m_OnTimerHigh) == 0x4C0, "m_OnTimerHigh in CTimerEntity should be at offset 0x4C0");
		static_assert(offsetof(CS2::server::CTimerEntity, m_OnTimerLow) == 0x4D8, "m_OnTimerLow in CTimerEntity should be at offset 0x4D8");
		static_assert(offsetof(CS2::server::CTimerEntity, m_iDisabled) == 0x4F0, "m_iDisabled in CTimerEntity should be at offset 0x4F0");
		static_assert(offsetof(CS2::server::CTimerEntity, m_flInitialDelay) == 0x4F4, "m_flInitialDelay in CTimerEntity should be at offset 0x4F4");
		static_assert(offsetof(CS2::server::CTimerEntity, m_flRefireTime) == 0x4F8, "m_flRefireTime in CTimerEntity should be at offset 0x4F8");
		static_assert(offsetof(CS2::server::CTimerEntity, m_bUpDownState) == 0x4FC, "m_bUpDownState in CTimerEntity should be at offset 0x4FC");
		static_assert(offsetof(CS2::server::CTimerEntity, m_iUseRandomTime) == 0x500, "m_iUseRandomTime in CTimerEntity should be at offset 0x500");
		static_assert(offsetof(CS2::server::CTimerEntity, m_bPauseAfterFiring) == 0x504, "m_bPauseAfterFiring in CTimerEntity should be at offset 0x504");
		static_assert(offsetof(CS2::server::CTimerEntity, m_flLowerRandomBound) == 0x508, "m_flLowerRandomBound in CTimerEntity should be at offset 0x508");
		static_assert(offsetof(CS2::server::CTimerEntity, m_flUpperRandomBound) == 0x50C, "m_flUpperRandomBound in CTimerEntity should be at offset 0x50C");
		static_assert(offsetof(CS2::server::CTimerEntity, m_flRemainingTime) == 0x510, "m_flRemainingTime in CTimerEntity should be at offset 0x510");
		static_assert(offsetof(CS2::server::CTimerEntity, m_bPaused) == 0x514, "m_bPaused in CTimerEntity should be at offset 0x514");
		static_assert(sizeof(CS2::server::CTimerEntity) == 0x518, "CTimerEntity size should be 0x518");
	}
}
