// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#ifndef CUSTOM_GLOBAL_TYPES
	#include "../GlobalTypes.hpp"
#else
	#include "../Custom/GlobalTypes.hpp"
#endif


#include "CBaseEntity.hpp"





using namespace GlobalTypes;
namespace CS2 {
	namespace server {
		class CTonemapController2 : public CS2::server::CBaseEntity {
		public:
			float32 m_flAutoExposureMin; // 0x4a8 | Schema_Builtin | Size: 0x4
			float32 m_flAutoExposureMax; // 0x4ac | Schema_Builtin | Size: 0x4
			float32 m_flExposureAdaptationSpeedUp; // 0x4b0 | Schema_Builtin | Size: 0x4
			float32 m_flExposureAdaptationSpeedDown; // 0x4b4 | Schema_Builtin | Size: 0x4
			float32 m_flTonemapEVSmoothingRange; // 0x4b8 | Schema_Builtin | Size: 0x4
			S2_PAD(0x4); // End padding
		};
		static_assert(offsetof(CS2::server::CTonemapController2, m_flAutoExposureMin) == 0x4A8, "m_flAutoExposureMin in CTonemapController2 should be at offset 0x4A8");
		static_assert(offsetof(CS2::server::CTonemapController2, m_flAutoExposureMax) == 0x4AC, "m_flAutoExposureMax in CTonemapController2 should be at offset 0x4AC");
		static_assert(offsetof(CS2::server::CTonemapController2, m_flExposureAdaptationSpeedUp) == 0x4B0, "m_flExposureAdaptationSpeedUp in CTonemapController2 should be at offset 0x4B0");
		static_assert(offsetof(CS2::server::CTonemapController2, m_flExposureAdaptationSpeedDown) == 0x4B4, "m_flExposureAdaptationSpeedDown in CTonemapController2 should be at offset 0x4B4");
		static_assert(offsetof(CS2::server::CTonemapController2, m_flTonemapEVSmoothingRange) == 0x4B8, "m_flTonemapEVSmoothingRange in CTonemapController2 should be at offset 0x4B8");
		static_assert(sizeof(CS2::server::CTonemapController2) == 0x4C0, "CTonemapController2 size should be 0x4C0");
	}
}
