// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#include <SDK/GlobalTypes.hpp>

#include <SDK/server/CBaseTrigger.hpp>



namespace CS2 {
	namespace server {
		class CPathSimple;
	}
}
namespace CS2 {
	namespace server {
		class CTriggerPush : public CS2::server::CBaseTrigger {
		public:
			GlobalTypes::QAngle m_angPushEntitySpace; // 0x9c0 | Schema_Atomic | Size: 0xc
			GlobalTypes::Vector m_vecPushDirEntitySpace; // 0x9cc | Schema_Atomic | Size: 0xc
			bool m_bTriggerOnStartTouch; // 0x9d8 | Schema_Builtin | Size: 0x1
			bool m_bUsePathSimple; // 0x9d9 | Schema_Builtin | Size: 0x1
			S2_PAD(0x6);
			GlobalTypes::CUtlSymbolLarge m_iszPathSimpleName; // 0x9e0 | Schema_Atomic | Size: 0x8
			server::CPathSimple* m_PathSimple; // 0x9e8 | Schema_Ptr | Size: 0x8
			uint32_t m_splinePushType; // 0x9f0 | Schema_Builtin | Size: 0x4
			S2_PAD(0x4); // End padding
		};
		static_assert(offsetof(CS2::server::CTriggerPush, m_angPushEntitySpace) == 0x9C0, "m_angPushEntitySpace in CTriggerPush should be at offset 0x9C0");
		static_assert(offsetof(CS2::server::CTriggerPush, m_vecPushDirEntitySpace) == 0x9CC, "m_vecPushDirEntitySpace in CTriggerPush should be at offset 0x9CC");
		static_assert(offsetof(CS2::server::CTriggerPush, m_bTriggerOnStartTouch) == 0x9D8, "m_bTriggerOnStartTouch in CTriggerPush should be at offset 0x9D8");
		static_assert(offsetof(CS2::server::CTriggerPush, m_bUsePathSimple) == 0x9D9, "m_bUsePathSimple in CTriggerPush should be at offset 0x9D9");
		static_assert(offsetof(CS2::server::CTriggerPush, m_iszPathSimpleName) == 0x9E0, "m_iszPathSimpleName in CTriggerPush should be at offset 0x9E0");
		static_assert(offsetof(CS2::server::CTriggerPush, m_PathSimple) == 0x9E8, "m_PathSimple in CTriggerPush should be at offset 0x9E8");
		static_assert(offsetof(CS2::server::CTriggerPush, m_splinePushType) == 0x9F0, "m_splinePushType in CTriggerPush should be at offset 0x9F0");
		static_assert(sizeof(CS2::server::CTriggerPush) == 0x9F8, "CTriggerPush size should be 0x9F8");
	}
}
