// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#ifndef CUSTOM_GLOBAL_TYPES
	#include <SDK/GlobalTypes.hpp>
#else
	#include <Custom/GlobalTypes.hpp>
#endif


#include <SDK/server/CBaseModelEntity.hpp>
#include <SDK/entity2/CEntityIOOutput.hpp>





using namespace GlobalTypes;
namespace CS2 {
	namespace server {
		class CTriggerBrush : public CS2::server::CBaseModelEntity {
		public:
			entity2::CEntityIOOutput m_OnStartTouch; // 0x7d8 | Schema_DeclaredClass | Size: 0x28
			entity2::CEntityIOOutput m_OnEndTouch; // 0x800 | Schema_DeclaredClass | Size: 0x28
			entity2::CEntityIOOutput m_OnUse; // 0x828 | Schema_DeclaredClass | Size: 0x28
			int32_t m_iInputFilter; // 0x850 | Schema_Builtin | Size: 0x4
			int32_t m_iDontMessageParent; // 0x854 | Schema_Builtin | Size: 0x4
		};
		static_assert(offsetof(CS2::server::CTriggerBrush, m_OnStartTouch) == 0x7D8, "m_OnStartTouch in CTriggerBrush should be at offset 0x7D8");
		static_assert(offsetof(CS2::server::CTriggerBrush, m_OnEndTouch) == 0x800, "m_OnEndTouch in CTriggerBrush should be at offset 0x800");
		static_assert(offsetof(CS2::server::CTriggerBrush, m_OnUse) == 0x828, "m_OnUse in CTriggerBrush should be at offset 0x828");
		static_assert(offsetof(CS2::server::CTriggerBrush, m_iInputFilter) == 0x850, "m_iInputFilter in CTriggerBrush should be at offset 0x850");
		static_assert(offsetof(CS2::server::CTriggerBrush, m_iDontMessageParent) == 0x854, "m_iDontMessageParent in CTriggerBrush should be at offset 0x854");
		static_assert(sizeof(CS2::server::CTriggerBrush) == 0x858, "CTriggerBrush size should be 0x858");
	}
}
