// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#include <SDK/GlobalTypes.hpp>

#include <SDK/server/CTriggerOnce.hpp>
#include <SDK/entity2/GameTime_t.hpp>
#include <SDK/entity2/CEntityIOOutput.hpp>



namespace CS2 {
	namespace server {
		class CTriggerLook : public CS2::server::CTriggerOnce {
		public:
			public:
			// server::CHandle< server::CBaseEntity > m_hLookTarget; // 0x9e0 | Schema_Atomic | Size: 0x4
			char  m_hLookTarget[0x4]; // 0x9e0 | Schema_Atomic | Size: 0x4
			float32 m_flFieldOfView; // 0x9e4 | Schema_Builtin | Size: 0x4
			float32 m_flLookTime; // 0x9e8 | Schema_Builtin | Size: 0x4
			float32 m_flLookTimeTotal; // 0x9ec | Schema_Builtin | Size: 0x4
			entity2::GameTime_t m_flLookTimeLast; // 0x9f0 | Schema_DeclaredClass | Size: 0x4
			float32 m_flTimeoutDuration; // 0x9f4 | Schema_Builtin | Size: 0x4
			bool m_bTimeoutFired; // 0x9f8 | Schema_Builtin | Size: 0x1
			bool m_bIsLooking; // 0x9f9 | Schema_Builtin | Size: 0x1
			bool m_b2DFOV; // 0x9fa | Schema_Builtin | Size: 0x1
			bool m_bUseVelocity; // 0x9fb | Schema_Builtin | Size: 0x1
			bool m_bTestOcclusion; // 0x9fc | Schema_Builtin | Size: 0x1
			bool m_bTestAllVisibleOcclusion; // 0x9fd | Schema_Builtin | Size: 0x1
			S2_PAD(0x2);
			entity2::CEntityIOOutput m_OnTimeout; // 0xa00 | Schema_DeclaredClass | Size: 0x28
			entity2::CEntityIOOutput m_OnStartLook; // 0xa28 | Schema_DeclaredClass | Size: 0x28
			entity2::CEntityIOOutput m_OnEndLook; // 0xa50 | Schema_DeclaredClass | Size: 0x28
		};
		static_assert(offsetof(CS2::server::CTriggerLook, m_hLookTarget) == 0x9E0, "m_hLookTarget in CTriggerLook should be at offset 0x9E0");
		static_assert(offsetof(CS2::server::CTriggerLook, m_flFieldOfView) == 0x9E4, "m_flFieldOfView in CTriggerLook should be at offset 0x9E4");
		static_assert(offsetof(CS2::server::CTriggerLook, m_flLookTime) == 0x9E8, "m_flLookTime in CTriggerLook should be at offset 0x9E8");
		static_assert(offsetof(CS2::server::CTriggerLook, m_flLookTimeTotal) == 0x9EC, "m_flLookTimeTotal in CTriggerLook should be at offset 0x9EC");
		static_assert(offsetof(CS2::server::CTriggerLook, m_flLookTimeLast) == 0x9F0, "m_flLookTimeLast in CTriggerLook should be at offset 0x9F0");
		static_assert(offsetof(CS2::server::CTriggerLook, m_flTimeoutDuration) == 0x9F4, "m_flTimeoutDuration in CTriggerLook should be at offset 0x9F4");
		static_assert(offsetof(CS2::server::CTriggerLook, m_bTimeoutFired) == 0x9F8, "m_bTimeoutFired in CTriggerLook should be at offset 0x9F8");
		static_assert(offsetof(CS2::server::CTriggerLook, m_bIsLooking) == 0x9F9, "m_bIsLooking in CTriggerLook should be at offset 0x9F9");
		static_assert(offsetof(CS2::server::CTriggerLook, m_b2DFOV) == 0x9FA, "m_b2DFOV in CTriggerLook should be at offset 0x9FA");
		static_assert(offsetof(CS2::server::CTriggerLook, m_bUseVelocity) == 0x9FB, "m_bUseVelocity in CTriggerLook should be at offset 0x9FB");
		static_assert(offsetof(CS2::server::CTriggerLook, m_bTestOcclusion) == 0x9FC, "m_bTestOcclusion in CTriggerLook should be at offset 0x9FC");
		static_assert(offsetof(CS2::server::CTriggerLook, m_bTestAllVisibleOcclusion) == 0x9FD, "m_bTestAllVisibleOcclusion in CTriggerLook should be at offset 0x9FD");
		static_assert(offsetof(CS2::server::CTriggerLook, m_OnTimeout) == 0xA00, "m_OnTimeout in CTriggerLook should be at offset 0xA00");
		static_assert(offsetof(CS2::server::CTriggerLook, m_OnStartLook) == 0xA28, "m_OnStartLook in CTriggerLook should be at offset 0xA28");
		static_assert(offsetof(CS2::server::CTriggerLook, m_OnEndLook) == 0xA50, "m_OnEndLook in CTriggerLook should be at offset 0xA50");
		static_assert(sizeof(CS2::server::CTriggerLook) == 0xA78, "CTriggerLook size should be 0xA78");
	}
}
