// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#ifndef CUSTOM_GLOBAL_TYPES
	#include "../GlobalTypes.hpp"
#else
	#include "../Custom/GlobalTypes.hpp"
#endif


#include "CTriggerMultiple.hpp"





using namespace GlobalTypes;
namespace CS2 {
	namespace server {
		class CTriggerImpact : public CS2::server::CTriggerMultiple {
		public:
			float32 m_flMagnitude; // 0x8a8 | Schema_Builtin | Size: 0x4
			float32 m_flNoise; // 0x8ac | Schema_Builtin | Size: 0x4
			float32 m_flViewkick; // 0x8b0 | Schema_Builtin | Size: 0x4
			S2_PAD(0x4);
			// GlobalTypes::CEntityOutputTemplate< Vector, Vector > m_pOutputForce; // 0x8b8 | Schema_Atomic | Size: 0x28
			char m_pOutputForce[0x28]; // 0x8b8 | Schema_Atomic | Size: 0x28
		};
		static_assert(offsetof(CS2::server::CTriggerImpact, m_flMagnitude) == 0x8A8, "m_flMagnitude in CTriggerImpact should be at offset 0x8A8");
		static_assert(offsetof(CS2::server::CTriggerImpact, m_flNoise) == 0x8AC, "m_flNoise in CTriggerImpact should be at offset 0x8AC");
		static_assert(offsetof(CS2::server::CTriggerImpact, m_flViewkick) == 0x8B0, "m_flViewkick in CTriggerImpact should be at offset 0x8B0");
		static_assert(offsetof(CS2::server::CTriggerImpact, m_pOutputForce) == 0x8B8, "m_pOutputForce in CTriggerImpact should be at offset 0x8B8");
		static_assert(sizeof(CS2::server::CTriggerImpact) == 0x8E0, "CTriggerImpact size should be 0x8E0");
	}
}
