// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#ifndef CUSTOM_GLOBAL_TYPES
	#include "../GlobalTypes.hpp"
#else
	#include "../Custom/GlobalTypes.hpp"
#endif


#include "CBaseTrigger.hpp"
#include "../modellib/AttachmentHandle_t.hpp"
#include "lerpdata_t.hpp"
#include "../entity2/CEntityIOOutput.hpp"



namespace CS2 {
	namespace server {
		class CBaseEntity;
	}
}


using namespace GlobalTypes;
namespace CS2 {
	namespace server {
		class CTriggerLerpObject : public CS2::server::CBaseTrigger {
		public:
			GlobalTypes::CUtlSymbolLarge m_iszLerpTarget; // 0x890 | Schema_Atomic | Size: 0x8
			GlobalTypes::CHandle<server::CBaseEntity> m_hLerpTarget; // 0x898 | Schema_Atomic | Size: 0x4
			// char m_hLerpTarget[0x4]; // 0x898 | Schema_Atomic | Size: 0x4
			S2_PAD(0x4);
			GlobalTypes::CUtlSymbolLarge m_iszLerpTargetAttachment; // 0x8a0 | Schema_Atomic | Size: 0x8
			modellib::AttachmentHandle_t m_hLerpTargetAttachment; // 0x8a8 | Schema_DeclaredClass | Size: 0x1
			S2_PAD(0x3);
			float32 m_flLerpDuration; // 0x8ac | Schema_Builtin | Size: 0x4
			bool m_bAttachedEntityWasParented; // 0x8b0 | Schema_Builtin | Size: 0x1
			bool m_bLerpRestoreMoveType; // 0x8b1 | Schema_Builtin | Size: 0x1
			bool m_bSingleLerpObject; // 0x8b2 | Schema_Builtin | Size: 0x1
			S2_PAD(0x5);
			GlobalTypes::CUtlVector<server::lerpdata_t> m_vecLerpingObjects; // 0x8b8 | Schema_Atomic | Size: 0x18
			// char m_vecLerpingObjects[0x18]; // 0x8b8 | Schema_Atomic | Size: 0x18
			GlobalTypes::CUtlSymbolLarge m_iszLerpEffect; // 0x8d0 | Schema_Atomic | Size: 0x8
			GlobalTypes::CUtlSymbolLarge m_iszLerpSound; // 0x8d8 | Schema_Atomic | Size: 0x8
			bool m_bAttachTouchingObject; // 0x8e0 | Schema_Builtin | Size: 0x1
			S2_PAD(0x3);
			GlobalTypes::CHandle<server::CBaseEntity> m_hEntityToWaitForDisconnect; // 0x8e4 | Schema_Atomic | Size: 0x4
			// char m_hEntityToWaitForDisconnect[0x4]; // 0x8e4 | Schema_Atomic | Size: 0x4
			entity2::CEntityIOOutput m_OnLerpStarted; // 0x8e8 | Schema_DeclaredClass | Size: 0x18
			entity2::CEntityIOOutput m_OnLerpFinished; // 0x900 | Schema_DeclaredClass | Size: 0x18
			entity2::CEntityIOOutput m_OnDetached; // 0x918 | Schema_DeclaredClass | Size: 0x18
		};
		static_assert(offsetof(CS2::server::CTriggerLerpObject, m_iszLerpTarget) == 0x890, "m_iszLerpTarget in CTriggerLerpObject should be at offset 0x890");
		static_assert(offsetof(CS2::server::CTriggerLerpObject, m_hLerpTarget) == 0x898, "m_hLerpTarget in CTriggerLerpObject should be at offset 0x898");
		static_assert(offsetof(CS2::server::CTriggerLerpObject, m_iszLerpTargetAttachment) == 0x8A0, "m_iszLerpTargetAttachment in CTriggerLerpObject should be at offset 0x8A0");
		static_assert(offsetof(CS2::server::CTriggerLerpObject, m_hLerpTargetAttachment) == 0x8A8, "m_hLerpTargetAttachment in CTriggerLerpObject should be at offset 0x8A8");
		static_assert(offsetof(CS2::server::CTriggerLerpObject, m_flLerpDuration) == 0x8AC, "m_flLerpDuration in CTriggerLerpObject should be at offset 0x8AC");
		static_assert(offsetof(CS2::server::CTriggerLerpObject, m_bAttachedEntityWasParented) == 0x8B0, "m_bAttachedEntityWasParented in CTriggerLerpObject should be at offset 0x8B0");
		static_assert(offsetof(CS2::server::CTriggerLerpObject, m_bLerpRestoreMoveType) == 0x8B1, "m_bLerpRestoreMoveType in CTriggerLerpObject should be at offset 0x8B1");
		static_assert(offsetof(CS2::server::CTriggerLerpObject, m_bSingleLerpObject) == 0x8B2, "m_bSingleLerpObject in CTriggerLerpObject should be at offset 0x8B2");
		static_assert(offsetof(CS2::server::CTriggerLerpObject, m_vecLerpingObjects) == 0x8B8, "m_vecLerpingObjects in CTriggerLerpObject should be at offset 0x8B8");
		static_assert(offsetof(CS2::server::CTriggerLerpObject, m_iszLerpEffect) == 0x8D0, "m_iszLerpEffect in CTriggerLerpObject should be at offset 0x8D0");
		static_assert(offsetof(CS2::server::CTriggerLerpObject, m_iszLerpSound) == 0x8D8, "m_iszLerpSound in CTriggerLerpObject should be at offset 0x8D8");
		static_assert(offsetof(CS2::server::CTriggerLerpObject, m_bAttachTouchingObject) == 0x8E0, "m_bAttachTouchingObject in CTriggerLerpObject should be at offset 0x8E0");
		static_assert(offsetof(CS2::server::CTriggerLerpObject, m_hEntityToWaitForDisconnect) == 0x8E4, "m_hEntityToWaitForDisconnect in CTriggerLerpObject should be at offset 0x8E4");
		static_assert(offsetof(CS2::server::CTriggerLerpObject, m_OnLerpStarted) == 0x8E8, "m_OnLerpStarted in CTriggerLerpObject should be at offset 0x8E8");
		static_assert(offsetof(CS2::server::CTriggerLerpObject, m_OnLerpFinished) == 0x900, "m_OnLerpFinished in CTriggerLerpObject should be at offset 0x900");
		static_assert(offsetof(CS2::server::CTriggerLerpObject, m_OnDetached) == 0x918, "m_OnDetached in CTriggerLerpObject should be at offset 0x918");
		static_assert(sizeof(CS2::server::CTriggerLerpObject) == 0x930, "CTriggerLerpObject size should be 0x930");
	}
}
