// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#include <SDK/GlobalTypes.hpp>

#include <SDK/server/CBaseTrigger.hpp>



namespace CS2 {
	namespace server {
		class CTriggerSndSosOpvar : public CS2::server::CBaseTrigger {
		public:
			public:
			// server::CUtlVector< server.dll::CHandle< CBaseEntity > > m_hTouchingPlayers; // 0x9b8 | Schema_Atomic | Size: 0x18
			char  m_hTouchingPlayers[0x18]; // 0x9b8 | Schema_Atomic | Size: 0x18
			GlobalTypes::Vector m_flPosition; // 0x9d0 | Schema_Atomic | Size: 0xc
			float32 m_flCenterSize; // 0x9dc | Schema_Builtin | Size: 0x4
			float32 m_flMinVal; // 0x9e0 | Schema_Builtin | Size: 0x4
			float32 m_flMaxVal; // 0x9e4 | Schema_Builtin | Size: 0x4
			GlobalTypes::CUtlSymbolLarge m_opvarName; // 0x9e8 | Schema_Atomic | Size: 0x8
			GlobalTypes::CUtlSymbolLarge m_stackName; // 0x9f0 | Schema_Atomic | Size: 0x8
			GlobalTypes::CUtlSymbolLarge m_operatorName; // 0x9f8 | Schema_Atomic | Size: 0x8
			bool m_bVolIs2D; // 0xa00 | Schema_Builtin | Size: 0x1
			char m_opvarNameChar[256]; // 0xa01 | Schema_FixedArray | Size: 0x100
			char m_stackNameChar[256]; // 0xb01 | Schema_FixedArray | Size: 0x100
			char m_operatorNameChar[256]; // 0xc01 | Schema_FixedArray | Size: 0x100
			S2_PAD(0x3);
			GlobalTypes::Vector m_VecNormPos; // 0xd04 | Schema_Atomic | Size: 0xc
			float32 m_flNormCenterSize; // 0xd10 | Schema_Builtin | Size: 0x4
			S2_PAD(0x4); // End padding
		};
		static_assert(offsetof(CS2::server::CTriggerSndSosOpvar, m_hTouchingPlayers) == 0x9B8, "m_hTouchingPlayers in CTriggerSndSosOpvar should be at offset 0x9B8");
		static_assert(offsetof(CS2::server::CTriggerSndSosOpvar, m_flPosition) == 0x9D0, "m_flPosition in CTriggerSndSosOpvar should be at offset 0x9D0");
		static_assert(offsetof(CS2::server::CTriggerSndSosOpvar, m_flCenterSize) == 0x9DC, "m_flCenterSize in CTriggerSndSosOpvar should be at offset 0x9DC");
		static_assert(offsetof(CS2::server::CTriggerSndSosOpvar, m_flMinVal) == 0x9E0, "m_flMinVal in CTriggerSndSosOpvar should be at offset 0x9E0");
		static_assert(offsetof(CS2::server::CTriggerSndSosOpvar, m_flMaxVal) == 0x9E4, "m_flMaxVal in CTriggerSndSosOpvar should be at offset 0x9E4");
		static_assert(offsetof(CS2::server::CTriggerSndSosOpvar, m_opvarName) == 0x9E8, "m_opvarName in CTriggerSndSosOpvar should be at offset 0x9E8");
		static_assert(offsetof(CS2::server::CTriggerSndSosOpvar, m_stackName) == 0x9F0, "m_stackName in CTriggerSndSosOpvar should be at offset 0x9F0");
		static_assert(offsetof(CS2::server::CTriggerSndSosOpvar, m_operatorName) == 0x9F8, "m_operatorName in CTriggerSndSosOpvar should be at offset 0x9F8");
		static_assert(offsetof(CS2::server::CTriggerSndSosOpvar, m_bVolIs2D) == 0xA00, "m_bVolIs2D in CTriggerSndSosOpvar should be at offset 0xA00");
		static_assert(offsetof(CS2::server::CTriggerSndSosOpvar, m_opvarNameChar) == 0xA01, "m_opvarNameChar in CTriggerSndSosOpvar should be at offset 0xA01");
		static_assert(offsetof(CS2::server::CTriggerSndSosOpvar, m_stackNameChar) == 0xB01, "m_stackNameChar in CTriggerSndSosOpvar should be at offset 0xB01");
		static_assert(offsetof(CS2::server::CTriggerSndSosOpvar, m_operatorNameChar) == 0xC01, "m_operatorNameChar in CTriggerSndSosOpvar should be at offset 0xC01");
		static_assert(offsetof(CS2::server::CTriggerSndSosOpvar, m_VecNormPos) == 0xD04, "m_VecNormPos in CTriggerSndSosOpvar should be at offset 0xD04");
		static_assert(offsetof(CS2::server::CTriggerSndSosOpvar, m_flNormCenterSize) == 0xD10, "m_flNormCenterSize in CTriggerSndSosOpvar should be at offset 0xD10");
		static_assert(sizeof(CS2::server::CTriggerSndSosOpvar) == 0xD18, "CTriggerSndSosOpvar size should be 0xD18");
	}
}
