// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#ifndef CUSTOM_GLOBAL_TYPES
	#include <SDK/GlobalTypes.hpp>
#else
	#include <Custom/GlobalTypes.hpp>
#endif


#include <SDK/server/CBaseTrigger.hpp>



namespace CS2 {
	namespace server {
		class CPathSimple;
	}
}


using namespace GlobalTypes;
namespace CS2 {
	namespace server {
		class CTriggerPush : public CS2::server::CBaseTrigger {
		public:
			GlobalTypes::QAngle m_angPushEntitySpace; // 0x9a8 | Schema_Atomic | Size: 0xc
			GlobalTypes::Vector m_vecPushDirEntitySpace; // 0x9b4 | Schema_Atomic | Size: 0xc
			bool m_bTriggerOnStartTouch; // 0x9c0 | Schema_Builtin | Size: 0x1
			bool m_bUsePathSimple; // 0x9c1 | Schema_Builtin | Size: 0x1
			S2_PAD(0x6);
			GlobalTypes::CUtlSymbolLarge m_iszPathSimpleName; // 0x9c8 | Schema_Atomic | Size: 0x8
			server::CPathSimple* m_PathSimple; // 0x9d0 | Schema_Ptr | Size: 0x8
			uint32_t m_splinePushType; // 0x9d8 | Schema_Builtin | Size: 0x4
			S2_PAD(0x4); // End padding
		};
		static_assert(offsetof(CS2::server::CTriggerPush, m_angPushEntitySpace) == 0x9A8, "m_angPushEntitySpace in CTriggerPush should be at offset 0x9A8");
		static_assert(offsetof(CS2::server::CTriggerPush, m_vecPushDirEntitySpace) == 0x9B4, "m_vecPushDirEntitySpace in CTriggerPush should be at offset 0x9B4");
		static_assert(offsetof(CS2::server::CTriggerPush, m_bTriggerOnStartTouch) == 0x9C0, "m_bTriggerOnStartTouch in CTriggerPush should be at offset 0x9C0");
		static_assert(offsetof(CS2::server::CTriggerPush, m_bUsePathSimple) == 0x9C1, "m_bUsePathSimple in CTriggerPush should be at offset 0x9C1");
		static_assert(offsetof(CS2::server::CTriggerPush, m_iszPathSimpleName) == 0x9C8, "m_iszPathSimpleName in CTriggerPush should be at offset 0x9C8");
		static_assert(offsetof(CS2::server::CTriggerPush, m_PathSimple) == 0x9D0, "m_PathSimple in CTriggerPush should be at offset 0x9D0");
		static_assert(offsetof(CS2::server::CTriggerPush, m_splinePushType) == 0x9D8, "m_splinePushType in CTriggerPush should be at offset 0x9D8");
		static_assert(sizeof(CS2::server::CTriggerPush) == 0x9E0, "CTriggerPush size should be 0x9E0");
	}
}
