// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#ifndef CUSTOM_GLOBAL_TYPES
	#include "../GlobalTypes.hpp"
#else
	#include "../Custom/GlobalTypes.hpp"
#endif


#include "CBaseEntity.hpp"
#include "CountdownTimer.hpp"



namespace CS2 {
	namespace server {
		class CBaseIssue;
	}
}


using namespace GlobalTypes;
namespace CS2 {
	namespace server {
		class CVoteController : public CS2::server::CBaseEntity {
		public:
			int32_t m_iActiveIssueIndex; // 0x4a8 | Schema_Builtin | Size: 0x4
			int32_t m_iOnlyTeamToVote; // 0x4ac | Schema_Builtin | Size: 0x4
			int32_t m_nVoteOptionCount[5]; // 0x4b0 | Schema_FixedArray | Size: 0x14
			int32_t m_nPotentialVotes; // 0x4c4 | Schema_Builtin | Size: 0x4
			bool m_bIsYesNoVote; // 0x4c8 | Schema_Builtin | Size: 0x1
			S2_PAD(0x7);
			server::CountdownTimer m_acceptingVotesTimer; // 0x4d0 | Schema_DeclaredClass | Size: 0x18
			server::CountdownTimer m_executeCommandTimer; // 0x4e8 | Schema_DeclaredClass | Size: 0x18
			server::CountdownTimer m_resetVoteTimer; // 0x500 | Schema_DeclaredClass | Size: 0x18
			int32_t m_nVotesCast[64]; // 0x518 | Schema_FixedArray | Size: 0x100
			GlobalTypes::CPlayerSlot m_playerHoldingVote; // 0x618 | Schema_Atomic | Size: 0x4
			GlobalTypes::CPlayerSlot m_playerOverrideForVote; // 0x61c | Schema_Atomic | Size: 0x4
			int32_t m_nHighestCountIndex; // 0x620 | Schema_Builtin | Size: 0x4
			S2_PAD(0x4);
			GlobalTypes::CUtlVector<server::CBaseIssue*> m_potentialIssues; // 0x628 | Schema_Atomic | Size: 0x18
			// char m_potentialIssues[0x18]; // 0x628 | Schema_Atomic | Size: 0x18
			GlobalTypes::CUtlVector<char*> m_VoteOptions; // 0x640 | Schema_Atomic | Size: 0x18
			// char m_VoteOptions[0x18]; // 0x640 | Schema_Atomic | Size: 0x18
		};
		static_assert(offsetof(CS2::server::CVoteController, m_iActiveIssueIndex) == 0x4A8, "m_iActiveIssueIndex in CVoteController should be at offset 0x4A8");
		static_assert(offsetof(CS2::server::CVoteController, m_iOnlyTeamToVote) == 0x4AC, "m_iOnlyTeamToVote in CVoteController should be at offset 0x4AC");
		static_assert(offsetof(CS2::server::CVoteController, m_nVoteOptionCount) == 0x4B0, "m_nVoteOptionCount in CVoteController should be at offset 0x4B0");
		static_assert(offsetof(CS2::server::CVoteController, m_nPotentialVotes) == 0x4C4, "m_nPotentialVotes in CVoteController should be at offset 0x4C4");
		static_assert(offsetof(CS2::server::CVoteController, m_bIsYesNoVote) == 0x4C8, "m_bIsYesNoVote in CVoteController should be at offset 0x4C8");
		static_assert(offsetof(CS2::server::CVoteController, m_acceptingVotesTimer) == 0x4D0, "m_acceptingVotesTimer in CVoteController should be at offset 0x4D0");
		static_assert(offsetof(CS2::server::CVoteController, m_executeCommandTimer) == 0x4E8, "m_executeCommandTimer in CVoteController should be at offset 0x4E8");
		static_assert(offsetof(CS2::server::CVoteController, m_resetVoteTimer) == 0x500, "m_resetVoteTimer in CVoteController should be at offset 0x500");
		static_assert(offsetof(CS2::server::CVoteController, m_nVotesCast) == 0x518, "m_nVotesCast in CVoteController should be at offset 0x518");
		static_assert(offsetof(CS2::server::CVoteController, m_playerHoldingVote) == 0x618, "m_playerHoldingVote in CVoteController should be at offset 0x618");
		static_assert(offsetof(CS2::server::CVoteController, m_playerOverrideForVote) == 0x61C, "m_playerOverrideForVote in CVoteController should be at offset 0x61C");
		static_assert(offsetof(CS2::server::CVoteController, m_nHighestCountIndex) == 0x620, "m_nHighestCountIndex in CVoteController should be at offset 0x620");
		static_assert(offsetof(CS2::server::CVoteController, m_potentialIssues) == 0x628, "m_potentialIssues in CVoteController should be at offset 0x628");
		static_assert(offsetof(CS2::server::CVoteController, m_VoteOptions) == 0x640, "m_VoteOptions in CVoteController should be at offset 0x640");
		static_assert(sizeof(CS2::server::CVoteController) == 0x658, "CVoteController size should be 0x658");
	}
}
