// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#ifndef CUSTOM_GLOBAL_TYPES
	#include <SDK/GlobalTypes.hpp>
#else
	#include <Custom/GlobalTypes.hpp>
#endif





namespace CS2 {
	namespace server {
		class DynamicVolumeDef_t  {
		public:
			// server::CHandle< server::CBaseEntity > m_source; // 0x0 | Schema_Atomic | Size: 0x4
			char  m_source[0x4]; // 0x0 | Schema_Atomic | Size: 0x4
			// server::CHandle< server::CBaseEntity > m_target; // 0x4 | Schema_Atomic | Size: 0x4
			char  m_target[0x4]; // 0x4 | Schema_Atomic | Size: 0x4
			int32_t m_nHullIdx; // 0x8 | Schema_Builtin | Size: 0x4
			GlobalTypes::Vector m_vSourceAnchorPos; // 0xc | Schema_Atomic | Size: 0xc
			GlobalTypes::Vector m_vTargetAnchorPos; // 0x18 | Schema_Atomic | Size: 0xc
			uint32_t m_nAreaSrc; // 0x24 | Schema_Builtin | Size: 0x4
			uint32_t m_nAreaDst; // 0x28 | Schema_Builtin | Size: 0x4
			bool m_bAttached; // 0x2c | Schema_Builtin | Size: 0x1
			S2_PAD(0x3); // End padding
		};
		static_assert(offsetof(CS2::server::DynamicVolumeDef_t, m_source) == 0x0, "m_source in DynamicVolumeDef_t should be at offset 0x0");
		static_assert(offsetof(CS2::server::DynamicVolumeDef_t, m_target) == 0x4, "m_target in DynamicVolumeDef_t should be at offset 0x4");
		static_assert(offsetof(CS2::server::DynamicVolumeDef_t, m_nHullIdx) == 0x8, "m_nHullIdx in DynamicVolumeDef_t should be at offset 0x8");
		static_assert(offsetof(CS2::server::DynamicVolumeDef_t, m_vSourceAnchorPos) == 0xC, "m_vSourceAnchorPos in DynamicVolumeDef_t should be at offset 0xC");
		static_assert(offsetof(CS2::server::DynamicVolumeDef_t, m_vTargetAnchorPos) == 0x18, "m_vTargetAnchorPos in DynamicVolumeDef_t should be at offset 0x18");
		static_assert(offsetof(CS2::server::DynamicVolumeDef_t, m_nAreaSrc) == 0x24, "m_nAreaSrc in DynamicVolumeDef_t should be at offset 0x24");
		static_assert(offsetof(CS2::server::DynamicVolumeDef_t, m_nAreaDst) == 0x28, "m_nAreaDst in DynamicVolumeDef_t should be at offset 0x28");
		static_assert(offsetof(CS2::server::DynamicVolumeDef_t, m_bAttached) == 0x2C, "m_bAttached in DynamicVolumeDef_t should be at offset 0x2C");
		static_assert(sizeof(CS2::server::DynamicVolumeDef_t) == 0x30, "DynamicVolumeDef_t size should be 0x30");
	}
}
