// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#ifndef CUSTOM_GLOBAL_TYPES
	#include <SDK/GlobalTypes.hpp>
#else
	#include <Custom/GlobalTypes.hpp>
#endif


#include <SDK/animationsystem/HSequence.hpp>
#include <SDK/entity2/GameTime_t.hpp>
#include <SDK/client/AnimLoopMode_t.hpp>



namespace CS2 {
	namespace server {
		class SequenceHistory_t  {
		public:
			animationsystem::HSequence m_hSequence; // 0x0 | Schema_DeclaredClass | Size: 0x4
			entity2::GameTime_t m_flSeqStartTime; // 0x4 | Schema_DeclaredClass | Size: 0x4
			float32 m_flSeqFixedCycle; // 0x8 | Schema_Builtin | Size: 0x4
			client::AnimLoopMode_t m_nSeqLoopMode; // 0xc | Schema_DeclaredEnum | Size: 0x4
			float32 m_flPlaybackRate; // 0x10 | Schema_Builtin | Size: 0x4
			float32 m_flCyclesPerSecond; // 0x14 | Schema_Builtin | Size: 0x4
		};
		static_assert(offsetof(CS2::server::SequenceHistory_t, m_hSequence) == 0x0, "m_hSequence in SequenceHistory_t should be at offset 0x0");
		static_assert(offsetof(CS2::server::SequenceHistory_t, m_flSeqStartTime) == 0x4, "m_flSeqStartTime in SequenceHistory_t should be at offset 0x4");
		static_assert(offsetof(CS2::server::SequenceHistory_t, m_flSeqFixedCycle) == 0x8, "m_flSeqFixedCycle in SequenceHistory_t should be at offset 0x8");
		static_assert(offsetof(CS2::server::SequenceHistory_t, m_nSeqLoopMode) == 0xC, "m_nSeqLoopMode in SequenceHistory_t should be at offset 0xC");
		static_assert(offsetof(CS2::server::SequenceHistory_t, m_flPlaybackRate) == 0x10, "m_flPlaybackRate in SequenceHistory_t should be at offset 0x10");
		static_assert(offsetof(CS2::server::SequenceHistory_t, m_flCyclesPerSecond) == 0x14, "m_flCyclesPerSecond in SequenceHistory_t should be at offset 0x14");
		static_assert(sizeof(CS2::server::SequenceHistory_t) == 0x18, "SequenceHistory_t size should be 0x18");
	}
}
