// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#ifndef CUSTOM_GLOBAL_TYPES
	#include <SDK/GlobalTypes.hpp>
#else
	#include <Custom/GlobalTypes.hpp>
#endif







using namespace GlobalTypes;
namespace CS2 {
	namespace server {
		class SimpleConstraintSoundProfile  {
		public:
			S2_PAD(0x8);
			float32 m_flKeyPointMinSoundThreshold; // 0x8 | Schema_Builtin | Size: 0x4
			float32 m_flKeyPointMaxSoundThreshold; // 0xc | Schema_Builtin | Size: 0x4
			float32 m_reversalSoundThresholdSmall; // 0x10 | Schema_Builtin | Size: 0x4
			float32 m_reversalSoundThresholdMedium; // 0x14 | Schema_Builtin | Size: 0x4
			float32 m_reversalSoundThresholdLarge; // 0x18 | Schema_Builtin | Size: 0x4
			S2_PAD(0x4); // End padding
		};
		static_assert(offsetof(CS2::server::SimpleConstraintSoundProfile, m_flKeyPointMinSoundThreshold) == 0x8, "m_flKeyPointMinSoundThreshold in SimpleConstraintSoundProfile should be at offset 0x8");
		static_assert(offsetof(CS2::server::SimpleConstraintSoundProfile, m_flKeyPointMaxSoundThreshold) == 0xC, "m_flKeyPointMaxSoundThreshold in SimpleConstraintSoundProfile should be at offset 0xC");
		static_assert(offsetof(CS2::server::SimpleConstraintSoundProfile, m_reversalSoundThresholdSmall) == 0x10, "m_reversalSoundThresholdSmall in SimpleConstraintSoundProfile should be at offset 0x10");
		static_assert(offsetof(CS2::server::SimpleConstraintSoundProfile, m_reversalSoundThresholdMedium) == 0x14, "m_reversalSoundThresholdMedium in SimpleConstraintSoundProfile should be at offset 0x14");
		static_assert(offsetof(CS2::server::SimpleConstraintSoundProfile, m_reversalSoundThresholdLarge) == 0x18, "m_reversalSoundThresholdLarge in SimpleConstraintSoundProfile should be at offset 0x18");
		static_assert(sizeof(CS2::server::SimpleConstraintSoundProfile) == 0x20, "SimpleConstraintSoundProfile size should be 0x20");
	}
}
