// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#include <SDK/GlobalTypes.hpp>

#include <SDK/server/fogparams_t.hpp>



namespace CS2 {
	namespace server {
		class sky3dparams_t  {
		public:
			S2_PAD(0x8);
			int16_t scale; // 0x8 | Schema_Builtin | Size: 0x2
			S2_PAD(0x2);
			GlobalTypes::Vector origin; // 0xc | Schema_Atomic | Size: 0xc
			bool bClip3DSkyBoxNearToWorldFar; // 0x18 | Schema_Builtin | Size: 0x1
			S2_PAD(0x3);
			float32 flClip3DSkyBoxNearToWorldFarOffset; // 0x1c | Schema_Builtin | Size: 0x4
			server::fogparams_t fog; // 0x20 | Schema_DeclaredClass | Size: 0x68
			GlobalTypes::WorldGroupId_t m_nWorldGroupID; // 0x88 | Schema_Atomic | Size: 0x4
			S2_PAD(0x4); // End padding
		};
		static_assert(offsetof(CS2::server::sky3dparams_t, scale) == 0x8, "scale in sky3dparams_t should be at offset 0x8");
		static_assert(offsetof(CS2::server::sky3dparams_t, origin) == 0xC, "origin in sky3dparams_t should be at offset 0xC");
		static_assert(offsetof(CS2::server::sky3dparams_t, bClip3DSkyBoxNearToWorldFar) == 0x18, "bClip3DSkyBoxNearToWorldFar in sky3dparams_t should be at offset 0x18");
		static_assert(offsetof(CS2::server::sky3dparams_t, flClip3DSkyBoxNearToWorldFarOffset) == 0x1C, "flClip3DSkyBoxNearToWorldFarOffset in sky3dparams_t should be at offset 0x1C");
		static_assert(offsetof(CS2::server::sky3dparams_t, fog) == 0x20, "fog in sky3dparams_t should be at offset 0x20");
		static_assert(offsetof(CS2::server::sky3dparams_t, m_nWorldGroupID) == 0x88, "m_nWorldGroupID in sky3dparams_t should be at offset 0x88");
		static_assert(sizeof(CS2::server::sky3dparams_t) == 0x90, "sky3dparams_t size should be 0x90");
	}
}
