// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#include <SDK/GlobalTypes.hpp>

#include <SDK/scenesystem/SceneViewId_t.hpp>



namespace CS2 {
	namespace scenesystem {
		class CSSDSMsg_LayerBase  {
		public:
			scenesystem::SceneViewId_t m_viewId; // 0x0 | Schema_DeclaredClass | Size: 0x10
			GlobalTypes::CUtlString m_ViewName; // 0x10 | Schema_Atomic | Size: 0x8
			uint64_t m_nLayerId; // 0x18 | Schema_Builtin | Size: 0x8
			GlobalTypes::CUtlString m_LayerName; // 0x20 | Schema_Atomic | Size: 0x8
			GlobalTypes::CUtlString m_displayText; // 0x28 | Schema_Atomic | Size: 0x8
		};
		static_assert(offsetof(CS2::scenesystem::CSSDSMsg_LayerBase, m_viewId) == 0x0, "m_viewId in CSSDSMsg_LayerBase should be at offset 0x0");
		static_assert(offsetof(CS2::scenesystem::CSSDSMsg_LayerBase, m_ViewName) == 0x10, "m_ViewName in CSSDSMsg_LayerBase should be at offset 0x10");
		static_assert(offsetof(CS2::scenesystem::CSSDSMsg_LayerBase, m_nLayerId) == 0x18, "m_nLayerId in CSSDSMsg_LayerBase should be at offset 0x18");
		static_assert(offsetof(CS2::scenesystem::CSSDSMsg_LayerBase, m_LayerName) == 0x20, "m_LayerName in CSSDSMsg_LayerBase should be at offset 0x20");
		static_assert(offsetof(CS2::scenesystem::CSSDSMsg_LayerBase, m_displayText) == 0x28, "m_displayText in CSSDSMsg_LayerBase should be at offset 0x28");
		static_assert(sizeof(CS2::scenesystem::CSSDSMsg_LayerBase) == 0x30, "CSSDSMsg_LayerBase size should be 0x30");
	}
}
