// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#ifndef CUSTOM_GLOBAL_TYPES
	#include <SDK/GlobalTypes.hpp>
#else
	#include <Custom/GlobalTypes.hpp>
#endif





namespace CS2 {
	namespace scenesystem {
		class CSSDSMsg_ViewTarget  {
		public:
			GlobalTypes::CUtlString m_Name; // 0x0 | Schema_Atomic | Size: 0x8
			uint64_t m_TextureId; // 0x8 | Schema_Builtin | Size: 0x8
			int32_t m_nWidth; // 0x10 | Schema_Builtin | Size: 0x4
			int32_t m_nHeight; // 0x14 | Schema_Builtin | Size: 0x4
			int32_t m_nRequestedWidth; // 0x18 | Schema_Builtin | Size: 0x4
			int32_t m_nRequestedHeight; // 0x1c | Schema_Builtin | Size: 0x4
			int32_t m_nNumMipLevels; // 0x20 | Schema_Builtin | Size: 0x4
			int32_t m_nDepth; // 0x24 | Schema_Builtin | Size: 0x4
			int32_t m_nMultisampleNumSamples; // 0x28 | Schema_Builtin | Size: 0x4
			int32_t m_nFormat; // 0x2c | Schema_Builtin | Size: 0x4
		};
		static_assert(offsetof(CS2::scenesystem::CSSDSMsg_ViewTarget, m_Name) == 0x0, "m_Name in CSSDSMsg_ViewTarget should be at offset 0x0");
		static_assert(offsetof(CS2::scenesystem::CSSDSMsg_ViewTarget, m_TextureId) == 0x8, "m_TextureId in CSSDSMsg_ViewTarget should be at offset 0x8");
		static_assert(offsetof(CS2::scenesystem::CSSDSMsg_ViewTarget, m_nWidth) == 0x10, "m_nWidth in CSSDSMsg_ViewTarget should be at offset 0x10");
		static_assert(offsetof(CS2::scenesystem::CSSDSMsg_ViewTarget, m_nHeight) == 0x14, "m_nHeight in CSSDSMsg_ViewTarget should be at offset 0x14");
		static_assert(offsetof(CS2::scenesystem::CSSDSMsg_ViewTarget, m_nRequestedWidth) == 0x18, "m_nRequestedWidth in CSSDSMsg_ViewTarget should be at offset 0x18");
		static_assert(offsetof(CS2::scenesystem::CSSDSMsg_ViewTarget, m_nRequestedHeight) == 0x1C, "m_nRequestedHeight in CSSDSMsg_ViewTarget should be at offset 0x1C");
		static_assert(offsetof(CS2::scenesystem::CSSDSMsg_ViewTarget, m_nNumMipLevels) == 0x20, "m_nNumMipLevels in CSSDSMsg_ViewTarget should be at offset 0x20");
		static_assert(offsetof(CS2::scenesystem::CSSDSMsg_ViewTarget, m_nDepth) == 0x24, "m_nDepth in CSSDSMsg_ViewTarget should be at offset 0x24");
		static_assert(offsetof(CS2::scenesystem::CSSDSMsg_ViewTarget, m_nMultisampleNumSamples) == 0x28, "m_nMultisampleNumSamples in CSSDSMsg_ViewTarget should be at offset 0x28");
		static_assert(offsetof(CS2::scenesystem::CSSDSMsg_ViewTarget, m_nFormat) == 0x2C, "m_nFormat in CSSDSMsg_ViewTarget should be at offset 0x2C");
		static_assert(sizeof(CS2::scenesystem::CSSDSMsg_ViewTarget) == 0x30, "CSSDSMsg_ViewTarget size should be 0x30");
	}
}
