// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#ifndef CUSTOM_GLOBAL_TYPES
	#include <SDK/GlobalTypes.hpp>
#else
	#include <Custom/GlobalTypes.hpp>
#endif


#include <SDK/animationsystem/AnimationSnapshotType_t.hpp>
#include <SDK/animationsystem/AnimationDecodeDebugDumpElement_t.hpp>





using namespace GlobalTypes;
namespace CS2 {
	namespace animationsystem {
		class AnimationSnapshotBase_t  {
		public:
			float32 m_flRealTime; // 0x0 | Schema_Builtin | Size: 0x4
			S2_PAD(0xc);
			GlobalTypes::matrix3x4a_t m_rootToWorld; // 0x10 | Schema_Atomic | Size: 0x30
			bool m_bBonesInWorldSpace; // 0x40 | Schema_Builtin | Size: 0x1
			S2_PAD(0x7);
			GlobalTypes::CUtlVector< uint32 > m_boneSetupMask; // 0x48 | Schema_Atomic | Size: 0x18
			// char  m_boneSetupMask[0x18]; // 0x48 | Schema_Atomic | Size: 0x18
			GlobalTypes::CUtlVector<GlobalTypes::matrix3x4a_t> m_boneTransforms; // 0x60 | Schema_Atomic | Size: 0x18
			// char  m_boneTransforms[0x18]; // 0x60 | Schema_Atomic | Size: 0x18
			GlobalTypes::CUtlVector< float32 > m_flexControllers; // 0x78 | Schema_Atomic | Size: 0x18
			// char  m_flexControllers[0x18]; // 0x78 | Schema_Atomic | Size: 0x18
			animationsystem::AnimationSnapshotType_t m_SnapshotType; // 0x90 | Schema_DeclaredEnum | Size: 0x4
			bool m_bHasDecodeDump; // 0x94 | Schema_Builtin | Size: 0x1
			S2_PAD(0x3);
			animationsystem::AnimationDecodeDebugDumpElement_t m_DecodeDump; // 0x98 | Schema_DeclaredClass | Size: 0x70
			S2_PAD(0x8); // End padding
		};
		static_assert(offsetof(CS2::animationsystem::AnimationSnapshotBase_t, m_flRealTime) == 0x0, "m_flRealTime in AnimationSnapshotBase_t should be at offset 0x0");
		static_assert(offsetof(CS2::animationsystem::AnimationSnapshotBase_t, m_rootToWorld) == 0x10, "m_rootToWorld in AnimationSnapshotBase_t should be at offset 0x10");
		static_assert(offsetof(CS2::animationsystem::AnimationSnapshotBase_t, m_bBonesInWorldSpace) == 0x40, "m_bBonesInWorldSpace in AnimationSnapshotBase_t should be at offset 0x40");
		static_assert(offsetof(CS2::animationsystem::AnimationSnapshotBase_t, m_boneSetupMask) == 0x48, "m_boneSetupMask in AnimationSnapshotBase_t should be at offset 0x48");
		static_assert(offsetof(CS2::animationsystem::AnimationSnapshotBase_t, m_boneTransforms) == 0x60, "m_boneTransforms in AnimationSnapshotBase_t should be at offset 0x60");
		static_assert(offsetof(CS2::animationsystem::AnimationSnapshotBase_t, m_flexControllers) == 0x78, "m_flexControllers in AnimationSnapshotBase_t should be at offset 0x78");
		static_assert(offsetof(CS2::animationsystem::AnimationSnapshotBase_t, m_SnapshotType) == 0x90, "m_SnapshotType in AnimationSnapshotBase_t should be at offset 0x90");
		static_assert(offsetof(CS2::animationsystem::AnimationSnapshotBase_t, m_bHasDecodeDump) == 0x94, "m_bHasDecodeDump in AnimationSnapshotBase_t should be at offset 0x94");
		static_assert(offsetof(CS2::animationsystem::AnimationSnapshotBase_t, m_DecodeDump) == 0x98, "m_DecodeDump in AnimationSnapshotBase_t should be at offset 0x98");
		static_assert(sizeof(CS2::animationsystem::AnimationSnapshotBase_t) == 0x110, "AnimationSnapshotBase_t size should be 0x110");
	}
}
