// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#ifndef CUSTOM_GLOBAL_TYPES
	#include <SDK/GlobalTypes.hpp>
#else
	#include <Custom/GlobalTypes.hpp>
#endif





namespace CS2 {
	namespace animationsystem {
		class AnimationDecodeDebugDumpElement_t  {
		public:
			int32_t m_nEntityIndex; // 0x0 | Schema_Builtin | Size: 0x4
			S2_PAD(0x4);
			GlobalTypes::CUtlString m_modelName; // 0x8 | Schema_Atomic | Size: 0x8
			// GlobalTypes::CUtlVector< GlobalTypes::CUtlString > m_poseParams; // 0x10 | Schema_Atomic | Size: 0x18
			char  m_poseParams[0x18]; // 0x10 | Schema_Atomic | Size: 0x18
			// GlobalTypes::CUtlVector< GlobalTypes::CUtlString > m_decodeOps; // 0x28 | Schema_Atomic | Size: 0x18
			char  m_decodeOps[0x18]; // 0x28 | Schema_Atomic | Size: 0x18
			// GlobalTypes::CUtlVector< GlobalTypes::CUtlString > m_internalOps; // 0x40 | Schema_Atomic | Size: 0x18
			char  m_internalOps[0x18]; // 0x40 | Schema_Atomic | Size: 0x18
			// GlobalTypes::CUtlVector< GlobalTypes::CUtlString > m_decodedAnims; // 0x58 | Schema_Atomic | Size: 0x18
			char  m_decodedAnims[0x18]; // 0x58 | Schema_Atomic | Size: 0x18
		};
		static_assert(offsetof(CS2::animationsystem::AnimationDecodeDebugDumpElement_t, m_nEntityIndex) == 0x0, "m_nEntityIndex in AnimationDecodeDebugDumpElement_t should be at offset 0x0");
		static_assert(offsetof(CS2::animationsystem::AnimationDecodeDebugDumpElement_t, m_modelName) == 0x8, "m_modelName in AnimationDecodeDebugDumpElement_t should be at offset 0x8");
		static_assert(offsetof(CS2::animationsystem::AnimationDecodeDebugDumpElement_t, m_poseParams) == 0x10, "m_poseParams in AnimationDecodeDebugDumpElement_t should be at offset 0x10");
		static_assert(offsetof(CS2::animationsystem::AnimationDecodeDebugDumpElement_t, m_decodeOps) == 0x28, "m_decodeOps in AnimationDecodeDebugDumpElement_t should be at offset 0x28");
		static_assert(offsetof(CS2::animationsystem::AnimationDecodeDebugDumpElement_t, m_internalOps) == 0x40, "m_internalOps in AnimationDecodeDebugDumpElement_t should be at offset 0x40");
		static_assert(offsetof(CS2::animationsystem::AnimationDecodeDebugDumpElement_t, m_decodedAnims) == 0x58, "m_decodedAnims in AnimationDecodeDebugDumpElement_t should be at offset 0x58");
		static_assert(sizeof(CS2::animationsystem::AnimationDecodeDebugDumpElement_t) == 0x70, "AnimationDecodeDebugDumpElement_t size should be 0x70");
	}
}
