// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#ifndef CUSTOM_GLOBAL_TYPES
	#include <SDK/GlobalTypes.hpp>
#else
	#include <Custom/GlobalTypes.hpp>
#endif


#include <SDK/resourcesystem/InfoForResourceTypeCAnimData.hpp>
#include <SDK/resourcesystem/InfoForResourceTypeCAnimationGroup.hpp>
#include <SDK/animationsystem/CAnimKeyData.hpp>





using namespace GlobalTypes;
namespace CS2 {
	namespace animationsystem {
		class CAnimationGroup  {
		public:
			S2_PAD(0x10);
			uint32_t m_nFlags; // 0x10 | Schema_Builtin | Size: 0x4
			S2_PAD(0x4);
			GlobalTypes::CBufferString m_name; // 0x18 | Schema_Atomic | Size: 0x10
			S2_PAD(0x38);
			GlobalTypes::CUtlVector<GlobalTypes::CStrongHandle<resourcesystem::InfoForResourceTypeCAnimData>> m_localHAnimArray_Handle; // 0x60 | Schema_Atomic | Size: 0x18
			// char  m_localHAnimArray_Handle[0x18]; // 0x60 | Schema_Atomic | Size: 0x18
			GlobalTypes::CUtlVector<GlobalTypes::CStrongHandle<resourcesystem::InfoForResourceTypeCAnimationGroup>> m_includedGroupArray_Handle; // 0x78 | Schema_Atomic | Size: 0x18
			// char  m_includedGroupArray_Handle[0x18]; // 0x78 | Schema_Atomic | Size: 0x18
			// GlobalTypes::CStrongHandle<resourcesystem::InfoForResourceTypeCSequenceGroupData> m_directHSeqGroup_Handle; // 0x90 | Schema_Atomic | Size: 0x8
			char  m_directHSeqGroup_Handle[0x8]; // 0x90 | Schema_Atomic | Size: 0x8
			animationsystem::CAnimKeyData m_decodeKey; // 0x98 | Schema_DeclaredClass | Size: 0x78
			GlobalTypes::CUtlVector<GlobalTypes::CBufferString> m_szScripts; // 0x110 | Schema_Atomic | Size: 0x18
			// char  m_szScripts[0x18]; // 0x110 | Schema_Atomic | Size: 0x18
			GlobalTypes::CUtlVector<GlobalTypes::CStrongHandleVoid> m_AdditionalExtRefs; // 0x128 | Schema_Atomic | Size: 0x18
			// char  m_AdditionalExtRefs[0x18]; // 0x128 | Schema_Atomic | Size: 0x18
			S2_PAD(0x8); // End padding
		};
		static_assert(offsetof(CS2::animationsystem::CAnimationGroup, m_nFlags) == 0x10, "m_nFlags in CAnimationGroup should be at offset 0x10");
		static_assert(offsetof(CS2::animationsystem::CAnimationGroup, m_name) == 0x18, "m_name in CAnimationGroup should be at offset 0x18");
		static_assert(offsetof(CS2::animationsystem::CAnimationGroup, m_localHAnimArray_Handle) == 0x60, "m_localHAnimArray_Handle in CAnimationGroup should be at offset 0x60");
		static_assert(offsetof(CS2::animationsystem::CAnimationGroup, m_includedGroupArray_Handle) == 0x78, "m_includedGroupArray_Handle in CAnimationGroup should be at offset 0x78");
		static_assert(offsetof(CS2::animationsystem::CAnimationGroup, m_directHSeqGroup_Handle) == 0x90, "m_directHSeqGroup_Handle in CAnimationGroup should be at offset 0x90");
		static_assert(offsetof(CS2::animationsystem::CAnimationGroup, m_decodeKey) == 0x98, "m_decodeKey in CAnimationGroup should be at offset 0x98");
		static_assert(offsetof(CS2::animationsystem::CAnimationGroup, m_szScripts) == 0x110, "m_szScripts in CAnimationGroup should be at offset 0x110");
		static_assert(offsetof(CS2::animationsystem::CAnimationGroup, m_AdditionalExtRefs) == 0x128, "m_AdditionalExtRefs in CAnimationGroup should be at offset 0x128");
		static_assert(sizeof(CS2::animationsystem::CAnimationGroup) == 0x148, "CAnimationGroup size should be 0x148");
	}
}
