// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#ifndef CUSTOM_GLOBAL_TYPES
	#include <SDK/GlobalTypes.hpp>
#else
	#include <Custom/GlobalTypes.hpp>
#endif







using namespace GlobalTypes;
namespace CS2 {
	namespace animationsystem {
		class CAnimDataChannelDesc  {
		public:
			GlobalTypes::CBufferString m_szChannelClass; // 0x0 | Schema_Atomic | Size: 0x10
			GlobalTypes::CBufferString m_szVariableName; // 0x10 | Schema_Atomic | Size: 0x10
			int32_t m_nFlags; // 0x20 | Schema_Builtin | Size: 0x4
			int32_t m_nType; // 0x24 | Schema_Builtin | Size: 0x4
			GlobalTypes::CBufferString m_szGrouping; // 0x28 | Schema_Atomic | Size: 0x10
			GlobalTypes::CBufferString m_szDescription; // 0x38 | Schema_Atomic | Size: 0x10
			GlobalTypes::CUtlVector<GlobalTypes::CBufferString> m_szElementNameArray; // 0x48 | Schema_Atomic | Size: 0x18
			// char  m_szElementNameArray[0x18]; // 0x48 | Schema_Atomic | Size: 0x18
			GlobalTypes::CUtlVector< int32 > m_nElementIndexArray; // 0x60 | Schema_Atomic | Size: 0x18
			// char  m_nElementIndexArray[0x18]; // 0x60 | Schema_Atomic | Size: 0x18
			GlobalTypes::CUtlVector< uint32 > m_nElementMaskArray; // 0x78 | Schema_Atomic | Size: 0x18
			// char  m_nElementMaskArray[0x18]; // 0x78 | Schema_Atomic | Size: 0x18
		};
		static_assert(offsetof(CS2::animationsystem::CAnimDataChannelDesc, m_szChannelClass) == 0x0, "m_szChannelClass in CAnimDataChannelDesc should be at offset 0x0");
		static_assert(offsetof(CS2::animationsystem::CAnimDataChannelDesc, m_szVariableName) == 0x10, "m_szVariableName in CAnimDataChannelDesc should be at offset 0x10");
		static_assert(offsetof(CS2::animationsystem::CAnimDataChannelDesc, m_nFlags) == 0x20, "m_nFlags in CAnimDataChannelDesc should be at offset 0x20");
		static_assert(offsetof(CS2::animationsystem::CAnimDataChannelDesc, m_nType) == 0x24, "m_nType in CAnimDataChannelDesc should be at offset 0x24");
		static_assert(offsetof(CS2::animationsystem::CAnimDataChannelDesc, m_szGrouping) == 0x28, "m_szGrouping in CAnimDataChannelDesc should be at offset 0x28");
		static_assert(offsetof(CS2::animationsystem::CAnimDataChannelDesc, m_szDescription) == 0x38, "m_szDescription in CAnimDataChannelDesc should be at offset 0x38");
		static_assert(offsetof(CS2::animationsystem::CAnimDataChannelDesc, m_szElementNameArray) == 0x48, "m_szElementNameArray in CAnimDataChannelDesc should be at offset 0x48");
		static_assert(offsetof(CS2::animationsystem::CAnimDataChannelDesc, m_nElementIndexArray) == 0x60, "m_nElementIndexArray in CAnimDataChannelDesc should be at offset 0x60");
		static_assert(offsetof(CS2::animationsystem::CAnimDataChannelDesc, m_nElementMaskArray) == 0x78, "m_nElementMaskArray in CAnimDataChannelDesc should be at offset 0x78");
		static_assert(sizeof(CS2::animationsystem::CAnimDataChannelDesc) == 0x90, "CAnimDataChannelDesc size should be 0x90");
	}
}
