// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#ifndef CUSTOM_GLOBAL_TYPES
	#include <SDK/GlobalTypes.hpp>
#else
	#include <Custom/GlobalTypes.hpp>
#endif





namespace CS2 {
	namespace animationsystem {
		class CAnimLocalHierarchy  {
		public:
			GlobalTypes::CBufferString m_sBone; // 0x0 | Schema_Atomic | Size: 0x10
			GlobalTypes::CBufferString m_sNewParent; // 0x10 | Schema_Atomic | Size: 0x10
			int32_t m_nStartFrame; // 0x20 | Schema_Builtin | Size: 0x4
			int32_t m_nPeakFrame; // 0x24 | Schema_Builtin | Size: 0x4
			int32_t m_nTailFrame; // 0x28 | Schema_Builtin | Size: 0x4
			int32_t m_nEndFrame; // 0x2c | Schema_Builtin | Size: 0x4
		};
		static_assert(offsetof(CS2::animationsystem::CAnimLocalHierarchy, m_sBone) == 0x0, "m_sBone in CAnimLocalHierarchy should be at offset 0x0");
		static_assert(offsetof(CS2::animationsystem::CAnimLocalHierarchy, m_sNewParent) == 0x10, "m_sNewParent in CAnimLocalHierarchy should be at offset 0x10");
		static_assert(offsetof(CS2::animationsystem::CAnimLocalHierarchy, m_nStartFrame) == 0x20, "m_nStartFrame in CAnimLocalHierarchy should be at offset 0x20");
		static_assert(offsetof(CS2::animationsystem::CAnimLocalHierarchy, m_nPeakFrame) == 0x24, "m_nPeakFrame in CAnimLocalHierarchy should be at offset 0x24");
		static_assert(offsetof(CS2::animationsystem::CAnimLocalHierarchy, m_nTailFrame) == 0x28, "m_nTailFrame in CAnimLocalHierarchy should be at offset 0x28");
		static_assert(offsetof(CS2::animationsystem::CAnimLocalHierarchy, m_nEndFrame) == 0x2C, "m_nEndFrame in CAnimLocalHierarchy should be at offset 0x2C");
		static_assert(sizeof(CS2::animationsystem::CAnimLocalHierarchy) == 0x30, "CAnimLocalHierarchy size should be 0x30");
	}
}
