// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#include <SDK/GlobalTypes.hpp>




namespace CS2 {
	namespace animationsystem {
		class CAnimBone  {
		public:
			GlobalTypes::CBufferString m_name; // 0x0 | Schema_Atomic | Size: 0x10
			int32_t m_parent; // 0x10 | Schema_Builtin | Size: 0x4
			GlobalTypes::Vector m_pos; // 0x14 | Schema_Atomic | Size: 0xc
			GlobalTypes::QuaternionStorage m_quat; // 0x20 | Schema_Atomic | Size: 0x10
			float32 m_scale; // 0x30 | Schema_Builtin | Size: 0x4
			GlobalTypes::QuaternionStorage m_qAlignment; // 0x34 | Schema_Atomic | Size: 0x10
			int32_t m_flags; // 0x44 | Schema_Builtin | Size: 0x4
		};
		static_assert(offsetof(CS2::animationsystem::CAnimBone, m_name) == 0x0, "m_name in CAnimBone should be at offset 0x0");
		static_assert(offsetof(CS2::animationsystem::CAnimBone, m_parent) == 0x10, "m_parent in CAnimBone should be at offset 0x10");
		static_assert(offsetof(CS2::animationsystem::CAnimBone, m_pos) == 0x14, "m_pos in CAnimBone should be at offset 0x14");
		static_assert(offsetof(CS2::animationsystem::CAnimBone, m_quat) == 0x20, "m_quat in CAnimBone should be at offset 0x20");
		static_assert(offsetof(CS2::animationsystem::CAnimBone, m_scale) == 0x30, "m_scale in CAnimBone should be at offset 0x30");
		static_assert(offsetof(CS2::animationsystem::CAnimBone, m_qAlignment) == 0x34, "m_qAlignment in CAnimBone should be at offset 0x34");
		static_assert(offsetof(CS2::animationsystem::CAnimBone, m_flags) == 0x44, "m_flags in CAnimBone should be at offset 0x44");
		static_assert(sizeof(CS2::animationsystem::CAnimBone) == 0x48, "CAnimBone size should be 0x48");
	}
}
