// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#include <SDK/GlobalTypes.hpp>




namespace CS2 {
	namespace animationsystem {
		class CAnimEventDefinition  {
		public:
			S2_PAD(0x8);
			int32_t m_nFrame; // 0x8 | Schema_Builtin | Size: 0x4
			int32_t m_nEndFrame; // 0xc | Schema_Builtin | Size: 0x4
			float32 m_flCycle; // 0x10 | Schema_Builtin | Size: 0x4
			float32 m_flDuration; // 0x14 | Schema_Builtin | Size: 0x4
			GlobalTypes::KeyValues3 m_EventData; // 0x18 | Schema_Atomic | Size: 0x10
			GlobalTypes::CBufferString m_sLegacyOptions; // 0x28 | Schema_Atomic | Size: 0x10
			GlobalTypes::CGlobalSymbol m_sEventName; // 0x38 | Schema_Atomic | Size: 0x8
		};
		static_assert(offsetof(CS2::animationsystem::CAnimEventDefinition, m_nFrame) == 0x8, "m_nFrame in CAnimEventDefinition should be at offset 0x8");
		static_assert(offsetof(CS2::animationsystem::CAnimEventDefinition, m_nEndFrame) == 0xC, "m_nEndFrame in CAnimEventDefinition should be at offset 0xC");
		static_assert(offsetof(CS2::animationsystem::CAnimEventDefinition, m_flCycle) == 0x10, "m_flCycle in CAnimEventDefinition should be at offset 0x10");
		static_assert(offsetof(CS2::animationsystem::CAnimEventDefinition, m_flDuration) == 0x14, "m_flDuration in CAnimEventDefinition should be at offset 0x14");
		static_assert(offsetof(CS2::animationsystem::CAnimEventDefinition, m_EventData) == 0x18, "m_EventData in CAnimEventDefinition should be at offset 0x18");
		static_assert(offsetof(CS2::animationsystem::CAnimEventDefinition, m_sLegacyOptions) == 0x28, "m_sLegacyOptions in CAnimEventDefinition should be at offset 0x28");
		static_assert(offsetof(CS2::animationsystem::CAnimEventDefinition, m_sEventName) == 0x38, "m_sEventName in CAnimEventDefinition should be at offset 0x38");
		static_assert(sizeof(CS2::animationsystem::CAnimEventDefinition) == 0x40, "CAnimEventDefinition size should be 0x40");
	}
}
