// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#include <SDK/GlobalTypes.hpp>




namespace CS2 {
	namespace animationsystem {
		class CAnimDesc_Flag  {
		public:
			bool m_bLooping; // 0x0 | Schema_Builtin | Size: 0x1
			bool m_bAllZeros; // 0x1 | Schema_Builtin | Size: 0x1
			bool m_bHidden; // 0x2 | Schema_Builtin | Size: 0x1
			bool m_bDelta; // 0x3 | Schema_Builtin | Size: 0x1
			bool m_bLegacyWorldspace; // 0x4 | Schema_Builtin | Size: 0x1
			bool m_bModelDoc; // 0x5 | Schema_Builtin | Size: 0x1
			bool m_bImplicitSeqIgnoreDelta; // 0x6 | Schema_Builtin | Size: 0x1
			bool m_bAnimGraphAdditive; // 0x7 | Schema_Builtin | Size: 0x1
		};
		static_assert(offsetof(CS2::animationsystem::CAnimDesc_Flag, m_bLooping) == 0x0, "m_bLooping in CAnimDesc_Flag should be at offset 0x0");
		static_assert(offsetof(CS2::animationsystem::CAnimDesc_Flag, m_bAllZeros) == 0x1, "m_bAllZeros in CAnimDesc_Flag should be at offset 0x1");
		static_assert(offsetof(CS2::animationsystem::CAnimDesc_Flag, m_bHidden) == 0x2, "m_bHidden in CAnimDesc_Flag should be at offset 0x2");
		static_assert(offsetof(CS2::animationsystem::CAnimDesc_Flag, m_bDelta) == 0x3, "m_bDelta in CAnimDesc_Flag should be at offset 0x3");
		static_assert(offsetof(CS2::animationsystem::CAnimDesc_Flag, m_bLegacyWorldspace) == 0x4, "m_bLegacyWorldspace in CAnimDesc_Flag should be at offset 0x4");
		static_assert(offsetof(CS2::animationsystem::CAnimDesc_Flag, m_bModelDoc) == 0x5, "m_bModelDoc in CAnimDesc_Flag should be at offset 0x5");
		static_assert(offsetof(CS2::animationsystem::CAnimDesc_Flag, m_bImplicitSeqIgnoreDelta) == 0x6, "m_bImplicitSeqIgnoreDelta in CAnimDesc_Flag should be at offset 0x6");
		static_assert(offsetof(CS2::animationsystem::CAnimDesc_Flag, m_bAnimGraphAdditive) == 0x7, "m_bAnimGraphAdditive in CAnimDesc_Flag should be at offset 0x7");
		static_assert(sizeof(CS2::animationsystem::CAnimDesc_Flag) == 0x8, "CAnimDesc_Flag size should be 0x8");
	}
}
