// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#ifndef CUSTOM_GLOBAL_TYPES
	#include <SDK/GlobalTypes.hpp>
#else
	#include <Custom/GlobalTypes.hpp>
#endif


#include <SDK/animationsystem/CSeqMultiFetchFlag.hpp>



namespace CS2 {
	namespace animationsystem {
		class CSeqMultiFetch  {
		public:
			animationsystem::CSeqMultiFetchFlag m_flags; // 0x0 | Schema_DeclaredClass | Size: 0x6
			S2_PAD(0x2);
			// GlobalTypes::CUtlVector< int16 > m_localReferenceArray; // 0x8 | Schema_Atomic | Size: 0x18
			char  m_localReferenceArray[0x18]; // 0x8 | Schema_Atomic | Size: 0x18
			int32_t m_nGroupSize[2]; // 0x20 | Schema_FixedArray | Size: 0x8
			int32_t m_nLocalPose[2]; // 0x28 | Schema_FixedArray | Size: 0x8
			// GlobalTypes::CUtlVector< float32 > m_poseKeyArray0; // 0x30 | Schema_Atomic | Size: 0x18
			char  m_poseKeyArray0[0x18]; // 0x30 | Schema_Atomic | Size: 0x18
			// GlobalTypes::CUtlVector< float32 > m_poseKeyArray1; // 0x48 | Schema_Atomic | Size: 0x18
			char  m_poseKeyArray1[0x18]; // 0x48 | Schema_Atomic | Size: 0x18
			int32_t m_nLocalCyclePoseParameter; // 0x60 | Schema_Builtin | Size: 0x4
			bool m_bCalculatePoseParameters; // 0x64 | Schema_Builtin | Size: 0x1
			bool m_bFixedBlendWeight; // 0x65 | Schema_Builtin | Size: 0x1
			S2_PAD(0x2);
			float32 m_flFixedBlendWeightVals[2]; // 0x68 | Schema_FixedArray | Size: 0x8
		};
		static_assert(offsetof(CS2::animationsystem::CSeqMultiFetch, m_flags) == 0x0, "m_flags in CSeqMultiFetch should be at offset 0x0");
		static_assert(offsetof(CS2::animationsystem::CSeqMultiFetch, m_localReferenceArray) == 0x8, "m_localReferenceArray in CSeqMultiFetch should be at offset 0x8");
		static_assert(offsetof(CS2::animationsystem::CSeqMultiFetch, m_nGroupSize) == 0x20, "m_nGroupSize in CSeqMultiFetch should be at offset 0x20");
		static_assert(offsetof(CS2::animationsystem::CSeqMultiFetch, m_nLocalPose) == 0x28, "m_nLocalPose in CSeqMultiFetch should be at offset 0x28");
		static_assert(offsetof(CS2::animationsystem::CSeqMultiFetch, m_poseKeyArray0) == 0x30, "m_poseKeyArray0 in CSeqMultiFetch should be at offset 0x30");
		static_assert(offsetof(CS2::animationsystem::CSeqMultiFetch, m_poseKeyArray1) == 0x48, "m_poseKeyArray1 in CSeqMultiFetch should be at offset 0x48");
		static_assert(offsetof(CS2::animationsystem::CSeqMultiFetch, m_nLocalCyclePoseParameter) == 0x60, "m_nLocalCyclePoseParameter in CSeqMultiFetch should be at offset 0x60");
		static_assert(offsetof(CS2::animationsystem::CSeqMultiFetch, m_bCalculatePoseParameters) == 0x64, "m_bCalculatePoseParameters in CSeqMultiFetch should be at offset 0x64");
		static_assert(offsetof(CS2::animationsystem::CSeqMultiFetch, m_bFixedBlendWeight) == 0x65, "m_bFixedBlendWeight in CSeqMultiFetch should be at offset 0x65");
		static_assert(offsetof(CS2::animationsystem::CSeqMultiFetch, m_flFixedBlendWeightVals) == 0x68, "m_flFixedBlendWeightVals in CSeqMultiFetch should be at offset 0x68");
		static_assert(sizeof(CS2::animationsystem::CSeqMultiFetch) == 0x70, "CSeqMultiFetch size should be 0x70");
	}
}
