// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#include <SDK/GlobalTypes.hpp>




namespace CS2 {
	namespace animationsystem {
		class CSeqPoseSetting  {
		public:
			GlobalTypes::CBufferString m_sPoseParameter; // 0x0 | Schema_Atomic | Size: 0x10
			GlobalTypes::CBufferString m_sAttachment; // 0x10 | Schema_Atomic | Size: 0x10
			GlobalTypes::CBufferString m_sReferenceSequence; // 0x20 | Schema_Atomic | Size: 0x10
			float32 m_flValue; // 0x30 | Schema_Builtin | Size: 0x4
			bool m_bX; // 0x34 | Schema_Builtin | Size: 0x1
			bool m_bY; // 0x35 | Schema_Builtin | Size: 0x1
			bool m_bZ; // 0x36 | Schema_Builtin | Size: 0x1
			S2_PAD(0x1);
			int32_t m_eType; // 0x38 | Schema_Builtin | Size: 0x4
			S2_PAD(0x4); // End padding
		};
		static_assert(offsetof(CS2::animationsystem::CSeqPoseSetting, m_sPoseParameter) == 0x0, "m_sPoseParameter in CSeqPoseSetting should be at offset 0x0");
		static_assert(offsetof(CS2::animationsystem::CSeqPoseSetting, m_sAttachment) == 0x10, "m_sAttachment in CSeqPoseSetting should be at offset 0x10");
		static_assert(offsetof(CS2::animationsystem::CSeqPoseSetting, m_sReferenceSequence) == 0x20, "m_sReferenceSequence in CSeqPoseSetting should be at offset 0x20");
		static_assert(offsetof(CS2::animationsystem::CSeqPoseSetting, m_flValue) == 0x30, "m_flValue in CSeqPoseSetting should be at offset 0x30");
		static_assert(offsetof(CS2::animationsystem::CSeqPoseSetting, m_bX) == 0x34, "m_bX in CSeqPoseSetting should be at offset 0x34");
		static_assert(offsetof(CS2::animationsystem::CSeqPoseSetting, m_bY) == 0x35, "m_bY in CSeqPoseSetting should be at offset 0x35");
		static_assert(offsetof(CS2::animationsystem::CSeqPoseSetting, m_bZ) == 0x36, "m_bZ in CSeqPoseSetting should be at offset 0x36");
		static_assert(offsetof(CS2::animationsystem::CSeqPoseSetting, m_eType) == 0x38, "m_eType in CSeqPoseSetting should be at offset 0x38");
		static_assert(sizeof(CS2::animationsystem::CSeqPoseSetting) == 0x40, "CSeqPoseSetting size should be 0x40");
	}
}
