// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#ifndef CUSTOM_GLOBAL_TYPES
	#include <SDK/GlobalTypes.hpp>
#else
	#include <Custom/GlobalTypes.hpp>
#endif





namespace CS2 {
	namespace animationsystem {
		class CSeqCmdLayer  {
		public:
			int16_t m_cmd; // 0x0 | Schema_Builtin | Size: 0x2
			int16_t m_nLocalReference; // 0x2 | Schema_Builtin | Size: 0x2
			int16_t m_nLocalBonemask; // 0x4 | Schema_Builtin | Size: 0x2
			int16_t m_nDstResult; // 0x6 | Schema_Builtin | Size: 0x2
			int16_t m_nSrcResult; // 0x8 | Schema_Builtin | Size: 0x2
			bool m_bSpline; // 0xa | Schema_Builtin | Size: 0x1
			S2_PAD(0x1);
			float32 m_flVar1; // 0xc | Schema_Builtin | Size: 0x4
			float32 m_flVar2; // 0x10 | Schema_Builtin | Size: 0x4
			int16_t m_nLineNumber; // 0x14 | Schema_Builtin | Size: 0x2
			S2_PAD(0x2); // End padding
		};
		static_assert(offsetof(CS2::animationsystem::CSeqCmdLayer, m_cmd) == 0x0, "m_cmd in CSeqCmdLayer should be at offset 0x0");
		static_assert(offsetof(CS2::animationsystem::CSeqCmdLayer, m_nLocalReference) == 0x2, "m_nLocalReference in CSeqCmdLayer should be at offset 0x2");
		static_assert(offsetof(CS2::animationsystem::CSeqCmdLayer, m_nLocalBonemask) == 0x4, "m_nLocalBonemask in CSeqCmdLayer should be at offset 0x4");
		static_assert(offsetof(CS2::animationsystem::CSeqCmdLayer, m_nDstResult) == 0x6, "m_nDstResult in CSeqCmdLayer should be at offset 0x6");
		static_assert(offsetof(CS2::animationsystem::CSeqCmdLayer, m_nSrcResult) == 0x8, "m_nSrcResult in CSeqCmdLayer should be at offset 0x8");
		static_assert(offsetof(CS2::animationsystem::CSeqCmdLayer, m_bSpline) == 0xA, "m_bSpline in CSeqCmdLayer should be at offset 0xA");
		static_assert(offsetof(CS2::animationsystem::CSeqCmdLayer, m_flVar1) == 0xC, "m_flVar1 in CSeqCmdLayer should be at offset 0xC");
		static_assert(offsetof(CS2::animationsystem::CSeqCmdLayer, m_flVar2) == 0x10, "m_flVar2 in CSeqCmdLayer should be at offset 0x10");
		static_assert(offsetof(CS2::animationsystem::CSeqCmdLayer, m_nLineNumber) == 0x14, "m_nLineNumber in CSeqCmdLayer should be at offset 0x14");
		static_assert(sizeof(CS2::animationsystem::CSeqCmdLayer) == 0x18, "CSeqCmdLayer size should be 0x18");
	}
}
