// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#include <SDK/GlobalTypes.hpp>




namespace CS2 {
	namespace animationsystem {
		class CSeqIKLock  {
		public:
			float32 m_flPosWeight; // 0x0 | Schema_Builtin | Size: 0x4
			float32 m_flAngleWeight; // 0x4 | Schema_Builtin | Size: 0x4
			int16_t m_nLocalBone; // 0x8 | Schema_Builtin | Size: 0x2
			bool m_bBonesOrientedAlongPositiveX; // 0xa | Schema_Builtin | Size: 0x1
			S2_PAD(0x1); // End padding
		};
		static_assert(offsetof(CS2::animationsystem::CSeqIKLock, m_flPosWeight) == 0x0, "m_flPosWeight in CSeqIKLock should be at offset 0x0");
		static_assert(offsetof(CS2::animationsystem::CSeqIKLock, m_flAngleWeight) == 0x4, "m_flAngleWeight in CSeqIKLock should be at offset 0x4");
		static_assert(offsetof(CS2::animationsystem::CSeqIKLock, m_nLocalBone) == 0x8, "m_nLocalBone in CSeqIKLock should be at offset 0x8");
		static_assert(offsetof(CS2::animationsystem::CSeqIKLock, m_bBonesOrientedAlongPositiveX) == 0xA, "m_bBonesOrientedAlongPositiveX in CSeqIKLock should be at offset 0xA");
		static_assert(sizeof(CS2::animationsystem::CSeqIKLock) == 0xC, "CSeqIKLock size should be 0xC");
	}
}
