// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#include <SDK/GlobalTypes.hpp>

#include <SDK/animationsystem/CSeqSeqDescFlag.hpp>
#include <SDK/animationsystem/CSeqTransition.hpp>



namespace CS2 {
	namespace animationsystem {
		class CSeqSynthAnimDesc  {
		public:
			GlobalTypes::CBufferString m_sName; // 0x0 | Schema_Atomic | Size: 0x10
			animationsystem::CSeqSeqDescFlag m_flags; // 0x10 | Schema_DeclaredClass | Size: 0xb
			S2_PAD(0x1);
			animationsystem::CSeqTransition m_transition; // 0x1c | Schema_DeclaredClass | Size: 0x8
			int16_t m_nLocalBaseReference; // 0x24 | Schema_Builtin | Size: 0x2
			int16_t m_nLocalBoneMask; // 0x26 | Schema_Builtin | Size: 0x2
			// GlobalTypes::CUtlVector< animationsystem::CAnimActivity > m_activityArray; // 0x28 | Schema_Atomic | Size: 0x18
			char  m_activityArray[0x18]; // 0x28 | Schema_Atomic | Size: 0x18
		};
		static_assert(offsetof(CS2::animationsystem::CSeqSynthAnimDesc, m_sName) == 0x0, "m_sName in CSeqSynthAnimDesc should be at offset 0x0");
		static_assert(offsetof(CS2::animationsystem::CSeqSynthAnimDesc, m_flags) == 0x10, "m_flags in CSeqSynthAnimDesc should be at offset 0x10");
		static_assert(offsetof(CS2::animationsystem::CSeqSynthAnimDesc, m_transition) == 0x1C, "m_transition in CSeqSynthAnimDesc should be at offset 0x1C");
		static_assert(offsetof(CS2::animationsystem::CSeqSynthAnimDesc, m_nLocalBaseReference) == 0x24, "m_nLocalBaseReference in CSeqSynthAnimDesc should be at offset 0x24");
		static_assert(offsetof(CS2::animationsystem::CSeqSynthAnimDesc, m_nLocalBoneMask) == 0x26, "m_nLocalBoneMask in CSeqSynthAnimDesc should be at offset 0x26");
		static_assert(offsetof(CS2::animationsystem::CSeqSynthAnimDesc, m_activityArray) == 0x28, "m_activityArray in CSeqSynthAnimDesc should be at offset 0x28");
		static_assert(sizeof(CS2::animationsystem::CSeqSynthAnimDesc) == 0x40, "CSeqSynthAnimDesc size should be 0x40");
	}
}
