// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#include <SDK/GlobalTypes.hpp>

#include <SDK/rendersystemdx11/RsFillMode_t.hpp>
#include <SDK/rendersystemdx11/RsCullMode_t.hpp>



namespace CS2 {
	namespace rendersystemdx11 {
		class RsRasterizerStateDesc_t  {
		public:
			rendersystemdx11::RsFillMode_t m_nFillMode; // 0x0 | Schema_DeclaredEnum | Size: 0x1
			rendersystemdx11::RsCullMode_t m_nCullMode; // 0x1 | Schema_DeclaredEnum | Size: 0x1
			bool m_bDepthClipEnable; // 0x2 | Schema_Builtin | Size: 0x1
			bool m_bMultisampleEnable; // 0x3 | Schema_Builtin | Size: 0x1
			int32_t m_nDepthBias; // 0x4 | Schema_Builtin | Size: 0x4
			float32 m_flDepthBiasClamp; // 0x8 | Schema_Builtin | Size: 0x4
			float32 m_flSlopeScaledDepthBias; // 0xc | Schema_Builtin | Size: 0x4
		};
		static_assert(offsetof(CS2::rendersystemdx11::RsRasterizerStateDesc_t, m_nFillMode) == 0x0, "m_nFillMode in RsRasterizerStateDesc_t should be at offset 0x0");
		static_assert(offsetof(CS2::rendersystemdx11::RsRasterizerStateDesc_t, m_nCullMode) == 0x1, "m_nCullMode in RsRasterizerStateDesc_t should be at offset 0x1");
		static_assert(offsetof(CS2::rendersystemdx11::RsRasterizerStateDesc_t, m_bDepthClipEnable) == 0x2, "m_bDepthClipEnable in RsRasterizerStateDesc_t should be at offset 0x2");
		static_assert(offsetof(CS2::rendersystemdx11::RsRasterizerStateDesc_t, m_bMultisampleEnable) == 0x3, "m_bMultisampleEnable in RsRasterizerStateDesc_t should be at offset 0x3");
		static_assert(offsetof(CS2::rendersystemdx11::RsRasterizerStateDesc_t, m_nDepthBias) == 0x4, "m_nDepthBias in RsRasterizerStateDesc_t should be at offset 0x4");
		static_assert(offsetof(CS2::rendersystemdx11::RsRasterizerStateDesc_t, m_flDepthBiasClamp) == 0x8, "m_flDepthBiasClamp in RsRasterizerStateDesc_t should be at offset 0x8");
		static_assert(offsetof(CS2::rendersystemdx11::RsRasterizerStateDesc_t, m_flSlopeScaledDepthBias) == 0xC, "m_flSlopeScaledDepthBias in RsRasterizerStateDesc_t should be at offset 0xC");
		static_assert(sizeof(CS2::rendersystemdx11::RsRasterizerStateDesc_t) == 0x10, "RsRasterizerStateDesc_t size should be 0x10");
	}
}
