// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#include <SDK/GlobalTypes.hpp>

#include <SDK/mathlib_extended/FuseFunctionIndex_t.hpp>



namespace CS2 {
	namespace mathlib_extended {
		class FunctionInfo_t  {
		public:
			S2_PAD(0x8);
			GlobalTypes::CUtlString m_name; // 0x8 | Schema_Atomic | Size: 0x8
			GlobalTypes::CUtlStringToken m_nameToken; // 0x10 | Schema_Atomic | Size: 0x4
			int32_t m_nParamCount; // 0x14 | Schema_Builtin | Size: 0x4
			mathlib_extended::FuseFunctionIndex_t m_nIndex; // 0x18 | Schema_DeclaredClass | Size: 0x2
			bool m_bIsPure; // 0x1a | Schema_Builtin | Size: 0x1
			S2_PAD(0x5); // End padding
		};
		static_assert(offsetof(CS2::mathlib_extended::FunctionInfo_t, m_name) == 0x8, "m_name in FunctionInfo_t should be at offset 0x8");
		static_assert(offsetof(CS2::mathlib_extended::FunctionInfo_t, m_nameToken) == 0x10, "m_nameToken in FunctionInfo_t should be at offset 0x10");
		static_assert(offsetof(CS2::mathlib_extended::FunctionInfo_t, m_nParamCount) == 0x14, "m_nParamCount in FunctionInfo_t should be at offset 0x14");
		static_assert(offsetof(CS2::mathlib_extended::FunctionInfo_t, m_nIndex) == 0x18, "m_nIndex in FunctionInfo_t should be at offset 0x18");
		static_assert(offsetof(CS2::mathlib_extended::FunctionInfo_t, m_bIsPure) == 0x1A, "m_bIsPure in FunctionInfo_t should be at offset 0x1A");
		static_assert(sizeof(CS2::mathlib_extended::FunctionInfo_t) == 0x20, "FunctionInfo_t size should be 0x20");
	}
}
