// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#include <SDK/GlobalTypes.hpp>

#include <SDK/mathlib_extended/FuseVariableIndex_t.hpp>
#include <SDK/mathlib_extended/FuseVariableType_t.hpp>
#include <SDK/mathlib_extended/FuseVariableAccess_t.hpp>



namespace CS2 {
	namespace mathlib_extended {
		class VariableInfo_t  {
		public:
			GlobalTypes::CUtlString m_name; // 0x0 | Schema_Atomic | Size: 0x8
			GlobalTypes::CUtlStringToken m_nameToken; // 0x8 | Schema_Atomic | Size: 0x4
			mathlib_extended::FuseVariableIndex_t m_nIndex; // 0xc | Schema_DeclaredClass | Size: 0x2
			uint8_t m_nNumComponents; // 0xe | Schema_Builtin | Size: 0x1
			mathlib_extended::FuseVariableType_t m_eVarType; // 0xf | Schema_DeclaredEnum | Size: 0x1
			mathlib_extended::FuseVariableAccess_t m_eAccess; // 0x10 | Schema_DeclaredEnum | Size: 0x1
			S2_PAD(0x7); // End padding
		};
		static_assert(offsetof(CS2::mathlib_extended::VariableInfo_t, m_name) == 0x0, "m_name in VariableInfo_t should be at offset 0x0");
		static_assert(offsetof(CS2::mathlib_extended::VariableInfo_t, m_nameToken) == 0x8, "m_nameToken in VariableInfo_t should be at offset 0x8");
		static_assert(offsetof(CS2::mathlib_extended::VariableInfo_t, m_nIndex) == 0xC, "m_nIndex in VariableInfo_t should be at offset 0xC");
		static_assert(offsetof(CS2::mathlib_extended::VariableInfo_t, m_nNumComponents) == 0xE, "m_nNumComponents in VariableInfo_t should be at offset 0xE");
		static_assert(offsetof(CS2::mathlib_extended::VariableInfo_t, m_eVarType) == 0xF, "m_eVarType in VariableInfo_t should be at offset 0xF");
		static_assert(offsetof(CS2::mathlib_extended::VariableInfo_t, m_eAccess) == 0x10, "m_eAccess in VariableInfo_t should be at offset 0x10");
		static_assert(sizeof(CS2::mathlib_extended::VariableInfo_t) == 0x18, "VariableInfo_t size should be 0x18");
	}
}
