// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#include <SDK/GlobalTypes.hpp>

#include <SDK/soundsystem/CSosGroupActionSchema.hpp>



namespace CS2 {
	namespace soundsystem {
		class CSosGroupActionSoundeventClusterSchema : public CS2::soundsystem::CSosGroupActionSchema {
		public:
			int32_t m_nMinNearby; // 0x18 | Schema_Builtin | Size: 0x4
			float32 m_flClusterEpsilon; // 0x1c | Schema_Builtin | Size: 0x4
			GlobalTypes::CUtlString m_shouldPlayOpvar; // 0x20 | Schema_Atomic | Size: 0x8
			GlobalTypes::CUtlString m_shouldPlayClusterChild; // 0x28 | Schema_Atomic | Size: 0x8
			GlobalTypes::CUtlString m_clusterSizeOpvar; // 0x30 | Schema_Atomic | Size: 0x8
			GlobalTypes::CUtlString m_groupBoundingBoxMinsOpvar; // 0x38 | Schema_Atomic | Size: 0x8
			GlobalTypes::CUtlString m_groupBoundingBoxMaxsOpvar; // 0x40 | Schema_Atomic | Size: 0x8
		};
		static_assert(offsetof(CS2::soundsystem::CSosGroupActionSoundeventClusterSchema, m_nMinNearby) == 0x18, "m_nMinNearby in CSosGroupActionSoundeventClusterSchema should be at offset 0x18");
		static_assert(offsetof(CS2::soundsystem::CSosGroupActionSoundeventClusterSchema, m_flClusterEpsilon) == 0x1C, "m_flClusterEpsilon in CSosGroupActionSoundeventClusterSchema should be at offset 0x1C");
		static_assert(offsetof(CS2::soundsystem::CSosGroupActionSoundeventClusterSchema, m_shouldPlayOpvar) == 0x20, "m_shouldPlayOpvar in CSosGroupActionSoundeventClusterSchema should be at offset 0x20");
		static_assert(offsetof(CS2::soundsystem::CSosGroupActionSoundeventClusterSchema, m_shouldPlayClusterChild) == 0x28, "m_shouldPlayClusterChild in CSosGroupActionSoundeventClusterSchema should be at offset 0x28");
		static_assert(offsetof(CS2::soundsystem::CSosGroupActionSoundeventClusterSchema, m_clusterSizeOpvar) == 0x30, "m_clusterSizeOpvar in CSosGroupActionSoundeventClusterSchema should be at offset 0x30");
		static_assert(offsetof(CS2::soundsystem::CSosGroupActionSoundeventClusterSchema, m_groupBoundingBoxMinsOpvar) == 0x38, "m_groupBoundingBoxMinsOpvar in CSosGroupActionSoundeventClusterSchema should be at offset 0x38");
		static_assert(offsetof(CS2::soundsystem::CSosGroupActionSoundeventClusterSchema, m_groupBoundingBoxMaxsOpvar) == 0x40, "m_groupBoundingBoxMaxsOpvar in CSosGroupActionSoundeventClusterSchema should be at offset 0x40");
		static_assert(sizeof(CS2::soundsystem::CSosGroupActionSoundeventClusterSchema) == 0x48, "CSosGroupActionSoundeventClusterSchema size should be 0x48");
	}
}
