// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#include <SDK/GlobalTypes.hpp>

#include <SDK/soundsystem/SosGroupType_t.hpp>
#include <SDK/soundsystem/CSosGroupMatchPattern.hpp>
#include <SDK/soundsystem/CSosGroupBranchPattern.hpp>
#include <SDK/soundsystem/CSosGroupActionSchema.hpp>



namespace CS2 {
	namespace soundsystem {
		class CSosSoundEventGroupSchema  {
		public:
			public:
			GlobalTypes::CUtlString m_name; // 0x0 | Schema_Atomic | Size: 0x8
			soundsystem::SosGroupType_t m_nType; // 0x8 | Schema_DeclaredEnum | Size: 0x4
			bool m_bIsBlocking; // 0xc | Schema_Builtin | Size: 0x1
			S2_PAD(0x3);
			int32_t m_nBlockMaxCount; // 0x10 | Schema_Builtin | Size: 0x4
			bool m_bInvertMatch; // 0x14 | Schema_Builtin | Size: 0x1
			S2_PAD(0x3);
			soundsystem::CSosGroupMatchPattern m_matchPattern; // 0x18 | Schema_DeclaredClass | Size: 0x30
			soundsystem::CSosGroupBranchPattern m_branchPattern; // 0x48 | Schema_DeclaredClass | Size: 0x10
			float32 m_flLifeSpanTime; // 0x58 | Schema_Builtin | Size: 0x4
			S2_PAD(0x64);
			soundsystem::CSosGroupActionSchema* m_vActions[4]; // 0xc0 | Schema_FixedArray | Size: 0x80
		};
		static_assert(offsetof(CS2::soundsystem::CSosSoundEventGroupSchema, m_name) == 0x0, "m_name in CSosSoundEventGroupSchema should be at offset 0x0");
		static_assert(offsetof(CS2::soundsystem::CSosSoundEventGroupSchema, m_nType) == 0x8, "m_nType in CSosSoundEventGroupSchema should be at offset 0x8");
		static_assert(offsetof(CS2::soundsystem::CSosSoundEventGroupSchema, m_bIsBlocking) == 0xC, "m_bIsBlocking in CSosSoundEventGroupSchema should be at offset 0xC");
		static_assert(offsetof(CS2::soundsystem::CSosSoundEventGroupSchema, m_nBlockMaxCount) == 0x10, "m_nBlockMaxCount in CSosSoundEventGroupSchema should be at offset 0x10");
		static_assert(offsetof(CS2::soundsystem::CSosSoundEventGroupSchema, m_bInvertMatch) == 0x14, "m_bInvertMatch in CSosSoundEventGroupSchema should be at offset 0x14");
		static_assert(offsetof(CS2::soundsystem::CSosSoundEventGroupSchema, m_matchPattern) == 0x18, "m_matchPattern in CSosSoundEventGroupSchema should be at offset 0x18");
		static_assert(offsetof(CS2::soundsystem::CSosSoundEventGroupSchema, m_branchPattern) == 0x48, "m_branchPattern in CSosSoundEventGroupSchema should be at offset 0x48");
		static_assert(offsetof(CS2::soundsystem::CSosSoundEventGroupSchema, m_flLifeSpanTime) == 0x58, "m_flLifeSpanTime in CSosSoundEventGroupSchema should be at offset 0x58");
		static_assert(offsetof(CS2::soundsystem::CSosSoundEventGroupSchema, m_vActions) == 0xC0, "m_vActions in CSosSoundEventGroupSchema should be at offset 0xC0");
		static_assert(sizeof(CS2::soundsystem::CSosSoundEventGroupSchema) == 0xE0, "CSosSoundEventGroupSchema size should be 0xE0");
	}
}
