// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#include <SDK/GlobalTypes.hpp>

#include <SDK/soundsystem/CSosGroupActionSchema.hpp>



namespace CS2 {
	namespace soundsystem {
		class CSosGroupActionMemberCountEnvelopeSchema : public CS2::soundsystem::CSosGroupActionSchema {
		public:
			int32_t m_nBaseCount; // 0x8 | Schema_Builtin | Size: 0x4
			int32_t m_nTargetCount; // 0xc | Schema_Builtin | Size: 0x4
			float32 m_flBaseValue; // 0x10 | Schema_Builtin | Size: 0x4
			float32 m_flTargetValue; // 0x14 | Schema_Builtin | Size: 0x4
			float32 m_flAttack; // 0x18 | Schema_Builtin | Size: 0x4
			float32 m_flDecay; // 0x1c | Schema_Builtin | Size: 0x4
			GlobalTypes::CUtlString m_resultVarName; // 0x20 | Schema_Atomic | Size: 0x8
			bool m_bSaveToGroup; // 0x28 | Schema_Builtin | Size: 0x1
			S2_PAD(0x7); // End padding
		};
		static_assert(offsetof(CS2::soundsystem::CSosGroupActionMemberCountEnvelopeSchema, m_nBaseCount) == 0x8, "m_nBaseCount in CSosGroupActionMemberCountEnvelopeSchema should be at offset 0x8");
		static_assert(offsetof(CS2::soundsystem::CSosGroupActionMemberCountEnvelopeSchema, m_nTargetCount) == 0xC, "m_nTargetCount in CSosGroupActionMemberCountEnvelopeSchema should be at offset 0xC");
		static_assert(offsetof(CS2::soundsystem::CSosGroupActionMemberCountEnvelopeSchema, m_flBaseValue) == 0x10, "m_flBaseValue in CSosGroupActionMemberCountEnvelopeSchema should be at offset 0x10");
		static_assert(offsetof(CS2::soundsystem::CSosGroupActionMemberCountEnvelopeSchema, m_flTargetValue) == 0x14, "m_flTargetValue in CSosGroupActionMemberCountEnvelopeSchema should be at offset 0x14");
		static_assert(offsetof(CS2::soundsystem::CSosGroupActionMemberCountEnvelopeSchema, m_flAttack) == 0x18, "m_flAttack in CSosGroupActionMemberCountEnvelopeSchema should be at offset 0x18");
		static_assert(offsetof(CS2::soundsystem::CSosGroupActionMemberCountEnvelopeSchema, m_flDecay) == 0x1C, "m_flDecay in CSosGroupActionMemberCountEnvelopeSchema should be at offset 0x1C");
		static_assert(offsetof(CS2::soundsystem::CSosGroupActionMemberCountEnvelopeSchema, m_resultVarName) == 0x20, "m_resultVarName in CSosGroupActionMemberCountEnvelopeSchema should be at offset 0x20");
		static_assert(offsetof(CS2::soundsystem::CSosGroupActionMemberCountEnvelopeSchema, m_bSaveToGroup) == 0x28, "m_bSaveToGroup in CSosGroupActionMemberCountEnvelopeSchema should be at offset 0x28");
		static_assert(sizeof(CS2::soundsystem::CSosGroupActionMemberCountEnvelopeSchema) == 0x30, "CSosGroupActionMemberCountEnvelopeSchema size should be 0x30");
	}
}
