// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#include <SDK/GlobalTypes.hpp>

#include <SDK/soundsystem/CSosGroupBranchPattern.hpp>



namespace CS2 {
	namespace soundsystem {
		class CSosGroupMatchPattern : public CS2::soundsystem::CSosGroupBranchPattern {
		public:
			GlobalTypes::CUtlString m_matchSoundEventName; // 0x10 | Schema_Atomic | Size: 0x8
			GlobalTypes::CUtlString m_matchSoundEventSubString; // 0x18 | Schema_Atomic | Size: 0x8
			float32 m_flEntIndex; // 0x20 | Schema_Builtin | Size: 0x4
			float32 m_flOpvar; // 0x24 | Schema_Builtin | Size: 0x4
			GlobalTypes::CUtlString m_opvarString; // 0x28 | Schema_Atomic | Size: 0x8
		};
		static_assert(offsetof(CS2::soundsystem::CSosGroupMatchPattern, m_matchSoundEventName) == 0x10, "m_matchSoundEventName in CSosGroupMatchPattern should be at offset 0x10");
		static_assert(offsetof(CS2::soundsystem::CSosGroupMatchPattern, m_matchSoundEventSubString) == 0x18, "m_matchSoundEventSubString in CSosGroupMatchPattern should be at offset 0x18");
		static_assert(offsetof(CS2::soundsystem::CSosGroupMatchPattern, m_flEntIndex) == 0x20, "m_flEntIndex in CSosGroupMatchPattern should be at offset 0x20");
		static_assert(offsetof(CS2::soundsystem::CSosGroupMatchPattern, m_flOpvar) == 0x24, "m_flOpvar in CSosGroupMatchPattern should be at offset 0x24");
		static_assert(offsetof(CS2::soundsystem::CSosGroupMatchPattern, m_opvarString) == 0x28, "m_opvarString in CSosGroupMatchPattern should be at offset 0x28");
		static_assert(sizeof(CS2::soundsystem::CSosGroupMatchPattern) == 0x30, "CSosGroupMatchPattern size should be 0x30");
	}
}
