// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#include <SDK/GlobalTypes.hpp>




namespace CS2 {
	namespace soundsystem {
		class CSosGroupBranchPattern  {
		public:
			S2_PAD(0x8);
			bool m_bMatchEventName; // 0x8 | Schema_Builtin | Size: 0x1
			bool m_bMatchEventSubString; // 0x9 | Schema_Builtin | Size: 0x1
			bool m_bMatchEntIndex; // 0xa | Schema_Builtin | Size: 0x1
			bool m_bMatchOpvar; // 0xb | Schema_Builtin | Size: 0x1
			bool m_bMatchString; // 0xc | Schema_Builtin | Size: 0x1
			S2_PAD(0x3); // End padding
		};
		static_assert(offsetof(CS2::soundsystem::CSosGroupBranchPattern, m_bMatchEventName) == 0x8, "m_bMatchEventName in CSosGroupBranchPattern should be at offset 0x8");
		static_assert(offsetof(CS2::soundsystem::CSosGroupBranchPattern, m_bMatchEventSubString) == 0x9, "m_bMatchEventSubString in CSosGroupBranchPattern should be at offset 0x9");
		static_assert(offsetof(CS2::soundsystem::CSosGroupBranchPattern, m_bMatchEntIndex) == 0xA, "m_bMatchEntIndex in CSosGroupBranchPattern should be at offset 0xA");
		static_assert(offsetof(CS2::soundsystem::CSosGroupBranchPattern, m_bMatchOpvar) == 0xB, "m_bMatchOpvar in CSosGroupBranchPattern should be at offset 0xB");
		static_assert(offsetof(CS2::soundsystem::CSosGroupBranchPattern, m_bMatchString) == 0xC, "m_bMatchString in CSosGroupBranchPattern should be at offset 0xC");
		static_assert(sizeof(CS2::soundsystem::CSosGroupBranchPattern) == 0x10, "CSosGroupBranchPattern size should be 0x10");
	}
}
