// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#include <SDK/GlobalTypes.hpp>

#include <SDK/particleslib/CParticleInput.hpp>
#include <SDK/particleslib/ParticleTransformType_t.hpp>



namespace CS2 {
	namespace particleslib {
		class CParticleTransformInput : public CS2::particleslib::CParticleInput {
		public:
			particleslib::ParticleTransformType_t m_nType; // 0x10 | Schema_DeclaredEnum | Size: 0x4
			S2_PAD(0x4);
			GlobalTypes::CParticleNamedValueRef m_NamedValue; // 0x18 | Schema_Atomic | Size: 0x40
			bool m_bFollowNamedValue; // 0x58 | Schema_Builtin | Size: 0x1
			bool m_bSupportsDisabled; // 0x59 | Schema_Builtin | Size: 0x1
			bool m_bUseOrientation; // 0x5a | Schema_Builtin | Size: 0x1
			S2_PAD(0x1);
			int32_t m_nControlPoint; // 0x5c | Schema_Builtin | Size: 0x4
			int32_t m_nControlPointRangeMax; // 0x60 | Schema_Builtin | Size: 0x4
			float32 m_flEndCPGrowthTime; // 0x64 | Schema_Builtin | Size: 0x4
		};
		static_assert(offsetof(CS2::particleslib::CParticleTransformInput, m_nType) == 0x10, "m_nType in CParticleTransformInput should be at offset 0x10");
		static_assert(offsetof(CS2::particleslib::CParticleTransformInput, m_NamedValue) == 0x18, "m_NamedValue in CParticleTransformInput should be at offset 0x18");
		static_assert(offsetof(CS2::particleslib::CParticleTransformInput, m_bFollowNamedValue) == 0x58, "m_bFollowNamedValue in CParticleTransformInput should be at offset 0x58");
		static_assert(offsetof(CS2::particleslib::CParticleTransformInput, m_bSupportsDisabled) == 0x59, "m_bSupportsDisabled in CParticleTransformInput should be at offset 0x59");
		static_assert(offsetof(CS2::particleslib::CParticleTransformInput, m_bUseOrientation) == 0x5A, "m_bUseOrientation in CParticleTransformInput should be at offset 0x5A");
		static_assert(offsetof(CS2::particleslib::CParticleTransformInput, m_nControlPoint) == 0x5C, "m_nControlPoint in CParticleTransformInput should be at offset 0x5C");
		static_assert(offsetof(CS2::particleslib::CParticleTransformInput, m_nControlPointRangeMax) == 0x60, "m_nControlPointRangeMax in CParticleTransformInput should be at offset 0x60");
		static_assert(offsetof(CS2::particleslib::CParticleTransformInput, m_flEndCPGrowthTime) == 0x64, "m_flEndCPGrowthTime in CParticleTransformInput should be at offset 0x64");
		static_assert(sizeof(CS2::particleslib::CParticleTransformInput) == 0x68, "CParticleTransformInput size should be 0x68");
	}
}
