// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#ifndef CUSTOM_GLOBAL_TYPES
	#include <SDK/GlobalTypes.hpp>
#else
	#include <Custom/GlobalTypes.hpp>
#endif


#include <SDK/particleslib/CParticleInput.hpp>
#include <SDK/particleslib/ParticleVecType_t.hpp>
#include <SDK/particles/ParticleAttributeIndex_t.hpp>
#include <SDK/particleslib/CParticleFloatInput.hpp>





using namespace GlobalTypes;
namespace CS2 {
	namespace particleslib {
		class CParticleVecInput : public CS2::particleslib::CParticleInput {
		public:
			particleslib::ParticleVecType_t m_nType; // 0x10 | Schema_DeclaredEnum | Size: 0x4
			GlobalTypes::Vector m_vLiteralValue; // 0x14 | Schema_Atomic | Size: 0xc
			GlobalTypes::Color m_LiteralColor; // 0x20 | Schema_Atomic | Size: 0x4
			S2_PAD(0x4);
			GlobalTypes::CParticleNamedValueRef m_NamedValue; // 0x28 | Schema_Atomic | Size: 0x40
			bool m_bFollowNamedValue; // 0x68 | Schema_Builtin | Size: 0x1
			S2_PAD(0x3);
			particles::ParticleAttributeIndex_t m_nVectorAttribute; // 0x6c | Schema_DeclaredClass | Size: 0x4
			GlobalTypes::Vector m_vVectorAttributeScale; // 0x70 | Schema_Atomic | Size: 0xc
			int32_t m_nControlPoint; // 0x7c | Schema_Builtin | Size: 0x4
			int32_t m_nDeltaControlPoint; // 0x80 | Schema_Builtin | Size: 0x4
			GlobalTypes::Vector m_vCPValueScale; // 0x84 | Schema_Atomic | Size: 0xc
			GlobalTypes::Vector m_vCPRelativePosition; // 0x90 | Schema_Atomic | Size: 0xc
			GlobalTypes::Vector m_vCPRelativeDir; // 0x9c | Schema_Atomic | Size: 0xc
			particleslib::CParticleFloatInput m_FloatComponentX; // 0xa8 | Schema_DeclaredClass | Size: 0x170
			particleslib::CParticleFloatInput m_FloatComponentY; // 0x218 | Schema_DeclaredClass | Size: 0x170
			particleslib::CParticleFloatInput m_FloatComponentZ; // 0x388 | Schema_DeclaredClass | Size: 0x170
			particleslib::CParticleFloatInput m_FloatInterp; // 0x4f8 | Schema_DeclaredClass | Size: 0x170
			float32 m_flInterpInput0; // 0x668 | Schema_Builtin | Size: 0x4
			float32 m_flInterpInput1; // 0x66c | Schema_Builtin | Size: 0x4
			GlobalTypes::Vector m_vInterpOutput0; // 0x670 | Schema_Atomic | Size: 0xc
			GlobalTypes::Vector m_vInterpOutput1; // 0x67c | Schema_Atomic | Size: 0xc
			GlobalTypes::CColorGradient m_Gradient; // 0x688 | Schema_Atomic | Size: 0x18
			GlobalTypes::Vector m_vRandomMin; // 0x6a0 | Schema_Atomic | Size: 0xc
			GlobalTypes::Vector m_vRandomMax; // 0x6ac | Schema_Atomic | Size: 0xc
		};
		static_assert(offsetof(CS2::particleslib::CParticleVecInput, m_nType) == 0x10, "m_nType in CParticleVecInput should be at offset 0x10");
		static_assert(offsetof(CS2::particleslib::CParticleVecInput, m_vLiteralValue) == 0x14, "m_vLiteralValue in CParticleVecInput should be at offset 0x14");
		static_assert(offsetof(CS2::particleslib::CParticleVecInput, m_LiteralColor) == 0x20, "m_LiteralColor in CParticleVecInput should be at offset 0x20");
		static_assert(offsetof(CS2::particleslib::CParticleVecInput, m_NamedValue) == 0x28, "m_NamedValue in CParticleVecInput should be at offset 0x28");
		static_assert(offsetof(CS2::particleslib::CParticleVecInput, m_bFollowNamedValue) == 0x68, "m_bFollowNamedValue in CParticleVecInput should be at offset 0x68");
		static_assert(offsetof(CS2::particleslib::CParticleVecInput, m_nVectorAttribute) == 0x6C, "m_nVectorAttribute in CParticleVecInput should be at offset 0x6C");
		static_assert(offsetof(CS2::particleslib::CParticleVecInput, m_vVectorAttributeScale) == 0x70, "m_vVectorAttributeScale in CParticleVecInput should be at offset 0x70");
		static_assert(offsetof(CS2::particleslib::CParticleVecInput, m_nControlPoint) == 0x7C, "m_nControlPoint in CParticleVecInput should be at offset 0x7C");
		static_assert(offsetof(CS2::particleslib::CParticleVecInput, m_nDeltaControlPoint) == 0x80, "m_nDeltaControlPoint in CParticleVecInput should be at offset 0x80");
		static_assert(offsetof(CS2::particleslib::CParticleVecInput, m_vCPValueScale) == 0x84, "m_vCPValueScale in CParticleVecInput should be at offset 0x84");
		static_assert(offsetof(CS2::particleslib::CParticleVecInput, m_vCPRelativePosition) == 0x90, "m_vCPRelativePosition in CParticleVecInput should be at offset 0x90");
		static_assert(offsetof(CS2::particleslib::CParticleVecInput, m_vCPRelativeDir) == 0x9C, "m_vCPRelativeDir in CParticleVecInput should be at offset 0x9C");
		static_assert(offsetof(CS2::particleslib::CParticleVecInput, m_FloatComponentX) == 0xA8, "m_FloatComponentX in CParticleVecInput should be at offset 0xA8");
		static_assert(offsetof(CS2::particleslib::CParticleVecInput, m_FloatComponentY) == 0x218, "m_FloatComponentY in CParticleVecInput should be at offset 0x218");
		static_assert(offsetof(CS2::particleslib::CParticleVecInput, m_FloatComponentZ) == 0x388, "m_FloatComponentZ in CParticleVecInput should be at offset 0x388");
		static_assert(offsetof(CS2::particleslib::CParticleVecInput, m_FloatInterp) == 0x4F8, "m_FloatInterp in CParticleVecInput should be at offset 0x4F8");
		static_assert(offsetof(CS2::particleslib::CParticleVecInput, m_flInterpInput0) == 0x668, "m_flInterpInput0 in CParticleVecInput should be at offset 0x668");
		static_assert(offsetof(CS2::particleslib::CParticleVecInput, m_flInterpInput1) == 0x66C, "m_flInterpInput1 in CParticleVecInput should be at offset 0x66C");
		static_assert(offsetof(CS2::particleslib::CParticleVecInput, m_vInterpOutput0) == 0x670, "m_vInterpOutput0 in CParticleVecInput should be at offset 0x670");
		static_assert(offsetof(CS2::particleslib::CParticleVecInput, m_vInterpOutput1) == 0x67C, "m_vInterpOutput1 in CParticleVecInput should be at offset 0x67C");
		static_assert(offsetof(CS2::particleslib::CParticleVecInput, m_Gradient) == 0x688, "m_Gradient in CParticleVecInput should be at offset 0x688");
		static_assert(offsetof(CS2::particleslib::CParticleVecInput, m_vRandomMin) == 0x6A0, "m_vRandomMin in CParticleVecInput should be at offset 0x6A0");
		static_assert(offsetof(CS2::particleslib::CParticleVecInput, m_vRandomMax) == 0x6AC, "m_vRandomMax in CParticleVecInput should be at offset 0x6AC");
		static_assert(sizeof(CS2::particleslib::CParticleVecInput) == 0x6B8, "CParticleVecInput size should be 0x6B8");
	}
}
