// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#ifndef CUSTOM_GLOBAL_TYPES
	#include <SDK/GlobalTypes.hpp>
#else
	#include <Custom/GlobalTypes.hpp>
#endif


#include <SDK/pulse_runtime_lib/CPulseCell_BaseYieldingInflow.hpp>
#include <SDK/pulse_runtime_lib/SignatureOutflow_Continue.hpp>
#include <SDK/pulse_runtime_lib/SignatureOutflow_Resume.hpp>



namespace CS2 {
	namespace pulse_system {
		class CPulseCell_Test_MultiOutflow_WithParams_Yielding : public CS2::pulse_runtime_lib::CPulseCell_BaseYieldingInflow {
		public:
			pulse_runtime_lib::SignatureOutflow_Continue m_Out1; // 0x48 | Schema_DeclaredClass | Size: 0x48
			pulse_runtime_lib::SignatureOutflow_Continue m_AsyncChild1; // 0x90 | Schema_DeclaredClass | Size: 0x48
			pulse_runtime_lib::SignatureOutflow_Continue m_AsyncChild2; // 0xd8 | Schema_DeclaredClass | Size: 0x48
			pulse_runtime_lib::SignatureOutflow_Resume m_YieldResume1; // 0x120 | Schema_DeclaredClass | Size: 0x48
			pulse_runtime_lib::SignatureOutflow_Resume m_YieldResume2; // 0x168 | Schema_DeclaredClass | Size: 0x48
		};
		static_assert(offsetof(CS2::pulse_system::CPulseCell_Test_MultiOutflow_WithParams_Yielding, m_Out1) == 0x48, "m_Out1 in CPulseCell_Test_MultiOutflow_WithParams_Yielding should be at offset 0x48");
		static_assert(offsetof(CS2::pulse_system::CPulseCell_Test_MultiOutflow_WithParams_Yielding, m_AsyncChild1) == 0x90, "m_AsyncChild1 in CPulseCell_Test_MultiOutflow_WithParams_Yielding should be at offset 0x90");
		static_assert(offsetof(CS2::pulse_system::CPulseCell_Test_MultiOutflow_WithParams_Yielding, m_AsyncChild2) == 0xD8, "m_AsyncChild2 in CPulseCell_Test_MultiOutflow_WithParams_Yielding should be at offset 0xD8");
		static_assert(offsetof(CS2::pulse_system::CPulseCell_Test_MultiOutflow_WithParams_Yielding, m_YieldResume1) == 0x120, "m_YieldResume1 in CPulseCell_Test_MultiOutflow_WithParams_Yielding should be at offset 0x120");
		static_assert(offsetof(CS2::pulse_system::CPulseCell_Test_MultiOutflow_WithParams_Yielding, m_YieldResume2) == 0x168, "m_YieldResume2 in CPulseCell_Test_MultiOutflow_WithParams_Yielding should be at offset 0x168");
		static_assert(sizeof(CS2::pulse_system::CPulseCell_Test_MultiOutflow_WithParams_Yielding) == 0x1B0, "CPulseCell_Test_MultiOutflow_WithParams_Yielding size should be 0x1B0");
	}
}
