// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#ifndef CUSTOM_GLOBAL_TYPES
	#include "../GlobalTypes.hpp"
#else
	#include "../Custom/GlobalTypes.hpp"
#endif


#include "VMixGraphCommandID_t.hpp"





using namespace GlobalTypes;
namespace CS2 {
	namespace soundsystem_lowlevel {
		class CVMixCommand  {
		public:
			soundsystem_lowlevel::VMixGraphCommandID_t m_nCommand; // 0x0 | Schema_DeclaredEnum | Size: 0x4
			uint32_t m_nParameterNameHash; // 0x4 | Schema_Builtin | Size: 0x4
			int32_t m_nOutputSubmix; // 0x8 | Schema_Builtin | Size: 0x4
			int32_t m_nInputSubmix0; // 0xc | Schema_Builtin | Size: 0x4
			int32_t m_nInputSubmix1; // 0x10 | Schema_Builtin | Size: 0x4
			int32_t m_nProcessor; // 0x14 | Schema_Builtin | Size: 0x4
			int32_t m_nInputValue0; // 0x18 | Schema_Builtin | Size: 0x4
			int32_t m_nInputValue1; // 0x1c | Schema_Builtin | Size: 0x4
		};
		static_assert(offsetof(CS2::soundsystem_lowlevel::CVMixCommand, m_nCommand) == 0x0, "m_nCommand in CVMixCommand should be at offset 0x0");
		static_assert(offsetof(CS2::soundsystem_lowlevel::CVMixCommand, m_nParameterNameHash) == 0x4, "m_nParameterNameHash in CVMixCommand should be at offset 0x4");
		static_assert(offsetof(CS2::soundsystem_lowlevel::CVMixCommand, m_nOutputSubmix) == 0x8, "m_nOutputSubmix in CVMixCommand should be at offset 0x8");
		static_assert(offsetof(CS2::soundsystem_lowlevel::CVMixCommand, m_nInputSubmix0) == 0xC, "m_nInputSubmix0 in CVMixCommand should be at offset 0xC");
		static_assert(offsetof(CS2::soundsystem_lowlevel::CVMixCommand, m_nInputSubmix1) == 0x10, "m_nInputSubmix1 in CVMixCommand should be at offset 0x10");
		static_assert(offsetof(CS2::soundsystem_lowlevel::CVMixCommand, m_nProcessor) == 0x14, "m_nProcessor in CVMixCommand should be at offset 0x14");
		static_assert(offsetof(CS2::soundsystem_lowlevel::CVMixCommand, m_nInputValue0) == 0x18, "m_nInputValue0 in CVMixCommand should be at offset 0x18");
		static_assert(offsetof(CS2::soundsystem_lowlevel::CVMixCommand, m_nInputValue1) == 0x1C, "m_nInputValue1 in CVMixCommand should be at offset 0x1C");
		static_assert(sizeof(CS2::soundsystem_lowlevel::CVMixCommand) == 0x20, "CVMixCommand size should be 0x20");
	}
}
