// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#ifndef CUSTOM_GLOBAL_TYPES
	#include <SDK/GlobalTypes.hpp>
#else
	#include <Custom/GlobalTypes.hpp>
#endif







using namespace GlobalTypes;
namespace CS2 {
	namespace soundsystem_lowlevel {
		class VMixDiffusorDesc_t  {
		public:
			float32 m_flSize; // 0x0 | Schema_Builtin | Size: 0x4
			float32 m_flComplexity; // 0x4 | Schema_Builtin | Size: 0x4
			float32 m_flFeedback; // 0x8 | Schema_Builtin | Size: 0x4
			float32 m_flOutputGain; // 0xc | Schema_Builtin | Size: 0x4
		};
		static_assert(offsetof(CS2::soundsystem_lowlevel::VMixDiffusorDesc_t, m_flSize) == 0x0, "m_flSize in VMixDiffusorDesc_t should be at offset 0x0");
		static_assert(offsetof(CS2::soundsystem_lowlevel::VMixDiffusorDesc_t, m_flComplexity) == 0x4, "m_flComplexity in VMixDiffusorDesc_t should be at offset 0x4");
		static_assert(offsetof(CS2::soundsystem_lowlevel::VMixDiffusorDesc_t, m_flFeedback) == 0x8, "m_flFeedback in VMixDiffusorDesc_t should be at offset 0x8");
		static_assert(offsetof(CS2::soundsystem_lowlevel::VMixDiffusorDesc_t, m_flOutputGain) == 0xC, "m_flOutputGain in VMixDiffusorDesc_t should be at offset 0xC");
		static_assert(sizeof(CS2::soundsystem_lowlevel::VMixDiffusorDesc_t) == 0x10, "VMixDiffusorDesc_t size should be 0x10");
	}
}
