// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#include <SDK/GlobalTypes.hpp>




namespace CS2 {
	namespace soundsystem_lowlevel {
		class VMixVocoderDesc_t  {
		public:
			int32_t m_nBandCount; // 0x0 | Schema_Builtin | Size: 0x4
			float32 m_flBandwidth; // 0x4 | Schema_Builtin | Size: 0x4
			float32 m_fldBModGain; // 0x8 | Schema_Builtin | Size: 0x4
			float32 m_flFreqRangeStart; // 0xc | Schema_Builtin | Size: 0x4
			float32 m_flFreqRangeEnd; // 0x10 | Schema_Builtin | Size: 0x4
			float32 m_fldBUnvoicedGain; // 0x14 | Schema_Builtin | Size: 0x4
			float32 m_flAttackTimeMS; // 0x18 | Schema_Builtin | Size: 0x4
			float32 m_flReleaseTimeMS; // 0x1c | Schema_Builtin | Size: 0x4
			int32_t m_nDebugBand; // 0x20 | Schema_Builtin | Size: 0x4
			bool m_bPeakMode; // 0x24 | Schema_Builtin | Size: 0x1
			S2_PAD(0x3); // End padding
		};
		static_assert(offsetof(CS2::soundsystem_lowlevel::VMixVocoderDesc_t, m_nBandCount) == 0x0, "m_nBandCount in VMixVocoderDesc_t should be at offset 0x0");
		static_assert(offsetof(CS2::soundsystem_lowlevel::VMixVocoderDesc_t, m_flBandwidth) == 0x4, "m_flBandwidth in VMixVocoderDesc_t should be at offset 0x4");
		static_assert(offsetof(CS2::soundsystem_lowlevel::VMixVocoderDesc_t, m_fldBModGain) == 0x8, "m_fldBModGain in VMixVocoderDesc_t should be at offset 0x8");
		static_assert(offsetof(CS2::soundsystem_lowlevel::VMixVocoderDesc_t, m_flFreqRangeStart) == 0xC, "m_flFreqRangeStart in VMixVocoderDesc_t should be at offset 0xC");
		static_assert(offsetof(CS2::soundsystem_lowlevel::VMixVocoderDesc_t, m_flFreqRangeEnd) == 0x10, "m_flFreqRangeEnd in VMixVocoderDesc_t should be at offset 0x10");
		static_assert(offsetof(CS2::soundsystem_lowlevel::VMixVocoderDesc_t, m_fldBUnvoicedGain) == 0x14, "m_fldBUnvoicedGain in VMixVocoderDesc_t should be at offset 0x14");
		static_assert(offsetof(CS2::soundsystem_lowlevel::VMixVocoderDesc_t, m_flAttackTimeMS) == 0x18, "m_flAttackTimeMS in VMixVocoderDesc_t should be at offset 0x18");
		static_assert(offsetof(CS2::soundsystem_lowlevel::VMixVocoderDesc_t, m_flReleaseTimeMS) == 0x1C, "m_flReleaseTimeMS in VMixVocoderDesc_t should be at offset 0x1C");
		static_assert(offsetof(CS2::soundsystem_lowlevel::VMixVocoderDesc_t, m_nDebugBand) == 0x20, "m_nDebugBand in VMixVocoderDesc_t should be at offset 0x20");
		static_assert(offsetof(CS2::soundsystem_lowlevel::VMixVocoderDesc_t, m_bPeakMode) == 0x24, "m_bPeakMode in VMixVocoderDesc_t should be at offset 0x24");
		static_assert(sizeof(CS2::soundsystem_lowlevel::VMixVocoderDesc_t) == 0x28, "VMixVocoderDesc_t size should be 0x28");
	}
}
