// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#include <SDK/GlobalTypes.hpp>

#include <SDK/soundsystem_lowlevel/VMixFilterDesc_t.hpp>
#include <SDK/soundsystem_lowlevel/VMixLFOShape_t.hpp>



namespace CS2 {
	namespace soundsystem_lowlevel {
		class VMixAutoFilterDesc_t  {
		public:
			float32 m_flEnvelopeAmount; // 0x0 | Schema_Builtin | Size: 0x4
			float32 m_flAttackTimeMS; // 0x4 | Schema_Builtin | Size: 0x4
			float32 m_flReleaseTimeMS; // 0x8 | Schema_Builtin | Size: 0x4
			soundsystem_lowlevel::VMixFilterDesc_t m_filter; // 0xc | Schema_DeclaredClass | Size: 0x10
			float32 m_flLFOAmount; // 0x1c | Schema_Builtin | Size: 0x4
			float32 m_flLFORate; // 0x20 | Schema_Builtin | Size: 0x4
			float32 m_flPhase; // 0x24 | Schema_Builtin | Size: 0x4
			soundsystem_lowlevel::VMixLFOShape_t m_nLFOShape; // 0x28 | Schema_DeclaredEnum | Size: 0x4
		};
		static_assert(offsetof(CS2::soundsystem_lowlevel::VMixAutoFilterDesc_t, m_flEnvelopeAmount) == 0x0, "m_flEnvelopeAmount in VMixAutoFilterDesc_t should be at offset 0x0");
		static_assert(offsetof(CS2::soundsystem_lowlevel::VMixAutoFilterDesc_t, m_flAttackTimeMS) == 0x4, "m_flAttackTimeMS in VMixAutoFilterDesc_t should be at offset 0x4");
		static_assert(offsetof(CS2::soundsystem_lowlevel::VMixAutoFilterDesc_t, m_flReleaseTimeMS) == 0x8, "m_flReleaseTimeMS in VMixAutoFilterDesc_t should be at offset 0x8");
		static_assert(offsetof(CS2::soundsystem_lowlevel::VMixAutoFilterDesc_t, m_filter) == 0xC, "m_filter in VMixAutoFilterDesc_t should be at offset 0xC");
		static_assert(offsetof(CS2::soundsystem_lowlevel::VMixAutoFilterDesc_t, m_flLFOAmount) == 0x1C, "m_flLFOAmount in VMixAutoFilterDesc_t should be at offset 0x1C");
		static_assert(offsetof(CS2::soundsystem_lowlevel::VMixAutoFilterDesc_t, m_flLFORate) == 0x20, "m_flLFORate in VMixAutoFilterDesc_t should be at offset 0x20");
		static_assert(offsetof(CS2::soundsystem_lowlevel::VMixAutoFilterDesc_t, m_flPhase) == 0x24, "m_flPhase in VMixAutoFilterDesc_t should be at offset 0x24");
		static_assert(offsetof(CS2::soundsystem_lowlevel::VMixAutoFilterDesc_t, m_nLFOShape) == 0x28, "m_nLFOShape in VMixAutoFilterDesc_t should be at offset 0x28");
		static_assert(sizeof(CS2::soundsystem_lowlevel::VMixAutoFilterDesc_t) == 0x2C, "VMixAutoFilterDesc_t size should be 0x2C");
	}
}
