// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#ifndef CUSTOM_GLOBAL_TYPES
	#include <SDK/GlobalTypes.hpp>
#else
	#include <Custom/GlobalTypes.hpp>
#endif







using namespace GlobalTypes;
namespace CS2 {
	namespace soundsystem_lowlevel {
		class VMixPitchShiftDesc_t  {
		public:
			int32_t m_nGrainSampleCount; // 0x0 | Schema_Builtin | Size: 0x4
			float32 m_flPitchShift; // 0x4 | Schema_Builtin | Size: 0x4
			int32_t m_nQuality; // 0x8 | Schema_Builtin | Size: 0x4
			int32_t m_nProcType; // 0xc | Schema_Builtin | Size: 0x4
		};
		static_assert(offsetof(CS2::soundsystem_lowlevel::VMixPitchShiftDesc_t, m_nGrainSampleCount) == 0x0, "m_nGrainSampleCount in VMixPitchShiftDesc_t should be at offset 0x0");
		static_assert(offsetof(CS2::soundsystem_lowlevel::VMixPitchShiftDesc_t, m_flPitchShift) == 0x4, "m_flPitchShift in VMixPitchShiftDesc_t should be at offset 0x4");
		static_assert(offsetof(CS2::soundsystem_lowlevel::VMixPitchShiftDesc_t, m_nQuality) == 0x8, "m_nQuality in VMixPitchShiftDesc_t should be at offset 0x8");
		static_assert(offsetof(CS2::soundsystem_lowlevel::VMixPitchShiftDesc_t, m_nProcType) == 0xC, "m_nProcType in VMixPitchShiftDesc_t should be at offset 0xC");
		static_assert(sizeof(CS2::soundsystem_lowlevel::VMixPitchShiftDesc_t) == 0x10, "VMixPitchShiftDesc_t size should be 0x10");
	}
}
