// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#ifndef CUSTOM_GLOBAL_TYPES
	#include <SDK/GlobalTypes.hpp>
#else
	#include <Custom/GlobalTypes.hpp>
#endif


#include <SDK/soundsystem_lowlevel/VMixFilterDesc_t.hpp>



namespace CS2 {
	namespace soundsystem_lowlevel {
		class VMixDelayDesc_t  {
		public:
			soundsystem_lowlevel::VMixFilterDesc_t m_feedbackFilter; // 0x0 | Schema_DeclaredClass | Size: 0x10
			bool m_bEnableFilter; // 0x10 | Schema_Builtin | Size: 0x1
			S2_PAD(0x3);
			float32 m_flDelay; // 0x14 | Schema_Builtin | Size: 0x4
			float32 m_flDirectGain; // 0x18 | Schema_Builtin | Size: 0x4
			float32 m_flDelayGain; // 0x1c | Schema_Builtin | Size: 0x4
			float32 m_flFeedbackGain; // 0x20 | Schema_Builtin | Size: 0x4
			float32 m_flWidth; // 0x24 | Schema_Builtin | Size: 0x4
		};
		static_assert(offsetof(CS2::soundsystem_lowlevel::VMixDelayDesc_t, m_feedbackFilter) == 0x0, "m_feedbackFilter in VMixDelayDesc_t should be at offset 0x0");
		static_assert(offsetof(CS2::soundsystem_lowlevel::VMixDelayDesc_t, m_bEnableFilter) == 0x10, "m_bEnableFilter in VMixDelayDesc_t should be at offset 0x10");
		static_assert(offsetof(CS2::soundsystem_lowlevel::VMixDelayDesc_t, m_flDelay) == 0x14, "m_flDelay in VMixDelayDesc_t should be at offset 0x14");
		static_assert(offsetof(CS2::soundsystem_lowlevel::VMixDelayDesc_t, m_flDirectGain) == 0x18, "m_flDirectGain in VMixDelayDesc_t should be at offset 0x18");
		static_assert(offsetof(CS2::soundsystem_lowlevel::VMixDelayDesc_t, m_flDelayGain) == 0x1C, "m_flDelayGain in VMixDelayDesc_t should be at offset 0x1C");
		static_assert(offsetof(CS2::soundsystem_lowlevel::VMixDelayDesc_t, m_flFeedbackGain) == 0x20, "m_flFeedbackGain in VMixDelayDesc_t should be at offset 0x20");
		static_assert(offsetof(CS2::soundsystem_lowlevel::VMixDelayDesc_t, m_flWidth) == 0x24, "m_flWidth in VMixDelayDesc_t should be at offset 0x24");
		static_assert(sizeof(CS2::soundsystem_lowlevel::VMixDelayDesc_t) == 0x28, "VMixDelayDesc_t size should be 0x28");
	}
}
