// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#ifndef CUSTOM_GLOBAL_TYPES
	#include <SDK/GlobalTypes.hpp>
#else
	#include <Custom/GlobalTypes.hpp>
#endif







using namespace GlobalTypes;
namespace CS2 {
	namespace soundsystem_lowlevel {
		class VMixDynamicsDesc_t  {
		public:
			float32 m_fldbGain; // 0x0 | Schema_Builtin | Size: 0x4
			float32 m_fldbNoiseGateThreshold; // 0x4 | Schema_Builtin | Size: 0x4
			float32 m_fldbCompressionThreshold; // 0x8 | Schema_Builtin | Size: 0x4
			float32 m_fldbLimiterThreshold; // 0xc | Schema_Builtin | Size: 0x4
			float32 m_fldbKneeWidth; // 0x10 | Schema_Builtin | Size: 0x4
			float32 m_flRatio; // 0x14 | Schema_Builtin | Size: 0x4
			float32 m_flLimiterRatio; // 0x18 | Schema_Builtin | Size: 0x4
			float32 m_flAttackTimeMS; // 0x1c | Schema_Builtin | Size: 0x4
			float32 m_flReleaseTimeMS; // 0x20 | Schema_Builtin | Size: 0x4
			float32 m_flRMSTimeMS; // 0x24 | Schema_Builtin | Size: 0x4
			float32 m_flWetMix; // 0x28 | Schema_Builtin | Size: 0x4
			bool m_bPeakMode; // 0x2c | Schema_Builtin | Size: 0x1
			S2_PAD(0x3); // End padding
		};
		static_assert(offsetof(CS2::soundsystem_lowlevel::VMixDynamicsDesc_t, m_fldbGain) == 0x0, "m_fldbGain in VMixDynamicsDesc_t should be at offset 0x0");
		static_assert(offsetof(CS2::soundsystem_lowlevel::VMixDynamicsDesc_t, m_fldbNoiseGateThreshold) == 0x4, "m_fldbNoiseGateThreshold in VMixDynamicsDesc_t should be at offset 0x4");
		static_assert(offsetof(CS2::soundsystem_lowlevel::VMixDynamicsDesc_t, m_fldbCompressionThreshold) == 0x8, "m_fldbCompressionThreshold in VMixDynamicsDesc_t should be at offset 0x8");
		static_assert(offsetof(CS2::soundsystem_lowlevel::VMixDynamicsDesc_t, m_fldbLimiterThreshold) == 0xC, "m_fldbLimiterThreshold in VMixDynamicsDesc_t should be at offset 0xC");
		static_assert(offsetof(CS2::soundsystem_lowlevel::VMixDynamicsDesc_t, m_fldbKneeWidth) == 0x10, "m_fldbKneeWidth in VMixDynamicsDesc_t should be at offset 0x10");
		static_assert(offsetof(CS2::soundsystem_lowlevel::VMixDynamicsDesc_t, m_flRatio) == 0x14, "m_flRatio in VMixDynamicsDesc_t should be at offset 0x14");
		static_assert(offsetof(CS2::soundsystem_lowlevel::VMixDynamicsDesc_t, m_flLimiterRatio) == 0x18, "m_flLimiterRatio in VMixDynamicsDesc_t should be at offset 0x18");
		static_assert(offsetof(CS2::soundsystem_lowlevel::VMixDynamicsDesc_t, m_flAttackTimeMS) == 0x1C, "m_flAttackTimeMS in VMixDynamicsDesc_t should be at offset 0x1C");
		static_assert(offsetof(CS2::soundsystem_lowlevel::VMixDynamicsDesc_t, m_flReleaseTimeMS) == 0x20, "m_flReleaseTimeMS in VMixDynamicsDesc_t should be at offset 0x20");
		static_assert(offsetof(CS2::soundsystem_lowlevel::VMixDynamicsDesc_t, m_flRMSTimeMS) == 0x24, "m_flRMSTimeMS in VMixDynamicsDesc_t should be at offset 0x24");
		static_assert(offsetof(CS2::soundsystem_lowlevel::VMixDynamicsDesc_t, m_flWetMix) == 0x28, "m_flWetMix in VMixDynamicsDesc_t should be at offset 0x28");
		static_assert(offsetof(CS2::soundsystem_lowlevel::VMixDynamicsDesc_t, m_bPeakMode) == 0x2C, "m_bPeakMode in VMixDynamicsDesc_t should be at offset 0x2C");
		static_assert(sizeof(CS2::soundsystem_lowlevel::VMixDynamicsDesc_t) == 0x30, "VMixDynamicsDesc_t size should be 0x30");
	}
}
