// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#ifndef CUSTOM_GLOBAL_TYPES
	#include <SDK/GlobalTypes.hpp>
#else
	#include <Custom/GlobalTypes.hpp>
#endif


#include <SDK/soundsystem_lowlevel/VMixFilterType_t.hpp>
#include <SDK/soundsystem_lowlevel/VMixFilterSlope_t.hpp>



namespace CS2 {
	namespace soundsystem_lowlevel {
		class VMixFilterDesc_t  {
		public:
			soundsystem_lowlevel::VMixFilterType_t m_nFilterType; // 0x0 | Schema_DeclaredEnum | Size: 0x2
			soundsystem_lowlevel::VMixFilterSlope_t m_nFilterSlope; // 0x2 | Schema_DeclaredEnum | Size: 0x1
			bool m_bEnabled; // 0x3 | Schema_Builtin | Size: 0x1
			float32 m_fldbGain; // 0x4 | Schema_Builtin | Size: 0x4
			float32 m_flCutoffFreq; // 0x8 | Schema_Builtin | Size: 0x4
			float32 m_flQ; // 0xc | Schema_Builtin | Size: 0x4
		};
		static_assert(offsetof(CS2::soundsystem_lowlevel::VMixFilterDesc_t, m_nFilterType) == 0x0, "m_nFilterType in VMixFilterDesc_t should be at offset 0x0");
		static_assert(offsetof(CS2::soundsystem_lowlevel::VMixFilterDesc_t, m_nFilterSlope) == 0x2, "m_nFilterSlope in VMixFilterDesc_t should be at offset 0x2");
		static_assert(offsetof(CS2::soundsystem_lowlevel::VMixFilterDesc_t, m_bEnabled) == 0x3, "m_bEnabled in VMixFilterDesc_t should be at offset 0x3");
		static_assert(offsetof(CS2::soundsystem_lowlevel::VMixFilterDesc_t, m_fldbGain) == 0x4, "m_fldbGain in VMixFilterDesc_t should be at offset 0x4");
		static_assert(offsetof(CS2::soundsystem_lowlevel::VMixFilterDesc_t, m_flCutoffFreq) == 0x8, "m_flCutoffFreq in VMixFilterDesc_t should be at offset 0x8");
		static_assert(offsetof(CS2::soundsystem_lowlevel::VMixFilterDesc_t, m_flQ) == 0xC, "m_flQ in VMixFilterDesc_t should be at offset 0xC");
		static_assert(sizeof(CS2::soundsystem_lowlevel::VMixFilterDesc_t) == 0x10, "VMixFilterDesc_t size should be 0x10");
	}
}
