// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#ifndef CUSTOM_GLOBAL_TYPES
	#include <SDK/GlobalTypes.hpp>
#else
	#include <Custom/GlobalTypes.hpp>
#endif


#include <SDK/soundsystem_lowlevel/VMixFilterDesc_t.hpp>



namespace CS2 {
	namespace soundsystem_lowlevel {
		class VMixModDelayDesc_t  {
		public:
			soundsystem_lowlevel::VMixFilterDesc_t m_feedbackFilter; // 0x0 | Schema_DeclaredClass | Size: 0x10
			bool m_bPhaseInvert; // 0x10 | Schema_Builtin | Size: 0x1
			S2_PAD(0x3);
			float32 m_flGlideTime; // 0x14 | Schema_Builtin | Size: 0x4
			float32 m_flDelay; // 0x18 | Schema_Builtin | Size: 0x4
			float32 m_flOutputGain; // 0x1c | Schema_Builtin | Size: 0x4
			float32 m_flFeedbackGain; // 0x20 | Schema_Builtin | Size: 0x4
			float32 m_flModRate; // 0x24 | Schema_Builtin | Size: 0x4
			float32 m_flModDepth; // 0x28 | Schema_Builtin | Size: 0x4
			bool m_bApplyAntialiasing; // 0x2c | Schema_Builtin | Size: 0x1
			S2_PAD(0x3); // End padding
		};
		static_assert(offsetof(CS2::soundsystem_lowlevel::VMixModDelayDesc_t, m_feedbackFilter) == 0x0, "m_feedbackFilter in VMixModDelayDesc_t should be at offset 0x0");
		static_assert(offsetof(CS2::soundsystem_lowlevel::VMixModDelayDesc_t, m_bPhaseInvert) == 0x10, "m_bPhaseInvert in VMixModDelayDesc_t should be at offset 0x10");
		static_assert(offsetof(CS2::soundsystem_lowlevel::VMixModDelayDesc_t, m_flGlideTime) == 0x14, "m_flGlideTime in VMixModDelayDesc_t should be at offset 0x14");
		static_assert(offsetof(CS2::soundsystem_lowlevel::VMixModDelayDesc_t, m_flDelay) == 0x18, "m_flDelay in VMixModDelayDesc_t should be at offset 0x18");
		static_assert(offsetof(CS2::soundsystem_lowlevel::VMixModDelayDesc_t, m_flOutputGain) == 0x1C, "m_flOutputGain in VMixModDelayDesc_t should be at offset 0x1C");
		static_assert(offsetof(CS2::soundsystem_lowlevel::VMixModDelayDesc_t, m_flFeedbackGain) == 0x20, "m_flFeedbackGain in VMixModDelayDesc_t should be at offset 0x20");
		static_assert(offsetof(CS2::soundsystem_lowlevel::VMixModDelayDesc_t, m_flModRate) == 0x24, "m_flModRate in VMixModDelayDesc_t should be at offset 0x24");
		static_assert(offsetof(CS2::soundsystem_lowlevel::VMixModDelayDesc_t, m_flModDepth) == 0x28, "m_flModDepth in VMixModDelayDesc_t should be at offset 0x28");
		static_assert(offsetof(CS2::soundsystem_lowlevel::VMixModDelayDesc_t, m_bApplyAntialiasing) == 0x2C, "m_bApplyAntialiasing in VMixModDelayDesc_t should be at offset 0x2C");
		static_assert(sizeof(CS2::soundsystem_lowlevel::VMixModDelayDesc_t) == 0x30, "VMixModDelayDesc_t size should be 0x30");
	}
}
