// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#include <SDK/GlobalTypes.hpp>




namespace CS2 {
	namespace soundsystem_lowlevel {
		class VMixDynamicsBand_t  {
		public:
			float32 m_fldbGainInput; // 0x0 | Schema_Builtin | Size: 0x4
			float32 m_fldbGainOutput; // 0x4 | Schema_Builtin | Size: 0x4
			float32 m_fldbThresholdBelow; // 0x8 | Schema_Builtin | Size: 0x4
			float32 m_fldbThresholdAbove; // 0xc | Schema_Builtin | Size: 0x4
			float32 m_flRatioBelow; // 0x10 | Schema_Builtin | Size: 0x4
			float32 m_flRatioAbove; // 0x14 | Schema_Builtin | Size: 0x4
			float32 m_flAttackTimeMS; // 0x18 | Schema_Builtin | Size: 0x4
			float32 m_flReleaseTimeMS; // 0x1c | Schema_Builtin | Size: 0x4
			bool m_bEnable; // 0x20 | Schema_Builtin | Size: 0x1
			bool m_bSolo; // 0x21 | Schema_Builtin | Size: 0x1
			S2_PAD(0x2); // End padding
		};
		static_assert(offsetof(CS2::soundsystem_lowlevel::VMixDynamicsBand_t, m_fldbGainInput) == 0x0, "m_fldbGainInput in VMixDynamicsBand_t should be at offset 0x0");
		static_assert(offsetof(CS2::soundsystem_lowlevel::VMixDynamicsBand_t, m_fldbGainOutput) == 0x4, "m_fldbGainOutput in VMixDynamicsBand_t should be at offset 0x4");
		static_assert(offsetof(CS2::soundsystem_lowlevel::VMixDynamicsBand_t, m_fldbThresholdBelow) == 0x8, "m_fldbThresholdBelow in VMixDynamicsBand_t should be at offset 0x8");
		static_assert(offsetof(CS2::soundsystem_lowlevel::VMixDynamicsBand_t, m_fldbThresholdAbove) == 0xC, "m_fldbThresholdAbove in VMixDynamicsBand_t should be at offset 0xC");
		static_assert(offsetof(CS2::soundsystem_lowlevel::VMixDynamicsBand_t, m_flRatioBelow) == 0x10, "m_flRatioBelow in VMixDynamicsBand_t should be at offset 0x10");
		static_assert(offsetof(CS2::soundsystem_lowlevel::VMixDynamicsBand_t, m_flRatioAbove) == 0x14, "m_flRatioAbove in VMixDynamicsBand_t should be at offset 0x14");
		static_assert(offsetof(CS2::soundsystem_lowlevel::VMixDynamicsBand_t, m_flAttackTimeMS) == 0x18, "m_flAttackTimeMS in VMixDynamicsBand_t should be at offset 0x18");
		static_assert(offsetof(CS2::soundsystem_lowlevel::VMixDynamicsBand_t, m_flReleaseTimeMS) == 0x1C, "m_flReleaseTimeMS in VMixDynamicsBand_t should be at offset 0x1C");
		static_assert(offsetof(CS2::soundsystem_lowlevel::VMixDynamicsBand_t, m_bEnable) == 0x20, "m_bEnable in VMixDynamicsBand_t should be at offset 0x20");
		static_assert(offsetof(CS2::soundsystem_lowlevel::VMixDynamicsBand_t, m_bSolo) == 0x21, "m_bSolo in VMixDynamicsBand_t should be at offset 0x21");
		static_assert(sizeof(CS2::soundsystem_lowlevel::VMixDynamicsBand_t) == 0x24, "VMixDynamicsBand_t size should be 0x24");
	}
}
