// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#ifndef CUSTOM_GLOBAL_TYPES
	#include <SDK/GlobalTypes.hpp>
#else
	#include <Custom/GlobalTypes.hpp>
#endif







using namespace GlobalTypes;
namespace CS2 {
	namespace soundsystem_lowlevel {
		class VMixFreeverbDesc_t  {
		public:
			float32 m_flRoomSize; // 0x0 | Schema_Builtin | Size: 0x4
			float32 m_flDamp; // 0x4 | Schema_Builtin | Size: 0x4
			float32 m_flWidth; // 0x8 | Schema_Builtin | Size: 0x4
			float32 m_flLateReflections; // 0xc | Schema_Builtin | Size: 0x4
		};
		static_assert(offsetof(CS2::soundsystem_lowlevel::VMixFreeverbDesc_t, m_flRoomSize) == 0x0, "m_flRoomSize in VMixFreeverbDesc_t should be at offset 0x0");
		static_assert(offsetof(CS2::soundsystem_lowlevel::VMixFreeverbDesc_t, m_flDamp) == 0x4, "m_flDamp in VMixFreeverbDesc_t should be at offset 0x4");
		static_assert(offsetof(CS2::soundsystem_lowlevel::VMixFreeverbDesc_t, m_flWidth) == 0x8, "m_flWidth in VMixFreeverbDesc_t should be at offset 0x8");
		static_assert(offsetof(CS2::soundsystem_lowlevel::VMixFreeverbDesc_t, m_flLateReflections) == 0xC, "m_flLateReflections in VMixFreeverbDesc_t should be at offset 0xC");
		static_assert(sizeof(CS2::soundsystem_lowlevel::VMixFreeverbDesc_t) == 0x10, "VMixFreeverbDesc_t size should be 0x10");
	}
}
