// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#ifndef CUSTOM_GLOBAL_TYPES
	#include <SDK/GlobalTypes.hpp>
#else
	#include <Custom/GlobalTypes.hpp>
#endif







using namespace GlobalTypes;
namespace CS2 {
	namespace soundsystem_lowlevel {
		class VMixConvolutionDesc_t  {
		public:
			float32 m_fldbGain; // 0x0 | Schema_Builtin | Size: 0x4
			float32 m_flPreDelayMS; // 0x4 | Schema_Builtin | Size: 0x4
			float32 m_flWetMix; // 0x8 | Schema_Builtin | Size: 0x4
			float32 m_fldbLow; // 0xc | Schema_Builtin | Size: 0x4
			float32 m_fldbMid; // 0x10 | Schema_Builtin | Size: 0x4
			float32 m_fldbHigh; // 0x14 | Schema_Builtin | Size: 0x4
			float32 m_flLowCutoffFreq; // 0x18 | Schema_Builtin | Size: 0x4
			float32 m_flHighCutoffFreq; // 0x1c | Schema_Builtin | Size: 0x4
		};
		static_assert(offsetof(CS2::soundsystem_lowlevel::VMixConvolutionDesc_t, m_fldbGain) == 0x0, "m_fldbGain in VMixConvolutionDesc_t should be at offset 0x0");
		static_assert(offsetof(CS2::soundsystem_lowlevel::VMixConvolutionDesc_t, m_flPreDelayMS) == 0x4, "m_flPreDelayMS in VMixConvolutionDesc_t should be at offset 0x4");
		static_assert(offsetof(CS2::soundsystem_lowlevel::VMixConvolutionDesc_t, m_flWetMix) == 0x8, "m_flWetMix in VMixConvolutionDesc_t should be at offset 0x8");
		static_assert(offsetof(CS2::soundsystem_lowlevel::VMixConvolutionDesc_t, m_fldbLow) == 0xC, "m_fldbLow in VMixConvolutionDesc_t should be at offset 0xC");
		static_assert(offsetof(CS2::soundsystem_lowlevel::VMixConvolutionDesc_t, m_fldbMid) == 0x10, "m_fldbMid in VMixConvolutionDesc_t should be at offset 0x10");
		static_assert(offsetof(CS2::soundsystem_lowlevel::VMixConvolutionDesc_t, m_fldbHigh) == 0x14, "m_fldbHigh in VMixConvolutionDesc_t should be at offset 0x14");
		static_assert(offsetof(CS2::soundsystem_lowlevel::VMixConvolutionDesc_t, m_flLowCutoffFreq) == 0x18, "m_flLowCutoffFreq in VMixConvolutionDesc_t should be at offset 0x18");
		static_assert(offsetof(CS2::soundsystem_lowlevel::VMixConvolutionDesc_t, m_flHighCutoffFreq) == 0x1C, "m_flHighCutoffFreq in VMixConvolutionDesc_t should be at offset 0x1C");
		static_assert(sizeof(CS2::soundsystem_lowlevel::VMixConvolutionDesc_t) == 0x20, "VMixConvolutionDesc_t size should be 0x20");
	}
}
