// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#ifndef CUSTOM_GLOBAL_TYPES
	#include "../GlobalTypes.hpp"
#else
	#include "../Custom/GlobalTypes.hpp"
#endif







using namespace GlobalTypes;
namespace CS2 {
	namespace soundsystem_lowlevel {
		class VMixFlangerDesc_t  {
		public:
			bool m_bPhaseInvert; // 0x0 | Schema_Builtin | Size: 0x1
			S2_PAD(0x3);
			float32 m_flGlideTime; // 0x4 | Schema_Builtin | Size: 0x4
			float32 m_flDelay; // 0x8 | Schema_Builtin | Size: 0x4
			float32 m_flOutputGain; // 0xc | Schema_Builtin | Size: 0x4
			float32 m_flFeedbackGain; // 0x10 | Schema_Builtin | Size: 0x4
			float32 m_flFeedforwardGain; // 0x14 | Schema_Builtin | Size: 0x4
			float32 m_flModRate; // 0x18 | Schema_Builtin | Size: 0x4
			float32 m_flModDepth; // 0x1c | Schema_Builtin | Size: 0x4
			bool m_bApplyAntialiasing; // 0x20 | Schema_Builtin | Size: 0x1
			S2_PAD(0x3); // End padding
		};
#ifdef USE_STATIC_ASSERTS
		static_assert(offsetof(CS2::soundsystem_lowlevel::VMixFlangerDesc_t, m_bPhaseInvert) == 0x0, "m_bPhaseInvert in VMixFlangerDesc_t should be at offset 0x0");
		static_assert(offsetof(CS2::soundsystem_lowlevel::VMixFlangerDesc_t, m_flGlideTime) == 0x4, "m_flGlideTime in VMixFlangerDesc_t should be at offset 0x4");
		static_assert(offsetof(CS2::soundsystem_lowlevel::VMixFlangerDesc_t, m_flDelay) == 0x8, "m_flDelay in VMixFlangerDesc_t should be at offset 0x8");
		static_assert(offsetof(CS2::soundsystem_lowlevel::VMixFlangerDesc_t, m_flOutputGain) == 0xC, "m_flOutputGain in VMixFlangerDesc_t should be at offset 0xC");
		static_assert(offsetof(CS2::soundsystem_lowlevel::VMixFlangerDesc_t, m_flFeedbackGain) == 0x10, "m_flFeedbackGain in VMixFlangerDesc_t should be at offset 0x10");
		static_assert(offsetof(CS2::soundsystem_lowlevel::VMixFlangerDesc_t, m_flFeedforwardGain) == 0x14, "m_flFeedforwardGain in VMixFlangerDesc_t should be at offset 0x14");
		static_assert(offsetof(CS2::soundsystem_lowlevel::VMixFlangerDesc_t, m_flModRate) == 0x18, "m_flModRate in VMixFlangerDesc_t should be at offset 0x18");
		static_assert(offsetof(CS2::soundsystem_lowlevel::VMixFlangerDesc_t, m_flModDepth) == 0x1C, "m_flModDepth in VMixFlangerDesc_t should be at offset 0x1C");
		static_assert(offsetof(CS2::soundsystem_lowlevel::VMixFlangerDesc_t, m_bApplyAntialiasing) == 0x20, "m_bApplyAntialiasing in VMixFlangerDesc_t should be at offset 0x20");
		static_assert(sizeof(CS2::soundsystem_lowlevel::VMixFlangerDesc_t) == 0x24, "VMixFlangerDesc_t size should be 0x24");

#endif
	}
}
