// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#include <SDK/GlobalTypes.hpp>

#include <SDK/soundsystem_lowlevel/VMixDynamicsBand_t.hpp>



namespace CS2 {
	namespace soundsystem_lowlevel {
		class VMixDynamics3BandDesc_t  {
		public:
			float32 m_fldbGainOutput; // 0x0 | Schema_Builtin | Size: 0x4
			float32 m_flRMSTimeMS; // 0x4 | Schema_Builtin | Size: 0x4
			float32 m_fldbKneeWidth; // 0x8 | Schema_Builtin | Size: 0x4
			float32 m_flDepth; // 0xc | Schema_Builtin | Size: 0x4
			float32 m_flWetMix; // 0x10 | Schema_Builtin | Size: 0x4
			float32 m_flTimeScale; // 0x14 | Schema_Builtin | Size: 0x4
			float32 m_flLowCutoffFreq; // 0x18 | Schema_Builtin | Size: 0x4
			float32 m_flHighCutoffFreq; // 0x1c | Schema_Builtin | Size: 0x4
			bool m_bPeakMode; // 0x20 | Schema_Builtin | Size: 0x1
			S2_PAD(0x3);
			soundsystem_lowlevel::VMixDynamicsBand_t m_bandDesc[3]; // 0x24 | Schema_FixedArray | Size: 0x144
		};
		static_assert(offsetof(CS2::soundsystem_lowlevel::VMixDynamics3BandDesc_t, m_fldbGainOutput) == 0x0, "m_fldbGainOutput in VMixDynamics3BandDesc_t should be at offset 0x0");
		static_assert(offsetof(CS2::soundsystem_lowlevel::VMixDynamics3BandDesc_t, m_flRMSTimeMS) == 0x4, "m_flRMSTimeMS in VMixDynamics3BandDesc_t should be at offset 0x4");
		static_assert(offsetof(CS2::soundsystem_lowlevel::VMixDynamics3BandDesc_t, m_fldbKneeWidth) == 0x8, "m_fldbKneeWidth in VMixDynamics3BandDesc_t should be at offset 0x8");
		static_assert(offsetof(CS2::soundsystem_lowlevel::VMixDynamics3BandDesc_t, m_flDepth) == 0xC, "m_flDepth in VMixDynamics3BandDesc_t should be at offset 0xC");
		static_assert(offsetof(CS2::soundsystem_lowlevel::VMixDynamics3BandDesc_t, m_flWetMix) == 0x10, "m_flWetMix in VMixDynamics3BandDesc_t should be at offset 0x10");
		static_assert(offsetof(CS2::soundsystem_lowlevel::VMixDynamics3BandDesc_t, m_flTimeScale) == 0x14, "m_flTimeScale in VMixDynamics3BandDesc_t should be at offset 0x14");
		static_assert(offsetof(CS2::soundsystem_lowlevel::VMixDynamics3BandDesc_t, m_flLowCutoffFreq) == 0x18, "m_flLowCutoffFreq in VMixDynamics3BandDesc_t should be at offset 0x18");
		static_assert(offsetof(CS2::soundsystem_lowlevel::VMixDynamics3BandDesc_t, m_flHighCutoffFreq) == 0x1C, "m_flHighCutoffFreq in VMixDynamics3BandDesc_t should be at offset 0x1C");
		static_assert(offsetof(CS2::soundsystem_lowlevel::VMixDynamics3BandDesc_t, m_bPeakMode) == 0x20, "m_bPeakMode in VMixDynamics3BandDesc_t should be at offset 0x20");
		static_assert(offsetof(CS2::soundsystem_lowlevel::VMixDynamics3BandDesc_t, m_bandDesc) == 0x24, "m_bandDesc in VMixDynamics3BandDesc_t should be at offset 0x24");
		static_assert(sizeof(CS2::soundsystem_lowlevel::VMixDynamics3BandDesc_t) == 0x90, "VMixDynamics3BandDesc_t size should be 0x90");
	}
}
