// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#ifndef CUSTOM_GLOBAL_TYPES
	#include <SDK/GlobalTypes.hpp>
#else
	#include <Custom/GlobalTypes.hpp>
#endif


#include <SDK/client/C_BaseEntity.hpp>
#include <SDK/client/CHitboxComponent.hpp>
#include <SDK/client/HitGroup_t.hpp>
#include <SDK/client/RenderMode_t.hpp>
#include <SDK/client/RenderFx_t.hpp>
#include <SDK/client/CCollisionProperty.hpp>
#include <SDK/client/CGlowProperty.hpp>
#include <SDK/client/DecalMode_t.hpp>
#include <SDK/client/CNetworkViewOffsetVector.hpp>



namespace CS2 {
	namespace client {
		class CRenderComponent;
		class CDestructiblePartsComponent;
		class CClientAlphaProperty;
	}
}


using namespace GlobalTypes;
namespace CS2 {
	namespace client {
		class C_BaseModelEntity : public CS2::client::C_BaseEntity {
		public:
			S2_PAD(0x4e8);
			client::CRenderComponent* m_CRenderComponent; // 0xae0 | Schema_Ptr | Size: 0x8
			client::CHitboxComponent m_CHitboxComponent; // 0xae8 | Schema_DeclaredClass | Size: 0x18
			client::CDestructiblePartsComponent* m_pDestructiblePartsSystemComponent; // 0xb00 | Schema_Ptr | Size: 0x8
			client::HitGroup_t m_LastHitGroup; // 0xb08 | Schema_DeclaredEnum | Size: 0x4
			S2_PAD(0x4);
			GlobalTypes::CGlobalSymbol m_sLastDamageSourceName; // 0xb10 | Schema_Atomic | Size: 0x8
			GlobalTypes::VectorWS m_vLastDamagePosition; // 0xb18 | Schema_Atomic | Size: 0xc
			S2_PAD(0x1c);
			bool m_bInitModelEffects; // 0xb40 | Schema_Builtin | Size: 0x1
			bool m_bIsStaticProp; // 0xb41 | Schema_Builtin | Size: 0x1
			S2_PAD(0x2);
			int32_t m_nLastAddDecal; // 0xb44 | Schema_Builtin | Size: 0x4
			int32_t m_nDecalsAdded; // 0xb48 | Schema_Builtin | Size: 0x4
			int32_t m_iOldHealth; // 0xb4c | Schema_Builtin | Size: 0x4
			client::RenderMode_t m_nRenderMode; // 0xb50 | Schema_DeclaredEnum | Size: 0x1
			client::RenderFx_t m_nRenderFX; // 0xb51 | Schema_DeclaredEnum | Size: 0x1
			bool m_bAllowFadeInView; // 0xb52 | Schema_Builtin | Size: 0x1
			S2_PAD(0x1d);
			GlobalTypes::Color m_clrRender; // 0xb70 | Schema_Atomic | Size: 0x4
			S2_PAD(0x4);
			// client::C_UtlVectorEmbeddedNetworkVar<client::EntityRenderAttribute_t> m_vecRenderAttributes; // 0xb78 | Schema_Atomic | Size: 0x68
			char  m_vecRenderAttributes[0x68]; // 0xb78 | Schema_Atomic | Size: 0x68
			S2_PAD(0x18);
			bool m_bRenderToCubemaps; // 0xbf8 | Schema_Builtin | Size: 0x1
			bool m_bNoInterpolate; // 0xbf9 | Schema_Builtin | Size: 0x1
			S2_PAD(0x6);
			client::CCollisionProperty m_Collision; // 0xc00 | Schema_DeclaredClass | Size: 0xb0
			client::CGlowProperty m_Glow; // 0xcb0 | Schema_DeclaredClass | Size: 0x58
			float32 m_flGlowBackfaceMult; // 0xd08 | Schema_Builtin | Size: 0x4
			float32 m_fadeMinDist; // 0xd0c | Schema_Builtin | Size: 0x4
			float32 m_fadeMaxDist; // 0xd10 | Schema_Builtin | Size: 0x4
			float32 m_flFadeScale; // 0xd14 | Schema_Builtin | Size: 0x4
			float32 m_flShadowStrength; // 0xd18 | Schema_Builtin | Size: 0x4
			uint8_t m_nObjectCulling; // 0xd1c | Schema_Builtin | Size: 0x1
			S2_PAD(0x3);
			int32_t m_nAddDecal; // 0xd20 | Schema_Builtin | Size: 0x4
			GlobalTypes::Vector m_vDecalPosition; // 0xd24 | Schema_Atomic | Size: 0xc
			GlobalTypes::Vector m_vDecalForwardAxis; // 0xd30 | Schema_Atomic | Size: 0xc
			client::DecalMode_t m_nDecalMode; // 0xd3c | Schema_DeclaredEnum | Size: 0x1
			client::DecalMode_t m_nRequiredDecalMode; // 0xd3d | Schema_DeclaredEnum | Size: 0x1
			S2_PAD(0x2);
			// client::C_NetworkUtlVectorBase<GlobalTypes::CHandle<client::C_BaseModelEntity>> m_ConfigEntitiesToPropagateMaterialDecalsTo; // 0xd40 | Schema_Atomic | Size: 0x18
			char  m_ConfigEntitiesToPropagateMaterialDecalsTo[0x18]; // 0xd40 | Schema_Atomic | Size: 0x18
			S2_PAD(0x28);
			client::CNetworkViewOffsetVector m_vecViewOffset; // 0xd80 | Schema_DeclaredClass | Size: 0x28
			S2_PAD(0xb8);
			client::CClientAlphaProperty* m_pClientAlphaProperty; // 0xe60 | Schema_Ptr | Size: 0x8
			GlobalTypes::Color m_ClientOverrideTint; // 0xe68 | Schema_Atomic | Size: 0x4
			bool m_bUseClientOverrideTint; // 0xe6c | Schema_Builtin | Size: 0x1
			S2_PAD(0x3b);
			uint32_t m_bvDisabledHitGroups[1]; // 0xea8 | Schema_FixedArray | Size: 0x4
			S2_PAD(0x4); // End padding
		};
		static_assert(offsetof(CS2::client::C_BaseModelEntity, m_CRenderComponent) == 0xAE0, "m_CRenderComponent in C_BaseModelEntity should be at offset 0xAE0");
		static_assert(offsetof(CS2::client::C_BaseModelEntity, m_CHitboxComponent) == 0xAE8, "m_CHitboxComponent in C_BaseModelEntity should be at offset 0xAE8");
		static_assert(offsetof(CS2::client::C_BaseModelEntity, m_pDestructiblePartsSystemComponent) == 0xB00, "m_pDestructiblePartsSystemComponent in C_BaseModelEntity should be at offset 0xB00");
		static_assert(offsetof(CS2::client::C_BaseModelEntity, m_LastHitGroup) == 0xB08, "m_LastHitGroup in C_BaseModelEntity should be at offset 0xB08");
		static_assert(offsetof(CS2::client::C_BaseModelEntity, m_sLastDamageSourceName) == 0xB10, "m_sLastDamageSourceName in C_BaseModelEntity should be at offset 0xB10");
		static_assert(offsetof(CS2::client::C_BaseModelEntity, m_vLastDamagePosition) == 0xB18, "m_vLastDamagePosition in C_BaseModelEntity should be at offset 0xB18");
		static_assert(offsetof(CS2::client::C_BaseModelEntity, m_bInitModelEffects) == 0xB40, "m_bInitModelEffects in C_BaseModelEntity should be at offset 0xB40");
		static_assert(offsetof(CS2::client::C_BaseModelEntity, m_bIsStaticProp) == 0xB41, "m_bIsStaticProp in C_BaseModelEntity should be at offset 0xB41");
		static_assert(offsetof(CS2::client::C_BaseModelEntity, m_nLastAddDecal) == 0xB44, "m_nLastAddDecal in C_BaseModelEntity should be at offset 0xB44");
		static_assert(offsetof(CS2::client::C_BaseModelEntity, m_nDecalsAdded) == 0xB48, "m_nDecalsAdded in C_BaseModelEntity should be at offset 0xB48");
		static_assert(offsetof(CS2::client::C_BaseModelEntity, m_iOldHealth) == 0xB4C, "m_iOldHealth in C_BaseModelEntity should be at offset 0xB4C");
		static_assert(offsetof(CS2::client::C_BaseModelEntity, m_nRenderMode) == 0xB50, "m_nRenderMode in C_BaseModelEntity should be at offset 0xB50");
		static_assert(offsetof(CS2::client::C_BaseModelEntity, m_nRenderFX) == 0xB51, "m_nRenderFX in C_BaseModelEntity should be at offset 0xB51");
		static_assert(offsetof(CS2::client::C_BaseModelEntity, m_bAllowFadeInView) == 0xB52, "m_bAllowFadeInView in C_BaseModelEntity should be at offset 0xB52");
		static_assert(offsetof(CS2::client::C_BaseModelEntity, m_clrRender) == 0xB70, "m_clrRender in C_BaseModelEntity should be at offset 0xB70");
		static_assert(offsetof(CS2::client::C_BaseModelEntity, m_vecRenderAttributes) == 0xB78, "m_vecRenderAttributes in C_BaseModelEntity should be at offset 0xB78");
		static_assert(offsetof(CS2::client::C_BaseModelEntity, m_bRenderToCubemaps) == 0xBF8, "m_bRenderToCubemaps in C_BaseModelEntity should be at offset 0xBF8");
		static_assert(offsetof(CS2::client::C_BaseModelEntity, m_bNoInterpolate) == 0xBF9, "m_bNoInterpolate in C_BaseModelEntity should be at offset 0xBF9");
		static_assert(offsetof(CS2::client::C_BaseModelEntity, m_Collision) == 0xC00, "m_Collision in C_BaseModelEntity should be at offset 0xC00");
		static_assert(offsetof(CS2::client::C_BaseModelEntity, m_Glow) == 0xCB0, "m_Glow in C_BaseModelEntity should be at offset 0xCB0");
		static_assert(offsetof(CS2::client::C_BaseModelEntity, m_flGlowBackfaceMult) == 0xD08, "m_flGlowBackfaceMult in C_BaseModelEntity should be at offset 0xD08");
		static_assert(offsetof(CS2::client::C_BaseModelEntity, m_fadeMinDist) == 0xD0C, "m_fadeMinDist in C_BaseModelEntity should be at offset 0xD0C");
		static_assert(offsetof(CS2::client::C_BaseModelEntity, m_fadeMaxDist) == 0xD10, "m_fadeMaxDist in C_BaseModelEntity should be at offset 0xD10");
		static_assert(offsetof(CS2::client::C_BaseModelEntity, m_flFadeScale) == 0xD14, "m_flFadeScale in C_BaseModelEntity should be at offset 0xD14");
		static_assert(offsetof(CS2::client::C_BaseModelEntity, m_flShadowStrength) == 0xD18, "m_flShadowStrength in C_BaseModelEntity should be at offset 0xD18");
		static_assert(offsetof(CS2::client::C_BaseModelEntity, m_nObjectCulling) == 0xD1C, "m_nObjectCulling in C_BaseModelEntity should be at offset 0xD1C");
		static_assert(offsetof(CS2::client::C_BaseModelEntity, m_nAddDecal) == 0xD20, "m_nAddDecal in C_BaseModelEntity should be at offset 0xD20");
		static_assert(offsetof(CS2::client::C_BaseModelEntity, m_vDecalPosition) == 0xD24, "m_vDecalPosition in C_BaseModelEntity should be at offset 0xD24");
		static_assert(offsetof(CS2::client::C_BaseModelEntity, m_vDecalForwardAxis) == 0xD30, "m_vDecalForwardAxis in C_BaseModelEntity should be at offset 0xD30");
		static_assert(offsetof(CS2::client::C_BaseModelEntity, m_nDecalMode) == 0xD3C, "m_nDecalMode in C_BaseModelEntity should be at offset 0xD3C");
		static_assert(offsetof(CS2::client::C_BaseModelEntity, m_nRequiredDecalMode) == 0xD3D, "m_nRequiredDecalMode in C_BaseModelEntity should be at offset 0xD3D");
		static_assert(offsetof(CS2::client::C_BaseModelEntity, m_ConfigEntitiesToPropagateMaterialDecalsTo) == 0xD40, "m_ConfigEntitiesToPropagateMaterialDecalsTo in C_BaseModelEntity should be at offset 0xD40");
		static_assert(offsetof(CS2::client::C_BaseModelEntity, m_vecViewOffset) == 0xD80, "m_vecViewOffset in C_BaseModelEntity should be at offset 0xD80");
		static_assert(offsetof(CS2::client::C_BaseModelEntity, m_pClientAlphaProperty) == 0xE60, "m_pClientAlphaProperty in C_BaseModelEntity should be at offset 0xE60");
		static_assert(offsetof(CS2::client::C_BaseModelEntity, m_ClientOverrideTint) == 0xE68, "m_ClientOverrideTint in C_BaseModelEntity should be at offset 0xE68");
		static_assert(offsetof(CS2::client::C_BaseModelEntity, m_bUseClientOverrideTint) == 0xE6C, "m_bUseClientOverrideTint in C_BaseModelEntity should be at offset 0xE6C");
		static_assert(offsetof(CS2::client::C_BaseModelEntity, m_bvDisabledHitGroups) == 0xEA8, "m_bvDisabledHitGroups in C_BaseModelEntity should be at offset 0xEA8");
		static_assert(sizeof(CS2::client::C_BaseModelEntity) == 0xEB0, "C_BaseModelEntity size should be 0xEB0");
	}
}
