// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#ifndef CUSTOM_GLOBAL_TYPES
	#include "../GlobalTypes.hpp"
#else
	#include "../Custom/GlobalTypes.hpp"
#endif


#include "C_BaseToggle.hpp"
#include "../entity2/CEntityIOOutput.hpp"
#include "C_BaseEntity.hpp"



namespace CS2 {
	namespace client {
		class CBaseFilter;
	}
}


using namespace GlobalTypes;
namespace CS2 {
	namespace client {
		class C_BaseTrigger : public CS2::client::C_BaseToggle {
		public:
			entity2::CEntityIOOutput m_OnStartTouch; // 0xe88 | Schema_DeclaredClass | Size: 0x18
			entity2::CEntityIOOutput m_OnStartTouchAll; // 0xea0 | Schema_DeclaredClass | Size: 0x18
			entity2::CEntityIOOutput m_OnEndTouch; // 0xeb8 | Schema_DeclaredClass | Size: 0x18
			entity2::CEntityIOOutput m_OnEndTouchAll; // 0xed0 | Schema_DeclaredClass | Size: 0x18
			entity2::CEntityIOOutput m_OnTouching; // 0xee8 | Schema_DeclaredClass | Size: 0x18
			entity2::CEntityIOOutput m_OnTouchingEachEntity; // 0xf00 | Schema_DeclaredClass | Size: 0x18
			entity2::CEntityIOOutput m_OnNotTouching; // 0xf18 | Schema_DeclaredClass | Size: 0x18
			GlobalTypes::CUtlVector<GlobalTypes::CHandle<client::C_BaseEntity>> m_hTouchingEntities; // 0xf30 | Schema_Atomic | Size: 0x18
			// char m_hTouchingEntities[0x18]; // 0xf30 | Schema_Atomic | Size: 0x18
			GlobalTypes::CUtlSymbolLarge m_iFilterName; // 0xf48 | Schema_Atomic | Size: 0x8
			GlobalTypes::CHandle<client::CBaseFilter> m_hFilter; // 0xf50 | Schema_Atomic | Size: 0x4
			// char m_hFilter[0x4]; // 0xf50 | Schema_Atomic | Size: 0x4
			bool m_bDisabled; // 0xf54 | Schema_Builtin | Size: 0x1
			S2_PAD(0x3); // End padding
		};
#ifdef USE_STATIC_ASSERTS
		static_assert(offsetof(CS2::client::C_BaseTrigger, m_OnStartTouch) == 0xE88, "m_OnStartTouch in C_BaseTrigger should be at offset 0xE88");
		static_assert(offsetof(CS2::client::C_BaseTrigger, m_OnStartTouchAll) == 0xEA0, "m_OnStartTouchAll in C_BaseTrigger should be at offset 0xEA0");
		static_assert(offsetof(CS2::client::C_BaseTrigger, m_OnEndTouch) == 0xEB8, "m_OnEndTouch in C_BaseTrigger should be at offset 0xEB8");
		static_assert(offsetof(CS2::client::C_BaseTrigger, m_OnEndTouchAll) == 0xED0, "m_OnEndTouchAll in C_BaseTrigger should be at offset 0xED0");
		static_assert(offsetof(CS2::client::C_BaseTrigger, m_OnTouching) == 0xEE8, "m_OnTouching in C_BaseTrigger should be at offset 0xEE8");
		static_assert(offsetof(CS2::client::C_BaseTrigger, m_OnTouchingEachEntity) == 0xF00, "m_OnTouchingEachEntity in C_BaseTrigger should be at offset 0xF00");
		static_assert(offsetof(CS2::client::C_BaseTrigger, m_OnNotTouching) == 0xF18, "m_OnNotTouching in C_BaseTrigger should be at offset 0xF18");
		static_assert(offsetof(CS2::client::C_BaseTrigger, m_hTouchingEntities) == 0xF30, "m_hTouchingEntities in C_BaseTrigger should be at offset 0xF30");
		static_assert(offsetof(CS2::client::C_BaseTrigger, m_iFilterName) == 0xF48, "m_iFilterName in C_BaseTrigger should be at offset 0xF48");
		static_assert(offsetof(CS2::client::C_BaseTrigger, m_hFilter) == 0xF50, "m_hFilter in C_BaseTrigger should be at offset 0xF50");
		static_assert(offsetof(CS2::client::C_BaseTrigger, m_bDisabled) == 0xF54, "m_bDisabled in C_BaseTrigger should be at offset 0xF54");
		static_assert(sizeof(CS2::client::C_BaseTrigger) == 0xF58, "C_BaseTrigger size should be 0xF58");

#endif
	}
}
