// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#ifndef CUSTOM_GLOBAL_TYPES
	#include "../GlobalTypes.hpp"
#else
	#include <Custom/GlobalTypes.hpp>
#endif


#include "C_BaseModelEntity.hpp"
#include "../entity2/GameTime_t.hpp"
#include "../entity2/CEntityIOOutput.hpp"





using namespace GlobalTypes;
namespace CS2 {
	namespace client {
		class C_BarnLight : public CS2::client::C_BaseModelEntity {
		public:
			bool m_bEnabled; // 0xe88 | Schema_Builtin | Size: 0x1
			S2_PAD(0x3);
			int32_t m_nColorMode; // 0xe8c | Schema_Builtin | Size: 0x4
			GlobalTypes::Color m_Color; // 0xe90 | Schema_Atomic | Size: 0x4
			float32 m_flColorTemperature; // 0xe94 | Schema_Builtin | Size: 0x4
			float32 m_flBrightness; // 0xe98 | Schema_Builtin | Size: 0x4
			float32 m_flBrightnessScale; // 0xe9c | Schema_Builtin | Size: 0x4
			int32_t m_nDirectLight; // 0xea0 | Schema_Builtin | Size: 0x4
			int32_t m_nBakedShadowIndex; // 0xea4 | Schema_Builtin | Size: 0x4
			int32_t m_nLightPathUniqueId; // 0xea8 | Schema_Builtin | Size: 0x4
			int32_t m_nLightMapUniqueId; // 0xeac | Schema_Builtin | Size: 0x4
			int32_t m_nLuminaireShape; // 0xeb0 | Schema_Builtin | Size: 0x4
			float32 m_flLuminaireSize; // 0xeb4 | Schema_Builtin | Size: 0x4
			float32 m_flLuminaireAnisotropy; // 0xeb8 | Schema_Builtin | Size: 0x4
			S2_PAD(0x4);
			GlobalTypes::CUtlString m_LightStyleString; // 0xec0 | Schema_Atomic | Size: 0x8
			entity2::GameTime_t m_flLightStyleStartTime; // 0xec8 | Schema_DeclaredClass | Size: 0x4
			S2_PAD(0x4);
			// GlobalTypes::C_NetworkUtlVectorBase<GlobalTypes::CUtlString> m_QueuedLightStyleStrings; // 0xed0 | Schema_Atomic | Size: 0x18
			char m_QueuedLightStyleStrings[0x18]; // 0xed0 | Schema_Atomic | Size: 0x18
			// GlobalTypes::C_NetworkUtlVectorBase<GlobalTypes::CUtlString> m_LightStyleEvents; // 0xee8 | Schema_Atomic | Size: 0x18
			char m_LightStyleEvents[0x18]; // 0xee8 | Schema_Atomic | Size: 0x18
			// client::C_NetworkUtlVectorBase<GlobalTypes::CHandle<client::C_BaseModelEntity>> m_LightStyleTargets; // 0xf00 | Schema_Atomic | Size: 0x18
			char m_LightStyleTargets[0x18]; // 0xf00 | Schema_Atomic | Size: 0x18
			entity2::CEntityIOOutput m_StyleEvent[4]; // 0xf18 | Schema_FixedArray | Size: 0x60
			// GlobalTypes::CStrongHandle<resourcesystem::InfoForResourceTypeCTextureBase> m_hLightCookie; // 0xf78 | Schema_Atomic | Size: 0x8
			char m_hLightCookie[0x8]; // 0xf78 | Schema_Atomic | Size: 0x8
			float32 m_flShape; // 0xf80 | Schema_Builtin | Size: 0x4
			float32 m_flSoftX; // 0xf84 | Schema_Builtin | Size: 0x4
			float32 m_flSoftY; // 0xf88 | Schema_Builtin | Size: 0x4
			float32 m_flSkirt; // 0xf8c | Schema_Builtin | Size: 0x4
			float32 m_flSkirtNear; // 0xf90 | Schema_Builtin | Size: 0x4
			GlobalTypes::Vector m_vSizeParams; // 0xf94 | Schema_Atomic | Size: 0xc
			float32 m_flRange; // 0xfa0 | Schema_Builtin | Size: 0x4
			GlobalTypes::Vector m_vShear; // 0xfa4 | Schema_Atomic | Size: 0xc
			int32_t m_nBakeSpecularToCubemaps; // 0xfb0 | Schema_Builtin | Size: 0x4
			GlobalTypes::Vector m_vBakeSpecularToCubemapsSize; // 0xfb4 | Schema_Atomic | Size: 0xc
			int32_t m_nCastShadows; // 0xfc0 | Schema_Builtin | Size: 0x4
			int32_t m_nShadowMapSize; // 0xfc4 | Schema_Builtin | Size: 0x4
			int32_t m_nShadowPriority; // 0xfc8 | Schema_Builtin | Size: 0x4
			bool m_bContactShadow; // 0xfcc | Schema_Builtin | Size: 0x1
			bool m_bForceShadowsEnabled; // 0xfcd | Schema_Builtin | Size: 0x1
			S2_PAD(0x2);
			int32_t m_nBounceLight; // 0xfd0 | Schema_Builtin | Size: 0x4
			float32 m_flBounceScale; // 0xfd4 | Schema_Builtin | Size: 0x4
			bool m_bDynamicBounce; // 0xfd8 | Schema_Builtin | Size: 0x1
			S2_PAD(0x3);
			float32 m_flMinRoughness; // 0xfdc | Schema_Builtin | Size: 0x4
			GlobalTypes::Vector m_vAlternateColor; // 0xfe0 | Schema_Atomic | Size: 0xc
			float32 m_fAlternateColorBrightness; // 0xfec | Schema_Builtin | Size: 0x4
			int32_t m_nFog; // 0xff0 | Schema_Builtin | Size: 0x4
			float32 m_flFogStrength; // 0xff4 | Schema_Builtin | Size: 0x4
			int32_t m_nFogShadows; // 0xff8 | Schema_Builtin | Size: 0x4
			float32 m_flFogScale; // 0xffc | Schema_Builtin | Size: 0x4
			bool m_bFogMixedShadows; // 0x1000 | Schema_Builtin | Size: 0x1
			S2_PAD(0x3);
			float32 m_flFadeSizeStart; // 0x1004 | Schema_Builtin | Size: 0x4
			float32 m_flFadeSizeEnd; // 0x1008 | Schema_Builtin | Size: 0x4
			float32 m_flShadowFadeSizeStart; // 0x100c | Schema_Builtin | Size: 0x4
			float32 m_flShadowFadeSizeEnd; // 0x1010 | Schema_Builtin | Size: 0x4
			bool m_bPrecomputedFieldsValid; // 0x1014 | Schema_Builtin | Size: 0x1
			S2_PAD(0x3);
			GlobalTypes::Vector m_vPrecomputedBoundsMins; // 0x1018 | Schema_Atomic | Size: 0xc
			GlobalTypes::Vector m_vPrecomputedBoundsMaxs; // 0x1024 | Schema_Atomic | Size: 0xc
			GlobalTypes::Vector m_vPrecomputedOBBOrigin; // 0x1030 | Schema_Atomic | Size: 0xc
			GlobalTypes::QAngle m_vPrecomputedOBBAngles; // 0x103c | Schema_Atomic | Size: 0xc
			GlobalTypes::Vector m_vPrecomputedOBBExtent; // 0x1048 | Schema_Atomic | Size: 0xc
			int32_t m_nPrecomputedSubFrusta; // 0x1054 | Schema_Builtin | Size: 0x4
			GlobalTypes::Vector m_vPrecomputedOBBOrigin0; // 0x1058 | Schema_Atomic | Size: 0xc
			GlobalTypes::QAngle m_vPrecomputedOBBAngles0; // 0x1064 | Schema_Atomic | Size: 0xc
			GlobalTypes::Vector m_vPrecomputedOBBExtent0; // 0x1070 | Schema_Atomic | Size: 0xc
			GlobalTypes::Vector m_vPrecomputedOBBOrigin1; // 0x107c | Schema_Atomic | Size: 0xc
			GlobalTypes::QAngle m_vPrecomputedOBBAngles1; // 0x1088 | Schema_Atomic | Size: 0xc
			GlobalTypes::Vector m_vPrecomputedOBBExtent1; // 0x1094 | Schema_Atomic | Size: 0xc
			GlobalTypes::Vector m_vPrecomputedOBBOrigin2; // 0x10a0 | Schema_Atomic | Size: 0xc
			GlobalTypes::QAngle m_vPrecomputedOBBAngles2; // 0x10ac | Schema_Atomic | Size: 0xc
			GlobalTypes::Vector m_vPrecomputedOBBExtent2; // 0x10b8 | Schema_Atomic | Size: 0xc
			GlobalTypes::Vector m_vPrecomputedOBBOrigin3; // 0x10c4 | Schema_Atomic | Size: 0xc
			GlobalTypes::QAngle m_vPrecomputedOBBAngles3; // 0x10d0 | Schema_Atomic | Size: 0xc
			GlobalTypes::Vector m_vPrecomputedOBBExtent3; // 0x10dc | Schema_Atomic | Size: 0xc
			GlobalTypes::Vector m_vPrecomputedOBBOrigin4; // 0x10e8 | Schema_Atomic | Size: 0xc
			GlobalTypes::QAngle m_vPrecomputedOBBAngles4; // 0x10f4 | Schema_Atomic | Size: 0xc
			GlobalTypes::Vector m_vPrecomputedOBBExtent4; // 0x1100 | Schema_Atomic | Size: 0xc
			GlobalTypes::Vector m_vPrecomputedOBBOrigin5; // 0x110c | Schema_Atomic | Size: 0xc
			GlobalTypes::QAngle m_vPrecomputedOBBAngles5; // 0x1118 | Schema_Atomic | Size: 0xc
			GlobalTypes::Vector m_vPrecomputedOBBExtent5; // 0x1124 | Schema_Atomic | Size: 0xc
			S2_PAD(0x40);
			bool m_bInitialBoneSetup; // 0x1170 | Schema_Builtin | Size: 0x1
			S2_PAD(0x7);
			// GlobalTypes::C_NetworkUtlVectorBase< uint16 > m_VisClusters; // 0x1178 | Schema_Atomic | Size: 0x18
			char m_VisClusters[0x18]; // 0x1178 | Schema_Atomic | Size: 0x18
			S2_PAD(0x8); // End padding
		};
#ifdef USE_STATIC_ASSERTS
		static_assert(offsetof(CS2::client::C_BarnLight, m_bEnabled) == 0xE88, "m_bEnabled in C_BarnLight should be at offset 0xE88");
		static_assert(offsetof(CS2::client::C_BarnLight, m_nColorMode) == 0xE8C, "m_nColorMode in C_BarnLight should be at offset 0xE8C");
		static_assert(offsetof(CS2::client::C_BarnLight, m_Color) == 0xE90, "m_Color in C_BarnLight should be at offset 0xE90");
		static_assert(offsetof(CS2::client::C_BarnLight, m_flColorTemperature) == 0xE94, "m_flColorTemperature in C_BarnLight should be at offset 0xE94");
		static_assert(offsetof(CS2::client::C_BarnLight, m_flBrightness) == 0xE98, "m_flBrightness in C_BarnLight should be at offset 0xE98");
		static_assert(offsetof(CS2::client::C_BarnLight, m_flBrightnessScale) == 0xE9C, "m_flBrightnessScale in C_BarnLight should be at offset 0xE9C");
		static_assert(offsetof(CS2::client::C_BarnLight, m_nDirectLight) == 0xEA0, "m_nDirectLight in C_BarnLight should be at offset 0xEA0");
		static_assert(offsetof(CS2::client::C_BarnLight, m_nBakedShadowIndex) == 0xEA4, "m_nBakedShadowIndex in C_BarnLight should be at offset 0xEA4");
		static_assert(offsetof(CS2::client::C_BarnLight, m_nLightPathUniqueId) == 0xEA8, "m_nLightPathUniqueId in C_BarnLight should be at offset 0xEA8");
		static_assert(offsetof(CS2::client::C_BarnLight, m_nLightMapUniqueId) == 0xEAC, "m_nLightMapUniqueId in C_BarnLight should be at offset 0xEAC");
		static_assert(offsetof(CS2::client::C_BarnLight, m_nLuminaireShape) == 0xEB0, "m_nLuminaireShape in C_BarnLight should be at offset 0xEB0");
		static_assert(offsetof(CS2::client::C_BarnLight, m_flLuminaireSize) == 0xEB4, "m_flLuminaireSize in C_BarnLight should be at offset 0xEB4");
		static_assert(offsetof(CS2::client::C_BarnLight, m_flLuminaireAnisotropy) == 0xEB8, "m_flLuminaireAnisotropy in C_BarnLight should be at offset 0xEB8");
		static_assert(offsetof(CS2::client::C_BarnLight, m_LightStyleString) == 0xEC0, "m_LightStyleString in C_BarnLight should be at offset 0xEC0");
		static_assert(offsetof(CS2::client::C_BarnLight, m_flLightStyleStartTime) == 0xEC8, "m_flLightStyleStartTime in C_BarnLight should be at offset 0xEC8");
		static_assert(offsetof(CS2::client::C_BarnLight, m_QueuedLightStyleStrings) == 0xED0, "m_QueuedLightStyleStrings in C_BarnLight should be at offset 0xED0");
		static_assert(offsetof(CS2::client::C_BarnLight, m_LightStyleEvents) == 0xEE8, "m_LightStyleEvents in C_BarnLight should be at offset 0xEE8");
		static_assert(offsetof(CS2::client::C_BarnLight, m_LightStyleTargets) == 0xF00, "m_LightStyleTargets in C_BarnLight should be at offset 0xF00");
		static_assert(offsetof(CS2::client::C_BarnLight, m_StyleEvent) == 0xF18, "m_StyleEvent in C_BarnLight should be at offset 0xF18");
		static_assert(offsetof(CS2::client::C_BarnLight, m_hLightCookie) == 0xF78, "m_hLightCookie in C_BarnLight should be at offset 0xF78");
		static_assert(offsetof(CS2::client::C_BarnLight, m_flShape) == 0xF80, "m_flShape in C_BarnLight should be at offset 0xF80");
		static_assert(offsetof(CS2::client::C_BarnLight, m_flSoftX) == 0xF84, "m_flSoftX in C_BarnLight should be at offset 0xF84");
		static_assert(offsetof(CS2::client::C_BarnLight, m_flSoftY) == 0xF88, "m_flSoftY in C_BarnLight should be at offset 0xF88");
		static_assert(offsetof(CS2::client::C_BarnLight, m_flSkirt) == 0xF8C, "m_flSkirt in C_BarnLight should be at offset 0xF8C");
		static_assert(offsetof(CS2::client::C_BarnLight, m_flSkirtNear) == 0xF90, "m_flSkirtNear in C_BarnLight should be at offset 0xF90");
		static_assert(offsetof(CS2::client::C_BarnLight, m_vSizeParams) == 0xF94, "m_vSizeParams in C_BarnLight should be at offset 0xF94");
		static_assert(offsetof(CS2::client::C_BarnLight, m_flRange) == 0xFA0, "m_flRange in C_BarnLight should be at offset 0xFA0");
		static_assert(offsetof(CS2::client::C_BarnLight, m_vShear) == 0xFA4, "m_vShear in C_BarnLight should be at offset 0xFA4");
		static_assert(offsetof(CS2::client::C_BarnLight, m_nBakeSpecularToCubemaps) == 0xFB0, "m_nBakeSpecularToCubemaps in C_BarnLight should be at offset 0xFB0");
		static_assert(offsetof(CS2::client::C_BarnLight, m_vBakeSpecularToCubemapsSize) == 0xFB4, "m_vBakeSpecularToCubemapsSize in C_BarnLight should be at offset 0xFB4");
		static_assert(offsetof(CS2::client::C_BarnLight, m_nCastShadows) == 0xFC0, "m_nCastShadows in C_BarnLight should be at offset 0xFC0");
		static_assert(offsetof(CS2::client::C_BarnLight, m_nShadowMapSize) == 0xFC4, "m_nShadowMapSize in C_BarnLight should be at offset 0xFC4");
		static_assert(offsetof(CS2::client::C_BarnLight, m_nShadowPriority) == 0xFC8, "m_nShadowPriority in C_BarnLight should be at offset 0xFC8");
		static_assert(offsetof(CS2::client::C_BarnLight, m_bContactShadow) == 0xFCC, "m_bContactShadow in C_BarnLight should be at offset 0xFCC");
		static_assert(offsetof(CS2::client::C_BarnLight, m_bForceShadowsEnabled) == 0xFCD, "m_bForceShadowsEnabled in C_BarnLight should be at offset 0xFCD");
		static_assert(offsetof(CS2::client::C_BarnLight, m_nBounceLight) == 0xFD0, "m_nBounceLight in C_BarnLight should be at offset 0xFD0");
		static_assert(offsetof(CS2::client::C_BarnLight, m_flBounceScale) == 0xFD4, "m_flBounceScale in C_BarnLight should be at offset 0xFD4");
		static_assert(offsetof(CS2::client::C_BarnLight, m_bDynamicBounce) == 0xFD8, "m_bDynamicBounce in C_BarnLight should be at offset 0xFD8");
		static_assert(offsetof(CS2::client::C_BarnLight, m_flMinRoughness) == 0xFDC, "m_flMinRoughness in C_BarnLight should be at offset 0xFDC");
		static_assert(offsetof(CS2::client::C_BarnLight, m_vAlternateColor) == 0xFE0, "m_vAlternateColor in C_BarnLight should be at offset 0xFE0");
		static_assert(offsetof(CS2::client::C_BarnLight, m_fAlternateColorBrightness) == 0xFEC, "m_fAlternateColorBrightness in C_BarnLight should be at offset 0xFEC");
		static_assert(offsetof(CS2::client::C_BarnLight, m_nFog) == 0xFF0, "m_nFog in C_BarnLight should be at offset 0xFF0");
		static_assert(offsetof(CS2::client::C_BarnLight, m_flFogStrength) == 0xFF4, "m_flFogStrength in C_BarnLight should be at offset 0xFF4");
		static_assert(offsetof(CS2::client::C_BarnLight, m_nFogShadows) == 0xFF8, "m_nFogShadows in C_BarnLight should be at offset 0xFF8");
		static_assert(offsetof(CS2::client::C_BarnLight, m_flFogScale) == 0xFFC, "m_flFogScale in C_BarnLight should be at offset 0xFFC");
		static_assert(offsetof(CS2::client::C_BarnLight, m_bFogMixedShadows) == 0x1000, "m_bFogMixedShadows in C_BarnLight should be at offset 0x1000");
		static_assert(offsetof(CS2::client::C_BarnLight, m_flFadeSizeStart) == 0x1004, "m_flFadeSizeStart in C_BarnLight should be at offset 0x1004");
		static_assert(offsetof(CS2::client::C_BarnLight, m_flFadeSizeEnd) == 0x1008, "m_flFadeSizeEnd in C_BarnLight should be at offset 0x1008");
		static_assert(offsetof(CS2::client::C_BarnLight, m_flShadowFadeSizeStart) == 0x100C, "m_flShadowFadeSizeStart in C_BarnLight should be at offset 0x100C");
		static_assert(offsetof(CS2::client::C_BarnLight, m_flShadowFadeSizeEnd) == 0x1010, "m_flShadowFadeSizeEnd in C_BarnLight should be at offset 0x1010");
		static_assert(offsetof(CS2::client::C_BarnLight, m_bPrecomputedFieldsValid) == 0x1014, "m_bPrecomputedFieldsValid in C_BarnLight should be at offset 0x1014");
		static_assert(offsetof(CS2::client::C_BarnLight, m_vPrecomputedBoundsMins) == 0x1018, "m_vPrecomputedBoundsMins in C_BarnLight should be at offset 0x1018");
		static_assert(offsetof(CS2::client::C_BarnLight, m_vPrecomputedBoundsMaxs) == 0x1024, "m_vPrecomputedBoundsMaxs in C_BarnLight should be at offset 0x1024");
		static_assert(offsetof(CS2::client::C_BarnLight, m_vPrecomputedOBBOrigin) == 0x1030, "m_vPrecomputedOBBOrigin in C_BarnLight should be at offset 0x1030");
		static_assert(offsetof(CS2::client::C_BarnLight, m_vPrecomputedOBBAngles) == 0x103C, "m_vPrecomputedOBBAngles in C_BarnLight should be at offset 0x103C");
		static_assert(offsetof(CS2::client::C_BarnLight, m_vPrecomputedOBBExtent) == 0x1048, "m_vPrecomputedOBBExtent in C_BarnLight should be at offset 0x1048");
		static_assert(offsetof(CS2::client::C_BarnLight, m_nPrecomputedSubFrusta) == 0x1054, "m_nPrecomputedSubFrusta in C_BarnLight should be at offset 0x1054");
		static_assert(offsetof(CS2::client::C_BarnLight, m_vPrecomputedOBBOrigin0) == 0x1058, "m_vPrecomputedOBBOrigin0 in C_BarnLight should be at offset 0x1058");
		static_assert(offsetof(CS2::client::C_BarnLight, m_vPrecomputedOBBAngles0) == 0x1064, "m_vPrecomputedOBBAngles0 in C_BarnLight should be at offset 0x1064");
		static_assert(offsetof(CS2::client::C_BarnLight, m_vPrecomputedOBBExtent0) == 0x1070, "m_vPrecomputedOBBExtent0 in C_BarnLight should be at offset 0x1070");
		static_assert(offsetof(CS2::client::C_BarnLight, m_vPrecomputedOBBOrigin1) == 0x107C, "m_vPrecomputedOBBOrigin1 in C_BarnLight should be at offset 0x107C");
		static_assert(offsetof(CS2::client::C_BarnLight, m_vPrecomputedOBBAngles1) == 0x1088, "m_vPrecomputedOBBAngles1 in C_BarnLight should be at offset 0x1088");
		static_assert(offsetof(CS2::client::C_BarnLight, m_vPrecomputedOBBExtent1) == 0x1094, "m_vPrecomputedOBBExtent1 in C_BarnLight should be at offset 0x1094");
		static_assert(offsetof(CS2::client::C_BarnLight, m_vPrecomputedOBBOrigin2) == 0x10A0, "m_vPrecomputedOBBOrigin2 in C_BarnLight should be at offset 0x10A0");
		static_assert(offsetof(CS2::client::C_BarnLight, m_vPrecomputedOBBAngles2) == 0x10AC, "m_vPrecomputedOBBAngles2 in C_BarnLight should be at offset 0x10AC");
		static_assert(offsetof(CS2::client::C_BarnLight, m_vPrecomputedOBBExtent2) == 0x10B8, "m_vPrecomputedOBBExtent2 in C_BarnLight should be at offset 0x10B8");
		static_assert(offsetof(CS2::client::C_BarnLight, m_vPrecomputedOBBOrigin3) == 0x10C4, "m_vPrecomputedOBBOrigin3 in C_BarnLight should be at offset 0x10C4");
		static_assert(offsetof(CS2::client::C_BarnLight, m_vPrecomputedOBBAngles3) == 0x10D0, "m_vPrecomputedOBBAngles3 in C_BarnLight should be at offset 0x10D0");
		static_assert(offsetof(CS2::client::C_BarnLight, m_vPrecomputedOBBExtent3) == 0x10DC, "m_vPrecomputedOBBExtent3 in C_BarnLight should be at offset 0x10DC");
		static_assert(offsetof(CS2::client::C_BarnLight, m_vPrecomputedOBBOrigin4) == 0x10E8, "m_vPrecomputedOBBOrigin4 in C_BarnLight should be at offset 0x10E8");
		static_assert(offsetof(CS2::client::C_BarnLight, m_vPrecomputedOBBAngles4) == 0x10F4, "m_vPrecomputedOBBAngles4 in C_BarnLight should be at offset 0x10F4");
		static_assert(offsetof(CS2::client::C_BarnLight, m_vPrecomputedOBBExtent4) == 0x1100, "m_vPrecomputedOBBExtent4 in C_BarnLight should be at offset 0x1100");
		static_assert(offsetof(CS2::client::C_BarnLight, m_vPrecomputedOBBOrigin5) == 0x110C, "m_vPrecomputedOBBOrigin5 in C_BarnLight should be at offset 0x110C");
		static_assert(offsetof(CS2::client::C_BarnLight, m_vPrecomputedOBBAngles5) == 0x1118, "m_vPrecomputedOBBAngles5 in C_BarnLight should be at offset 0x1118");
		static_assert(offsetof(CS2::client::C_BarnLight, m_vPrecomputedOBBExtent5) == 0x1124, "m_vPrecomputedOBBExtent5 in C_BarnLight should be at offset 0x1124");
		static_assert(offsetof(CS2::client::C_BarnLight, m_bInitialBoneSetup) == 0x1170, "m_bInitialBoneSetup in C_BarnLight should be at offset 0x1170");
		static_assert(offsetof(CS2::client::C_BarnLight, m_VisClusters) == 0x1178, "m_VisClusters in C_BarnLight should be at offset 0x1178");
		static_assert(sizeof(CS2::client::C_BarnLight) == 0x1198, "C_BarnLight size should be 0x1198");

#endif
	}
}
