// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#ifndef CUSTOM_GLOBAL_TYPES
	#include "../GlobalTypes.hpp"
#else
	#include "../Custom/GlobalTypes.hpp"
#endif


#include "CBaseAnimGraph.hpp"
#include "SceneEventId_t.hpp"
#include "../modellib/AttachmentHandle_t.hpp"
#include "C_BaseFlex_Emphasized_Phoneme.hpp"





using namespace GlobalTypes;
namespace CS2 {
	namespace client {
		class C_BaseFlex : public CS2::client::CBaseAnimGraph {
		public:
			S2_PAD(0x8);
			// GlobalTypes::C_NetworkUtlVectorBase< float32 > m_flexWeight; // 0x1170 | Schema_Atomic | Size: 0x18
			char m_flexWeight[0x18]; // 0x1170 | Schema_Atomic | Size: 0x18
			GlobalTypes::VectorWS m_vLookTargetPosition; // 0x1188 | Schema_Atomic | Size: 0xc
			S2_PAD(0xdc);
			int32_t m_nLastFlexUpdateFrameCount; // 0x1270 | Schema_Builtin | Size: 0x4
			GlobalTypes::Vector m_CachedViewTarget; // 0x1274 | Schema_Atomic | Size: 0xc
			client::SceneEventId_t m_nNextSceneEventId; // 0x1280 | Schema_DeclaredClass | Size: 0x4
			modellib::AttachmentHandle_t m_iMouthAttachment; // 0x1284 | Schema_DeclaredClass | Size: 0x1
			modellib::AttachmentHandle_t m_iEyeAttachment; // 0x1285 | Schema_DeclaredClass | Size: 0x1
			bool m_bResetFlexWeightsOnModelChange; // 0x1286 | Schema_Builtin | Size: 0x1
			S2_PAD(0x19);
			int32_t m_nEyeOcclusionRendererBone; // 0x12a0 | Schema_Builtin | Size: 0x4
			GlobalTypes::matrix3x4_t m_mEyeOcclusionRendererCameraToBoneTransform; // 0x12a4 | Schema_Atomic | Size: 0x30
			GlobalTypes::Vector m_vEyeOcclusionRendererHalfExtent; // 0x12d4 | Schema_Atomic | Size: 0xc
			S2_PAD(0x10);
			client::C_BaseFlex_Emphasized_Phoneme m_PhonemeClasses[3]; // 0x12f0 | Schema_FixedArray | Size: 0x60
		};
		static_assert(offsetof(CS2::client::C_BaseFlex, m_flexWeight) == 0x1170, "m_flexWeight in C_BaseFlex should be at offset 0x1170");
		static_assert(offsetof(CS2::client::C_BaseFlex, m_vLookTargetPosition) == 0x1188, "m_vLookTargetPosition in C_BaseFlex should be at offset 0x1188");
		static_assert(offsetof(CS2::client::C_BaseFlex, m_nLastFlexUpdateFrameCount) == 0x1270, "m_nLastFlexUpdateFrameCount in C_BaseFlex should be at offset 0x1270");
		static_assert(offsetof(CS2::client::C_BaseFlex, m_CachedViewTarget) == 0x1274, "m_CachedViewTarget in C_BaseFlex should be at offset 0x1274");
		static_assert(offsetof(CS2::client::C_BaseFlex, m_nNextSceneEventId) == 0x1280, "m_nNextSceneEventId in C_BaseFlex should be at offset 0x1280");
		static_assert(offsetof(CS2::client::C_BaseFlex, m_iMouthAttachment) == 0x1284, "m_iMouthAttachment in C_BaseFlex should be at offset 0x1284");
		static_assert(offsetof(CS2::client::C_BaseFlex, m_iEyeAttachment) == 0x1285, "m_iEyeAttachment in C_BaseFlex should be at offset 0x1285");
		static_assert(offsetof(CS2::client::C_BaseFlex, m_bResetFlexWeightsOnModelChange) == 0x1286, "m_bResetFlexWeightsOnModelChange in C_BaseFlex should be at offset 0x1286");
		static_assert(offsetof(CS2::client::C_BaseFlex, m_nEyeOcclusionRendererBone) == 0x12A0, "m_nEyeOcclusionRendererBone in C_BaseFlex should be at offset 0x12A0");
		static_assert(offsetof(CS2::client::C_BaseFlex, m_mEyeOcclusionRendererCameraToBoneTransform) == 0x12A4, "m_mEyeOcclusionRendererCameraToBoneTransform in C_BaseFlex should be at offset 0x12A4");
		static_assert(offsetof(CS2::client::C_BaseFlex, m_vEyeOcclusionRendererHalfExtent) == 0x12D4, "m_vEyeOcclusionRendererHalfExtent in C_BaseFlex should be at offset 0x12D4");
		static_assert(offsetof(CS2::client::C_BaseFlex, m_PhonemeClasses) == 0x12F0, "m_PhonemeClasses in C_BaseFlex should be at offset 0x12F0");
		static_assert(sizeof(CS2::client::C_BaseFlex) == 0x1350, "C_BaseFlex size should be 0x1350");
	}
}
