// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#include <SDK/GlobalTypes.hpp>

#include <SDK/client/C_BaseModelEntity.hpp>
#include <SDK/entity2/GameTime_t.hpp>
#include <SDK/entity2/CEntityIOOutput.hpp>



namespace CS2 {
	namespace client {
		class C_BarnLight : public CS2::client::C_BaseModelEntity {
		public:
			public:
			bool m_bEnabled; // 0xec0 | Schema_Builtin | Size: 0x1
			S2_PAD(0x3);
			int32_t m_nColorMode; // 0xec4 | Schema_Builtin | Size: 0x4
			GlobalTypes::Color m_Color; // 0xec8 | Schema_Atomic | Size: 0x4
			float32 m_flColorTemperature; // 0xecc | Schema_Builtin | Size: 0x4
			float32 m_flBrightness; // 0xed0 | Schema_Builtin | Size: 0x4
			float32 m_flBrightnessScale; // 0xed4 | Schema_Builtin | Size: 0x4
			int32_t m_nDirectLight; // 0xed8 | Schema_Builtin | Size: 0x4
			int32_t m_nBakedShadowIndex; // 0xedc | Schema_Builtin | Size: 0x4
			int32_t m_nLightPathUniqueId; // 0xee0 | Schema_Builtin | Size: 0x4
			int32_t m_nLightMapUniqueId; // 0xee4 | Schema_Builtin | Size: 0x4
			int32_t m_nLuminaireShape; // 0xee8 | Schema_Builtin | Size: 0x4
			float32 m_flLuminaireSize; // 0xeec | Schema_Builtin | Size: 0x4
			float32 m_flLuminaireAnisotropy; // 0xef0 | Schema_Builtin | Size: 0x4
			S2_PAD(0x4);
			GlobalTypes::CUtlString m_LightStyleString; // 0xef8 | Schema_Atomic | Size: 0x8
			entity2::GameTime_t m_flLightStyleStartTime; // 0xf00 | Schema_DeclaredClass | Size: 0x4
			S2_PAD(0x4);
			// GlobalTypes::C_NetworkUtlVectorBase< GlobalTypes::CUtlString > m_QueuedLightStyleStrings; // 0xf08 | Schema_Atomic | Size: 0x18
			char  m_QueuedLightStyleStrings[0x18]; // 0xf08 | Schema_Atomic | Size: 0x18
			// GlobalTypes::C_NetworkUtlVectorBase< GlobalTypes::CUtlString > m_LightStyleEvents; // 0xf20 | Schema_Atomic | Size: 0x18
			char  m_LightStyleEvents[0x18]; // 0xf20 | Schema_Atomic | Size: 0x18
			// client::C_NetworkUtlVectorBase< client.dll::CHandle< C_BaseModelEntity > > m_LightStyleTargets; // 0xf38 | Schema_Atomic | Size: 0x18
			char  m_LightStyleTargets[0x18]; // 0xf38 | Schema_Atomic | Size: 0x18
			entity2::CEntityIOOutput m_StyleEvent[4]; // 0xf50 | Schema_FixedArray | Size: 0x280
			// GlobalTypes::CStrongHandle< resourcesystem::InfoForResourceTypeCTextureBase > m_hLightCookie; // 0xff0 | Schema_Atomic | Size: 0x8
			char  m_hLightCookie[0x8]; // 0xff0 | Schema_Atomic | Size: 0x8
			float32 m_flShape; // 0xff8 | Schema_Builtin | Size: 0x4
			float32 m_flSoftX; // 0xffc | Schema_Builtin | Size: 0x4
			float32 m_flSoftY; // 0x1000 | Schema_Builtin | Size: 0x4
			float32 m_flSkirt; // 0x1004 | Schema_Builtin | Size: 0x4
			float32 m_flSkirtNear; // 0x1008 | Schema_Builtin | Size: 0x4
			GlobalTypes::Vector m_vSizeParams; // 0x100c | Schema_Atomic | Size: 0xc
			float32 m_flRange; // 0x1018 | Schema_Builtin | Size: 0x4
			GlobalTypes::Vector m_vShear; // 0x101c | Schema_Atomic | Size: 0xc
			int32_t m_nBakeSpecularToCubemaps; // 0x1028 | Schema_Builtin | Size: 0x4
			GlobalTypes::Vector m_vBakeSpecularToCubemapsSize; // 0x102c | Schema_Atomic | Size: 0xc
			int32_t m_nCastShadows; // 0x1038 | Schema_Builtin | Size: 0x4
			int32_t m_nShadowMapSize; // 0x103c | Schema_Builtin | Size: 0x4
			int32_t m_nShadowPriority; // 0x1040 | Schema_Builtin | Size: 0x4
			bool m_bContactShadow; // 0x1044 | Schema_Builtin | Size: 0x1
			bool m_bForceShadowsEnabled; // 0x1045 | Schema_Builtin | Size: 0x1
			S2_PAD(0x2);
			int32_t m_nBounceLight; // 0x1048 | Schema_Builtin | Size: 0x4
			float32 m_flBounceScale; // 0x104c | Schema_Builtin | Size: 0x4
			float32 m_flMinRoughness; // 0x1050 | Schema_Builtin | Size: 0x4
			GlobalTypes::Vector m_vAlternateColor; // 0x1054 | Schema_Atomic | Size: 0xc
			float32 m_fAlternateColorBrightness; // 0x1060 | Schema_Builtin | Size: 0x4
			int32_t m_nFog; // 0x1064 | Schema_Builtin | Size: 0x4
			float32 m_flFogStrength; // 0x1068 | Schema_Builtin | Size: 0x4
			int32_t m_nFogShadows; // 0x106c | Schema_Builtin | Size: 0x4
			float32 m_flFogScale; // 0x1070 | Schema_Builtin | Size: 0x4
			bool m_bFogMixedShadows; // 0x1074 | Schema_Builtin | Size: 0x1
			S2_PAD(0x3);
			float32 m_flFadeSizeStart; // 0x1078 | Schema_Builtin | Size: 0x4
			float32 m_flFadeSizeEnd; // 0x107c | Schema_Builtin | Size: 0x4
			float32 m_flShadowFadeSizeStart; // 0x1080 | Schema_Builtin | Size: 0x4
			float32 m_flShadowFadeSizeEnd; // 0x1084 | Schema_Builtin | Size: 0x4
			bool m_bPrecomputedFieldsValid; // 0x1088 | Schema_Builtin | Size: 0x1
			S2_PAD(0x3);
			GlobalTypes::Vector m_vPrecomputedBoundsMins; // 0x108c | Schema_Atomic | Size: 0xc
			GlobalTypes::Vector m_vPrecomputedBoundsMaxs; // 0x1098 | Schema_Atomic | Size: 0xc
			GlobalTypes::Vector m_vPrecomputedOBBOrigin; // 0x10a4 | Schema_Atomic | Size: 0xc
			GlobalTypes::QAngle m_vPrecomputedOBBAngles; // 0x10b0 | Schema_Atomic | Size: 0xc
			GlobalTypes::Vector m_vPrecomputedOBBExtent; // 0x10bc | Schema_Atomic | Size: 0xc
			int32_t m_nPrecomputedSubFrusta; // 0x10c8 | Schema_Builtin | Size: 0x4
			GlobalTypes::Vector m_vPrecomputedOBBOrigin0; // 0x10cc | Schema_Atomic | Size: 0xc
			GlobalTypes::QAngle m_vPrecomputedOBBAngles0; // 0x10d8 | Schema_Atomic | Size: 0xc
			GlobalTypes::Vector m_vPrecomputedOBBExtent0; // 0x10e4 | Schema_Atomic | Size: 0xc
			GlobalTypes::Vector m_vPrecomputedOBBOrigin1; // 0x10f0 | Schema_Atomic | Size: 0xc
			GlobalTypes::QAngle m_vPrecomputedOBBAngles1; // 0x10fc | Schema_Atomic | Size: 0xc
			GlobalTypes::Vector m_vPrecomputedOBBExtent1; // 0x1108 | Schema_Atomic | Size: 0xc
			GlobalTypes::Vector m_vPrecomputedOBBOrigin2; // 0x1114 | Schema_Atomic | Size: 0xc
			GlobalTypes::QAngle m_vPrecomputedOBBAngles2; // 0x1120 | Schema_Atomic | Size: 0xc
			GlobalTypes::Vector m_vPrecomputedOBBExtent2; // 0x112c | Schema_Atomic | Size: 0xc
			GlobalTypes::Vector m_vPrecomputedOBBOrigin3; // 0x1138 | Schema_Atomic | Size: 0xc
			GlobalTypes::QAngle m_vPrecomputedOBBAngles3; // 0x1144 | Schema_Atomic | Size: 0xc
			GlobalTypes::Vector m_vPrecomputedOBBExtent3; // 0x1150 | Schema_Atomic | Size: 0xc
			GlobalTypes::Vector m_vPrecomputedOBBOrigin4; // 0x115c | Schema_Atomic | Size: 0xc
			GlobalTypes::QAngle m_vPrecomputedOBBAngles4; // 0x1168 | Schema_Atomic | Size: 0xc
			GlobalTypes::Vector m_vPrecomputedOBBExtent4; // 0x1174 | Schema_Atomic | Size: 0xc
			GlobalTypes::Vector m_vPrecomputedOBBOrigin5; // 0x1180 | Schema_Atomic | Size: 0xc
			GlobalTypes::QAngle m_vPrecomputedOBBAngles5; // 0x118c | Schema_Atomic | Size: 0xc
			GlobalTypes::Vector m_vPrecomputedOBBExtent5; // 0x1198 | Schema_Atomic | Size: 0xc
			S2_PAD(0x44);
			bool m_bInitialBoneSetup; // 0x11e8 | Schema_Builtin | Size: 0x1
			S2_PAD(0x7);
			// GlobalTypes::C_NetworkUtlVectorBase< uint16 > m_VisClusters; // 0x11f0 | Schema_Atomic | Size: 0x18
			char  m_VisClusters[0x18]; // 0x11f0 | Schema_Atomic | Size: 0x18
			S2_PAD(0x8); // End padding
		};
		static_assert(offsetof(CS2::client::C_BarnLight, m_bEnabled) == 0xEC0, "m_bEnabled in C_BarnLight should be at offset 0xEC0");
		static_assert(offsetof(CS2::client::C_BarnLight, m_nColorMode) == 0xEC4, "m_nColorMode in C_BarnLight should be at offset 0xEC4");
		static_assert(offsetof(CS2::client::C_BarnLight, m_Color) == 0xEC8, "m_Color in C_BarnLight should be at offset 0xEC8");
		static_assert(offsetof(CS2::client::C_BarnLight, m_flColorTemperature) == 0xECC, "m_flColorTemperature in C_BarnLight should be at offset 0xECC");
		static_assert(offsetof(CS2::client::C_BarnLight, m_flBrightness) == 0xED0, "m_flBrightness in C_BarnLight should be at offset 0xED0");
		static_assert(offsetof(CS2::client::C_BarnLight, m_flBrightnessScale) == 0xED4, "m_flBrightnessScale in C_BarnLight should be at offset 0xED4");
		static_assert(offsetof(CS2::client::C_BarnLight, m_nDirectLight) == 0xED8, "m_nDirectLight in C_BarnLight should be at offset 0xED8");
		static_assert(offsetof(CS2::client::C_BarnLight, m_nBakedShadowIndex) == 0xEDC, "m_nBakedShadowIndex in C_BarnLight should be at offset 0xEDC");
		static_assert(offsetof(CS2::client::C_BarnLight, m_nLightPathUniqueId) == 0xEE0, "m_nLightPathUniqueId in C_BarnLight should be at offset 0xEE0");
		static_assert(offsetof(CS2::client::C_BarnLight, m_nLightMapUniqueId) == 0xEE4, "m_nLightMapUniqueId in C_BarnLight should be at offset 0xEE4");
		static_assert(offsetof(CS2::client::C_BarnLight, m_nLuminaireShape) == 0xEE8, "m_nLuminaireShape in C_BarnLight should be at offset 0xEE8");
		static_assert(offsetof(CS2::client::C_BarnLight, m_flLuminaireSize) == 0xEEC, "m_flLuminaireSize in C_BarnLight should be at offset 0xEEC");
		static_assert(offsetof(CS2::client::C_BarnLight, m_flLuminaireAnisotropy) == 0xEF0, "m_flLuminaireAnisotropy in C_BarnLight should be at offset 0xEF0");
		static_assert(offsetof(CS2::client::C_BarnLight, m_LightStyleString) == 0xEF8, "m_LightStyleString in C_BarnLight should be at offset 0xEF8");
		static_assert(offsetof(CS2::client::C_BarnLight, m_flLightStyleStartTime) == 0xF00, "m_flLightStyleStartTime in C_BarnLight should be at offset 0xF00");
		static_assert(offsetof(CS2::client::C_BarnLight, m_QueuedLightStyleStrings) == 0xF08, "m_QueuedLightStyleStrings in C_BarnLight should be at offset 0xF08");
		static_assert(offsetof(CS2::client::C_BarnLight, m_LightStyleEvents) == 0xF20, "m_LightStyleEvents in C_BarnLight should be at offset 0xF20");
		static_assert(offsetof(CS2::client::C_BarnLight, m_LightStyleTargets) == 0xF38, "m_LightStyleTargets in C_BarnLight should be at offset 0xF38");
		static_assert(offsetof(CS2::client::C_BarnLight, m_StyleEvent) == 0xF50, "m_StyleEvent in C_BarnLight should be at offset 0xF50");
		static_assert(offsetof(CS2::client::C_BarnLight, m_hLightCookie) == 0xFF0, "m_hLightCookie in C_BarnLight should be at offset 0xFF0");
		static_assert(offsetof(CS2::client::C_BarnLight, m_flShape) == 0xFF8, "m_flShape in C_BarnLight should be at offset 0xFF8");
		static_assert(offsetof(CS2::client::C_BarnLight, m_flSoftX) == 0xFFC, "m_flSoftX in C_BarnLight should be at offset 0xFFC");
		static_assert(offsetof(CS2::client::C_BarnLight, m_flSoftY) == 0x1000, "m_flSoftY in C_BarnLight should be at offset 0x1000");
		static_assert(offsetof(CS2::client::C_BarnLight, m_flSkirt) == 0x1004, "m_flSkirt in C_BarnLight should be at offset 0x1004");
		static_assert(offsetof(CS2::client::C_BarnLight, m_flSkirtNear) == 0x1008, "m_flSkirtNear in C_BarnLight should be at offset 0x1008");
		static_assert(offsetof(CS2::client::C_BarnLight, m_vSizeParams) == 0x100C, "m_vSizeParams in C_BarnLight should be at offset 0x100C");
		static_assert(offsetof(CS2::client::C_BarnLight, m_flRange) == 0x1018, "m_flRange in C_BarnLight should be at offset 0x1018");
		static_assert(offsetof(CS2::client::C_BarnLight, m_vShear) == 0x101C, "m_vShear in C_BarnLight should be at offset 0x101C");
		static_assert(offsetof(CS2::client::C_BarnLight, m_nBakeSpecularToCubemaps) == 0x1028, "m_nBakeSpecularToCubemaps in C_BarnLight should be at offset 0x1028");
		static_assert(offsetof(CS2::client::C_BarnLight, m_vBakeSpecularToCubemapsSize) == 0x102C, "m_vBakeSpecularToCubemapsSize in C_BarnLight should be at offset 0x102C");
		static_assert(offsetof(CS2::client::C_BarnLight, m_nCastShadows) == 0x1038, "m_nCastShadows in C_BarnLight should be at offset 0x1038");
		static_assert(offsetof(CS2::client::C_BarnLight, m_nShadowMapSize) == 0x103C, "m_nShadowMapSize in C_BarnLight should be at offset 0x103C");
		static_assert(offsetof(CS2::client::C_BarnLight, m_nShadowPriority) == 0x1040, "m_nShadowPriority in C_BarnLight should be at offset 0x1040");
		static_assert(offsetof(CS2::client::C_BarnLight, m_bContactShadow) == 0x1044, "m_bContactShadow in C_BarnLight should be at offset 0x1044");
		static_assert(offsetof(CS2::client::C_BarnLight, m_bForceShadowsEnabled) == 0x1045, "m_bForceShadowsEnabled in C_BarnLight should be at offset 0x1045");
		static_assert(offsetof(CS2::client::C_BarnLight, m_nBounceLight) == 0x1048, "m_nBounceLight in C_BarnLight should be at offset 0x1048");
		static_assert(offsetof(CS2::client::C_BarnLight, m_flBounceScale) == 0x104C, "m_flBounceScale in C_BarnLight should be at offset 0x104C");
		static_assert(offsetof(CS2::client::C_BarnLight, m_flMinRoughness) == 0x1050, "m_flMinRoughness in C_BarnLight should be at offset 0x1050");
		static_assert(offsetof(CS2::client::C_BarnLight, m_vAlternateColor) == 0x1054, "m_vAlternateColor in C_BarnLight should be at offset 0x1054");
		static_assert(offsetof(CS2::client::C_BarnLight, m_fAlternateColorBrightness) == 0x1060, "m_fAlternateColorBrightness in C_BarnLight should be at offset 0x1060");
		static_assert(offsetof(CS2::client::C_BarnLight, m_nFog) == 0x1064, "m_nFog in C_BarnLight should be at offset 0x1064");
		static_assert(offsetof(CS2::client::C_BarnLight, m_flFogStrength) == 0x1068, "m_flFogStrength in C_BarnLight should be at offset 0x1068");
		static_assert(offsetof(CS2::client::C_BarnLight, m_nFogShadows) == 0x106C, "m_nFogShadows in C_BarnLight should be at offset 0x106C");
		static_assert(offsetof(CS2::client::C_BarnLight, m_flFogScale) == 0x1070, "m_flFogScale in C_BarnLight should be at offset 0x1070");
		static_assert(offsetof(CS2::client::C_BarnLight, m_bFogMixedShadows) == 0x1074, "m_bFogMixedShadows in C_BarnLight should be at offset 0x1074");
		static_assert(offsetof(CS2::client::C_BarnLight, m_flFadeSizeStart) == 0x1078, "m_flFadeSizeStart in C_BarnLight should be at offset 0x1078");
		static_assert(offsetof(CS2::client::C_BarnLight, m_flFadeSizeEnd) == 0x107C, "m_flFadeSizeEnd in C_BarnLight should be at offset 0x107C");
		static_assert(offsetof(CS2::client::C_BarnLight, m_flShadowFadeSizeStart) == 0x1080, "m_flShadowFadeSizeStart in C_BarnLight should be at offset 0x1080");
		static_assert(offsetof(CS2::client::C_BarnLight, m_flShadowFadeSizeEnd) == 0x1084, "m_flShadowFadeSizeEnd in C_BarnLight should be at offset 0x1084");
		static_assert(offsetof(CS2::client::C_BarnLight, m_bPrecomputedFieldsValid) == 0x1088, "m_bPrecomputedFieldsValid in C_BarnLight should be at offset 0x1088");
		static_assert(offsetof(CS2::client::C_BarnLight, m_vPrecomputedBoundsMins) == 0x108C, "m_vPrecomputedBoundsMins in C_BarnLight should be at offset 0x108C");
		static_assert(offsetof(CS2::client::C_BarnLight, m_vPrecomputedBoundsMaxs) == 0x1098, "m_vPrecomputedBoundsMaxs in C_BarnLight should be at offset 0x1098");
		static_assert(offsetof(CS2::client::C_BarnLight, m_vPrecomputedOBBOrigin) == 0x10A4, "m_vPrecomputedOBBOrigin in C_BarnLight should be at offset 0x10A4");
		static_assert(offsetof(CS2::client::C_BarnLight, m_vPrecomputedOBBAngles) == 0x10B0, "m_vPrecomputedOBBAngles in C_BarnLight should be at offset 0x10B0");
		static_assert(offsetof(CS2::client::C_BarnLight, m_vPrecomputedOBBExtent) == 0x10BC, "m_vPrecomputedOBBExtent in C_BarnLight should be at offset 0x10BC");
		static_assert(offsetof(CS2::client::C_BarnLight, m_nPrecomputedSubFrusta) == 0x10C8, "m_nPrecomputedSubFrusta in C_BarnLight should be at offset 0x10C8");
		static_assert(offsetof(CS2::client::C_BarnLight, m_vPrecomputedOBBOrigin0) == 0x10CC, "m_vPrecomputedOBBOrigin0 in C_BarnLight should be at offset 0x10CC");
		static_assert(offsetof(CS2::client::C_BarnLight, m_vPrecomputedOBBAngles0) == 0x10D8, "m_vPrecomputedOBBAngles0 in C_BarnLight should be at offset 0x10D8");
		static_assert(offsetof(CS2::client::C_BarnLight, m_vPrecomputedOBBExtent0) == 0x10E4, "m_vPrecomputedOBBExtent0 in C_BarnLight should be at offset 0x10E4");
		static_assert(offsetof(CS2::client::C_BarnLight, m_vPrecomputedOBBOrigin1) == 0x10F0, "m_vPrecomputedOBBOrigin1 in C_BarnLight should be at offset 0x10F0");
		static_assert(offsetof(CS2::client::C_BarnLight, m_vPrecomputedOBBAngles1) == 0x10FC, "m_vPrecomputedOBBAngles1 in C_BarnLight should be at offset 0x10FC");
		static_assert(offsetof(CS2::client::C_BarnLight, m_vPrecomputedOBBExtent1) == 0x1108, "m_vPrecomputedOBBExtent1 in C_BarnLight should be at offset 0x1108");
		static_assert(offsetof(CS2::client::C_BarnLight, m_vPrecomputedOBBOrigin2) == 0x1114, "m_vPrecomputedOBBOrigin2 in C_BarnLight should be at offset 0x1114");
		static_assert(offsetof(CS2::client::C_BarnLight, m_vPrecomputedOBBAngles2) == 0x1120, "m_vPrecomputedOBBAngles2 in C_BarnLight should be at offset 0x1120");
		static_assert(offsetof(CS2::client::C_BarnLight, m_vPrecomputedOBBExtent2) == 0x112C, "m_vPrecomputedOBBExtent2 in C_BarnLight should be at offset 0x112C");
		static_assert(offsetof(CS2::client::C_BarnLight, m_vPrecomputedOBBOrigin3) == 0x1138, "m_vPrecomputedOBBOrigin3 in C_BarnLight should be at offset 0x1138");
		static_assert(offsetof(CS2::client::C_BarnLight, m_vPrecomputedOBBAngles3) == 0x1144, "m_vPrecomputedOBBAngles3 in C_BarnLight should be at offset 0x1144");
		static_assert(offsetof(CS2::client::C_BarnLight, m_vPrecomputedOBBExtent3) == 0x1150, "m_vPrecomputedOBBExtent3 in C_BarnLight should be at offset 0x1150");
		static_assert(offsetof(CS2::client::C_BarnLight, m_vPrecomputedOBBOrigin4) == 0x115C, "m_vPrecomputedOBBOrigin4 in C_BarnLight should be at offset 0x115C");
		static_assert(offsetof(CS2::client::C_BarnLight, m_vPrecomputedOBBAngles4) == 0x1168, "m_vPrecomputedOBBAngles4 in C_BarnLight should be at offset 0x1168");
		static_assert(offsetof(CS2::client::C_BarnLight, m_vPrecomputedOBBExtent4) == 0x1174, "m_vPrecomputedOBBExtent4 in C_BarnLight should be at offset 0x1174");
		static_assert(offsetof(CS2::client::C_BarnLight, m_vPrecomputedOBBOrigin5) == 0x1180, "m_vPrecomputedOBBOrigin5 in C_BarnLight should be at offset 0x1180");
		static_assert(offsetof(CS2::client::C_BarnLight, m_vPrecomputedOBBAngles5) == 0x118C, "m_vPrecomputedOBBAngles5 in C_BarnLight should be at offset 0x118C");
		static_assert(offsetof(CS2::client::C_BarnLight, m_vPrecomputedOBBExtent5) == 0x1198, "m_vPrecomputedOBBExtent5 in C_BarnLight should be at offset 0x1198");
		static_assert(offsetof(CS2::client::C_BarnLight, m_bInitialBoneSetup) == 0x11E8, "m_bInitialBoneSetup in C_BarnLight should be at offset 0x11E8");
		static_assert(offsetof(CS2::client::C_BarnLight, m_VisClusters) == 0x11F0, "m_VisClusters in C_BarnLight should be at offset 0x11F0");
		static_assert(sizeof(CS2::client::C_BarnLight) == 0x1210, "C_BarnLight size should be 0x1210");
	}
}
