// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#ifndef CUSTOM_GLOBAL_TYPES
	#include "../GlobalTypes.hpp"
#else
	#include "../Custom/GlobalTypes.hpp"
#endif


#include "C_BaseGrenade.hpp"
#include "../entity2/GameTime_t.hpp"
#include "ParticleIndex_t.hpp"





using namespace GlobalTypes;
namespace CS2 {
	namespace client {
		class C_BaseCSGrenadeProjectile : public CS2::client::C_BaseGrenade {
		public:
			GlobalTypes::Vector m_vInitialPosition; // 0x13a0 | Schema_Atomic | Size: 0xc
			GlobalTypes::Vector m_vInitialVelocity; // 0x13ac | Schema_Atomic | Size: 0xc
			int32_t m_nBounces; // 0x13b8 | Schema_Builtin | Size: 0x4
			S2_PAD(0x4);
			// GlobalTypes::CStrongHandle<resourcesystem::InfoForResourceTypeIParticleSystemDefinition> m_nExplodeEffectIndex; // 0x13c0 | Schema_Atomic | Size: 0x8
			char m_nExplodeEffectIndex[0x8]; // 0x13c0 | Schema_Atomic | Size: 0x8
			int32_t m_nExplodeEffectTickBegin; // 0x13c8 | Schema_Builtin | Size: 0x4
			GlobalTypes::Vector m_vecExplodeEffectOrigin; // 0x13cc | Schema_Atomic | Size: 0xc
			entity2::GameTime_t m_flSpawnTime; // 0x13d8 | Schema_DeclaredClass | Size: 0x4
			GlobalTypes::Vector vecLastTrailLinePos; // 0x13dc | Schema_Atomic | Size: 0xc
			entity2::GameTime_t flNextTrailLineTime; // 0x13e8 | Schema_DeclaredClass | Size: 0x4
			bool m_bExplodeEffectBegan; // 0x13ec | Schema_Builtin | Size: 0x1
			bool m_bCanCreateGrenadeTrail; // 0x13ed | Schema_Builtin | Size: 0x1
			S2_PAD(0x2);
			client::ParticleIndex_t m_nSnapshotTrajectoryEffectIndex; // 0x13f0 | Schema_DeclaredClass | Size: 0x4
			S2_PAD(0x4);
			// GlobalTypes::CStrongHandle<resourcesystem::InfoForResourceTypeIParticleSnapshot> m_hSnapshotTrajectoryParticleSnapshot; // 0x13f8 | Schema_Atomic | Size: 0x8
			char m_hSnapshotTrajectoryParticleSnapshot[0x8]; // 0x13f8 | Schema_Atomic | Size: 0x8
			GlobalTypes::CUtlVector<GlobalTypes::Vector> m_arrTrajectoryTrailPoints; // 0x1400 | Schema_Atomic | Size: 0x18
			// char m_arrTrajectoryTrailPoints[0x18]; // 0x1400 | Schema_Atomic | Size: 0x18
			GlobalTypes::CUtlVector< float32 > m_arrTrajectoryTrailPointCreationTimes; // 0x1418 | Schema_Atomic | Size: 0x18
			// char m_arrTrajectoryTrailPointCreationTimes[0x18]; // 0x1418 | Schema_Atomic | Size: 0x18
			float32 m_flTrajectoryTrailEffectCreationTime; // 0x1430 | Schema_Builtin | Size: 0x4
			S2_PAD(0x4); // End padding
		};
		static_assert(offsetof(CS2::client::C_BaseCSGrenadeProjectile, m_vInitialPosition) == 0x13A0, "m_vInitialPosition in C_BaseCSGrenadeProjectile should be at offset 0x13A0");
		static_assert(offsetof(CS2::client::C_BaseCSGrenadeProjectile, m_vInitialVelocity) == 0x13AC, "m_vInitialVelocity in C_BaseCSGrenadeProjectile should be at offset 0x13AC");
		static_assert(offsetof(CS2::client::C_BaseCSGrenadeProjectile, m_nBounces) == 0x13B8, "m_nBounces in C_BaseCSGrenadeProjectile should be at offset 0x13B8");
		static_assert(offsetof(CS2::client::C_BaseCSGrenadeProjectile, m_nExplodeEffectIndex) == 0x13C0, "m_nExplodeEffectIndex in C_BaseCSGrenadeProjectile should be at offset 0x13C0");
		static_assert(offsetof(CS2::client::C_BaseCSGrenadeProjectile, m_nExplodeEffectTickBegin) == 0x13C8, "m_nExplodeEffectTickBegin in C_BaseCSGrenadeProjectile should be at offset 0x13C8");
		static_assert(offsetof(CS2::client::C_BaseCSGrenadeProjectile, m_vecExplodeEffectOrigin) == 0x13CC, "m_vecExplodeEffectOrigin in C_BaseCSGrenadeProjectile should be at offset 0x13CC");
		static_assert(offsetof(CS2::client::C_BaseCSGrenadeProjectile, m_flSpawnTime) == 0x13D8, "m_flSpawnTime in C_BaseCSGrenadeProjectile should be at offset 0x13D8");
		static_assert(offsetof(CS2::client::C_BaseCSGrenadeProjectile, vecLastTrailLinePos) == 0x13DC, "vecLastTrailLinePos in C_BaseCSGrenadeProjectile should be at offset 0x13DC");
		static_assert(offsetof(CS2::client::C_BaseCSGrenadeProjectile, flNextTrailLineTime) == 0x13E8, "flNextTrailLineTime in C_BaseCSGrenadeProjectile should be at offset 0x13E8");
		static_assert(offsetof(CS2::client::C_BaseCSGrenadeProjectile, m_bExplodeEffectBegan) == 0x13EC, "m_bExplodeEffectBegan in C_BaseCSGrenadeProjectile should be at offset 0x13EC");
		static_assert(offsetof(CS2::client::C_BaseCSGrenadeProjectile, m_bCanCreateGrenadeTrail) == 0x13ED, "m_bCanCreateGrenadeTrail in C_BaseCSGrenadeProjectile should be at offset 0x13ED");
		static_assert(offsetof(CS2::client::C_BaseCSGrenadeProjectile, m_nSnapshotTrajectoryEffectIndex) == 0x13F0, "m_nSnapshotTrajectoryEffectIndex in C_BaseCSGrenadeProjectile should be at offset 0x13F0");
		static_assert(offsetof(CS2::client::C_BaseCSGrenadeProjectile, m_hSnapshotTrajectoryParticleSnapshot) == 0x13F8, "m_hSnapshotTrajectoryParticleSnapshot in C_BaseCSGrenadeProjectile should be at offset 0x13F8");
		static_assert(offsetof(CS2::client::C_BaseCSGrenadeProjectile, m_arrTrajectoryTrailPoints) == 0x1400, "m_arrTrajectoryTrailPoints in C_BaseCSGrenadeProjectile should be at offset 0x1400");
		static_assert(offsetof(CS2::client::C_BaseCSGrenadeProjectile, m_arrTrajectoryTrailPointCreationTimes) == 0x1418, "m_arrTrajectoryTrailPointCreationTimes in C_BaseCSGrenadeProjectile should be at offset 0x1418");
		static_assert(offsetof(CS2::client::C_BaseCSGrenadeProjectile, m_flTrajectoryTrailEffectCreationTime) == 0x1430, "m_flTrajectoryTrailEffectCreationTime in C_BaseCSGrenadeProjectile should be at offset 0x1430");
		static_assert(sizeof(CS2::client::C_BaseCSGrenadeProjectile) == 0x1438, "C_BaseCSGrenadeProjectile size should be 0x1438");
	}
}
