// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#ifndef CUSTOM_GLOBAL_TYPES
	#include "../GlobalTypes.hpp"
#else
	#include "../Custom/GlobalTypes.hpp"
#endif


#include "C_BaseEntity.hpp"
#include "CHitboxComponent.hpp"
#include "HitGroup_t.hpp"
#include "RenderMode_t.hpp"
#include "RenderFx_t.hpp"
#include "EntityRenderAttribute_t.hpp"
#include "CCollisionProperty.hpp"
#include "CGlowProperty.hpp"
#include "DecalRtEncoding_t.hpp"
#include "CNetworkViewOffsetVector.hpp"



namespace CS2 {
	namespace client {
		class CRenderComponent;
		class CDestructiblePartsComponent;
		class CClientAlphaProperty;
	}
}


using namespace GlobalTypes;
namespace CS2 {
	namespace client {
		class C_BaseModelEntity : public CS2::client::C_BaseEntity {
		public:
			S2_PAD(0x4e8);
			client::CRenderComponent* m_CRenderComponent; // 0xaf0 | Schema_Ptr | Size: 0x8
			client::CHitboxComponent m_CHitboxComponent; // 0xaf8 | Schema_DeclaredClass | Size: 0x18
			client::HitGroup_t m_nDestructiblePartInitialStateDestructed0; // 0xb10 | Schema_DeclaredEnum | Size: 0x4
			client::HitGroup_t m_nDestructiblePartInitialStateDestructed1; // 0xb14 | Schema_DeclaredEnum | Size: 0x4
			client::HitGroup_t m_nDestructiblePartInitialStateDestructed2; // 0xb18 | Schema_DeclaredEnum | Size: 0x4
			client::HitGroup_t m_nDestructiblePartInitialStateDestructed3; // 0xb1c | Schema_DeclaredEnum | Size: 0x4
			client::HitGroup_t m_nDestructiblePartInitialStateDestructed4; // 0xb20 | Schema_DeclaredEnum | Size: 0x4
			int32_t m_nDestructiblePartInitialStateDestructed0_PartIndex; // 0xb24 | Schema_Builtin | Size: 0x4
			int32_t m_nDestructiblePartInitialStateDestructed1_PartIndex; // 0xb28 | Schema_Builtin | Size: 0x4
			int32_t m_nDestructiblePartInitialStateDestructed2_PartIndex; // 0xb2c | Schema_Builtin | Size: 0x4
			int32_t m_nDestructiblePartInitialStateDestructed3_PartIndex; // 0xb30 | Schema_Builtin | Size: 0x4
			int32_t m_nDestructiblePartInitialStateDestructed4_PartIndex; // 0xb34 | Schema_Builtin | Size: 0x4
			client::CDestructiblePartsComponent* m_pDestructiblePartsSystemComponent; // 0xb38 | Schema_Ptr | Size: 0x8
			S2_PAD(0x18);
			bool m_bInitModelEffects; // 0xb58 | Schema_Builtin | Size: 0x1
			bool m_bDoingModelEffects; // 0xb59 | Schema_Builtin | Size: 0x1
			bool m_bIsStaticProp; // 0xb5a | Schema_Builtin | Size: 0x1
			S2_PAD(0x1);
			int32_t m_iOldHealth; // 0xb5c | Schema_Builtin | Size: 0x4
			client::RenderMode_t m_nRenderMode; // 0xb60 | Schema_DeclaredEnum | Size: 0x1
			client::RenderFx_t m_nRenderFX; // 0xb61 | Schema_DeclaredEnum | Size: 0x1
			bool m_bAllowFadeInView; // 0xb62 | Schema_Builtin | Size: 0x1
			S2_PAD(0x1d);
			GlobalTypes::Color m_clrRender; // 0xb80 | Schema_Atomic | Size: 0x4
			S2_PAD(0x4);
			// client::C_UtlVectorEmbeddedNetworkVar<client::EntityRenderAttribute_t> m_vecRenderAttributes; // 0xb88 | Schema_Atomic | Size: 0x68
			char m_vecRenderAttributes[0x68]; // 0xb88 | Schema_Atomic | Size: 0x68
			S2_PAD(0x18);
			bool m_bRenderToCubemaps; // 0xc08 | Schema_Builtin | Size: 0x1
			bool m_bNoInterpolate; // 0xc09 | Schema_Builtin | Size: 0x1
			S2_PAD(0x6);
			client::CCollisionProperty m_Collision; // 0xc10 | Schema_DeclaredClass | Size: 0xb0
			client::CGlowProperty m_Glow; // 0xcc0 | Schema_DeclaredClass | Size: 0x58
			float32 m_flGlowBackfaceMult; // 0xd18 | Schema_Builtin | Size: 0x4
			float32 m_fadeMinDist; // 0xd1c | Schema_Builtin | Size: 0x4
			float32 m_fadeMaxDist; // 0xd20 | Schema_Builtin | Size: 0x4
			float32 m_flFadeScale; // 0xd24 | Schema_Builtin | Size: 0x4
			float32 m_flShadowStrength; // 0xd28 | Schema_Builtin | Size: 0x4
			uint8_t m_nObjectCulling; // 0xd2c | Schema_Builtin | Size: 0x1
			client::DecalRtEncoding_t m_nRequiredDecalRtEncoding; // 0xd2d | Schema_DeclaredEnum | Size: 0x1
			S2_PAD(0x2a);
			client::CNetworkViewOffsetVector m_vecViewOffset; // 0xd58 | Schema_DeclaredClass | Size: 0x28
			S2_PAD(0xb8);
			client::CClientAlphaProperty* m_pClientAlphaProperty; // 0xe38 | Schema_Ptr | Size: 0x8
			GlobalTypes::Color m_ClientOverrideTint; // 0xe40 | Schema_Atomic | Size: 0x4
			bool m_bUseClientOverrideTint; // 0xe44 | Schema_Builtin | Size: 0x1
			S2_PAD(0x3b);
			uint32_t m_bvDisabledHitGroups[1]; // 0xe80 | Schema_FixedArray | Size: 0x4
			S2_PAD(0x4); // End padding
		};
		static_assert(offsetof(CS2::client::C_BaseModelEntity, m_CRenderComponent) == 0xAF0, "m_CRenderComponent in C_BaseModelEntity should be at offset 0xAF0");
		static_assert(offsetof(CS2::client::C_BaseModelEntity, m_CHitboxComponent) == 0xAF8, "m_CHitboxComponent in C_BaseModelEntity should be at offset 0xAF8");
		static_assert(offsetof(CS2::client::C_BaseModelEntity, m_nDestructiblePartInitialStateDestructed0) == 0xB10, "m_nDestructiblePartInitialStateDestructed0 in C_BaseModelEntity should be at offset 0xB10");
		static_assert(offsetof(CS2::client::C_BaseModelEntity, m_nDestructiblePartInitialStateDestructed1) == 0xB14, "m_nDestructiblePartInitialStateDestructed1 in C_BaseModelEntity should be at offset 0xB14");
		static_assert(offsetof(CS2::client::C_BaseModelEntity, m_nDestructiblePartInitialStateDestructed2) == 0xB18, "m_nDestructiblePartInitialStateDestructed2 in C_BaseModelEntity should be at offset 0xB18");
		static_assert(offsetof(CS2::client::C_BaseModelEntity, m_nDestructiblePartInitialStateDestructed3) == 0xB1C, "m_nDestructiblePartInitialStateDestructed3 in C_BaseModelEntity should be at offset 0xB1C");
		static_assert(offsetof(CS2::client::C_BaseModelEntity, m_nDestructiblePartInitialStateDestructed4) == 0xB20, "m_nDestructiblePartInitialStateDestructed4 in C_BaseModelEntity should be at offset 0xB20");
		static_assert(offsetof(CS2::client::C_BaseModelEntity, m_nDestructiblePartInitialStateDestructed0_PartIndex) == 0xB24, "m_nDestructiblePartInitialStateDestructed0_PartIndex in C_BaseModelEntity should be at offset 0xB24");
		static_assert(offsetof(CS2::client::C_BaseModelEntity, m_nDestructiblePartInitialStateDestructed1_PartIndex) == 0xB28, "m_nDestructiblePartInitialStateDestructed1_PartIndex in C_BaseModelEntity should be at offset 0xB28");
		static_assert(offsetof(CS2::client::C_BaseModelEntity, m_nDestructiblePartInitialStateDestructed2_PartIndex) == 0xB2C, "m_nDestructiblePartInitialStateDestructed2_PartIndex in C_BaseModelEntity should be at offset 0xB2C");
		static_assert(offsetof(CS2::client::C_BaseModelEntity, m_nDestructiblePartInitialStateDestructed3_PartIndex) == 0xB30, "m_nDestructiblePartInitialStateDestructed3_PartIndex in C_BaseModelEntity should be at offset 0xB30");
		static_assert(offsetof(CS2::client::C_BaseModelEntity, m_nDestructiblePartInitialStateDestructed4_PartIndex) == 0xB34, "m_nDestructiblePartInitialStateDestructed4_PartIndex in C_BaseModelEntity should be at offset 0xB34");
		static_assert(offsetof(CS2::client::C_BaseModelEntity, m_pDestructiblePartsSystemComponent) == 0xB38, "m_pDestructiblePartsSystemComponent in C_BaseModelEntity should be at offset 0xB38");
		static_assert(offsetof(CS2::client::C_BaseModelEntity, m_bInitModelEffects) == 0xB58, "m_bInitModelEffects in C_BaseModelEntity should be at offset 0xB58");
		static_assert(offsetof(CS2::client::C_BaseModelEntity, m_bDoingModelEffects) == 0xB59, "m_bDoingModelEffects in C_BaseModelEntity should be at offset 0xB59");
		static_assert(offsetof(CS2::client::C_BaseModelEntity, m_bIsStaticProp) == 0xB5A, "m_bIsStaticProp in C_BaseModelEntity should be at offset 0xB5A");
		static_assert(offsetof(CS2::client::C_BaseModelEntity, m_iOldHealth) == 0xB5C, "m_iOldHealth in C_BaseModelEntity should be at offset 0xB5C");
		static_assert(offsetof(CS2::client::C_BaseModelEntity, m_nRenderMode) == 0xB60, "m_nRenderMode in C_BaseModelEntity should be at offset 0xB60");
		static_assert(offsetof(CS2::client::C_BaseModelEntity, m_nRenderFX) == 0xB61, "m_nRenderFX in C_BaseModelEntity should be at offset 0xB61");
		static_assert(offsetof(CS2::client::C_BaseModelEntity, m_bAllowFadeInView) == 0xB62, "m_bAllowFadeInView in C_BaseModelEntity should be at offset 0xB62");
		static_assert(offsetof(CS2::client::C_BaseModelEntity, m_clrRender) == 0xB80, "m_clrRender in C_BaseModelEntity should be at offset 0xB80");
		static_assert(offsetof(CS2::client::C_BaseModelEntity, m_vecRenderAttributes) == 0xB88, "m_vecRenderAttributes in C_BaseModelEntity should be at offset 0xB88");
		static_assert(offsetof(CS2::client::C_BaseModelEntity, m_bRenderToCubemaps) == 0xC08, "m_bRenderToCubemaps in C_BaseModelEntity should be at offset 0xC08");
		static_assert(offsetof(CS2::client::C_BaseModelEntity, m_bNoInterpolate) == 0xC09, "m_bNoInterpolate in C_BaseModelEntity should be at offset 0xC09");
		static_assert(offsetof(CS2::client::C_BaseModelEntity, m_Collision) == 0xC10, "m_Collision in C_BaseModelEntity should be at offset 0xC10");
		static_assert(offsetof(CS2::client::C_BaseModelEntity, m_Glow) == 0xCC0, "m_Glow in C_BaseModelEntity should be at offset 0xCC0");
		static_assert(offsetof(CS2::client::C_BaseModelEntity, m_flGlowBackfaceMult) == 0xD18, "m_flGlowBackfaceMult in C_BaseModelEntity should be at offset 0xD18");
		static_assert(offsetof(CS2::client::C_BaseModelEntity, m_fadeMinDist) == 0xD1C, "m_fadeMinDist in C_BaseModelEntity should be at offset 0xD1C");
		static_assert(offsetof(CS2::client::C_BaseModelEntity, m_fadeMaxDist) == 0xD20, "m_fadeMaxDist in C_BaseModelEntity should be at offset 0xD20");
		static_assert(offsetof(CS2::client::C_BaseModelEntity, m_flFadeScale) == 0xD24, "m_flFadeScale in C_BaseModelEntity should be at offset 0xD24");
		static_assert(offsetof(CS2::client::C_BaseModelEntity, m_flShadowStrength) == 0xD28, "m_flShadowStrength in C_BaseModelEntity should be at offset 0xD28");
		static_assert(offsetof(CS2::client::C_BaseModelEntity, m_nObjectCulling) == 0xD2C, "m_nObjectCulling in C_BaseModelEntity should be at offset 0xD2C");
		static_assert(offsetof(CS2::client::C_BaseModelEntity, m_nRequiredDecalRtEncoding) == 0xD2D, "m_nRequiredDecalRtEncoding in C_BaseModelEntity should be at offset 0xD2D");
		static_assert(offsetof(CS2::client::C_BaseModelEntity, m_vecViewOffset) == 0xD58, "m_vecViewOffset in C_BaseModelEntity should be at offset 0xD58");
		static_assert(offsetof(CS2::client::C_BaseModelEntity, m_pClientAlphaProperty) == 0xE38, "m_pClientAlphaProperty in C_BaseModelEntity should be at offset 0xE38");
		static_assert(offsetof(CS2::client::C_BaseModelEntity, m_ClientOverrideTint) == 0xE40, "m_ClientOverrideTint in C_BaseModelEntity should be at offset 0xE40");
		static_assert(offsetof(CS2::client::C_BaseModelEntity, m_bUseClientOverrideTint) == 0xE44, "m_bUseClientOverrideTint in C_BaseModelEntity should be at offset 0xE44");
		static_assert(offsetof(CS2::client::C_BaseModelEntity, m_bvDisabledHitGroups) == 0xE80, "m_bvDisabledHitGroups in C_BaseModelEntity should be at offset 0xE80");
		static_assert(sizeof(CS2::client::C_BaseModelEntity) == 0xE88, "C_BaseModelEntity size should be 0xE88");
	}
}
