// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#include <SDK/GlobalTypes.hpp>

#include <SDK/client/C_BaseToggle.hpp>
#include <SDK/entity2/CEntityIOOutput.hpp>



namespace CS2 {
	namespace client {
		class C_BaseTrigger : public CS2::client::C_BaseToggle {
		public:
			entity2::CEntityIOOutput m_OnStartTouch; // 0xec0 | Schema_DeclaredClass | Size: 0x28
			entity2::CEntityIOOutput m_OnStartTouchAll; // 0xee8 | Schema_DeclaredClass | Size: 0x28
			entity2::CEntityIOOutput m_OnEndTouch; // 0xf10 | Schema_DeclaredClass | Size: 0x28
			entity2::CEntityIOOutput m_OnEndTouchAll; // 0xf38 | Schema_DeclaredClass | Size: 0x28
			entity2::CEntityIOOutput m_OnTouching; // 0xf60 | Schema_DeclaredClass | Size: 0x28
			entity2::CEntityIOOutput m_OnTouchingEachEntity; // 0xf88 | Schema_DeclaredClass | Size: 0x28
			entity2::CEntityIOOutput m_OnNotTouching; // 0xfb0 | Schema_DeclaredClass | Size: 0x28
			// client::CUtlVector< client.dll::CHandle< C_BaseEntity > > m_hTouchingEntities; // 0xfd8 | Schema_Atomic | Size: 0x18
			char  m_hTouchingEntities[0x18]; // 0xfd8 | Schema_Atomic | Size: 0x18
			GlobalTypes::CUtlSymbolLarge m_iFilterName; // 0xff0 | Schema_Atomic | Size: 0x8
			// client::CHandle< client::CBaseFilter > m_hFilter; // 0xff8 | Schema_Atomic | Size: 0x4
			char  m_hFilter[0x4]; // 0xff8 | Schema_Atomic | Size: 0x4
			bool m_bDisabled; // 0xffc | Schema_Builtin | Size: 0x1
			S2_PAD(0x3); // End padding
		};
		static_assert(offsetof(CS2::client::C_BaseTrigger, m_OnStartTouch) == 0xEC0, "m_OnStartTouch in C_BaseTrigger should be at offset 0xEC0");
		static_assert(offsetof(CS2::client::C_BaseTrigger, m_OnStartTouchAll) == 0xEE8, "m_OnStartTouchAll in C_BaseTrigger should be at offset 0xEE8");
		static_assert(offsetof(CS2::client::C_BaseTrigger, m_OnEndTouch) == 0xF10, "m_OnEndTouch in C_BaseTrigger should be at offset 0xF10");
		static_assert(offsetof(CS2::client::C_BaseTrigger, m_OnEndTouchAll) == 0xF38, "m_OnEndTouchAll in C_BaseTrigger should be at offset 0xF38");
		static_assert(offsetof(CS2::client::C_BaseTrigger, m_OnTouching) == 0xF60, "m_OnTouching in C_BaseTrigger should be at offset 0xF60");
		static_assert(offsetof(CS2::client::C_BaseTrigger, m_OnTouchingEachEntity) == 0xF88, "m_OnTouchingEachEntity in C_BaseTrigger should be at offset 0xF88");
		static_assert(offsetof(CS2::client::C_BaseTrigger, m_OnNotTouching) == 0xFB0, "m_OnNotTouching in C_BaseTrigger should be at offset 0xFB0");
		static_assert(offsetof(CS2::client::C_BaseTrigger, m_hTouchingEntities) == 0xFD8, "m_hTouchingEntities in C_BaseTrigger should be at offset 0xFD8");
		static_assert(offsetof(CS2::client::C_BaseTrigger, m_iFilterName) == 0xFF0, "m_iFilterName in C_BaseTrigger should be at offset 0xFF0");
		static_assert(offsetof(CS2::client::C_BaseTrigger, m_hFilter) == 0xFF8, "m_hFilter in C_BaseTrigger should be at offset 0xFF8");
		static_assert(offsetof(CS2::client::C_BaseTrigger, m_bDisabled) == 0xFFC, "m_bDisabled in C_BaseTrigger should be at offset 0xFFC");
		static_assert(sizeof(CS2::client::C_BaseTrigger) == 0x1000, "C_BaseTrigger size should be 0x1000");
	}
}
