// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#ifndef CUSTOM_GLOBAL_TYPES
	#include "../GlobalTypes.hpp"
#else
	#include <Custom/GlobalTypes.hpp>
#endif


#include "C_BaseFlex.hpp"
#include "C_EconWearable.hpp"
#include "../modellib/AttachmentHandle_t.hpp"
#include "C_BaseCombatCharacter_WaterWakeMode_t.hpp"





using namespace GlobalTypes;
namespace CS2 {
	namespace client {
		class C_BaseCombatCharacter : public CS2::client::C_BaseFlex {
		public:
			// client::C_NetworkUtlVectorBase<GlobalTypes::CHandle<client::C_EconWearable>> m_hMyWearables; // 0x1350 | Schema_Atomic | Size: 0x18
			char m_hMyWearables[0x18]; // 0x1350 | Schema_Atomic | Size: 0x18
			modellib::AttachmentHandle_t m_leftFootAttachment; // 0x1368 | Schema_DeclaredClass | Size: 0x1
			modellib::AttachmentHandle_t m_rightFootAttachment; // 0x1369 | Schema_DeclaredClass | Size: 0x1
			S2_PAD(0x2);
			client::C_BaseCombatCharacter_WaterWakeMode_t m_nWaterWakeMode; // 0x136c | Schema_DeclaredEnum | Size: 0x4
			float32 m_flWaterWorldZ; // 0x1370 | Schema_Builtin | Size: 0x4
			float32 m_flWaterNextTraceTime; // 0x1374 | Schema_Builtin | Size: 0x4
			S2_PAD(0x60); // End padding
		};
#ifdef USE_STATIC_ASSERTS
		static_assert(offsetof(CS2::client::C_BaseCombatCharacter, m_hMyWearables) == 0x1350, "m_hMyWearables in C_BaseCombatCharacter should be at offset 0x1350");
		static_assert(offsetof(CS2::client::C_BaseCombatCharacter, m_leftFootAttachment) == 0x1368, "m_leftFootAttachment in C_BaseCombatCharacter should be at offset 0x1368");
		static_assert(offsetof(CS2::client::C_BaseCombatCharacter, m_rightFootAttachment) == 0x1369, "m_rightFootAttachment in C_BaseCombatCharacter should be at offset 0x1369");
		static_assert(offsetof(CS2::client::C_BaseCombatCharacter, m_nWaterWakeMode) == 0x136C, "m_nWaterWakeMode in C_BaseCombatCharacter should be at offset 0x136C");
		static_assert(offsetof(CS2::client::C_BaseCombatCharacter, m_flWaterWorldZ) == 0x1370, "m_flWaterWorldZ in C_BaseCombatCharacter should be at offset 0x1370");
		static_assert(offsetof(CS2::client::C_BaseCombatCharacter, m_flWaterNextTraceTime) == 0x1374, "m_flWaterNextTraceTime in C_BaseCombatCharacter should be at offset 0x1374");
		static_assert(sizeof(CS2::client::C_BaseCombatCharacter) == 0x13D8, "C_BaseCombatCharacter size should be 0x13D8");

#endif
	}
}
