// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#ifndef CUSTOM_GLOBAL_TYPES
	#include "../GlobalTypes.hpp"
#else
	#include "../Custom/GlobalTypes.hpp"
#endif


#include "C_BaseFlex.hpp"
#include "../entity2/GameTime_t.hpp"



namespace CS2 {
	namespace client {
		class C_CSPlayerPawn;
	}
}


using namespace GlobalTypes;
namespace CS2 {
	namespace client {
		class C_BaseGrenade : public CS2::client::C_BaseFlex {
		public:
			bool m_bHasWarnedAI; // 0x1350 | Schema_Builtin | Size: 0x1
			bool m_bIsSmokeGrenade; // 0x1351 | Schema_Builtin | Size: 0x1
			bool m_bIsLive; // 0x1352 | Schema_Builtin | Size: 0x1
			S2_PAD(0x1);
			float32 m_DmgRadius; // 0x1354 | Schema_Builtin | Size: 0x4
			entity2::GameTime_t m_flDetonateTime; // 0x1358 | Schema_DeclaredClass | Size: 0x4
			float32 m_flWarnAITime; // 0x135c | Schema_Builtin | Size: 0x4
			float32 m_flDamage; // 0x1360 | Schema_Builtin | Size: 0x4
			S2_PAD(0x4);
			GlobalTypes::CUtlSymbolLarge m_iszBounceSound; // 0x1368 | Schema_Atomic | Size: 0x8
			GlobalTypes::CUtlString m_ExplosionSound; // 0x1370 | Schema_Atomic | Size: 0x8
			S2_PAD(0x4);
			GlobalTypes::CHandle<client::C_CSPlayerPawn> m_hThrower; // 0x137c | Schema_Atomic | Size: 0x4
			// char m_hThrower[0x4]; // 0x137c | Schema_Atomic | Size: 0x4
			S2_PAD(0x14);
			entity2::GameTime_t m_flNextAttack; // 0x1394 | Schema_DeclaredClass | Size: 0x4
			GlobalTypes::CHandle<client::C_CSPlayerPawn> m_hOriginalThrower; // 0x1398 | Schema_Atomic | Size: 0x4
			// char m_hOriginalThrower[0x4]; // 0x1398 | Schema_Atomic | Size: 0x4
			S2_PAD(0x4); // End padding
		};
		static_assert(offsetof(CS2::client::C_BaseGrenade, m_bHasWarnedAI) == 0x1350, "m_bHasWarnedAI in C_BaseGrenade should be at offset 0x1350");
		static_assert(offsetof(CS2::client::C_BaseGrenade, m_bIsSmokeGrenade) == 0x1351, "m_bIsSmokeGrenade in C_BaseGrenade should be at offset 0x1351");
		static_assert(offsetof(CS2::client::C_BaseGrenade, m_bIsLive) == 0x1352, "m_bIsLive in C_BaseGrenade should be at offset 0x1352");
		static_assert(offsetof(CS2::client::C_BaseGrenade, m_DmgRadius) == 0x1354, "m_DmgRadius in C_BaseGrenade should be at offset 0x1354");
		static_assert(offsetof(CS2::client::C_BaseGrenade, m_flDetonateTime) == 0x1358, "m_flDetonateTime in C_BaseGrenade should be at offset 0x1358");
		static_assert(offsetof(CS2::client::C_BaseGrenade, m_flWarnAITime) == 0x135C, "m_flWarnAITime in C_BaseGrenade should be at offset 0x135C");
		static_assert(offsetof(CS2::client::C_BaseGrenade, m_flDamage) == 0x1360, "m_flDamage in C_BaseGrenade should be at offset 0x1360");
		static_assert(offsetof(CS2::client::C_BaseGrenade, m_iszBounceSound) == 0x1368, "m_iszBounceSound in C_BaseGrenade should be at offset 0x1368");
		static_assert(offsetof(CS2::client::C_BaseGrenade, m_ExplosionSound) == 0x1370, "m_ExplosionSound in C_BaseGrenade should be at offset 0x1370");
		static_assert(offsetof(CS2::client::C_BaseGrenade, m_hThrower) == 0x137C, "m_hThrower in C_BaseGrenade should be at offset 0x137C");
		static_assert(offsetof(CS2::client::C_BaseGrenade, m_flNextAttack) == 0x1394, "m_flNextAttack in C_BaseGrenade should be at offset 0x1394");
		static_assert(offsetof(CS2::client::C_BaseGrenade, m_hOriginalThrower) == 0x1398, "m_hOriginalThrower in C_BaseGrenade should be at offset 0x1398");
		static_assert(sizeof(CS2::client::C_BaseGrenade) == 0x13A0, "C_BaseGrenade size should be 0x13A0");
	}
}
