// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#include <SDK/GlobalTypes.hpp>

#include <SDK/client/C_BaseModelEntity.hpp>
#include <SDK/entity2/GameTime_t.hpp>
#include <SDK/client/BeamType_t.hpp>
#include <SDK/modellib/AttachmentHandle_t.hpp>
#include <SDK/client/BeamClipStyle_t.hpp>



namespace CS2 {
	namespace client {
		class C_BaseEntity;
	}
}
namespace CS2 {
	namespace client {
		class C_Beam : public CS2::client::C_BaseModelEntity {
		public:
			float32 m_flFrameRate; // 0xeb0 | Schema_Builtin | Size: 0x4
			float32 m_flHDRColorScale; // 0xeb4 | Schema_Builtin | Size: 0x4
			entity2::GameTime_t m_flFireTime; // 0xeb8 | Schema_DeclaredClass | Size: 0x4
			float32 m_flDamage; // 0xebc | Schema_Builtin | Size: 0x4
			uint8_t m_nNumBeamEnts; // 0xec0 | Schema_Builtin | Size: 0x1
			S2_PAD(0x3);
			int32_t m_queryHandleHalo; // 0xec4 | Schema_Builtin | Size: 0x4
			S2_PAD(0x20);
			// GlobalTypes::CStrongHandle< resourcesystem::InfoForResourceTypeIMaterial2 > m_hBaseMaterial; // 0xee8 | Schema_Atomic | Size: 0x8
			char  m_hBaseMaterial[0x8]; // 0xee8 | Schema_Atomic | Size: 0x8
			// GlobalTypes::CStrongHandle< resourcesystem::InfoForResourceTypeIMaterial2 > m_nHaloIndex; // 0xef0 | Schema_Atomic | Size: 0x8
			char  m_nHaloIndex[0x8]; // 0xef0 | Schema_Atomic | Size: 0x8
			client::BeamType_t m_nBeamType; // 0xef8 | Schema_DeclaredEnum | Size: 0x4
			uint32_t m_nBeamFlags; // 0xefc | Schema_Builtin | Size: 0x4
			// client::CHandle< C_BaseEntity > m_hAttachEntity[10]; // 0xf00 | Schema_FixedArray | Size: 0x28
			char  m_hAttachEntity[0x4]; // 0xf00 | Schema_FixedArray | Size: 0x4
			modellib::AttachmentHandle_t m_nAttachIndex[10]; // 0xf28 | Schema_FixedArray | Size: 0x64
			float32 m_fWidth; // 0xf34 | Schema_Builtin | Size: 0x4
			float32 m_fEndWidth; // 0xf38 | Schema_Builtin | Size: 0x4
			float32 m_fFadeLength; // 0xf3c | Schema_Builtin | Size: 0x4
			float32 m_fHaloScale; // 0xf40 | Schema_Builtin | Size: 0x4
			float32 m_fAmplitude; // 0xf44 | Schema_Builtin | Size: 0x4
			float32 m_fStartFrame; // 0xf48 | Schema_Builtin | Size: 0x4
			float32 m_fSpeed; // 0xf4c | Schema_Builtin | Size: 0x4
			float32 m_flFrame; // 0xf50 | Schema_Builtin | Size: 0x4
			client::BeamClipStyle_t m_nClipStyle; // 0xf54 | Schema_DeclaredEnum | Size: 0x4
			bool m_bTurnedOff; // 0xf58 | Schema_Builtin | Size: 0x1
			S2_PAD(0x3);
			GlobalTypes::VectorWS m_vecEndPos; // 0xf5c | Schema_Atomic | Size: 0xc
			GlobalTypes::CHandle< client::C_BaseEntity > m_hEndEntity; // 0xf68 | Schema_Atomic | Size: 0x4
			// char  m_hEndEntity[0x4]; // 0xf68 | Schema_Atomic | Size: 0x4
			S2_PAD(0x4); // End padding
		};
		static_assert(offsetof(CS2::client::C_Beam, m_flFrameRate) == 0xEB0, "m_flFrameRate in C_Beam should be at offset 0xEB0");
		static_assert(offsetof(CS2::client::C_Beam, m_flHDRColorScale) == 0xEB4, "m_flHDRColorScale in C_Beam should be at offset 0xEB4");
		static_assert(offsetof(CS2::client::C_Beam, m_flFireTime) == 0xEB8, "m_flFireTime in C_Beam should be at offset 0xEB8");
		static_assert(offsetof(CS2::client::C_Beam, m_flDamage) == 0xEBC, "m_flDamage in C_Beam should be at offset 0xEBC");
		static_assert(offsetof(CS2::client::C_Beam, m_nNumBeamEnts) == 0xEC0, "m_nNumBeamEnts in C_Beam should be at offset 0xEC0");
		static_assert(offsetof(CS2::client::C_Beam, m_queryHandleHalo) == 0xEC4, "m_queryHandleHalo in C_Beam should be at offset 0xEC4");
		static_assert(offsetof(CS2::client::C_Beam, m_hBaseMaterial) == 0xEE8, "m_hBaseMaterial in C_Beam should be at offset 0xEE8");
		static_assert(offsetof(CS2::client::C_Beam, m_nHaloIndex) == 0xEF0, "m_nHaloIndex in C_Beam should be at offset 0xEF0");
		static_assert(offsetof(CS2::client::C_Beam, m_nBeamType) == 0xEF8, "m_nBeamType in C_Beam should be at offset 0xEF8");
		static_assert(offsetof(CS2::client::C_Beam, m_nBeamFlags) == 0xEFC, "m_nBeamFlags in C_Beam should be at offset 0xEFC");
		static_assert(offsetof(CS2::client::C_Beam, m_hAttachEntity) == 0xF00, "m_hAttachEntity in C_Beam should be at offset 0xF00");
		static_assert(offsetof(CS2::client::C_Beam, m_nAttachIndex) == 0xF28, "m_nAttachIndex in C_Beam should be at offset 0xF28");
		static_assert(offsetof(CS2::client::C_Beam, m_fWidth) == 0xF34, "m_fWidth in C_Beam should be at offset 0xF34");
		static_assert(offsetof(CS2::client::C_Beam, m_fEndWidth) == 0xF38, "m_fEndWidth in C_Beam should be at offset 0xF38");
		static_assert(offsetof(CS2::client::C_Beam, m_fFadeLength) == 0xF3C, "m_fFadeLength in C_Beam should be at offset 0xF3C");
		static_assert(offsetof(CS2::client::C_Beam, m_fHaloScale) == 0xF40, "m_fHaloScale in C_Beam should be at offset 0xF40");
		static_assert(offsetof(CS2::client::C_Beam, m_fAmplitude) == 0xF44, "m_fAmplitude in C_Beam should be at offset 0xF44");
		static_assert(offsetof(CS2::client::C_Beam, m_fStartFrame) == 0xF48, "m_fStartFrame in C_Beam should be at offset 0xF48");
		static_assert(offsetof(CS2::client::C_Beam, m_fSpeed) == 0xF4C, "m_fSpeed in C_Beam should be at offset 0xF4C");
		static_assert(offsetof(CS2::client::C_Beam, m_flFrame) == 0xF50, "m_flFrame in C_Beam should be at offset 0xF50");
		static_assert(offsetof(CS2::client::C_Beam, m_nClipStyle) == 0xF54, "m_nClipStyle in C_Beam should be at offset 0xF54");
		static_assert(offsetof(CS2::client::C_Beam, m_bTurnedOff) == 0xF58, "m_bTurnedOff in C_Beam should be at offset 0xF58");
		static_assert(offsetof(CS2::client::C_Beam, m_vecEndPos) == 0xF5C, "m_vecEndPos in C_Beam should be at offset 0xF5C");
		static_assert(offsetof(CS2::client::C_Beam, m_hEndEntity) == 0xF68, "m_hEndEntity in C_Beam should be at offset 0xF68");
		static_assert(sizeof(CS2::client::C_Beam) == 0xF70, "C_Beam size should be 0xF70");
	}
}
