// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#ifndef CUSTOM_GLOBAL_TYPES
	#include <SDK/GlobalTypes.hpp>
#else
	#include <Custom/GlobalTypes.hpp>
#endif


#include <SDK/client/CBaseProp.hpp>
#include <SDK/client/CPropDataComponent.hpp>
#include <SDK/entity2/CEntityIOOutput.hpp>
#include <SDK/client/PerformanceMode_t.hpp>
#include <SDK/entity2/GameTime_t.hpp>
#include <SDK/client/BreakableContentsType_t.hpp>
#include <SDK/client/BaseExplosionTypes_t.hpp>



namespace CS2 {
	namespace client {
		class C_BaseEntity;
		class C_BasePlayerPawn;
	}
}


using namespace GlobalTypes;
namespace CS2 {
	namespace client {
		class C_BreakableProp : public CS2::client::CBaseProp {
		public:
			client::CPropDataComponent m_CPropDataComponent; // 0x11a0 | Schema_DeclaredClass | Size: 0x40
			entity2::CEntityIOOutput m_OnStartDeath; // 0x11e0 | Schema_DeclaredClass | Size: 0x18
			entity2::CEntityIOOutput m_OnBreak; // 0x11f8 | Schema_DeclaredClass | Size: 0x18
			// GlobalTypes::CEntityOutputTemplate< float32, float32 > m_OnHealthChanged; // 0x1210 | Schema_Atomic | Size: 0x20
			char m_OnHealthChanged[0x20]; // 0x1210 | Schema_Atomic | Size: 0x20
			entity2::CEntityIOOutput m_OnTakeDamage; // 0x1230 | Schema_DeclaredClass | Size: 0x18
			float32 m_impactEnergyScale; // 0x1248 | Schema_Builtin | Size: 0x4
			int32_t m_iMinHealthDmg; // 0x124c | Schema_Builtin | Size: 0x4
			float32 m_flPressureDelay; // 0x1250 | Schema_Builtin | Size: 0x4
			float32 m_flDefBurstScale; // 0x1254 | Schema_Builtin | Size: 0x4
			GlobalTypes::Vector m_vDefBurstOffset; // 0x1258 | Schema_Atomic | Size: 0xc
			GlobalTypes::CHandle<client::C_BaseEntity> m_hBreaker; // 0x1264 | Schema_Atomic | Size: 0x4
			// char m_hBreaker[0x4]; // 0x1264 | Schema_Atomic | Size: 0x4
			client::PerformanceMode_t m_PerformanceMode; // 0x1268 | Schema_DeclaredEnum | Size: 0x4
			entity2::GameTime_t m_flPreventDamageBeforeTime; // 0x126c | Schema_DeclaredClass | Size: 0x4
			client::BreakableContentsType_t m_BreakableContentsType; // 0x1270 | Schema_DeclaredEnum | Size: 0x4
			S2_PAD(0x4);
			GlobalTypes::CUtlString m_strBreakableContentsPropGroupOverride; // 0x1278 | Schema_Atomic | Size: 0x8
			GlobalTypes::CUtlString m_strBreakableContentsParticleOverride; // 0x1280 | Schema_Atomic | Size: 0x8
			bool m_bHasBreakPiecesOrCommands; // 0x1288 | Schema_Builtin | Size: 0x1
			S2_PAD(0x3);
			float32 m_explodeDamage; // 0x128c | Schema_Builtin | Size: 0x4
			float32 m_explodeRadius; // 0x1290 | Schema_Builtin | Size: 0x4
			client::BaseExplosionTypes_t m_nExplosionType; // 0x1294 | Schema_DeclaredEnum | Size: 0x4
			float32 m_explosionDelay; // 0x1298 | Schema_Builtin | Size: 0x4
			S2_PAD(0x4);
			GlobalTypes::CUtlSymbolLarge m_explosionBuildupSound; // 0x12a0 | Schema_Atomic | Size: 0x8
			GlobalTypes::CUtlSymbolLarge m_explosionCustomEffect; // 0x12a8 | Schema_Atomic | Size: 0x8
			GlobalTypes::CUtlSymbolLarge m_explosionCustomSound; // 0x12b0 | Schema_Atomic | Size: 0x8
			GlobalTypes::CUtlSymbolLarge m_explosionModifier; // 0x12b8 | Schema_Atomic | Size: 0x8
			GlobalTypes::CHandle<client::C_BasePlayerPawn> m_hPhysicsAttacker; // 0x12c0 | Schema_Atomic | Size: 0x4
			// char m_hPhysicsAttacker[0x4]; // 0x12c0 | Schema_Atomic | Size: 0x4
			entity2::GameTime_t m_flLastPhysicsInfluenceTime; // 0x12c4 | Schema_DeclaredClass | Size: 0x4
			float32 m_flDefaultFadeScale; // 0x12c8 | Schema_Builtin | Size: 0x4
			GlobalTypes::CHandle<client::C_BaseEntity> m_hLastAttacker; // 0x12cc | Schema_Atomic | Size: 0x4
			// char m_hLastAttacker[0x4]; // 0x12cc | Schema_Atomic | Size: 0x4
		};
		static_assert(offsetof(CS2::client::C_BreakableProp, m_CPropDataComponent) == 0x11A0, "m_CPropDataComponent in C_BreakableProp should be at offset 0x11A0");
		static_assert(offsetof(CS2::client::C_BreakableProp, m_OnStartDeath) == 0x11E0, "m_OnStartDeath in C_BreakableProp should be at offset 0x11E0");
		static_assert(offsetof(CS2::client::C_BreakableProp, m_OnBreak) == 0x11F8, "m_OnBreak in C_BreakableProp should be at offset 0x11F8");
		static_assert(offsetof(CS2::client::C_BreakableProp, m_OnHealthChanged) == 0x1210, "m_OnHealthChanged in C_BreakableProp should be at offset 0x1210");
		static_assert(offsetof(CS2::client::C_BreakableProp, m_OnTakeDamage) == 0x1230, "m_OnTakeDamage in C_BreakableProp should be at offset 0x1230");
		static_assert(offsetof(CS2::client::C_BreakableProp, m_impactEnergyScale) == 0x1248, "m_impactEnergyScale in C_BreakableProp should be at offset 0x1248");
		static_assert(offsetof(CS2::client::C_BreakableProp, m_iMinHealthDmg) == 0x124C, "m_iMinHealthDmg in C_BreakableProp should be at offset 0x124C");
		static_assert(offsetof(CS2::client::C_BreakableProp, m_flPressureDelay) == 0x1250, "m_flPressureDelay in C_BreakableProp should be at offset 0x1250");
		static_assert(offsetof(CS2::client::C_BreakableProp, m_flDefBurstScale) == 0x1254, "m_flDefBurstScale in C_BreakableProp should be at offset 0x1254");
		static_assert(offsetof(CS2::client::C_BreakableProp, m_vDefBurstOffset) == 0x1258, "m_vDefBurstOffset in C_BreakableProp should be at offset 0x1258");
		static_assert(offsetof(CS2::client::C_BreakableProp, m_hBreaker) == 0x1264, "m_hBreaker in C_BreakableProp should be at offset 0x1264");
		static_assert(offsetof(CS2::client::C_BreakableProp, m_PerformanceMode) == 0x1268, "m_PerformanceMode in C_BreakableProp should be at offset 0x1268");
		static_assert(offsetof(CS2::client::C_BreakableProp, m_flPreventDamageBeforeTime) == 0x126C, "m_flPreventDamageBeforeTime in C_BreakableProp should be at offset 0x126C");
		static_assert(offsetof(CS2::client::C_BreakableProp, m_BreakableContentsType) == 0x1270, "m_BreakableContentsType in C_BreakableProp should be at offset 0x1270");
		static_assert(offsetof(CS2::client::C_BreakableProp, m_strBreakableContentsPropGroupOverride) == 0x1278, "m_strBreakableContentsPropGroupOverride in C_BreakableProp should be at offset 0x1278");
		static_assert(offsetof(CS2::client::C_BreakableProp, m_strBreakableContentsParticleOverride) == 0x1280, "m_strBreakableContentsParticleOverride in C_BreakableProp should be at offset 0x1280");
		static_assert(offsetof(CS2::client::C_BreakableProp, m_bHasBreakPiecesOrCommands) == 0x1288, "m_bHasBreakPiecesOrCommands in C_BreakableProp should be at offset 0x1288");
		static_assert(offsetof(CS2::client::C_BreakableProp, m_explodeDamage) == 0x128C, "m_explodeDamage in C_BreakableProp should be at offset 0x128C");
		static_assert(offsetof(CS2::client::C_BreakableProp, m_explodeRadius) == 0x1290, "m_explodeRadius in C_BreakableProp should be at offset 0x1290");
		static_assert(offsetof(CS2::client::C_BreakableProp, m_nExplosionType) == 0x1294, "m_nExplosionType in C_BreakableProp should be at offset 0x1294");
		static_assert(offsetof(CS2::client::C_BreakableProp, m_explosionDelay) == 0x1298, "m_explosionDelay in C_BreakableProp should be at offset 0x1298");
		static_assert(offsetof(CS2::client::C_BreakableProp, m_explosionBuildupSound) == 0x12A0, "m_explosionBuildupSound in C_BreakableProp should be at offset 0x12A0");
		static_assert(offsetof(CS2::client::C_BreakableProp, m_explosionCustomEffect) == 0x12A8, "m_explosionCustomEffect in C_BreakableProp should be at offset 0x12A8");
		static_assert(offsetof(CS2::client::C_BreakableProp, m_explosionCustomSound) == 0x12B0, "m_explosionCustomSound in C_BreakableProp should be at offset 0x12B0");
		static_assert(offsetof(CS2::client::C_BreakableProp, m_explosionModifier) == 0x12B8, "m_explosionModifier in C_BreakableProp should be at offset 0x12B8");
		static_assert(offsetof(CS2::client::C_BreakableProp, m_hPhysicsAttacker) == 0x12C0, "m_hPhysicsAttacker in C_BreakableProp should be at offset 0x12C0");
		static_assert(offsetof(CS2::client::C_BreakableProp, m_flLastPhysicsInfluenceTime) == 0x12C4, "m_flLastPhysicsInfluenceTime in C_BreakableProp should be at offset 0x12C4");
		static_assert(offsetof(CS2::client::C_BreakableProp, m_flDefaultFadeScale) == 0x12C8, "m_flDefaultFadeScale in C_BreakableProp should be at offset 0x12C8");
		static_assert(offsetof(CS2::client::C_BreakableProp, m_hLastAttacker) == 0x12CC, "m_hLastAttacker in C_BreakableProp should be at offset 0x12CC");
		static_assert(sizeof(CS2::client::C_BreakableProp) == 0x12D0, "C_BreakableProp size should be 0x12D0");
	}
}
