// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#ifndef CUSTOM_GLOBAL_TYPES
	#include "../GlobalTypes.hpp"
#else
	#include <Custom/GlobalTypes.hpp>
#endif


#include "CBaseAnimGraph.hpp"



namespace CS2 {
	namespace client {
		class C_BaseEntity;
	}
}


using namespace GlobalTypes;
namespace CS2 {
	namespace client {
		class C_BulletHitModel : public CS2::client::CBaseAnimGraph {
		public:
			GlobalTypes::matrix3x4_t m_matLocal; // 0x1168 | Schema_Atomic | Size: 0x30
			int32_t m_iBoneIndex; // 0x1198 | Schema_Builtin | Size: 0x4
			GlobalTypes::CHandle<client::C_BaseEntity> m_hPlayerParent; // 0x119c | Schema_Atomic | Size: 0x4
			// char m_hPlayerParent[0x4]; // 0x119c | Schema_Atomic | Size: 0x4
			bool m_bIsHit; // 0x11a0 | Schema_Builtin | Size: 0x1
			S2_PAD(0x3);
			float32 m_flTimeCreated; // 0x11a4 | Schema_Builtin | Size: 0x4
			GlobalTypes::Vector m_vecStartPos; // 0x11a8 | Schema_Atomic | Size: 0xc
			S2_PAD(0x4); // End padding
		};
#ifdef USE_STATIC_ASSERTS
		static_assert(offsetof(CS2::client::C_BulletHitModel, m_matLocal) == 0x1168, "m_matLocal in C_BulletHitModel should be at offset 0x1168");
		static_assert(offsetof(CS2::client::C_BulletHitModel, m_iBoneIndex) == 0x1198, "m_iBoneIndex in C_BulletHitModel should be at offset 0x1198");
		static_assert(offsetof(CS2::client::C_BulletHitModel, m_hPlayerParent) == 0x119C, "m_hPlayerParent in C_BulletHitModel should be at offset 0x119C");
		static_assert(offsetof(CS2::client::C_BulletHitModel, m_bIsHit) == 0x11A0, "m_bIsHit in C_BulletHitModel should be at offset 0x11A0");
		static_assert(offsetof(CS2::client::C_BulletHitModel, m_flTimeCreated) == 0x11A4, "m_flTimeCreated in C_BulletHitModel should be at offset 0x11A4");
		static_assert(offsetof(CS2::client::C_BulletHitModel, m_vecStartPos) == 0x11A8, "m_vecStartPos in C_BulletHitModel should be at offset 0x11A8");
		static_assert(sizeof(CS2::client::C_BulletHitModel) == 0x11B8, "C_BulletHitModel size should be 0x11B8");

#endif
	}
}
