// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#ifndef CUSTOM_GLOBAL_TYPES
	#include <SDK/GlobalTypes.hpp>
#else
	#include <Custom/GlobalTypes.hpp>
#endif


#include <SDK/client/CBaseAnimGraphAnimGraphController.hpp>





using namespace GlobalTypes;
namespace CS2 {
	namespace client {
		class C_Chicken_GraphController : public CS2::client::CBaseAnimGraphAnimGraphController {
		public:
			// GlobalTypes::CAnimGraphParamRef<char*> m_paramActivity; // 0x268 | Schema_Atomic | Size: 0x28
			char  m_paramActivity[0x28]; // 0x268 | Schema_Atomic | Size: 0x28
			// GlobalTypes::CAnimGraphParamRef< bool > m_paramEndActivityImmediately; // 0x290 | Schema_Atomic | Size: 0x20
			char  m_paramEndActivityImmediately[0x20]; // 0x290 | Schema_Atomic | Size: 0x20
			// GlobalTypes::CAnimGraphParamRef< bool > m_paramSnapToSquatting; // 0x2b0 | Schema_Atomic | Size: 0x20
			char  m_paramSnapToSquatting[0x20]; // 0x2b0 | Schema_Atomic | Size: 0x20
			GlobalTypes::CAnimGraphTagRef m_sActivityFinished; // 0x2d0 | Schema_Atomic | Size: 0x18
			S2_PAD(0x8); // End padding
		};
		static_assert(offsetof(CS2::client::C_Chicken_GraphController, m_paramActivity) == 0x268, "m_paramActivity in C_Chicken_GraphController should be at offset 0x268");
		static_assert(offsetof(CS2::client::C_Chicken_GraphController, m_paramEndActivityImmediately) == 0x290, "m_paramEndActivityImmediately in C_Chicken_GraphController should be at offset 0x290");
		static_assert(offsetof(CS2::client::C_Chicken_GraphController, m_paramSnapToSquatting) == 0x2B0, "m_paramSnapToSquatting in C_Chicken_GraphController should be at offset 0x2B0");
		static_assert(offsetof(CS2::client::C_Chicken_GraphController, m_sActivityFinished) == 0x2D0, "m_sActivityFinished in C_Chicken_GraphController should be at offset 0x2D0");
		static_assert(sizeof(CS2::client::C_Chicken_GraphController) == 0x2F0, "C_Chicken_GraphController size should be 0x2F0");
	}
}
