// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#ifndef CUSTOM_GLOBAL_TYPES
	#include "../GlobalTypes.hpp"
#else
	#include <Custom/GlobalTypes.hpp>
#endif


#include "C_BasePlayerWeapon.hpp"
#include "WeaponGameplayAnimState.hpp"
#include "../entity2/GameTime_t.hpp"
#include "../entity2/CEntityIOOutput.hpp"
#include "CSWeaponMode.hpp"
#include "../entity2/GameTick_t.hpp"
#include "C_IronSightController.hpp"



namespace CS2 {
	namespace client {
		class C_CSPlayerPawn;
	}
}


using namespace GlobalTypes;
namespace CS2 {
	namespace client {
		class C_CSWeaponBase : public CS2::client::C_BasePlayerWeapon {
		public:
			S2_PAD(0x50);
			client::WeaponGameplayAnimState m_iWeaponGameplayAnimState; // 0x1948 | Schema_DeclaredEnum | Size: 0x2
			S2_PAD(0x2);
			entity2::GameTime_t m_flWeaponGameplayAnimStateTimestamp; // 0x194c | Schema_DeclaredClass | Size: 0x4
			entity2::GameTime_t m_flInspectCancelCompleteTime; // 0x1950 | Schema_DeclaredClass | Size: 0x4
			bool m_bInspectPending; // 0x1954 | Schema_Builtin | Size: 0x1
			bool m_bInspectShouldLoop; // 0x1955 | Schema_Builtin | Size: 0x1
			S2_PAD(0x2a);
			float32 m_flCrosshairDistance; // 0x1980 | Schema_Builtin | Size: 0x4
			int32_t m_iAmmoLastCheck; // 0x1984 | Schema_Builtin | Size: 0x4
			int32_t m_nLastEmptySoundCmdNum; // 0x1988 | Schema_Builtin | Size: 0x4
			bool m_bFireOnEmpty; // 0x198c | Schema_Builtin | Size: 0x1
			S2_PAD(0x3);
			entity2::CEntityIOOutput m_OnPlayerPickup; // 0x1990 | Schema_DeclaredClass | Size: 0x18
			client::CSWeaponMode m_weaponMode; // 0x19a8 | Schema_DeclaredEnum | Size: 0x4
			float32 m_flTurningInaccuracyDelta; // 0x19ac | Schema_Builtin | Size: 0x4
			GlobalTypes::Vector m_vecTurningInaccuracyEyeDirLast; // 0x19b0 | Schema_Atomic | Size: 0xc
			float32 m_flTurningInaccuracy; // 0x19bc | Schema_Builtin | Size: 0x4
			float32 m_fAccuracyPenalty; // 0x19c0 | Schema_Builtin | Size: 0x4
			entity2::GameTime_t m_flLastAccuracyUpdateTime; // 0x19c4 | Schema_DeclaredClass | Size: 0x4
			float32 m_fAccuracySmoothedForZoom; // 0x19c8 | Schema_Builtin | Size: 0x4
			int32_t m_iRecoilIndex; // 0x19cc | Schema_Builtin | Size: 0x4
			float32 m_flRecoilIndex; // 0x19d0 | Schema_Builtin | Size: 0x4
			bool m_bBurstMode; // 0x19d4 | Schema_Builtin | Size: 0x1
			S2_PAD(0x3);
			entity2::GameTime_t m_flLastBurstModeChangeTime; // 0x19d8 | Schema_DeclaredClass | Size: 0x4
			entity2::GameTick_t m_nPostponeFireReadyTicks; // 0x19dc | Schema_DeclaredClass | Size: 0x4
			float32 m_flPostponeFireReadyFrac; // 0x19e0 | Schema_Builtin | Size: 0x4
			bool m_bInReload; // 0x19e4 | Schema_Builtin | Size: 0x1
			S2_PAD(0x3);
			entity2::GameTime_t m_flDroppedAtTime; // 0x19e8 | Schema_DeclaredClass | Size: 0x4
			bool m_bIsHauledBack; // 0x19ec | Schema_Builtin | Size: 0x1
			bool m_bSilencerOn; // 0x19ed | Schema_Builtin | Size: 0x1
			S2_PAD(0x2);
			entity2::GameTime_t m_flTimeSilencerSwitchComplete; // 0x19f0 | Schema_DeclaredClass | Size: 0x4
			float32 m_flWeaponActionPlaybackRate; // 0x19f4 | Schema_Builtin | Size: 0x4
			int32_t m_iOriginalTeamNumber; // 0x19f8 | Schema_Builtin | Size: 0x4
			int32_t m_iMostRecentTeamNumber; // 0x19fc | Schema_Builtin | Size: 0x4
			bool m_bDroppedNearBuyZone; // 0x1a00 | Schema_Builtin | Size: 0x1
			S2_PAD(0x3);
			float32 m_flNextAttackRenderTimeOffset; // 0x1a04 | Schema_Builtin | Size: 0x4
			S2_PAD(0x98);
			bool m_bClearWeaponIdentifyingUGC; // 0x1aa0 | Schema_Builtin | Size: 0x1
			bool m_bVisualsDataSet; // 0x1aa1 | Schema_Builtin | Size: 0x1
			bool m_bUIWeapon; // 0x1aa2 | Schema_Builtin | Size: 0x1
			S2_PAD(0x1);
			int32_t m_nCustomEconReloadEventId; // 0x1aa4 | Schema_Builtin | Size: 0x4
			S2_PAD(0x8);
			entity2::GameTime_t m_nextPrevOwnerUseTime; // 0x1ab0 | Schema_DeclaredClass | Size: 0x4
			GlobalTypes::CHandle<client::C_CSPlayerPawn> m_hPrevOwner; // 0x1ab4 | Schema_Atomic | Size: 0x4
			// char m_hPrevOwner[0x4]; // 0x1ab4 | Schema_Atomic | Size: 0x4
			entity2::GameTick_t m_nDropTick; // 0x1ab8 | Schema_DeclaredClass | Size: 0x4
			bool m_bWasActiveWeaponWhenDropped; // 0x1abc | Schema_Builtin | Size: 0x1
			S2_PAD(0x1f);
			bool m_donated; // 0x1adc | Schema_Builtin | Size: 0x1
			S2_PAD(0x3);
			entity2::GameTime_t m_fLastShotTime; // 0x1ae0 | Schema_DeclaredClass | Size: 0x4
			bool m_bWasOwnedByCT; // 0x1ae4 | Schema_Builtin | Size: 0x1
			bool m_bWasOwnedByTerrorist; // 0x1ae5 | Schema_Builtin | Size: 0x1
			S2_PAD(0x2);
			float32 m_flNextClientFireBulletTime; // 0x1ae8 | Schema_Builtin | Size: 0x4
			float32 m_flNextClientFireBulletTime_Repredict; // 0x1aec | Schema_Builtin | Size: 0x4
			S2_PAD(0x160);
			client::C_IronSightController m_IronSightController; // 0x1c50 | Schema_DeclaredClass | Size: 0xb0
			int32_t m_iIronSightMode; // 0x1d00 | Schema_Builtin | Size: 0x4
			S2_PAD(0x14);
			entity2::GameTime_t m_flLastLOSTraceFailureTime; // 0x1d18 | Schema_DeclaredClass | Size: 0x4
			S2_PAD(0x5c);
			float32 m_flWatTickOffset; // 0x1d78 | Schema_Builtin | Size: 0x4
			S2_PAD(0x10);
			entity2::GameTime_t m_flLastShakeTime; // 0x1d8c | Schema_DeclaredClass | Size: 0x4
			S2_PAD(0x1b0); // End padding
		};
#ifdef USE_STATIC_ASSERTS
		static_assert(offsetof(CS2::client::C_CSWeaponBase, m_iWeaponGameplayAnimState) == 0x1948, "m_iWeaponGameplayAnimState in C_CSWeaponBase should be at offset 0x1948");
		static_assert(offsetof(CS2::client::C_CSWeaponBase, m_flWeaponGameplayAnimStateTimestamp) == 0x194C, "m_flWeaponGameplayAnimStateTimestamp in C_CSWeaponBase should be at offset 0x194C");
		static_assert(offsetof(CS2::client::C_CSWeaponBase, m_flInspectCancelCompleteTime) == 0x1950, "m_flInspectCancelCompleteTime in C_CSWeaponBase should be at offset 0x1950");
		static_assert(offsetof(CS2::client::C_CSWeaponBase, m_bInspectPending) == 0x1954, "m_bInspectPending in C_CSWeaponBase should be at offset 0x1954");
		static_assert(offsetof(CS2::client::C_CSWeaponBase, m_bInspectShouldLoop) == 0x1955, "m_bInspectShouldLoop in C_CSWeaponBase should be at offset 0x1955");
		static_assert(offsetof(CS2::client::C_CSWeaponBase, m_flCrosshairDistance) == 0x1980, "m_flCrosshairDistance in C_CSWeaponBase should be at offset 0x1980");
		static_assert(offsetof(CS2::client::C_CSWeaponBase, m_iAmmoLastCheck) == 0x1984, "m_iAmmoLastCheck in C_CSWeaponBase should be at offset 0x1984");
		static_assert(offsetof(CS2::client::C_CSWeaponBase, m_nLastEmptySoundCmdNum) == 0x1988, "m_nLastEmptySoundCmdNum in C_CSWeaponBase should be at offset 0x1988");
		static_assert(offsetof(CS2::client::C_CSWeaponBase, m_bFireOnEmpty) == 0x198C, "m_bFireOnEmpty in C_CSWeaponBase should be at offset 0x198C");
		static_assert(offsetof(CS2::client::C_CSWeaponBase, m_OnPlayerPickup) == 0x1990, "m_OnPlayerPickup in C_CSWeaponBase should be at offset 0x1990");
		static_assert(offsetof(CS2::client::C_CSWeaponBase, m_weaponMode) == 0x19A8, "m_weaponMode in C_CSWeaponBase should be at offset 0x19A8");
		static_assert(offsetof(CS2::client::C_CSWeaponBase, m_flTurningInaccuracyDelta) == 0x19AC, "m_flTurningInaccuracyDelta in C_CSWeaponBase should be at offset 0x19AC");
		static_assert(offsetof(CS2::client::C_CSWeaponBase, m_vecTurningInaccuracyEyeDirLast) == 0x19B0, "m_vecTurningInaccuracyEyeDirLast in C_CSWeaponBase should be at offset 0x19B0");
		static_assert(offsetof(CS2::client::C_CSWeaponBase, m_flTurningInaccuracy) == 0x19BC, "m_flTurningInaccuracy in C_CSWeaponBase should be at offset 0x19BC");
		static_assert(offsetof(CS2::client::C_CSWeaponBase, m_fAccuracyPenalty) == 0x19C0, "m_fAccuracyPenalty in C_CSWeaponBase should be at offset 0x19C0");
		static_assert(offsetof(CS2::client::C_CSWeaponBase, m_flLastAccuracyUpdateTime) == 0x19C4, "m_flLastAccuracyUpdateTime in C_CSWeaponBase should be at offset 0x19C4");
		static_assert(offsetof(CS2::client::C_CSWeaponBase, m_fAccuracySmoothedForZoom) == 0x19C8, "m_fAccuracySmoothedForZoom in C_CSWeaponBase should be at offset 0x19C8");
		static_assert(offsetof(CS2::client::C_CSWeaponBase, m_iRecoilIndex) == 0x19CC, "m_iRecoilIndex in C_CSWeaponBase should be at offset 0x19CC");
		static_assert(offsetof(CS2::client::C_CSWeaponBase, m_flRecoilIndex) == 0x19D0, "m_flRecoilIndex in C_CSWeaponBase should be at offset 0x19D0");
		static_assert(offsetof(CS2::client::C_CSWeaponBase, m_bBurstMode) == 0x19D4, "m_bBurstMode in C_CSWeaponBase should be at offset 0x19D4");
		static_assert(offsetof(CS2::client::C_CSWeaponBase, m_flLastBurstModeChangeTime) == 0x19D8, "m_flLastBurstModeChangeTime in C_CSWeaponBase should be at offset 0x19D8");
		static_assert(offsetof(CS2::client::C_CSWeaponBase, m_nPostponeFireReadyTicks) == 0x19DC, "m_nPostponeFireReadyTicks in C_CSWeaponBase should be at offset 0x19DC");
		static_assert(offsetof(CS2::client::C_CSWeaponBase, m_flPostponeFireReadyFrac) == 0x19E0, "m_flPostponeFireReadyFrac in C_CSWeaponBase should be at offset 0x19E0");
		static_assert(offsetof(CS2::client::C_CSWeaponBase, m_bInReload) == 0x19E4, "m_bInReload in C_CSWeaponBase should be at offset 0x19E4");
		static_assert(offsetof(CS2::client::C_CSWeaponBase, m_flDroppedAtTime) == 0x19E8, "m_flDroppedAtTime in C_CSWeaponBase should be at offset 0x19E8");
		static_assert(offsetof(CS2::client::C_CSWeaponBase, m_bIsHauledBack) == 0x19EC, "m_bIsHauledBack in C_CSWeaponBase should be at offset 0x19EC");
		static_assert(offsetof(CS2::client::C_CSWeaponBase, m_bSilencerOn) == 0x19ED, "m_bSilencerOn in C_CSWeaponBase should be at offset 0x19ED");
		static_assert(offsetof(CS2::client::C_CSWeaponBase, m_flTimeSilencerSwitchComplete) == 0x19F0, "m_flTimeSilencerSwitchComplete in C_CSWeaponBase should be at offset 0x19F0");
		static_assert(offsetof(CS2::client::C_CSWeaponBase, m_flWeaponActionPlaybackRate) == 0x19F4, "m_flWeaponActionPlaybackRate in C_CSWeaponBase should be at offset 0x19F4");
		static_assert(offsetof(CS2::client::C_CSWeaponBase, m_iOriginalTeamNumber) == 0x19F8, "m_iOriginalTeamNumber in C_CSWeaponBase should be at offset 0x19F8");
		static_assert(offsetof(CS2::client::C_CSWeaponBase, m_iMostRecentTeamNumber) == 0x19FC, "m_iMostRecentTeamNumber in C_CSWeaponBase should be at offset 0x19FC");
		static_assert(offsetof(CS2::client::C_CSWeaponBase, m_bDroppedNearBuyZone) == 0x1A00, "m_bDroppedNearBuyZone in C_CSWeaponBase should be at offset 0x1A00");
		static_assert(offsetof(CS2::client::C_CSWeaponBase, m_flNextAttackRenderTimeOffset) == 0x1A04, "m_flNextAttackRenderTimeOffset in C_CSWeaponBase should be at offset 0x1A04");
		static_assert(offsetof(CS2::client::C_CSWeaponBase, m_bClearWeaponIdentifyingUGC) == 0x1AA0, "m_bClearWeaponIdentifyingUGC in C_CSWeaponBase should be at offset 0x1AA0");
		static_assert(offsetof(CS2::client::C_CSWeaponBase, m_bVisualsDataSet) == 0x1AA1, "m_bVisualsDataSet in C_CSWeaponBase should be at offset 0x1AA1");
		static_assert(offsetof(CS2::client::C_CSWeaponBase, m_bUIWeapon) == 0x1AA2, "m_bUIWeapon in C_CSWeaponBase should be at offset 0x1AA2");
		static_assert(offsetof(CS2::client::C_CSWeaponBase, m_nCustomEconReloadEventId) == 0x1AA4, "m_nCustomEconReloadEventId in C_CSWeaponBase should be at offset 0x1AA4");
		static_assert(offsetof(CS2::client::C_CSWeaponBase, m_nextPrevOwnerUseTime) == 0x1AB0, "m_nextPrevOwnerUseTime in C_CSWeaponBase should be at offset 0x1AB0");
		static_assert(offsetof(CS2::client::C_CSWeaponBase, m_hPrevOwner) == 0x1AB4, "m_hPrevOwner in C_CSWeaponBase should be at offset 0x1AB4");
		static_assert(offsetof(CS2::client::C_CSWeaponBase, m_nDropTick) == 0x1AB8, "m_nDropTick in C_CSWeaponBase should be at offset 0x1AB8");
		static_assert(offsetof(CS2::client::C_CSWeaponBase, m_bWasActiveWeaponWhenDropped) == 0x1ABC, "m_bWasActiveWeaponWhenDropped in C_CSWeaponBase should be at offset 0x1ABC");
		static_assert(offsetof(CS2::client::C_CSWeaponBase, m_donated) == 0x1ADC, "m_donated in C_CSWeaponBase should be at offset 0x1ADC");
		static_assert(offsetof(CS2::client::C_CSWeaponBase, m_fLastShotTime) == 0x1AE0, "m_fLastShotTime in C_CSWeaponBase should be at offset 0x1AE0");
		static_assert(offsetof(CS2::client::C_CSWeaponBase, m_bWasOwnedByCT) == 0x1AE4, "m_bWasOwnedByCT in C_CSWeaponBase should be at offset 0x1AE4");
		static_assert(offsetof(CS2::client::C_CSWeaponBase, m_bWasOwnedByTerrorist) == 0x1AE5, "m_bWasOwnedByTerrorist in C_CSWeaponBase should be at offset 0x1AE5");
		static_assert(offsetof(CS2::client::C_CSWeaponBase, m_flNextClientFireBulletTime) == 0x1AE8, "m_flNextClientFireBulletTime in C_CSWeaponBase should be at offset 0x1AE8");
		static_assert(offsetof(CS2::client::C_CSWeaponBase, m_flNextClientFireBulletTime_Repredict) == 0x1AEC, "m_flNextClientFireBulletTime_Repredict in C_CSWeaponBase should be at offset 0x1AEC");
		static_assert(offsetof(CS2::client::C_CSWeaponBase, m_IronSightController) == 0x1C50, "m_IronSightController in C_CSWeaponBase should be at offset 0x1C50");
		static_assert(offsetof(CS2::client::C_CSWeaponBase, m_iIronSightMode) == 0x1D00, "m_iIronSightMode in C_CSWeaponBase should be at offset 0x1D00");
		static_assert(offsetof(CS2::client::C_CSWeaponBase, m_flLastLOSTraceFailureTime) == 0x1D18, "m_flLastLOSTraceFailureTime in C_CSWeaponBase should be at offset 0x1D18");
		static_assert(offsetof(CS2::client::C_CSWeaponBase, m_flWatTickOffset) == 0x1D78, "m_flWatTickOffset in C_CSWeaponBase should be at offset 0x1D78");
		static_assert(offsetof(CS2::client::C_CSWeaponBase, m_flLastShakeTime) == 0x1D8C, "m_flLastShakeTime in C_CSWeaponBase should be at offset 0x1D8C");
		static_assert(sizeof(CS2::client::C_CSWeaponBase) == 0x1F40, "C_CSWeaponBase size should be 0x1F40");

#endif
	}
}
