// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#ifndef CUSTOM_GLOBAL_TYPES
	#include "../GlobalTypes.hpp"
#else
	#include <Custom/GlobalTypes.hpp>
#endif


#include "CAnimGraphControllerBase.hpp"





using namespace GlobalTypes;
namespace CS2 {
	namespace client {
		class C_CSGO_PreviewPlayer_GraphController : public CS2::client::CAnimGraphControllerBase {
		public:
			// GlobalTypes::CAnimGraphParamRef<char*> m_pszCharacterMode; // 0x90 | Schema_Atomic | Size: 0x30
			char m_pszCharacterMode[0x30]; // 0x90 | Schema_Atomic | Size: 0x30
			// GlobalTypes::CAnimGraphParamRef<char*> m_pszTeamPreviewVariant; // 0xc0 | Schema_Atomic | Size: 0x30
			char m_pszTeamPreviewVariant[0x30]; // 0xc0 | Schema_Atomic | Size: 0x30
			// GlobalTypes::CAnimGraphParamRef<char*> m_pszTeamPreviewPosition; // 0xf0 | Schema_Atomic | Size: 0x30
			char m_pszTeamPreviewPosition[0x30]; // 0xf0 | Schema_Atomic | Size: 0x30
			// GlobalTypes::CAnimGraphParamRef<char*> m_pszEndOfMatchCelebration; // 0x120 | Schema_Atomic | Size: 0x30
			char m_pszEndOfMatchCelebration[0x30]; // 0x120 | Schema_Atomic | Size: 0x30
			// GlobalTypes::CAnimGraphParamRef< int32 > m_nTeamPreviewRandom; // 0x150 | Schema_Atomic | Size: 0x28
			char m_nTeamPreviewRandom[0x28]; // 0x150 | Schema_Atomic | Size: 0x28
			// GlobalTypes::CAnimGraphParamRef<char*> m_pszWeaponState; // 0x178 | Schema_Atomic | Size: 0x30
			char m_pszWeaponState[0x30]; // 0x178 | Schema_Atomic | Size: 0x30
			// GlobalTypes::CAnimGraphParamRef<char*> m_pszWeaponType; // 0x1a8 | Schema_Atomic | Size: 0x30
			char m_pszWeaponType[0x30]; // 0x1a8 | Schema_Atomic | Size: 0x30
			// GlobalTypes::CAnimGraphParamRef< bool > m_bCT; // 0x1d8 | Schema_Atomic | Size: 0x28
			char m_bCT[0x28]; // 0x1d8 | Schema_Atomic | Size: 0x28
		};
#ifdef USE_STATIC_ASSERTS
		static_assert(offsetof(CS2::client::C_CSGO_PreviewPlayer_GraphController, m_pszCharacterMode) == 0x90, "m_pszCharacterMode in C_CSGO_PreviewPlayer_GraphController should be at offset 0x90");
		static_assert(offsetof(CS2::client::C_CSGO_PreviewPlayer_GraphController, m_pszTeamPreviewVariant) == 0xC0, "m_pszTeamPreviewVariant in C_CSGO_PreviewPlayer_GraphController should be at offset 0xC0");
		static_assert(offsetof(CS2::client::C_CSGO_PreviewPlayer_GraphController, m_pszTeamPreviewPosition) == 0xF0, "m_pszTeamPreviewPosition in C_CSGO_PreviewPlayer_GraphController should be at offset 0xF0");
		static_assert(offsetof(CS2::client::C_CSGO_PreviewPlayer_GraphController, m_pszEndOfMatchCelebration) == 0x120, "m_pszEndOfMatchCelebration in C_CSGO_PreviewPlayer_GraphController should be at offset 0x120");
		static_assert(offsetof(CS2::client::C_CSGO_PreviewPlayer_GraphController, m_nTeamPreviewRandom) == 0x150, "m_nTeamPreviewRandom in C_CSGO_PreviewPlayer_GraphController should be at offset 0x150");
		static_assert(offsetof(CS2::client::C_CSGO_PreviewPlayer_GraphController, m_pszWeaponState) == 0x178, "m_pszWeaponState in C_CSGO_PreviewPlayer_GraphController should be at offset 0x178");
		static_assert(offsetof(CS2::client::C_CSGO_PreviewPlayer_GraphController, m_pszWeaponType) == 0x1A8, "m_pszWeaponType in C_CSGO_PreviewPlayer_GraphController should be at offset 0x1A8");
		static_assert(offsetof(CS2::client::C_CSGO_PreviewPlayer_GraphController, m_bCT) == 0x1D8, "m_bCT in C_CSGO_PreviewPlayer_GraphController should be at offset 0x1D8");
		static_assert(sizeof(CS2::client::C_CSGO_PreviewPlayer_GraphController) == 0x200, "C_CSGO_PreviewPlayer_GraphController size should be 0x200");

#endif
	}
}
