// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#ifndef CUSTOM_GLOBAL_TYPES
	#include <SDK/GlobalTypes.hpp>
#else
	#include <Custom/GlobalTypes.hpp>
#endif


#include <SDK/client/C_CSWeaponBase.hpp>





using namespace GlobalTypes;
namespace CS2 {
	namespace client {
		class C_CSWeaponBaseGun : public CS2::client::C_CSWeaponBase {
		public:
			int32_t m_zoomLevel; // 0x1f40 | Schema_Builtin | Size: 0x4
			int32_t m_iBurstShotsRemaining; // 0x1f44 | Schema_Builtin | Size: 0x4
			int32_t m_iSilencerBodygroup; // 0x1f48 | Schema_Builtin | Size: 0x4
			S2_PAD(0xc);
			int32_t m_silencedModelIndex; // 0x1f58 | Schema_Builtin | Size: 0x4
			bool m_inPrecache; // 0x1f5c | Schema_Builtin | Size: 0x1
			bool m_bNeedsBoltAction; // 0x1f5d | Schema_Builtin | Size: 0x1
			S2_PAD(0x2);
			int32_t m_nRevolverCylinderIdx; // 0x1f60 | Schema_Builtin | Size: 0x4
			S2_PAD(0xc); // End padding
		};
		static_assert(offsetof(CS2::client::C_CSWeaponBaseGun, m_zoomLevel) == 0x1F40, "m_zoomLevel in C_CSWeaponBaseGun should be at offset 0x1F40");
		static_assert(offsetof(CS2::client::C_CSWeaponBaseGun, m_iBurstShotsRemaining) == 0x1F44, "m_iBurstShotsRemaining in C_CSWeaponBaseGun should be at offset 0x1F44");
		static_assert(offsetof(CS2::client::C_CSWeaponBaseGun, m_iSilencerBodygroup) == 0x1F48, "m_iSilencerBodygroup in C_CSWeaponBaseGun should be at offset 0x1F48");
		static_assert(offsetof(CS2::client::C_CSWeaponBaseGun, m_silencedModelIndex) == 0x1F58, "m_silencedModelIndex in C_CSWeaponBaseGun should be at offset 0x1F58");
		static_assert(offsetof(CS2::client::C_CSWeaponBaseGun, m_inPrecache) == 0x1F5C, "m_inPrecache in C_CSWeaponBaseGun should be at offset 0x1F5C");
		static_assert(offsetof(CS2::client::C_CSWeaponBaseGun, m_bNeedsBoltAction) == 0x1F5D, "m_bNeedsBoltAction in C_CSWeaponBaseGun should be at offset 0x1F5D");
		static_assert(offsetof(CS2::client::C_CSWeaponBaseGun, m_nRevolverCylinderIdx) == 0x1F60, "m_nRevolverCylinderIdx in C_CSWeaponBaseGun should be at offset 0x1F60");
		static_assert(sizeof(CS2::client::C_CSWeaponBaseGun) == 0x1F70, "C_CSWeaponBaseGun size should be 0x1F70");
	}
}
