// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#ifndef CUSTOM_GLOBAL_TYPES
	#include <SDK/GlobalTypes.hpp>
#else
	#include <Custom/GlobalTypes.hpp>
#endif


#include <SDK/client/C_CSWeaponBase.hpp>



namespace CS2 {
	namespace client {
		class C_CSWeaponBaseGun : public CS2::client::C_CSWeaponBase {
		public:
			int32_t m_zoomLevel; // 0x1f80 | Schema_Builtin | Size: 0x4
			int32_t m_iBurstShotsRemaining; // 0x1f84 | Schema_Builtin | Size: 0x4
			int32_t m_iSilencerBodygroup; // 0x1f88 | Schema_Builtin | Size: 0x4
			S2_PAD(0xc);
			int32_t m_silencedModelIndex; // 0x1f98 | Schema_Builtin | Size: 0x4
			bool m_inPrecache; // 0x1f9c | Schema_Builtin | Size: 0x1
			bool m_bNeedsBoltAction; // 0x1f9d | Schema_Builtin | Size: 0x1
			S2_PAD(0x2);
			int32_t m_nRevolverCylinderIdx; // 0x1fa0 | Schema_Builtin | Size: 0x4
			S2_PAD(0xc); // End padding
		};
		static_assert(offsetof(CS2::client::C_CSWeaponBaseGun, m_zoomLevel) == 0x1F80, "m_zoomLevel in C_CSWeaponBaseGun should be at offset 0x1F80");
		static_assert(offsetof(CS2::client::C_CSWeaponBaseGun, m_iBurstShotsRemaining) == 0x1F84, "m_iBurstShotsRemaining in C_CSWeaponBaseGun should be at offset 0x1F84");
		static_assert(offsetof(CS2::client::C_CSWeaponBaseGun, m_iSilencerBodygroup) == 0x1F88, "m_iSilencerBodygroup in C_CSWeaponBaseGun should be at offset 0x1F88");
		static_assert(offsetof(CS2::client::C_CSWeaponBaseGun, m_silencedModelIndex) == 0x1F98, "m_silencedModelIndex in C_CSWeaponBaseGun should be at offset 0x1F98");
		static_assert(offsetof(CS2::client::C_CSWeaponBaseGun, m_inPrecache) == 0x1F9C, "m_inPrecache in C_CSWeaponBaseGun should be at offset 0x1F9C");
		static_assert(offsetof(CS2::client::C_CSWeaponBaseGun, m_bNeedsBoltAction) == 0x1F9D, "m_bNeedsBoltAction in C_CSWeaponBaseGun should be at offset 0x1F9D");
		static_assert(offsetof(CS2::client::C_CSWeaponBaseGun, m_nRevolverCylinderIdx) == 0x1FA0, "m_nRevolverCylinderIdx in C_CSWeaponBaseGun should be at offset 0x1FA0");
		static_assert(sizeof(CS2::client::C_CSWeaponBaseGun) == 0x1FB0, "C_CSWeaponBaseGun size should be 0x1FB0");
	}
}
