// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#include <SDK/GlobalTypes.hpp>

#include <SDK/client/C_BaseFlex.hpp>
#include <SDK/client/AnimLoopMode_t.hpp>



namespace CS2 {
	namespace client {
		class C_CSGO_PreviewModel : public CS2::client::C_BaseFlex {
		public:
			GlobalTypes::CUtlString m_animgraph; // 0x1380 | Schema_Atomic | Size: 0x8
			GlobalTypes::CGlobalSymbol m_animgraphCharacterModeString; // 0x1388 | Schema_Atomic | Size: 0x8
			GlobalTypes::CUtlString m_defaultAnim; // 0x1390 | Schema_Atomic | Size: 0x8
			client::AnimLoopMode_t m_nDefaultAnimLoopMode; // 0x1398 | Schema_DeclaredEnum | Size: 0x4
			float32 m_flInitialModelScale; // 0x139c | Schema_Builtin | Size: 0x4
			GlobalTypes::CUtlString m_sInitialWeaponState; // 0x13a0 | Schema_Atomic | Size: 0x8
			S2_PAD(0x510); // End padding
		};
		static_assert(offsetof(CS2::client::C_CSGO_PreviewModel, m_animgraph) == 0x1380, "m_animgraph in C_CSGO_PreviewModel should be at offset 0x1380");
		static_assert(offsetof(CS2::client::C_CSGO_PreviewModel, m_animgraphCharacterModeString) == 0x1388, "m_animgraphCharacterModeString in C_CSGO_PreviewModel should be at offset 0x1388");
		static_assert(offsetof(CS2::client::C_CSGO_PreviewModel, m_defaultAnim) == 0x1390, "m_defaultAnim in C_CSGO_PreviewModel should be at offset 0x1390");
		static_assert(offsetof(CS2::client::C_CSGO_PreviewModel, m_nDefaultAnimLoopMode) == 0x1398, "m_nDefaultAnimLoopMode in C_CSGO_PreviewModel should be at offset 0x1398");
		static_assert(offsetof(CS2::client::C_CSGO_PreviewModel, m_flInitialModelScale) == 0x139C, "m_flInitialModelScale in C_CSGO_PreviewModel should be at offset 0x139C");
		static_assert(offsetof(CS2::client::C_CSGO_PreviewModel, m_sInitialWeaponState) == 0x13A0, "m_sInitialWeaponState in C_CSGO_PreviewModel should be at offset 0x13A0");
		static_assert(sizeof(CS2::client::C_CSGO_PreviewModel) == 0x18B8, "C_CSGO_PreviewModel size should be 0x18B8");
	}
}
