// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#include <SDK/GlobalTypes.hpp>

#include <SDK/client/CBaseAnimGraphAnimGraphController.hpp>



namespace CS2 {
	namespace client {
		class C_CSGO_PreviewModel_GraphController : public CS2::client::CBaseAnimGraphAnimGraphController {
		public:
			// GlobalTypes::CAnimGraphParamOptionalRef< char >* m_pszCharacterMode; // 0x268 | Schema_Atomic | Size: 0x28
			char  m_pszCharacterMode[0x28]; // 0x268 | Schema_Atomic | Size: 0x28
			// GlobalTypes::CAnimGraphParamOptionalRef< char >* m_pszWeaponState; // 0x290 | Schema_Atomic | Size: 0x28
			char  m_pszWeaponState[0x28]; // 0x290 | Schema_Atomic | Size: 0x28
			// GlobalTypes::CAnimGraphParamOptionalRef< char >* m_pszWeaponType; // 0x2b8 | Schema_Atomic | Size: 0x28
			char  m_pszWeaponType[0x28]; // 0x2b8 | Schema_Atomic | Size: 0x28
			// GlobalTypes::CAnimGraphParamOptionalRef< char >* m_pszEndOfMatchCelebration; // 0x2e0 | Schema_Atomic | Size: 0x28
			char  m_pszEndOfMatchCelebration[0x28]; // 0x2e0 | Schema_Atomic | Size: 0x28
		};
		static_assert(offsetof(CS2::client::C_CSGO_PreviewModel_GraphController, m_pszCharacterMode) == 0x268, "m_pszCharacterMode in C_CSGO_PreviewModel_GraphController should be at offset 0x268");
		static_assert(offsetof(CS2::client::C_CSGO_PreviewModel_GraphController, m_pszWeaponState) == 0x290, "m_pszWeaponState in C_CSGO_PreviewModel_GraphController should be at offset 0x290");
		static_assert(offsetof(CS2::client::C_CSGO_PreviewModel_GraphController, m_pszWeaponType) == 0x2B8, "m_pszWeaponType in C_CSGO_PreviewModel_GraphController should be at offset 0x2B8");
		static_assert(offsetof(CS2::client::C_CSGO_PreviewModel_GraphController, m_pszEndOfMatchCelebration) == 0x2E0, "m_pszEndOfMatchCelebration in C_CSGO_PreviewModel_GraphController should be at offset 0x2E0");
		static_assert(sizeof(CS2::client::C_CSGO_PreviewModel_GraphController) == 0x308, "C_CSGO_PreviewModel_GraphController size should be 0x308");
	}
}
