// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#ifndef CUSTOM_GLOBAL_TYPES
	#include "../GlobalTypes.hpp"
#else
	#include "../Custom/GlobalTypes.hpp"
#endif


#include "C_CSPlayerPawnBase.hpp"
#include "../entity2/GameTime_t.hpp"
#include "../entity2/GameTick_t.hpp"
#include "loadout_slot_t.hpp"
#include "C_EconItemView.hpp"
#include "EntitySpottedState_t.hpp"
#include "CSPlayerBlockingUseAction_t.hpp"
#include "PredictedDamageTag_t.hpp"
#include "ParticleIndex_t.hpp"
#include "CountdownTimer.hpp"



namespace CS2 {
	namespace client {
		class CCSPlayer_BulletServices;
		class CCSPlayer_HostageServices;
		class CCSPlayer_BuyServices;
		class CCSPlayer_GlowServices;
		class CCSPlayer_ActionTrackingServices;
		class CCSPlayer_DamageReactServices;
		class C_CS2HudModelArms;
		class C_BulletHitModel;
		class C_CSWeaponBase;
	}
}


using namespace GlobalTypes;
namespace CS2 {
	namespace client {
		class C_CSPlayerPawn : public CS2::client::C_CSPlayerPawnBase {
		public:
			S2_PAD(0x10);
			client::CCSPlayer_BulletServices* m_pBulletServices; // 0x1660 | Schema_Ptr | Size: 0x8
			client::CCSPlayer_HostageServices* m_pHostageServices; // 0x1668 | Schema_Ptr | Size: 0x8
			client::CCSPlayer_BuyServices* m_pBuyServices; // 0x1670 | Schema_Ptr | Size: 0x8
			client::CCSPlayer_GlowServices* m_pGlowServices; // 0x1678 | Schema_Ptr | Size: 0x8
			client::CCSPlayer_ActionTrackingServices* m_pActionTrackingServices; // 0x1680 | Schema_Ptr | Size: 0x8
			client::CCSPlayer_DamageReactServices* m_pDamageReactServices; // 0x1688 | Schema_Ptr | Size: 0x8
			entity2::GameTime_t m_flHealthShotBoostExpirationTime; // 0x1690 | Schema_DeclaredClass | Size: 0x4
			entity2::GameTime_t m_flLastFiredWeaponTime; // 0x1694 | Schema_DeclaredClass | Size: 0x4
			bool m_bHasFemaleVoice; // 0x1698 | Schema_Builtin | Size: 0x1
			S2_PAD(0x3);
			float32 m_flLandingTimeSeconds; // 0x169c | Schema_Builtin | Size: 0x4
			float32 m_flOldFallVelocity; // 0x16a0 | Schema_Builtin | Size: 0x4
			char m_szLastPlaceName[18]; // 0x16a4 | Schema_FixedArray | Size: 0x12
			bool m_bPrevDefuser; // 0x16b6 | Schema_Builtin | Size: 0x1
			bool m_bPrevHelmet; // 0x16b7 | Schema_Builtin | Size: 0x1
			int32_t m_nPrevArmorVal; // 0x16b8 | Schema_Builtin | Size: 0x4
			int32_t m_nPrevGrenadeAmmoCount; // 0x16bc | Schema_Builtin | Size: 0x4
			uint32_t m_unPreviousWeaponHash; // 0x16c0 | Schema_Builtin | Size: 0x4
			uint32_t m_unWeaponHash; // 0x16c4 | Schema_Builtin | Size: 0x4
			bool m_bInBuyZone; // 0x16c8 | Schema_Builtin | Size: 0x1
			bool m_bPreviouslyInBuyZone; // 0x16c9 | Schema_Builtin | Size: 0x1
			S2_PAD(0x2);
			GlobalTypes::QAngle m_aimPunchAngle; // 0x16cc | Schema_Atomic | Size: 0xc
			GlobalTypes::QAngle m_aimPunchAngleVel; // 0x16d8 | Schema_Atomic | Size: 0xc
			entity2::GameTick_t m_aimPunchTickBase; // 0x16e4 | Schema_DeclaredClass | Size: 0x4
			float32 m_aimPunchTickFraction; // 0x16e8 | Schema_Builtin | Size: 0x4
			S2_PAD(0x24);
			bool m_bInLanding; // 0x1710 | Schema_Builtin | Size: 0x1
			S2_PAD(0x3);
			float32 m_flLandingStartTime; // 0x1714 | Schema_Builtin | Size: 0x4
			bool m_bInHostageRescueZone; // 0x1718 | Schema_Builtin | Size: 0x1
			bool m_bInBombZone; // 0x1719 | Schema_Builtin | Size: 0x1
			bool m_bIsBuyMenuOpen; // 0x171a | Schema_Builtin | Size: 0x1
			S2_PAD(0x1);
			entity2::GameTime_t m_flTimeOfLastInjury; // 0x171c | Schema_DeclaredClass | Size: 0x4
			entity2::GameTime_t m_flNextSprayDecalTime; // 0x1720 | Schema_DeclaredClass | Size: 0x4
			S2_PAD(0x154);
			int32_t m_iRetakesOffering; // 0x1878 | Schema_Builtin | Size: 0x4
			int32_t m_iRetakesOfferingCard; // 0x187c | Schema_Builtin | Size: 0x4
			bool m_bRetakesHasDefuseKit; // 0x1880 | Schema_Builtin | Size: 0x1
			bool m_bRetakesMVPLastRound; // 0x1881 | Schema_Builtin | Size: 0x1
			S2_PAD(0x2);
			int32_t m_iRetakesMVPBoostItem; // 0x1884 | Schema_Builtin | Size: 0x4
			client::loadout_slot_t m_RetakesMVPBoostExtraUtility; // 0x1888 | Schema_DeclaredEnum | Size: 0x4
			S2_PAD(0x1);
			bool m_bNeedToReApplyGloves; // 0x188d | Schema_Builtin | Size: 0x1
			S2_PAD(0x2);
			client::C_EconItemView m_EconGloves; // 0x1890 | Schema_DeclaredClass | Size: 0x470
			uint8_t m_nEconGlovesChanged; // 0x1d00 | Schema_Builtin | Size: 0x1
			bool m_bMustSyncRagdollState; // 0x1d01 | Schema_Builtin | Size: 0x1
			S2_PAD(0x2);
			int32_t m_nRagdollDamageBone; // 0x1d04 | Schema_Builtin | Size: 0x4
			GlobalTypes::Vector m_vRagdollDamageForce; // 0x1d08 | Schema_Atomic | Size: 0xc
			GlobalTypes::Vector m_vRagdollDamagePosition; // 0x1d14 | Schema_Atomic | Size: 0xc
			char m_szRagdollDamageWeaponName[64]; // 0x1d20 | Schema_FixedArray | Size: 0x40
			bool m_bRagdollDamageHeadshot; // 0x1d60 | Schema_Builtin | Size: 0x1
			S2_PAD(0x3);
			GlobalTypes::Vector m_vRagdollServerOrigin; // 0x1d64 | Schema_Atomic | Size: 0xc
			S2_PAD(0x670);
			entity2::GameTime_t m_lastLandTime; // 0x23e0 | Schema_DeclaredClass | Size: 0x4
			bool m_bOnGroundLastTick; // 0x23e4 | Schema_Builtin | Size: 0x1
			S2_PAD(0x1b);
			GlobalTypes::CHandle<client::C_CS2HudModelArms> m_hHudModelArms; // 0x2400 | Schema_Atomic | Size: 0x4
			// char m_hHudModelArms[0x4]; // 0x2400 | Schema_Atomic | Size: 0x4
			GlobalTypes::QAngle m_qDeathEyeAngles; // 0x2404 | Schema_Atomic | Size: 0xc
			bool m_bSkipOneHeadConstraintUpdate; // 0x2410 | Schema_Builtin | Size: 0x1
			bool m_bLeftHanded; // 0x2411 | Schema_Builtin | Size: 0x1
			S2_PAD(0x2);
			entity2::GameTime_t m_fSwitchedHandednessTime; // 0x2414 | Schema_DeclaredClass | Size: 0x4
			float32 m_flViewmodelOffsetX; // 0x2418 | Schema_Builtin | Size: 0x4
			float32 m_flViewmodelOffsetY; // 0x241c | Schema_Builtin | Size: 0x4
			float32 m_flViewmodelOffsetZ; // 0x2420 | Schema_Builtin | Size: 0x4
			float32 m_flViewmodelFOV; // 0x2424 | Schema_Builtin | Size: 0x4
			uint32_t m_vecPlayerPatchEconIndices[5]; // 0x2428 | Schema_FixedArray | Size: 0x14
			S2_PAD(0x24);
			GlobalTypes::Color m_GunGameImmunityColor; // 0x2460 | Schema_Atomic | Size: 0x4
			S2_PAD(0x4c);
			GlobalTypes::CUtlVector<client::C_BulletHitModel*> m_vecBulletHitModels; // 0x24b0 | Schema_Atomic | Size: 0x18
			// char m_vecBulletHitModels[0x18]; // 0x24b0 | Schema_Atomic | Size: 0x18
			bool m_bIsWalking; // 0x24c8 | Schema_Builtin | Size: 0x1
			S2_PAD(0x7);
			GlobalTypes::QAngle m_thirdPersonHeading; // 0x24d0 | Schema_Atomic | Size: 0xc
			S2_PAD(0x84);
			float32 m_flSlopeDropOffset; // 0x2560 | Schema_Builtin | Size: 0x4
			S2_PAD(0x74);
			float32 m_flSlopeDropHeight; // 0x25d8 | Schema_Builtin | Size: 0x4
			S2_PAD(0x74);
			GlobalTypes::Vector m_vHeadConstraintOffset; // 0x2650 | Schema_Atomic | Size: 0xc
			S2_PAD(0x84);
			client::EntitySpottedState_t m_entitySpottedState; // 0x26e0 | Schema_DeclaredClass | Size: 0x18
			bool m_bIsScoped; // 0x26f8 | Schema_Builtin | Size: 0x1
			bool m_bResumeZoom; // 0x26f9 | Schema_Builtin | Size: 0x1
			bool m_bIsDefusing; // 0x26fa | Schema_Builtin | Size: 0x1
			bool m_bIsGrabbingHostage; // 0x26fb | Schema_Builtin | Size: 0x1
			client::CSPlayerBlockingUseAction_t m_iBlockingUseActionInProgress; // 0x26fc | Schema_DeclaredEnum | Size: 0x4
			entity2::GameTime_t m_flEmitSoundTime; // 0x2700 | Schema_DeclaredClass | Size: 0x4
			bool m_bInNoDefuseArea; // 0x2704 | Schema_Builtin | Size: 0x1
			S2_PAD(0x3);
			int32_t m_nWhichBombZone; // 0x2708 | Schema_Builtin | Size: 0x4
			int32_t m_iShotsFired; // 0x270c | Schema_Builtin | Size: 0x4
			float32 m_flFlinchStack; // 0x2710 | Schema_Builtin | Size: 0x4
			float32 m_flVelocityModifier; // 0x2714 | Schema_Builtin | Size: 0x4
			float32 m_flHitHeading; // 0x2718 | Schema_Builtin | Size: 0x4
			int32_t m_nHitBodyPart; // 0x271c | Schema_Builtin | Size: 0x4
			bool m_bWaitForNoAttack; // 0x2720 | Schema_Builtin | Size: 0x1
			S2_PAD(0x3);
			float32 m_ignoreLadderJumpTime; // 0x2724 | Schema_Builtin | Size: 0x4
			S2_PAD(0x1);
			bool m_bKilledByHeadshot; // 0x2729 | Schema_Builtin | Size: 0x1
			S2_PAD(0x2);
			int32_t m_ArmorValue; // 0x272c | Schema_Builtin | Size: 0x4
			uint16_t m_unCurrentEquipmentValue; // 0x2730 | Schema_Builtin | Size: 0x2
			uint16_t m_unRoundStartEquipmentValue; // 0x2732 | Schema_Builtin | Size: 0x2
			uint16_t m_unFreezetimeEndEquipmentValue; // 0x2734 | Schema_Builtin | Size: 0x2
			S2_PAD(0x2);
			GlobalTypes::CEntityIndex m_nLastKillerIndex; // 0x2738 | Schema_Atomic | Size: 0x4
			bool m_bOldIsScoped; // 0x273c | Schema_Builtin | Size: 0x1
			bool m_bHasDeathInfo; // 0x273d | Schema_Builtin | Size: 0x1
			S2_PAD(0x2);
			float32 m_flDeathInfoTime; // 0x2740 | Schema_Builtin | Size: 0x4
			GlobalTypes::Vector m_vecDeathInfoOrigin; // 0x2744 | Schema_Atomic | Size: 0xc
			S2_PAD(0x4);
			entity2::GameTime_t m_grenadeParameterStashTime; // 0x2754 | Schema_DeclaredClass | Size: 0x4
			bool m_bGrenadeParametersStashed; // 0x2758 | Schema_Builtin | Size: 0x1
			S2_PAD(0x3);
			GlobalTypes::QAngle m_angStashedShootAngles; // 0x275c | Schema_Atomic | Size: 0xc
			GlobalTypes::Vector m_vecStashedGrenadeThrowPosition; // 0x2768 | Schema_Atomic | Size: 0xc
			GlobalTypes::Vector m_vecStashedVelocity; // 0x2774 | Schema_Atomic | Size: 0xc
			GlobalTypes::QAngle m_angShootAngleHistory[2]; // 0x2780 | Schema_FixedArray | Size: 0x18
			GlobalTypes::Vector m_vecThrowPositionHistory[2]; // 0x2798 | Schema_FixedArray | Size: 0x18
			GlobalTypes::Vector m_vecVelocityHistory[2]; // 0x27b0 | Schema_FixedArray | Size: 0x18
			// client::C_UtlVectorEmbeddedNetworkVar<client::PredictedDamageTag_t> m_PredictedDamageTags; // 0x27c8 | Schema_Atomic | Size: 0x68
			char m_PredictedDamageTags[0x68]; // 0x27c8 | Schema_Atomic | Size: 0x68
			entity2::GameTick_t m_nPrevHighestReceivedDamageTagTick; // 0x2830 | Schema_DeclaredClass | Size: 0x4
			int32_t m_nHighestAppliedDamageTagTick; // 0x2834 | Schema_Builtin | Size: 0x4
			S2_PAD(0x1534);
			bool m_bShouldAutobuyDMWeapons; // 0x3d6c | Schema_Builtin | Size: 0x1
			S2_PAD(0x3);
			entity2::GameTime_t m_fImmuneToGunGameDamageTime; // 0x3d70 | Schema_DeclaredClass | Size: 0x4
			bool m_bGunGameImmunity; // 0x3d74 | Schema_Builtin | Size: 0x1
			S2_PAD(0x3);
			entity2::GameTime_t m_fImmuneToGunGameDamageTimeLast; // 0x3d78 | Schema_DeclaredClass | Size: 0x4
			float32 m_fMolotovDamageTime; // 0x3d7c | Schema_Builtin | Size: 0x4
			S2_PAD(0x4);
			GlobalTypes::Vector m_vecLastAliveLocalVelocity; // 0x3d84 | Schema_Atomic | Size: 0xc
			float32 m_fRenderingClipPlane[4]; // 0x3d90 | Schema_FixedArray | Size: 0x10
			int32_t m_nLastClipPlaneSetupFrame; // 0x3da0 | Schema_Builtin | Size: 0x4
			GlobalTypes::Vector m_vecLastClipCameraPos; // 0x3da4 | Schema_Atomic | Size: 0xc
			GlobalTypes::Vector m_vecLastClipCameraForward; // 0x3db0 | Schema_Atomic | Size: 0xc
			bool m_bClipHitStaticWorld; // 0x3dbc | Schema_Builtin | Size: 0x1
			bool m_bCachedPlaneIsValid; // 0x3dbd | Schema_Builtin | Size: 0x1
			S2_PAD(0x2);
			client::C_CSWeaponBase* m_pClippingWeapon; // 0x3dc0 | Schema_Ptr | Size: 0x8
			client::ParticleIndex_t m_nPlayerInfernoBodyFx; // 0x3dc8 | Schema_DeclaredClass | Size: 0x4
			S2_PAD(0x4);
			GlobalTypes::QAngle m_angEyeAngles; // 0x3dd0 | Schema_Atomic | Size: 0xc
			S2_PAD(0x84);
			entity2::GameTime_t m_arrOldEyeAnglesTimes[4]; // 0x3e60 | Schema_FixedArray | Size: 0x10
			GlobalTypes::QAngle m_arrOldEyeAngles[4]; // 0x3e70 | Schema_FixedArray | Size: 0x30
			GlobalTypes::QAngle m_angEyeAnglesVelocity; // 0x3ea0 | Schema_Atomic | Size: 0xc
			GlobalTypes::CEntityIndex m_iIDEntIndex; // 0x3eac | Schema_Atomic | Size: 0x4
			client::CountdownTimer m_delayTargetIDTimer; // 0x3eb0 | Schema_DeclaredClass | Size: 0x18
			GlobalTypes::CEntityIndex m_iTargetItemEntIdx; // 0x3ec8 | Schema_Atomic | Size: 0x4
			GlobalTypes::CEntityIndex m_iOldIDEntIndex; // 0x3ecc | Schema_Atomic | Size: 0x4
			client::CountdownTimer m_holdTargetIDTimer; // 0x3ed0 | Schema_DeclaredClass | Size: 0x18
			S2_PAD(0x8); // End padding
		};
#ifdef USE_STATIC_ASSERTS
		static_assert(offsetof(CS2::client::C_CSPlayerPawn, m_pBulletServices) == 0x1660, "m_pBulletServices in C_CSPlayerPawn should be at offset 0x1660");
		static_assert(offsetof(CS2::client::C_CSPlayerPawn, m_pHostageServices) == 0x1668, "m_pHostageServices in C_CSPlayerPawn should be at offset 0x1668");
		static_assert(offsetof(CS2::client::C_CSPlayerPawn, m_pBuyServices) == 0x1670, "m_pBuyServices in C_CSPlayerPawn should be at offset 0x1670");
		static_assert(offsetof(CS2::client::C_CSPlayerPawn, m_pGlowServices) == 0x1678, "m_pGlowServices in C_CSPlayerPawn should be at offset 0x1678");
		static_assert(offsetof(CS2::client::C_CSPlayerPawn, m_pActionTrackingServices) == 0x1680, "m_pActionTrackingServices in C_CSPlayerPawn should be at offset 0x1680");
