// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#include <SDK/GlobalTypes.hpp>

#include <SDK/client/C_BaseModelEntity.hpp>



namespace CS2 {
	namespace client {
		class C_DynamicLight : public CS2::client::C_BaseModelEntity {
		public:
			public:
			uint8_t m_Flags; // 0xec0 | Schema_Builtin | Size: 0x1
			uint8_t m_LightStyle; // 0xec1 | Schema_Builtin | Size: 0x1
			S2_PAD(0x2);
			float32 m_Radius; // 0xec4 | Schema_Builtin | Size: 0x4
			int32_t m_Exponent; // 0xec8 | Schema_Builtin | Size: 0x4
			float32 m_InnerAngle; // 0xecc | Schema_Builtin | Size: 0x4
			float32 m_OuterAngle; // 0xed0 | Schema_Builtin | Size: 0x4
			float32 m_SpotRadius; // 0xed4 | Schema_Builtin | Size: 0x4
			S2_PAD(0x10); // End padding
		};
		static_assert(offsetof(CS2::client::C_DynamicLight, m_Flags) == 0xEC0, "m_Flags in C_DynamicLight should be at offset 0xEC0");
		static_assert(offsetof(CS2::client::C_DynamicLight, m_LightStyle) == 0xEC1, "m_LightStyle in C_DynamicLight should be at offset 0xEC1");
		static_assert(offsetof(CS2::client::C_DynamicLight, m_Radius) == 0xEC4, "m_Radius in C_DynamicLight should be at offset 0xEC4");
		static_assert(offsetof(CS2::client::C_DynamicLight, m_Exponent) == 0xEC8, "m_Exponent in C_DynamicLight should be at offset 0xEC8");
		static_assert(offsetof(CS2::client::C_DynamicLight, m_InnerAngle) == 0xECC, "m_InnerAngle in C_DynamicLight should be at offset 0xECC");
		static_assert(offsetof(CS2::client::C_DynamicLight, m_OuterAngle) == 0xED0, "m_OuterAngle in C_DynamicLight should be at offset 0xED0");
		static_assert(offsetof(CS2::client::C_DynamicLight, m_SpotRadius) == 0xED4, "m_SpotRadius in C_DynamicLight should be at offset 0xED4");
		static_assert(sizeof(CS2::client::C_DynamicLight) == 0xEE8, "C_DynamicLight size should be 0xEE8");
	}
}
