// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#ifndef CUSTOM_GLOBAL_TYPES
	#include <SDK/GlobalTypes.hpp>
#else
	#include <Custom/GlobalTypes.hpp>
#endif


#include <SDK/client/C_BaseModelEntity.hpp>





using namespace GlobalTypes;
namespace CS2 {
	namespace client {
		class C_DynamicLight : public CS2::client::C_BaseModelEntity {
		public:
			uint8_t m_Flags; // 0xe88 | Schema_Builtin | Size: 0x1
			uint8_t m_LightStyle; // 0xe89 | Schema_Builtin | Size: 0x1
			S2_PAD(0x2);
			float32 m_Radius; // 0xe8c | Schema_Builtin | Size: 0x4
			int32_t m_Exponent; // 0xe90 | Schema_Builtin | Size: 0x4
			float32 m_InnerAngle; // 0xe94 | Schema_Builtin | Size: 0x4
			float32 m_OuterAngle; // 0xe98 | Schema_Builtin | Size: 0x4
			float32 m_SpotRadius; // 0xe9c | Schema_Builtin | Size: 0x4
			S2_PAD(0x10); // End padding
		};
		static_assert(offsetof(CS2::client::C_DynamicLight, m_Flags) == 0xE88, "m_Flags in C_DynamicLight should be at offset 0xE88");
		static_assert(offsetof(CS2::client::C_DynamicLight, m_LightStyle) == 0xE89, "m_LightStyle in C_DynamicLight should be at offset 0xE89");
		static_assert(offsetof(CS2::client::C_DynamicLight, m_Radius) == 0xE8C, "m_Radius in C_DynamicLight should be at offset 0xE8C");
		static_assert(offsetof(CS2::client::C_DynamicLight, m_Exponent) == 0xE90, "m_Exponent in C_DynamicLight should be at offset 0xE90");
		static_assert(offsetof(CS2::client::C_DynamicLight, m_InnerAngle) == 0xE94, "m_InnerAngle in C_DynamicLight should be at offset 0xE94");
		static_assert(offsetof(CS2::client::C_DynamicLight, m_OuterAngle) == 0xE98, "m_OuterAngle in C_DynamicLight should be at offset 0xE98");
		static_assert(offsetof(CS2::client::C_DynamicLight, m_SpotRadius) == 0xE9C, "m_SpotRadius in C_DynamicLight should be at offset 0xE9C");
		static_assert(sizeof(CS2::client::C_DynamicLight) == 0xEB0, "C_DynamicLight size should be 0xEB0");
	}
}
