// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#include <SDK/GlobalTypes.hpp>

#include <SDK/client/IEconItemInterface.hpp>
#include <SDK/client/CAttributeList.hpp>



namespace CS2 {
	namespace client {
		class C_EconItemView : public CS2::client::IEconItemInterface {
		public:
			S2_PAD(0x58);
			bool m_bInventoryImageRgbaRequested; // 0x60 | Schema_Builtin | Size: 0x1
			bool m_bInventoryImageTriedCache; // 0x61 | Schema_Builtin | Size: 0x1
			S2_PAD(0x1e);
			int32_t m_nInventoryImageRgbaWidth; // 0x80 | Schema_Builtin | Size: 0x4
			int32_t m_nInventoryImageRgbaHeight; // 0x84 | Schema_Builtin | Size: 0x4
			char m_szCurrentLoadCachedFileName[260]; // 0x88 | Schema_FixedArray | Size: 0x104
			S2_PAD(0x2c);
			bool m_bRestoreCustomMaterialAfterPrecache; // 0x1b8 | Schema_Builtin | Size: 0x1
			S2_PAD(0x1);
			uint16_t m_iItemDefinitionIndex; // 0x1ba | Schema_Builtin | Size: 0x2
			int32_t m_iEntityQuality; // 0x1bc | Schema_Builtin | Size: 0x4
			uint32_t m_iEntityLevel; // 0x1c0 | Schema_Builtin | Size: 0x4
			S2_PAD(0x4);
			uint64_t m_iItemID; // 0x1c8 | Schema_Builtin | Size: 0x8
			uint32_t m_iItemIDHigh; // 0x1d0 | Schema_Builtin | Size: 0x4
			uint32_t m_iItemIDLow; // 0x1d4 | Schema_Builtin | Size: 0x4
			uint32_t m_iAccountID; // 0x1d8 | Schema_Builtin | Size: 0x4
			uint32_t m_iInventoryPosition; // 0x1dc | Schema_Builtin | Size: 0x4
			S2_PAD(0x8);
			bool m_bInitialized; // 0x1e8 | Schema_Builtin | Size: 0x1
			bool m_bDisallowSOC; // 0x1e9 | Schema_Builtin | Size: 0x1
			bool m_bIsStoreItem; // 0x1ea | Schema_Builtin | Size: 0x1
			bool m_bIsTradeItem; // 0x1eb | Schema_Builtin | Size: 0x1
			int32_t m_iEntityQuantity; // 0x1ec | Schema_Builtin | Size: 0x4
			int32_t m_iRarityOverride; // 0x1f0 | Schema_Builtin | Size: 0x4
			int32_t m_iQualityOverride; // 0x1f4 | Schema_Builtin | Size: 0x4
			int32_t m_iOriginOverride; // 0x1f8 | Schema_Builtin | Size: 0x4
			uint8_t m_ubStyleOverride; // 0x1fc | Schema_Builtin | Size: 0x1
			uint8_t m_unClientFlags; // 0x1fd | Schema_Builtin | Size: 0x1
			S2_PAD(0x12);
			client::CAttributeList m_AttributeList; // 0x210 | Schema_DeclaredClass | Size: 0x78
			client::CAttributeList m_NetworkedDynamicAttributes; // 0x288 | Schema_DeclaredClass | Size: 0x78
			char m_szCustomName[161]; // 0x300 | Schema_FixedArray | Size: 0xa1
			char m_szCustomNameOverride[161]; // 0x3a1 | Schema_FixedArray | Size: 0xa1
			S2_PAD(0x2e);
			bool m_bInitializedTags; // 0x470 | Schema_Builtin | Size: 0x1
			S2_PAD(0x7); // End padding
		};
		static_assert(offsetof(CS2::client::C_EconItemView, m_bInventoryImageRgbaRequested) == 0x60, "m_bInventoryImageRgbaRequested in C_EconItemView should be at offset 0x60");
		static_assert(offsetof(CS2::client::C_EconItemView, m_bInventoryImageTriedCache) == 0x61, "m_bInventoryImageTriedCache in C_EconItemView should be at offset 0x61");
		static_assert(offsetof(CS2::client::C_EconItemView, m_nInventoryImageRgbaWidth) == 0x80, "m_nInventoryImageRgbaWidth in C_EconItemView should be at offset 0x80");
		static_assert(offsetof(CS2::client::C_EconItemView, m_nInventoryImageRgbaHeight) == 0x84, "m_nInventoryImageRgbaHeight in C_EconItemView should be at offset 0x84");
		static_assert(offsetof(CS2::client::C_EconItemView, m_szCurrentLoadCachedFileName) == 0x88, "m_szCurrentLoadCachedFileName in C_EconItemView should be at offset 0x88");
		static_assert(offsetof(CS2::client::C_EconItemView, m_bRestoreCustomMaterialAfterPrecache) == 0x1B8, "m_bRestoreCustomMaterialAfterPrecache in C_EconItemView should be at offset 0x1B8");
		static_assert(offsetof(CS2::client::C_EconItemView, m_iItemDefinitionIndex) == 0x1BA, "m_iItemDefinitionIndex in C_EconItemView should be at offset 0x1BA");
		static_assert(offsetof(CS2::client::C_EconItemView, m_iEntityQuality) == 0x1BC, "m_iEntityQuality in C_EconItemView should be at offset 0x1BC");
		static_assert(offsetof(CS2::client::C_EconItemView, m_iEntityLevel) == 0x1C0, "m_iEntityLevel in C_EconItemView should be at offset 0x1C0");
		static_assert(offsetof(CS2::client::C_EconItemView, m_iItemID) == 0x1C8, "m_iItemID in C_EconItemView should be at offset 0x1C8");
		static_assert(offsetof(CS2::client::C_EconItemView, m_iItemIDHigh) == 0x1D0, "m_iItemIDHigh in C_EconItemView should be at offset 0x1D0");
		static_assert(offsetof(CS2::client::C_EconItemView, m_iItemIDLow) == 0x1D4, "m_iItemIDLow in C_EconItemView should be at offset 0x1D4");
		static_assert(offsetof(CS2::client::C_EconItemView, m_iAccountID) == 0x1D8, "m_iAccountID in C_EconItemView should be at offset 0x1D8");
		static_assert(offsetof(CS2::client::C_EconItemView, m_iInventoryPosition) == 0x1DC, "m_iInventoryPosition in C_EconItemView should be at offset 0x1DC");
		static_assert(offsetof(CS2::client::C_EconItemView, m_bInitialized) == 0x1E8, "m_bInitialized in C_EconItemView should be at offset 0x1E8");
		static_assert(offsetof(CS2::client::C_EconItemView, m_bDisallowSOC) == 0x1E9, "m_bDisallowSOC in C_EconItemView should be at offset 0x1E9");
		static_assert(offsetof(CS2::client::C_EconItemView, m_bIsStoreItem) == 0x1EA, "m_bIsStoreItem in C_EconItemView should be at offset 0x1EA");
		static_assert(offsetof(CS2::client::C_EconItemView, m_bIsTradeItem) == 0x1EB, "m_bIsTradeItem in C_EconItemView should be at offset 0x1EB");
		static_assert(offsetof(CS2::client::C_EconItemView, m_iEntityQuantity) == 0x1EC, "m_iEntityQuantity in C_EconItemView should be at offset 0x1EC");
		static_assert(offsetof(CS2::client::C_EconItemView, m_iRarityOverride) == 0x1F0, "m_iRarityOverride in C_EconItemView should be at offset 0x1F0");
		static_assert(offsetof(CS2::client::C_EconItemView, m_iQualityOverride) == 0x1F4, "m_iQualityOverride in C_EconItemView should be at offset 0x1F4");
		static_assert(offsetof(CS2::client::C_EconItemView, m_iOriginOverride) == 0x1F8, "m_iOriginOverride in C_EconItemView should be at offset 0x1F8");
		static_assert(offsetof(CS2::client::C_EconItemView, m_ubStyleOverride) == 0x1FC, "m_ubStyleOverride in C_EconItemView should be at offset 0x1FC");
		static_assert(offsetof(CS2::client::C_EconItemView, m_unClientFlags) == 0x1FD, "m_unClientFlags in C_EconItemView should be at offset 0x1FD");
		static_assert(offsetof(CS2::client::C_EconItemView, m_AttributeList) == 0x210, "m_AttributeList in C_EconItemView should be at offset 0x210");
		static_assert(offsetof(CS2::client::C_EconItemView, m_NetworkedDynamicAttributes) == 0x288, "m_NetworkedDynamicAttributes in C_EconItemView should be at offset 0x288");
		static_assert(offsetof(CS2::client::C_EconItemView, m_szCustomName) == 0x300, "m_szCustomName in C_EconItemView should be at offset 0x300");
		static_assert(offsetof(CS2::client::C_EconItemView, m_szCustomNameOverride) == 0x3A1, "m_szCustomNameOverride in C_EconItemView should be at offset 0x3A1");
		static_assert(offsetof(CS2::client::C_EconItemView, m_bInitializedTags) == 0x470, "m_bInitializedTags in C_EconItemView should be at offset 0x470");
		static_assert(sizeof(CS2::client::C_EconItemView) == 0x478, "C_EconItemView size should be 0x478");
	}
}
