// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#include <SDK/GlobalTypes.hpp>

#include <SDK/client/C_BaseFlex.hpp>
#include <SDK/client/C_AttributeContainer.hpp>



namespace CS2 {
	namespace client {
		class C_EconEntity : public CS2::client::C_BaseFlex {
		public:
			S2_PAD(0x10);
			float32 m_flFlexDelayTime; // 0x1390 | Schema_Builtin | Size: 0x4
			S2_PAD(0x4);
			float32* m_flFlexDelayedWeight; // 0x1398 | Schema_Ptr | Size: 0x8
			bool m_bAttributesInitialized; // 0x13a0 | Schema_Builtin | Size: 0x1
			S2_PAD(0x7);
			client::C_AttributeContainer m_AttributeManager; // 0x13a8 | Schema_DeclaredClass | Size: 0x4d8
			uint32_t m_OriginalOwnerXuidLow; // 0x1880 | Schema_Builtin | Size: 0x4
			uint32_t m_OriginalOwnerXuidHigh; // 0x1884 | Schema_Builtin | Size: 0x4
			int32_t m_nFallbackPaintKit; // 0x1888 | Schema_Builtin | Size: 0x4
			int32_t m_nFallbackSeed; // 0x188c | Schema_Builtin | Size: 0x4
			float32 m_flFallbackWear; // 0x1890 | Schema_Builtin | Size: 0x4
			int32_t m_nFallbackStatTrak; // 0x1894 | Schema_Builtin | Size: 0x4
			bool m_bClientside; // 0x1898 | Schema_Builtin | Size: 0x1
			bool m_bParticleSystemsCreated; // 0x1899 | Schema_Builtin | Size: 0x1
			S2_PAD(0x6);
			// GlobalTypes::CUtlVector< int32 > m_vecAttachedParticles; // 0x18a0 | Schema_Atomic | Size: 0x18
			char  m_vecAttachedParticles[0x18]; // 0x18a0 | Schema_Atomic | Size: 0x18
			// client::CHandle< client::CBaseAnimGraph > m_hViewmodelAttachment; // 0x18b8 | Schema_Atomic | Size: 0x4
			char  m_hViewmodelAttachment[0x4]; // 0x18b8 | Schema_Atomic | Size: 0x4
			int32_t m_iOldTeam; // 0x18bc | Schema_Builtin | Size: 0x4
			bool m_bAttachmentDirty; // 0x18c0 | Schema_Builtin | Size: 0x1
			S2_PAD(0x3);
			int32_t m_nUnloadedModelIndex; // 0x18c4 | Schema_Builtin | Size: 0x4
			int32_t m_iNumOwnerValidationRetries; // 0x18c8 | Schema_Builtin | Size: 0x4
			S2_PAD(0xc);
			// client::CHandle< client::C_BaseEntity > m_hOldProvidee; // 0x18d8 | Schema_Atomic | Size: 0x4
			char  m_hOldProvidee[0x4]; // 0x18d8 | Schema_Atomic | Size: 0x4
			S2_PAD(0x4);
			// client::AttachedModelData_t > m_vecAttachedModels; // 0x18e0 | Schema_Atomic | Size: 0x18
			char  m_vecAttachedModels[0x18]; // 0x18e0 | Schema_Atomic | Size: 0x18
		};
		static_assert(offsetof(CS2::client::C_EconEntity, m_flFlexDelayTime) == 0x1390, "m_flFlexDelayTime in C_EconEntity should be at offset 0x1390");
		static_assert(offsetof(CS2::client::C_EconEntity, m_flFlexDelayedWeight) == 0x1398, "m_flFlexDelayedWeight in C_EconEntity should be at offset 0x1398");
		static_assert(offsetof(CS2::client::C_EconEntity, m_bAttributesInitialized) == 0x13A0, "m_bAttributesInitialized in C_EconEntity should be at offset 0x13A0");
		static_assert(offsetof(CS2::client::C_EconEntity, m_AttributeManager) == 0x13A8, "m_AttributeManager in C_EconEntity should be at offset 0x13A8");
		static_assert(offsetof(CS2::client::C_EconEntity, m_OriginalOwnerXuidLow) == 0x1880, "m_OriginalOwnerXuidLow in C_EconEntity should be at offset 0x1880");
		static_assert(offsetof(CS2::client::C_EconEntity, m_OriginalOwnerXuidHigh) == 0x1884, "m_OriginalOwnerXuidHigh in C_EconEntity should be at offset 0x1884");
		static_assert(offsetof(CS2::client::C_EconEntity, m_nFallbackPaintKit) == 0x1888, "m_nFallbackPaintKit in C_EconEntity should be at offset 0x1888");
		static_assert(offsetof(CS2::client::C_EconEntity, m_nFallbackSeed) == 0x188C, "m_nFallbackSeed in C_EconEntity should be at offset 0x188C");
		static_assert(offsetof(CS2::client::C_EconEntity, m_flFallbackWear) == 0x1890, "m_flFallbackWear in C_EconEntity should be at offset 0x1890");
		static_assert(offsetof(CS2::client::C_EconEntity, m_nFallbackStatTrak) == 0x1894, "m_nFallbackStatTrak in C_EconEntity should be at offset 0x1894");
		static_assert(offsetof(CS2::client::C_EconEntity, m_bClientside) == 0x1898, "m_bClientside in C_EconEntity should be at offset 0x1898");
		static_assert(offsetof(CS2::client::C_EconEntity, m_bParticleSystemsCreated) == 0x1899, "m_bParticleSystemsCreated in C_EconEntity should be at offset 0x1899");
		static_assert(offsetof(CS2::client::C_EconEntity, m_vecAttachedParticles) == 0x18A0, "m_vecAttachedParticles in C_EconEntity should be at offset 0x18A0");
		static_assert(offsetof(CS2::client::C_EconEntity, m_hViewmodelAttachment) == 0x18B8, "m_hViewmodelAttachment in C_EconEntity should be at offset 0x18B8");
		static_assert(offsetof(CS2::client::C_EconEntity, m_iOldTeam) == 0x18BC, "m_iOldTeam in C_EconEntity should be at offset 0x18BC");
		static_assert(offsetof(CS2::client::C_EconEntity, m_bAttachmentDirty) == 0x18C0, "m_bAttachmentDirty in C_EconEntity should be at offset 0x18C0");
		static_assert(offsetof(CS2::client::C_EconEntity, m_nUnloadedModelIndex) == 0x18C4, "m_nUnloadedModelIndex in C_EconEntity should be at offset 0x18C4");
		static_assert(offsetof(CS2::client::C_EconEntity, m_iNumOwnerValidationRetries) == 0x18C8, "m_iNumOwnerValidationRetries in C_EconEntity should be at offset 0x18C8");
		static_assert(offsetof(CS2::client::C_EconEntity, m_hOldProvidee) == 0x18D8, "m_hOldProvidee in C_EconEntity should be at offset 0x18D8");
		static_assert(offsetof(CS2::client::C_EconEntity, m_vecAttachedModels) == 0x18E0, "m_vecAttachedModels in C_EconEntity should be at offset 0x18E0");
		static_assert(sizeof(CS2::client::C_EconEntity) == 0x18F8, "C_EconEntity size should be 0x18F8");
	}
}
