// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#ifndef CUSTOM_GLOBAL_TYPES
	#include "../GlobalTypes.hpp"
#else
	#include "../Custom/GlobalTypes.hpp"
#endif


#include "C_BaseModelEntity.hpp"
#include "../entity2/GameTime_t.hpp"
#include "EntityDisolveType_t.hpp"





using namespace GlobalTypes;
namespace CS2 {
	namespace client {
		class C_EntityDissolve : public CS2::client::C_BaseModelEntity {
		public:
			S2_PAD(0x8);
			entity2::GameTime_t m_flStartTime; // 0xe90 | Schema_DeclaredClass | Size: 0x4
			float32 m_flFadeInStart; // 0xe94 | Schema_Builtin | Size: 0x4
			float32 m_flFadeInLength; // 0xe98 | Schema_Builtin | Size: 0x4
			float32 m_flFadeOutModelStart; // 0xe9c | Schema_Builtin | Size: 0x4
			float32 m_flFadeOutModelLength; // 0xea0 | Schema_Builtin | Size: 0x4
			float32 m_flFadeOutStart; // 0xea4 | Schema_Builtin | Size: 0x4
			float32 m_flFadeOutLength; // 0xea8 | Schema_Builtin | Size: 0x4
			entity2::GameTime_t m_flNextSparkTime; // 0xeac | Schema_DeclaredClass | Size: 0x4
			client::EntityDisolveType_t m_nDissolveType; // 0xeb0 | Schema_DeclaredEnum | Size: 0x4
			GlobalTypes::Vector m_vDissolverOrigin; // 0xeb4 | Schema_Atomic | Size: 0xc
			uint32_t m_nMagnitude; // 0xec0 | Schema_Builtin | Size: 0x4
			bool m_bCoreExplode; // 0xec4 | Schema_Builtin | Size: 0x1
			bool m_bLinkedToServerEnt; // 0xec5 | Schema_Builtin | Size: 0x1
			S2_PAD(0xa); // End padding
		};
		static_assert(offsetof(CS2::client::C_EntityDissolve, m_flStartTime) == 0xE90, "m_flStartTime in C_EntityDissolve should be at offset 0xE90");
		static_assert(offsetof(CS2::client::C_EntityDissolve, m_flFadeInStart) == 0xE94, "m_flFadeInStart in C_EntityDissolve should be at offset 0xE94");
		static_assert(offsetof(CS2::client::C_EntityDissolve, m_flFadeInLength) == 0xE98, "m_flFadeInLength in C_EntityDissolve should be at offset 0xE98");
		static_assert(offsetof(CS2::client::C_EntityDissolve, m_flFadeOutModelStart) == 0xE9C, "m_flFadeOutModelStart in C_EntityDissolve should be at offset 0xE9C");
		static_assert(offsetof(CS2::client::C_EntityDissolve, m_flFadeOutModelLength) == 0xEA0, "m_flFadeOutModelLength in C_EntityDissolve should be at offset 0xEA0");
		static_assert(offsetof(CS2::client::C_EntityDissolve, m_flFadeOutStart) == 0xEA4, "m_flFadeOutStart in C_EntityDissolve should be at offset 0xEA4");
		static_assert(offsetof(CS2::client::C_EntityDissolve, m_flFadeOutLength) == 0xEA8, "m_flFadeOutLength in C_EntityDissolve should be at offset 0xEA8");
		static_assert(offsetof(CS2::client::C_EntityDissolve, m_flNextSparkTime) == 0xEAC, "m_flNextSparkTime in C_EntityDissolve should be at offset 0xEAC");
		static_assert(offsetof(CS2::client::C_EntityDissolve, m_nDissolveType) == 0xEB0, "m_nDissolveType in C_EntityDissolve should be at offset 0xEB0");
		static_assert(offsetof(CS2::client::C_EntityDissolve, m_vDissolverOrigin) == 0xEB4, "m_vDissolverOrigin in C_EntityDissolve should be at offset 0xEB4");
		static_assert(offsetof(CS2::client::C_EntityDissolve, m_nMagnitude) == 0xEC0, "m_nMagnitude in C_EntityDissolve should be at offset 0xEC0");
		static_assert(offsetof(CS2::client::C_EntityDissolve, m_bCoreExplode) == 0xEC4, "m_bCoreExplode in C_EntityDissolve should be at offset 0xEC4");
		static_assert(offsetof(CS2::client::C_EntityDissolve, m_bLinkedToServerEnt) == 0xEC5, "m_bLinkedToServerEnt in C_EntityDissolve should be at offset 0xEC5");
		static_assert(sizeof(CS2::client::C_EntityDissolve) == 0xED0, "C_EntityDissolve size should be 0xED0");
	}
}
