// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#include <SDK/GlobalTypes.hpp>

#include <SDK/client/C_ParticleSystem.hpp>



namespace CS2 {
	namespace client {
		class C_EnvParticleGlow : public CS2::client::C_ParticleSystem {
		public:
			float32 m_flAlphaScale; // 0x1478 | Schema_Builtin | Size: 0x4
			float32 m_flRadiusScale; // 0x147c | Schema_Builtin | Size: 0x4
			float32 m_flSelfIllumScale; // 0x1480 | Schema_Builtin | Size: 0x4
			GlobalTypes::Color m_ColorTint; // 0x1484 | Schema_Atomic | Size: 0x4
			// GlobalTypes::CStrongHandle< resourcesystem::InfoForResourceTypeCTextureBase > m_hTextureOverride; // 0x1488 | Schema_Atomic | Size: 0x8
			char  m_hTextureOverride[0x8]; // 0x1488 | Schema_Atomic | Size: 0x8
		};
		static_assert(offsetof(CS2::client::C_EnvParticleGlow, m_flAlphaScale) == 0x1478, "m_flAlphaScale in C_EnvParticleGlow should be at offset 0x1478");
		static_assert(offsetof(CS2::client::C_EnvParticleGlow, m_flRadiusScale) == 0x147C, "m_flRadiusScale in C_EnvParticleGlow should be at offset 0x147C");
		static_assert(offsetof(CS2::client::C_EnvParticleGlow, m_flSelfIllumScale) == 0x1480, "m_flSelfIllumScale in C_EnvParticleGlow should be at offset 0x1480");
		static_assert(offsetof(CS2::client::C_EnvParticleGlow, m_ColorTint) == 0x1484, "m_ColorTint in C_EnvParticleGlow should be at offset 0x1484");
		static_assert(offsetof(CS2::client::C_EnvParticleGlow, m_hTextureOverride) == 0x1488, "m_hTextureOverride in C_EnvParticleGlow should be at offset 0x1488");
		static_assert(sizeof(CS2::client::C_EnvParticleGlow) == 0x1490, "C_EnvParticleGlow size should be 0x1490");
	}
}
