// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#ifndef CUSTOM_GLOBAL_TYPES
	#include <SDK/GlobalTypes.hpp>
#else
	#include <Custom/GlobalTypes.hpp>
#endif


#include <SDK/client/C_BaseEntity.hpp>





using namespace GlobalTypes;
namespace CS2 {
	namespace client {
		class C_EnvCombinedLightProbeVolume : public CS2::client::C_BaseEntity {
		public:
			S2_PAD(0x1078);
			GlobalTypes::Color m_Entity_Color; // 0x1680 | Schema_Atomic | Size: 0x4
			float32 m_Entity_flBrightness; // 0x1684 | Schema_Builtin | Size: 0x4
			// GlobalTypes::CStrongHandle<resourcesystem::InfoForResourceTypeCTextureBase> m_Entity_hCubemapTexture; // 0x1688 | Schema_Atomic | Size: 0x8
			char m_Entity_hCubemapTexture[0x8]; // 0x1688 | Schema_Atomic | Size: 0x8
			bool m_Entity_bCustomCubemapTexture; // 0x1690 | Schema_Builtin | Size: 0x1
			S2_PAD(0x7);
			// GlobalTypes::CStrongHandle<resourcesystem::InfoForResourceTypeCTextureBase> m_Entity_hLightProbeTexture_AmbientCube; // 0x1698 | Schema_Atomic | Size: 0x8
			char m_Entity_hLightProbeTexture_AmbientCube[0x8]; // 0x1698 | Schema_Atomic | Size: 0x8
			// GlobalTypes::CStrongHandle<resourcesystem::InfoForResourceTypeCTextureBase> m_Entity_hLightProbeTexture_SDF; // 0x16a0 | Schema_Atomic | Size: 0x8
			char m_Entity_hLightProbeTexture_SDF[0x8]; // 0x16a0 | Schema_Atomic | Size: 0x8
			// GlobalTypes::CStrongHandle<resourcesystem::InfoForResourceTypeCTextureBase> m_Entity_hLightProbeTexture_SH2_DC; // 0x16a8 | Schema_Atomic | Size: 0x8
			char m_Entity_hLightProbeTexture_SH2_DC[0x8]; // 0x16a8 | Schema_Atomic | Size: 0x8
			// GlobalTypes::CStrongHandle<resourcesystem::InfoForResourceTypeCTextureBase> m_Entity_hLightProbeTexture_SH2_R; // 0x16b0 | Schema_Atomic | Size: 0x8
			char m_Entity_hLightProbeTexture_SH2_R[0x8]; // 0x16b0 | Schema_Atomic | Size: 0x8
			// GlobalTypes::CStrongHandle<resourcesystem::InfoForResourceTypeCTextureBase> m_Entity_hLightProbeTexture_SH2_G; // 0x16b8 | Schema_Atomic | Size: 0x8
			char m_Entity_hLightProbeTexture_SH2_G[0x8]; // 0x16b8 | Schema_Atomic | Size: 0x8
			// GlobalTypes::CStrongHandle<resourcesystem::InfoForResourceTypeCTextureBase> m_Entity_hLightProbeTexture_SH2_B; // 0x16c0 | Schema_Atomic | Size: 0x8
			char m_Entity_hLightProbeTexture_SH2_B[0x8]; // 0x16c0 | Schema_Atomic | Size: 0x8
			// GlobalTypes::CStrongHandle<resourcesystem::InfoForResourceTypeCTextureBase> m_Entity_hLightProbeDirectLightIndicesTexture; // 0x16c8 | Schema_Atomic | Size: 0x8
			char m_Entity_hLightProbeDirectLightIndicesTexture[0x8]; // 0x16c8 | Schema_Atomic | Size: 0x8
			// GlobalTypes::CStrongHandle<resourcesystem::InfoForResourceTypeCTextureBase> m_Entity_hLightProbeDirectLightScalarsTexture; // 0x16d0 | Schema_Atomic | Size: 0x8
			char m_Entity_hLightProbeDirectLightScalarsTexture[0x8]; // 0x16d0 | Schema_Atomic | Size: 0x8
			// GlobalTypes::CStrongHandle<resourcesystem::InfoForResourceTypeCTextureBase> m_Entity_hLightProbeDirectLightShadowsTexture; // 0x16d8 | Schema_Atomic | Size: 0x8
			char m_Entity_hLightProbeDirectLightShadowsTexture[0x8]; // 0x16d8 | Schema_Atomic | Size: 0x8
			GlobalTypes::Vector m_Entity_vBoxMins; // 0x16e0 | Schema_Atomic | Size: 0xc
			GlobalTypes::Vector m_Entity_vBoxMaxs; // 0x16ec | Schema_Atomic | Size: 0xc
			bool m_Entity_bMoveable; // 0x16f8 | Schema_Builtin | Size: 0x1
			S2_PAD(0x3);
			int32_t m_Entity_nHandshake; // 0x16fc | Schema_Builtin | Size: 0x4
			int32_t m_Entity_nEnvCubeMapArrayIndex; // 0x1700 | Schema_Builtin | Size: 0x4
			int32_t m_Entity_nPriority; // 0x1704 | Schema_Builtin | Size: 0x4
			bool m_Entity_bStartDisabled; // 0x1708 | Schema_Builtin | Size: 0x1
			S2_PAD(0x3);
			float32 m_Entity_flEdgeFadeDist; // 0x170c | Schema_Builtin | Size: 0x4
			GlobalTypes::Vector m_Entity_vEdgeFadeDists; // 0x1710 | Schema_Atomic | Size: 0xc
			int32_t m_Entity_nLightProbeSizeX; // 0x171c | Schema_Builtin | Size: 0x4
			int32_t m_Entity_nLightProbeSizeY; // 0x1720 | Schema_Builtin | Size: 0x4
			int32_t m_Entity_nLightProbeSizeZ; // 0x1724 | Schema_Builtin | Size: 0x4
			int32_t m_Entity_nLightProbeAtlasX; // 0x1728 | Schema_Builtin | Size: 0x4
			int32_t m_Entity_nLightProbeAtlasY; // 0x172c | Schema_Builtin | Size: 0x4
			int32_t m_Entity_nLightProbeAtlasZ; // 0x1730 | Schema_Builtin | Size: 0x4
			S2_PAD(0x15);
			bool m_Entity_bEnabled; // 0x1749 | Schema_Builtin | Size: 0x1
			S2_PAD(0x6); // End padding
		};
		static_assert(offsetof(CS2::client::C_EnvCombinedLightProbeVolume, m_Entity_Color) == 0x1680, "m_Entity_Color in C_EnvCombinedLightProbeVolume should be at offset 0x1680");
		static_assert(offsetof(CS2::client::C_EnvCombinedLightProbeVolume, m_Entity_flBrightness) == 0x1684, "m_Entity_flBrightness in C_EnvCombinedLightProbeVolume should be at offset 0x1684");
		static_assert(offsetof(CS2::client::C_EnvCombinedLightProbeVolume, m_Entity_hCubemapTexture) == 0x1688, "m_Entity_hCubemapTexture in C_EnvCombinedLightProbeVolume should be at offset 0x1688");
		static_assert(offsetof(CS2::client::C_EnvCombinedLightProbeVolume, m_Entity_bCustomCubemapTexture) == 0x1690, "m_Entity_bCustomCubemapTexture in C_EnvCombinedLightProbeVolume should be at offset 0x1690");
		static_assert(offsetof(CS2::client::C_EnvCombinedLightProbeVolume, m_Entity_hLightProbeTexture_AmbientCube) == 0x1698, "m_Entity_hLightProbeTexture_AmbientCube in C_EnvCombinedLightProbeVolume should be at offset 0x1698");
		static_assert(offsetof(CS2::client::C_EnvCombinedLightProbeVolume, m_Entity_hLightProbeTexture_SDF) == 0x16A0, "m_Entity_hLightProbeTexture_SDF in C_EnvCombinedLightProbeVolume should be at offset 0x16A0");
		static_assert(offsetof(CS2::client::C_EnvCombinedLightProbeVolume, m_Entity_hLightProbeTexture_SH2_DC) == 0x16A8, "m_Entity_hLightProbeTexture_SH2_DC in C_EnvCombinedLightProbeVolume should be at offset 0x16A8");
		static_assert(offsetof(CS2::client::C_EnvCombinedLightProbeVolume, m_Entity_hLightProbeTexture_SH2_R) == 0x16B0, "m_Entity_hLightProbeTexture_SH2_R in C_EnvCombinedLightProbeVolume should be at offset 0x16B0");
		static_assert(offsetof(CS2::client::C_EnvCombinedLightProbeVolume, m_Entity_hLightProbeTexture_SH2_G) == 0x16B8, "m_Entity_hLightProbeTexture_SH2_G in C_EnvCombinedLightProbeVolume should be at offset 0x16B8");
		static_assert(offsetof(CS2::client::C_EnvCombinedLightProbeVolume, m_Entity_hLightProbeTexture_SH2_B) == 0x16C0, "m_Entity_hLightProbeTexture_SH2_B in C_EnvCombinedLightProbeVolume should be at offset 0x16C0");
		static_assert(offsetof(CS2::client::C_EnvCombinedLightProbeVolume, m_Entity_hLightProbeDirectLightIndicesTexture) == 0x16C8, "m_Entity_hLightProbeDirectLightIndicesTexture in C_EnvCombinedLightProbeVolume should be at offset 0x16C8");
		static_assert(offsetof(CS2::client::C_EnvCombinedLightProbeVolume, m_Entity_hLightProbeDirectLightScalarsTexture) == 0x16D0, "m_Entity_hLightProbeDirectLightScalarsTexture in C_EnvCombinedLightProbeVolume should be at offset 0x16D0");
		static_assert(offsetof(CS2::client::C_EnvCombinedLightProbeVolume, m_Entity_hLightProbeDirectLightShadowsTexture) == 0x16D8, "m_Entity_hLightProbeDirectLightShadowsTexture in C_EnvCombinedLightProbeVolume should be at offset 0x16D8");
		static_assert(offsetof(CS2::client::C_EnvCombinedLightProbeVolume, m_Entity_vBoxMins) == 0x16E0, "m_Entity_vBoxMins in C_EnvCombinedLightProbeVolume should be at offset 0x16E0");
		static_assert(offsetof(CS2::client::C_EnvCombinedLightProbeVolume, m_Entity_vBoxMaxs) == 0x16EC, "m_Entity_vBoxMaxs in C_EnvCombinedLightProbeVolume should be at offset 0x16EC");
		static_assert(offsetof(CS2::client::C_EnvCombinedLightProbeVolume, m_Entity_bMoveable) == 0x16F8, "m_Entity_bMoveable in C_EnvCombinedLightProbeVolume should be at offset 0x16F8");
		static_assert(offsetof(CS2::client::C_EnvCombinedLightProbeVolume, m_Entity_nHandshake) == 0x16FC, "m_Entity_nHandshake in C_EnvCombinedLightProbeVolume should be at offset 0x16FC");
		static_assert(offsetof(CS2::client::C_EnvCombinedLightProbeVolume, m_Entity_nEnvCubeMapArrayIndex) == 0x1700, "m_Entity_nEnvCubeMapArrayIndex in C_EnvCombinedLightProbeVolume should be at offset 0x1700");
		static_assert(offsetof(CS2::client::C_EnvCombinedLightProbeVolume, m_Entity_nPriority) == 0x1704, "m_Entity_nPriority in C_EnvCombinedLightProbeVolume should be at offset 0x1704");
		static_assert(offsetof(CS2::client::C_EnvCombinedLightProbeVolume, m_Entity_bStartDisabled) == 0x1708, "m_Entity_bStartDisabled in C_EnvCombinedLightProbeVolume should be at offset 0x1708");
		static_assert(offsetof(CS2::client::C_EnvCombinedLightProbeVolume, m_Entity_flEdgeFadeDist) == 0x170C, "m_Entity_flEdgeFadeDist in C_EnvCombinedLightProbeVolume should be at offset 0x170C");
		static_assert(offsetof(CS2::client::C_EnvCombinedLightProbeVolume, m_Entity_vEdgeFadeDists) == 0x1710, "m_Entity_vEdgeFadeDists in C_EnvCombinedLightProbeVolume should be at offset 0x1710");
		static_assert(offsetof(CS2::client::C_EnvCombinedLightProbeVolume, m_Entity_nLightProbeSizeX) == 0x171C, "m_Entity_nLightProbeSizeX in C_EnvCombinedLightProbeVolume should be at offset 0x171C");
		static_assert(offsetof(CS2::client::C_EnvCombinedLightProbeVolume, m_Entity_nLightProbeSizeY) == 0x1720, "m_Entity_nLightProbeSizeY in C_EnvCombinedLightProbeVolume should be at offset 0x1720");
		static_assert(offsetof(CS2::client::C_EnvCombinedLightProbeVolume, m_Entity_nLightProbeSizeZ) == 0x1724, "m_Entity_nLightProbeSizeZ in C_EnvCombinedLightProbeVolume should be at offset 0x1724");
		static_assert(offsetof(CS2::client::C_EnvCombinedLightProbeVolume, m_Entity_nLightProbeAtlasX) == 0x1728, "m_Entity_nLightProbeAtlasX in C_EnvCombinedLightProbeVolume should be at offset 0x1728");
		static_assert(offsetof(CS2::client::C_EnvCombinedLightProbeVolume, m_Entity_nLightProbeAtlasY) == 0x172C, "m_Entity_nLightProbeAtlasY in C_EnvCombinedLightProbeVolume should be at offset 0x172C");
		static_assert(offsetof(CS2::client::C_EnvCombinedLightProbeVolume, m_Entity_nLightProbeAtlasZ) == 0x1730, "m_Entity_nLightProbeAtlasZ in C_EnvCombinedLightProbeVolume should be at offset 0x1730");
		static_assert(offsetof(CS2::client::C_EnvCombinedLightProbeVolume, m_Entity_bEnabled) == 0x1749, "m_Entity_bEnabled in C_EnvCombinedLightProbeVolume should be at offset 0x1749");
		static_assert(sizeof(CS2::client::C_EnvCombinedLightProbeVolume) == 0x1750, "C_EnvCombinedLightProbeVolume size should be 0x1750");
	}
}
