// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#ifndef CUSTOM_GLOBAL_TYPES
	#include "../GlobalTypes.hpp"
#else
	#include "../Custom/GlobalTypes.hpp"
#endif


#include "C_BaseModelEntity.hpp"





using namespace GlobalTypes;
namespace CS2 {
	namespace client {
		class C_EnvSky : public CS2::client::C_BaseModelEntity {
		public:
			// GlobalTypes::CStrongHandle<resourcesystem::InfoForResourceTypeIMaterial2> m_hSkyMaterial; // 0xe88 | Schema_Atomic | Size: 0x8
			char m_hSkyMaterial[0x8]; // 0xe88 | Schema_Atomic | Size: 0x8
			// GlobalTypes::CStrongHandle<resourcesystem::InfoForResourceTypeIMaterial2> m_hSkyMaterialLightingOnly; // 0xe90 | Schema_Atomic | Size: 0x8
			char m_hSkyMaterialLightingOnly[0x8]; // 0xe90 | Schema_Atomic | Size: 0x8
			bool m_bStartDisabled; // 0xe98 | Schema_Builtin | Size: 0x1
			GlobalTypes::Color m_vTintColor; // 0xe99 | Schema_Atomic | Size: 0x4
			GlobalTypes::Color m_vTintColorLightingOnly; // 0xe9d | Schema_Atomic | Size: 0x4
			S2_PAD(0x3);
			float32 m_flBrightnessScale; // 0xea4 | Schema_Builtin | Size: 0x4
			int32_t m_nFogType; // 0xea8 | Schema_Builtin | Size: 0x4
			float32 m_flFogMinStart; // 0xeac | Schema_Builtin | Size: 0x4
			float32 m_flFogMinEnd; // 0xeb0 | Schema_Builtin | Size: 0x4
			float32 m_flFogMaxStart; // 0xeb4 | Schema_Builtin | Size: 0x4
			float32 m_flFogMaxEnd; // 0xeb8 | Schema_Builtin | Size: 0x4
			bool m_bEnabled; // 0xebc | Schema_Builtin | Size: 0x1
			S2_PAD(0x2b); // End padding
		};
		static_assert(offsetof(CS2::client::C_EnvSky, m_hSkyMaterial) == 0xE88, "m_hSkyMaterial in C_EnvSky should be at offset 0xE88");
		static_assert(offsetof(CS2::client::C_EnvSky, m_hSkyMaterialLightingOnly) == 0xE90, "m_hSkyMaterialLightingOnly in C_EnvSky should be at offset 0xE90");
		static_assert(offsetof(CS2::client::C_EnvSky, m_bStartDisabled) == 0xE98, "m_bStartDisabled in C_EnvSky should be at offset 0xE98");
		static_assert(offsetof(CS2::client::C_EnvSky, m_vTintColor) == 0xE99, "m_vTintColor in C_EnvSky should be at offset 0xE99");
		static_assert(offsetof(CS2::client::C_EnvSky, m_vTintColorLightingOnly) == 0xE9D, "m_vTintColorLightingOnly in C_EnvSky should be at offset 0xE9D");
		static_assert(offsetof(CS2::client::C_EnvSky, m_flBrightnessScale) == 0xEA4, "m_flBrightnessScale in C_EnvSky should be at offset 0xEA4");
		static_assert(offsetof(CS2::client::C_EnvSky, m_nFogType) == 0xEA8, "m_nFogType in C_EnvSky should be at offset 0xEA8");
		static_assert(offsetof(CS2::client::C_EnvSky, m_flFogMinStart) == 0xEAC, "m_flFogMinStart in C_EnvSky should be at offset 0xEAC");
		static_assert(offsetof(CS2::client::C_EnvSky, m_flFogMinEnd) == 0xEB0, "m_flFogMinEnd in C_EnvSky should be at offset 0xEB0");
		static_assert(offsetof(CS2::client::C_EnvSky, m_flFogMaxStart) == 0xEB4, "m_flFogMaxStart in C_EnvSky should be at offset 0xEB4");
		static_assert(offsetof(CS2::client::C_EnvSky, m_flFogMaxEnd) == 0xEB8, "m_flFogMaxEnd in C_EnvSky should be at offset 0xEB8");
		static_assert(offsetof(CS2::client::C_EnvSky, m_bEnabled) == 0xEBC, "m_bEnabled in C_EnvSky should be at offset 0xEBC");
		static_assert(sizeof(CS2::client::C_EnvSky) == 0xEE8, "C_EnvSky size should be 0xEE8");
	}
}
