// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#ifndef CUSTOM_GLOBAL_TYPES
	#include "../GlobalTypes.hpp"
#else
	#include "../Custom/GlobalTypes.hpp"
#endif


#include "C_BaseEntity.hpp"





using namespace GlobalTypes;
namespace CS2 {
	namespace client {
		class C_EnvWindVolume : public CS2::client::C_BaseEntity {
		public:
			bool m_bActive; // 0x608 | Schema_Builtin | Size: 0x1
			S2_PAD(0x3);
			GlobalTypes::Vector m_vBoxMins; // 0x60c | Schema_Atomic | Size: 0xc
			GlobalTypes::Vector m_vBoxMaxs; // 0x618 | Schema_Atomic | Size: 0xc
			bool m_bStartDisabled; // 0x624 | Schema_Builtin | Size: 0x1
			S2_PAD(0x3);
			int32_t m_nShape; // 0x628 | Schema_Builtin | Size: 0x4
			float32 m_fWindSpeedMultiplier; // 0x62c | Schema_Builtin | Size: 0x4
			float32 m_fWindTurbulenceMultiplier; // 0x630 | Schema_Builtin | Size: 0x4
			float32 m_fWindSpeedVariationMultiplier; // 0x634 | Schema_Builtin | Size: 0x4
			float32 m_fWindDirectionVariationMultiplier; // 0x638 | Schema_Builtin | Size: 0x4
			S2_PAD(0x4); // End padding
		};
#ifdef USE_STATIC_ASSERTS
		static_assert(offsetof(CS2::client::C_EnvWindVolume, m_bActive) == 0x608, "m_bActive in C_EnvWindVolume should be at offset 0x608");
		static_assert(offsetof(CS2::client::C_EnvWindVolume, m_vBoxMins) == 0x60C, "m_vBoxMins in C_EnvWindVolume should be at offset 0x60C");
		static_assert(offsetof(CS2::client::C_EnvWindVolume, m_vBoxMaxs) == 0x618, "m_vBoxMaxs in C_EnvWindVolume should be at offset 0x618");
		static_assert(offsetof(CS2::client::C_EnvWindVolume, m_bStartDisabled) == 0x624, "m_bStartDisabled in C_EnvWindVolume should be at offset 0x624");
		static_assert(offsetof(CS2::client::C_EnvWindVolume, m_nShape) == 0x628, "m_nShape in C_EnvWindVolume should be at offset 0x628");
		static_assert(offsetof(CS2::client::C_EnvWindVolume, m_fWindSpeedMultiplier) == 0x62C, "m_fWindSpeedMultiplier in C_EnvWindVolume should be at offset 0x62C");
		static_assert(offsetof(CS2::client::C_EnvWindVolume, m_fWindTurbulenceMultiplier) == 0x630, "m_fWindTurbulenceMultiplier in C_EnvWindVolume should be at offset 0x630");
		static_assert(offsetof(CS2::client::C_EnvWindVolume, m_fWindSpeedVariationMultiplier) == 0x634, "m_fWindSpeedVariationMultiplier in C_EnvWindVolume should be at offset 0x634");
		static_assert(offsetof(CS2::client::C_EnvWindVolume, m_fWindDirectionVariationMultiplier) == 0x638, "m_fWindDirectionVariationMultiplier in C_EnvWindVolume should be at offset 0x638");
		static_assert(sizeof(CS2::client::C_EnvWindVolume) == 0x640, "C_EnvWindVolume size should be 0x640");

#endif
	}
}
