// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#include <SDK/GlobalTypes.hpp>

#include <SDK/client/C_BaseModelEntity.hpp>
#include <SDK/entity2/GameTick_t.hpp>



namespace CS2 {
	namespace client {
		class C_FuncConveyor : public CS2::client::C_BaseModelEntity {
		public:
			S2_PAD(0x8);
			GlobalTypes::Vector m_vecMoveDirEntitySpace; // 0xec8 | Schema_Atomic | Size: 0xc
			float32 m_flTargetSpeed; // 0xed4 | Schema_Builtin | Size: 0x4
			entity2::GameTick_t m_nTransitionStartTick; // 0xed8 | Schema_DeclaredClass | Size: 0x4
			int32_t m_nTransitionDurationTicks; // 0xedc | Schema_Builtin | Size: 0x4
			float32 m_flTransitionStartSpeed; // 0xee0 | Schema_Builtin | Size: 0x4
			S2_PAD(0x4);
			// client::C_NetworkUtlVectorBase< client.dll::CHandle< C_BaseEntity > > m_hConveyorModels; // 0xee8 | Schema_Atomic | Size: 0x18
			char  m_hConveyorModels[0x18]; // 0xee8 | Schema_Atomic | Size: 0x18
			float32 m_flCurrentConveyorOffset; // 0xf00 | Schema_Builtin | Size: 0x4
			float32 m_flCurrentConveyorSpeed; // 0xf04 | Schema_Builtin | Size: 0x4
		};
		static_assert(offsetof(CS2::client::C_FuncConveyor, m_vecMoveDirEntitySpace) == 0xEC8, "m_vecMoveDirEntitySpace in C_FuncConveyor should be at offset 0xEC8");
		static_assert(offsetof(CS2::client::C_FuncConveyor, m_flTargetSpeed) == 0xED4, "m_flTargetSpeed in C_FuncConveyor should be at offset 0xED4");
		static_assert(offsetof(CS2::client::C_FuncConveyor, m_nTransitionStartTick) == 0xED8, "m_nTransitionStartTick in C_FuncConveyor should be at offset 0xED8");
		static_assert(offsetof(CS2::client::C_FuncConveyor, m_nTransitionDurationTicks) == 0xEDC, "m_nTransitionDurationTicks in C_FuncConveyor should be at offset 0xEDC");
		static_assert(offsetof(CS2::client::C_FuncConveyor, m_flTransitionStartSpeed) == 0xEE0, "m_flTransitionStartSpeed in C_FuncConveyor should be at offset 0xEE0");
		static_assert(offsetof(CS2::client::C_FuncConveyor, m_hConveyorModels) == 0xEE8, "m_hConveyorModels in C_FuncConveyor should be at offset 0xEE8");
		static_assert(offsetof(CS2::client::C_FuncConveyor, m_flCurrentConveyorOffset) == 0xF00, "m_flCurrentConveyorOffset in C_FuncConveyor should be at offset 0xF00");
		static_assert(offsetof(CS2::client::C_FuncConveyor, m_flCurrentConveyorSpeed) == 0xF04, "m_flCurrentConveyorSpeed in C_FuncConveyor should be at offset 0xF04");
		static_assert(sizeof(CS2::client::C_FuncConveyor) == 0xF08, "C_FuncConveyor size should be 0xF08");
	}
}
