// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#ifndef CUSTOM_GLOBAL_TYPES
	#include "../GlobalTypes.hpp"
#else
	#include <Custom/GlobalTypes.hpp>
#endif


#include "C_FuncBrush.hpp"



namespace CS2 {
	namespace client {
		class C_BaseEntity;
	}
}


using namespace GlobalTypes;
namespace CS2 {
	namespace client {
		class C_FuncMonitor : public CS2::client::C_FuncBrush {
		public:
			GlobalTypes::CUtlString m_targetCamera; // 0xe88 | Schema_Atomic | Size: 0x8
			int32_t m_nResolutionEnum; // 0xe90 | Schema_Builtin | Size: 0x4
			bool m_bRenderShadows; // 0xe94 | Schema_Builtin | Size: 0x1
			bool m_bUseUniqueColorTarget; // 0xe95 | Schema_Builtin | Size: 0x1
			S2_PAD(0x2);
			GlobalTypes::CUtlString m_brushModelName; // 0xe98 | Schema_Atomic | Size: 0x8
			GlobalTypes::CHandle<client::C_BaseEntity> m_hTargetCamera; // 0xea0 | Schema_Atomic | Size: 0x4
			// char m_hTargetCamera[0x4]; // 0xea0 | Schema_Atomic | Size: 0x4
			bool m_bEnabled; // 0xea4 | Schema_Builtin | Size: 0x1
			bool m_bDraw3DSkybox; // 0xea5 | Schema_Builtin | Size: 0x1
			S2_PAD(0x45a); // End padding
		};
#ifdef USE_STATIC_ASSERTS
		static_assert(offsetof(CS2::client::C_FuncMonitor, m_targetCamera) == 0xE88, "m_targetCamera in C_FuncMonitor should be at offset 0xE88");
		static_assert(offsetof(CS2::client::C_FuncMonitor, m_nResolutionEnum) == 0xE90, "m_nResolutionEnum in C_FuncMonitor should be at offset 0xE90");
		static_assert(offsetof(CS2::client::C_FuncMonitor, m_bRenderShadows) == 0xE94, "m_bRenderShadows in C_FuncMonitor should be at offset 0xE94");
		static_assert(offsetof(CS2::client::C_FuncMonitor, m_bUseUniqueColorTarget) == 0xE95, "m_bUseUniqueColorTarget in C_FuncMonitor should be at offset 0xE95");
		static_assert(offsetof(CS2::client::C_FuncMonitor, m_brushModelName) == 0xE98, "m_brushModelName in C_FuncMonitor should be at offset 0xE98");
		static_assert(offsetof(CS2::client::C_FuncMonitor, m_hTargetCamera) == 0xEA0, "m_hTargetCamera in C_FuncMonitor should be at offset 0xEA0");
		static_assert(offsetof(CS2::client::C_FuncMonitor, m_bEnabled) == 0xEA4, "m_bEnabled in C_FuncMonitor should be at offset 0xEA4");
		static_assert(offsetof(CS2::client::C_FuncMonitor, m_bDraw3DSkybox) == 0xEA5, "m_bDraw3DSkybox in C_FuncMonitor should be at offset 0xEA5");
		static_assert(sizeof(CS2::client::C_FuncMonitor) == 0x1300, "C_FuncMonitor size should be 0x1300");

#endif
	}
}
