// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#include <SDK/GlobalTypes.hpp>

#include <SDK/client/C_BaseModelEntity.hpp>



namespace CS2 {
	namespace client {
		class C_FuncLadder : public CS2::client::C_BaseModelEntity {
		public:
			public:
			GlobalTypes::Vector m_vecLadderDir; // 0xec0 | Schema_Atomic | Size: 0xc
			S2_PAD(0x4);
			// client::CUtlVector< client.dll::CHandle< C_InfoLadderDismount > > m_Dismounts; // 0xed0 | Schema_Atomic | Size: 0x18
			char  m_Dismounts[0x18]; // 0xed0 | Schema_Atomic | Size: 0x18
			GlobalTypes::Vector m_vecLocalTop; // 0xee8 | Schema_Atomic | Size: 0xc
			GlobalTypes::Vector m_vecPlayerMountPositionTop; // 0xef4 | Schema_Atomic | Size: 0xc
			GlobalTypes::Vector m_vecPlayerMountPositionBottom; // 0xf00 | Schema_Atomic | Size: 0xc
			float32 m_flAutoRideSpeed; // 0xf0c | Schema_Builtin | Size: 0x4
			bool m_bDisabled; // 0xf10 | Schema_Builtin | Size: 0x1
			bool m_bFakeLadder; // 0xf11 | Schema_Builtin | Size: 0x1
			bool m_bHasSlack; // 0xf12 | Schema_Builtin | Size: 0x1
			S2_PAD(0x5); // End padding
		};
		static_assert(offsetof(CS2::client::C_FuncLadder, m_vecLadderDir) == 0xEC0, "m_vecLadderDir in C_FuncLadder should be at offset 0xEC0");
		static_assert(offsetof(CS2::client::C_FuncLadder, m_Dismounts) == 0xED0, "m_Dismounts in C_FuncLadder should be at offset 0xED0");
		static_assert(offsetof(CS2::client::C_FuncLadder, m_vecLocalTop) == 0xEE8, "m_vecLocalTop in C_FuncLadder should be at offset 0xEE8");
		static_assert(offsetof(CS2::client::C_FuncLadder, m_vecPlayerMountPositionTop) == 0xEF4, "m_vecPlayerMountPositionTop in C_FuncLadder should be at offset 0xEF4");
		static_assert(offsetof(CS2::client::C_FuncLadder, m_vecPlayerMountPositionBottom) == 0xF00, "m_vecPlayerMountPositionBottom in C_FuncLadder should be at offset 0xF00");
		static_assert(offsetof(CS2::client::C_FuncLadder, m_flAutoRideSpeed) == 0xF0C, "m_flAutoRideSpeed in C_FuncLadder should be at offset 0xF0C");
		static_assert(offsetof(CS2::client::C_FuncLadder, m_bDisabled) == 0xF10, "m_bDisabled in C_FuncLadder should be at offset 0xF10");
		static_assert(offsetof(CS2::client::C_FuncLadder, m_bFakeLadder) == 0xF11, "m_bFakeLadder in C_FuncLadder should be at offset 0xF11");
		static_assert(offsetof(CS2::client::C_FuncLadder, m_bHasSlack) == 0xF12, "m_bHasSlack in C_FuncLadder should be at offset 0xF12");
		static_assert(sizeof(CS2::client::C_FuncLadder) == 0xF18, "C_FuncLadder size should be 0xF18");
	}
}
