// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#ifndef CUSTOM_GLOBAL_TYPES
	#include "../GlobalTypes.hpp"
#else
	#include "../Custom/GlobalTypes.hpp"
#endif


#include "C_BaseEntity.hpp"





using namespace GlobalTypes;
namespace CS2 {
	namespace client {
		class C_GradientFog : public CS2::client::C_BaseEntity {
		public:
			// GlobalTypes::CStrongHandle<resourcesystem::InfoForResourceTypeCTextureBase> m_hGradientFogTexture; // 0x608 | Schema_Atomic | Size: 0x8
			char m_hGradientFogTexture[0x8]; // 0x608 | Schema_Atomic | Size: 0x8
			float32 m_flFogStartDistance; // 0x610 | Schema_Builtin | Size: 0x4
			float32 m_flFogEndDistance; // 0x614 | Schema_Builtin | Size: 0x4
			bool m_bHeightFogEnabled; // 0x618 | Schema_Builtin | Size: 0x1
			S2_PAD(0x3);
			float32 m_flFogStartHeight; // 0x61c | Schema_Builtin | Size: 0x4
			float32 m_flFogEndHeight; // 0x620 | Schema_Builtin | Size: 0x4
			float32 m_flFarZ; // 0x624 | Schema_Builtin | Size: 0x4
			float32 m_flFogMaxOpacity; // 0x628 | Schema_Builtin | Size: 0x4
			float32 m_flFogFalloffExponent; // 0x62c | Schema_Builtin | Size: 0x4
			float32 m_flFogVerticalExponent; // 0x630 | Schema_Builtin | Size: 0x4
			GlobalTypes::Color m_fogColor; // 0x634 | Schema_Atomic | Size: 0x4
			float32 m_flFogStrength; // 0x638 | Schema_Builtin | Size: 0x4
			float32 m_flFadeTime; // 0x63c | Schema_Builtin | Size: 0x4
			bool m_bStartDisabled; // 0x640 | Schema_Builtin | Size: 0x1
			bool m_bIsEnabled; // 0x641 | Schema_Builtin | Size: 0x1
			bool m_bGradientFogNeedsTextures; // 0x642 | Schema_Builtin | Size: 0x1
			S2_PAD(0x5d); // End padding
		};
#ifdef USE_STATIC_ASSERTS
		static_assert(offsetof(CS2::client::C_GradientFog, m_hGradientFogTexture) == 0x608, "m_hGradientFogTexture in C_GradientFog should be at offset 0x608");
		static_assert(offsetof(CS2::client::C_GradientFog, m_flFogStartDistance) == 0x610, "m_flFogStartDistance in C_GradientFog should be at offset 0x610");
		static_assert(offsetof(CS2::client::C_GradientFog, m_flFogEndDistance) == 0x614, "m_flFogEndDistance in C_GradientFog should be at offset 0x614");
		static_assert(offsetof(CS2::client::C_GradientFog, m_bHeightFogEnabled) == 0x618, "m_bHeightFogEnabled in C_GradientFog should be at offset 0x618");
		static_assert(offsetof(CS2::client::C_GradientFog, m_flFogStartHeight) == 0x61C, "m_flFogStartHeight in C_GradientFog should be at offset 0x61C");
		static_assert(offsetof(CS2::client::C_GradientFog, m_flFogEndHeight) == 0x620, "m_flFogEndHeight in C_GradientFog should be at offset 0x620");
		static_assert(offsetof(CS2::client::C_GradientFog, m_flFarZ) == 0x624, "m_flFarZ in C_GradientFog should be at offset 0x624");
		static_assert(offsetof(CS2::client::C_GradientFog, m_flFogMaxOpacity) == 0x628, "m_flFogMaxOpacity in C_GradientFog should be at offset 0x628");
		static_assert(offsetof(CS2::client::C_GradientFog, m_flFogFalloffExponent) == 0x62C, "m_flFogFalloffExponent in C_GradientFog should be at offset 0x62C");
		static_assert(offsetof(CS2::client::C_GradientFog, m_flFogVerticalExponent) == 0x630, "m_flFogVerticalExponent in C_GradientFog should be at offset 0x630");
		static_assert(offsetof(CS2::client::C_GradientFog, m_fogColor) == 0x634, "m_fogColor in C_GradientFog should be at offset 0x634");
		static_assert(offsetof(CS2::client::C_GradientFog, m_flFogStrength) == 0x638, "m_flFogStrength in C_GradientFog should be at offset 0x638");
		static_assert(offsetof(CS2::client::C_GradientFog, m_flFadeTime) == 0x63C, "m_flFadeTime in C_GradientFog should be at offset 0x63C");
		static_assert(offsetof(CS2::client::C_GradientFog, m_bStartDisabled) == 0x640, "m_bStartDisabled in C_GradientFog should be at offset 0x640");
		static_assert(offsetof(CS2::client::C_GradientFog, m_bIsEnabled) == 0x641, "m_bIsEnabled in C_GradientFog should be at offset 0x641");
		static_assert(offsetof(CS2::client::C_GradientFog, m_bGradientFogNeedsTextures) == 0x642, "m_bGradientFogNeedsTextures in C_GradientFog should be at offset 0x642");
		static_assert(sizeof(CS2::client::C_GradientFog) == 0x6A0, "C_GradientFog size should be 0x6A0");

#endif
	}
}
