// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#ifndef CUSTOM_GLOBAL_TYPES
	#include "../GlobalTypes.hpp"
#else
	#include "../Custom/GlobalTypes.hpp"
#endif


#include "C_BaseCombatCharacter.hpp"
#include "EntitySpottedState_t.hpp"
#include "CountdownTimer.hpp"
#include "../entity2/GameTime_t.hpp"
#include "../modellib/AttachmentHandle_t.hpp"



namespace CS2 {
	namespace client {
		class C_BaseEntity;
		class C_CSPlayerPawn;
		class CBasePlayerController;
	}
}


using namespace GlobalTypes;
namespace CS2 {
	namespace client {
		class C_Hostage : public CS2::client::C_BaseCombatCharacter {
		public:
			client::EntitySpottedState_t m_entitySpottedState; // 0x13d8 | Schema_DeclaredClass | Size: 0x18
			GlobalTypes::CHandle<client::C_BaseEntity> m_leader; // 0x13f0 | Schema_Atomic | Size: 0x4
			// char m_leader[0x4]; // 0x13f0 | Schema_Atomic | Size: 0x4
			S2_PAD(0x4);
			client::CountdownTimer m_reuseTimer; // 0x13f8 | Schema_DeclaredClass | Size: 0x18
			GlobalTypes::Vector m_vel; // 0x1410 | Schema_Atomic | Size: 0xc
			bool m_isRescued; // 0x141c | Schema_Builtin | Size: 0x1
			bool m_jumpedThisFrame; // 0x141d | Schema_Builtin | Size: 0x1
			S2_PAD(0x2);
			int32_t m_nHostageState; // 0x1420 | Schema_Builtin | Size: 0x4
			bool m_bHandsHaveBeenCut; // 0x1424 | Schema_Builtin | Size: 0x1
			S2_PAD(0x3);
			GlobalTypes::CHandle<client::C_CSPlayerPawn> m_hHostageGrabber; // 0x1428 | Schema_Atomic | Size: 0x4
			// char m_hHostageGrabber[0x4]; // 0x1428 | Schema_Atomic | Size: 0x4
			entity2::GameTime_t m_fLastGrabTime; // 0x142c | Schema_DeclaredClass | Size: 0x4
			GlobalTypes::Vector m_vecGrabbedPos; // 0x1430 | Schema_Atomic | Size: 0xc
			entity2::GameTime_t m_flRescueStartTime; // 0x143c | Schema_DeclaredClass | Size: 0x4
			entity2::GameTime_t m_flGrabSuccessTime; // 0x1440 | Schema_DeclaredClass | Size: 0x4
			entity2::GameTime_t m_flDropStartTime; // 0x1444 | Schema_DeclaredClass | Size: 0x4
			entity2::GameTime_t m_flDeadOrRescuedTime; // 0x1448 | Schema_DeclaredClass | Size: 0x4
			S2_PAD(0x4);
			client::CountdownTimer m_blinkTimer; // 0x1450 | Schema_DeclaredClass | Size: 0x18
			GlobalTypes::Vector m_lookAt; // 0x1468 | Schema_Atomic | Size: 0xc
			S2_PAD(0x4);
			client::CountdownTimer m_lookAroundTimer; // 0x1478 | Schema_DeclaredClass | Size: 0x18
			bool m_isInit; // 0x1490 | Schema_Builtin | Size: 0x1
			modellib::AttachmentHandle_t m_eyeAttachment; // 0x1491 | Schema_DeclaredClass | Size: 0x1
			modellib::AttachmentHandle_t m_chestAttachment; // 0x1492 | Schema_DeclaredClass | Size: 0x1
			S2_PAD(0x5);
			client::CBasePlayerController* m_pPredictionOwner; // 0x1498 | Schema_Ptr | Size: 0x8
			entity2::GameTime_t m_fNewestAlphaThinkTime; // 0x14a0 | Schema_DeclaredClass | Size: 0x4
			S2_PAD(0x4); // End padding
		};
		static_assert(offsetof(CS2::client::C_Hostage, m_entitySpottedState) == 0x13D8, "m_entitySpottedState in C_Hostage should be at offset 0x13D8");
		static_assert(offsetof(CS2::client::C_Hostage, m_leader) == 0x13F0, "m_leader in C_Hostage should be at offset 0x13F0");
		static_assert(offsetof(CS2::client::C_Hostage, m_reuseTimer) == 0x13F8, "m_reuseTimer in C_Hostage should be at offset 0x13F8");
		static_assert(offsetof(CS2::client::C_Hostage, m_vel) == 0x1410, "m_vel in C_Hostage should be at offset 0x1410");
		static_assert(offsetof(CS2::client::C_Hostage, m_isRescued) == 0x141C, "m_isRescued in C_Hostage should be at offset 0x141C");
		static_assert(offsetof(CS2::client::C_Hostage, m_jumpedThisFrame) == 0x141D, "m_jumpedThisFrame in C_Hostage should be at offset 0x141D");
		static_assert(offsetof(CS2::client::C_Hostage, m_nHostageState) == 0x1420, "m_nHostageState in C_Hostage should be at offset 0x1420");
		static_assert(offsetof(CS2::client::C_Hostage, m_bHandsHaveBeenCut) == 0x1424, "m_bHandsHaveBeenCut in C_Hostage should be at offset 0x1424");
		static_assert(offsetof(CS2::client::C_Hostage, m_hHostageGrabber) == 0x1428, "m_hHostageGrabber in C_Hostage should be at offset 0x1428");
		static_assert(offsetof(CS2::client::C_Hostage, m_fLastGrabTime) == 0x142C, "m_fLastGrabTime in C_Hostage should be at offset 0x142C");
		static_assert(offsetof(CS2::client::C_Hostage, m_vecGrabbedPos) == 0x1430, "m_vecGrabbedPos in C_Hostage should be at offset 0x1430");
		static_assert(offsetof(CS2::client::C_Hostage, m_flRescueStartTime) == 0x143C, "m_flRescueStartTime in C_Hostage should be at offset 0x143C");
		static_assert(offsetof(CS2::client::C_Hostage, m_flGrabSuccessTime) == 0x1440, "m_flGrabSuccessTime in C_Hostage should be at offset 0x1440");
		static_assert(offsetof(CS2::client::C_Hostage, m_flDropStartTime) == 0x1444, "m_flDropStartTime in C_Hostage should be at offset 0x1444");
		static_assert(offsetof(CS2::client::C_Hostage, m_flDeadOrRescuedTime) == 0x1448, "m_flDeadOrRescuedTime in C_Hostage should be at offset 0x1448");
		static_assert(offsetof(CS2::client::C_Hostage, m_blinkTimer) == 0x1450, "m_blinkTimer in C_Hostage should be at offset 0x1450");
		static_assert(offsetof(CS2::client::C_Hostage, m_lookAt) == 0x1468, "m_lookAt in C_Hostage should be at offset 0x1468");
		static_assert(offsetof(CS2::client::C_Hostage, m_lookAroundTimer) == 0x1478, "m_lookAroundTimer in C_Hostage should be at offset 0x1478");
		static_assert(offsetof(CS2::client::C_Hostage, m_isInit) == 0x1490, "m_isInit in C_Hostage should be at offset 0x1490");
		static_assert(offsetof(CS2::client::C_Hostage, m_eyeAttachment) == 0x1491, "m_eyeAttachment in C_Hostage should be at offset 0x1491");
		static_assert(offsetof(CS2::client::C_Hostage, m_chestAttachment) == 0x1492, "m_chestAttachment in C_Hostage should be at offset 0x1492");
		static_assert(offsetof(CS2::client::C_Hostage, m_pPredictionOwner) == 0x1498, "m_pPredictionOwner in C_Hostage should be at offset 0x1498");
		static_assert(offsetof(CS2::client::C_Hostage, m_fNewestAlphaThinkTime) == 0x14A0, "m_fNewestAlphaThinkTime in C_Hostage should be at offset 0x14A0");
		static_assert(sizeof(CS2::client::C_Hostage) == 0x14A8, "C_Hostage size should be 0x14A8");
	}
}
