// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#include <SDK/GlobalTypes.hpp>

#include <SDK/client/C_ModelPointEntity.hpp>
#include <SDK/client/CPlayerSprayDecalRenderHelper.hpp>



namespace CS2 {
	namespace client {
		class C_PlayerSprayDecal : public CS2::client::C_ModelPointEntity {
		public:
			public:
			int32_t m_nUniqueID; // 0xec0 | Schema_Builtin | Size: 0x4
			uint32_t m_unAccountID; // 0xec4 | Schema_Builtin | Size: 0x4
			uint32_t m_unTraceID; // 0xec8 | Schema_Builtin | Size: 0x4
			uint32_t m_rtGcTime; // 0xecc | Schema_Builtin | Size: 0x4
			GlobalTypes::Vector m_vecEndPos; // 0xed0 | Schema_Atomic | Size: 0xc
			GlobalTypes::Vector m_vecStart; // 0xedc | Schema_Atomic | Size: 0xc
			GlobalTypes::Vector m_vecLeft; // 0xee8 | Schema_Atomic | Size: 0xc
			GlobalTypes::Vector m_vecNormal; // 0xef4 | Schema_Atomic | Size: 0xc
			int32_t m_nPlayer; // 0xf00 | Schema_Builtin | Size: 0x4
			int32_t m_nEntity; // 0xf04 | Schema_Builtin | Size: 0x4
			int32_t m_nHitbox; // 0xf08 | Schema_Builtin | Size: 0x4
			float32 m_flCreationTime; // 0xf0c | Schema_Builtin | Size: 0x4
			int32_t m_nTintID; // 0xf10 | Schema_Builtin | Size: 0x4
			uint8_t m_nVersion; // 0xf14 | Schema_Builtin | Size: 0x1
			uint8_t m_ubSignature[128]; // 0xf15 | Schema_FixedArray | Size: 0x80
			S2_PAD(0xb);
			client::CPlayerSprayDecalRenderHelper m_SprayRenderHelper; // 0xfa0 | Schema_DeclaredClass | Size: 0x30
		};
		static_assert(offsetof(CS2::client::C_PlayerSprayDecal, m_nUniqueID) == 0xEC0, "m_nUniqueID in C_PlayerSprayDecal should be at offset 0xEC0");
		static_assert(offsetof(CS2::client::C_PlayerSprayDecal, m_unAccountID) == 0xEC4, "m_unAccountID in C_PlayerSprayDecal should be at offset 0xEC4");
		static_assert(offsetof(CS2::client::C_PlayerSprayDecal, m_unTraceID) == 0xEC8, "m_unTraceID in C_PlayerSprayDecal should be at offset 0xEC8");
		static_assert(offsetof(CS2::client::C_PlayerSprayDecal, m_rtGcTime) == 0xECC, "m_rtGcTime in C_PlayerSprayDecal should be at offset 0xECC");
		static_assert(offsetof(CS2::client::C_PlayerSprayDecal, m_vecEndPos) == 0xED0, "m_vecEndPos in C_PlayerSprayDecal should be at offset 0xED0");
		static_assert(offsetof(CS2::client::C_PlayerSprayDecal, m_vecStart) == 0xEDC, "m_vecStart in C_PlayerSprayDecal should be at offset 0xEDC");
		static_assert(offsetof(CS2::client::C_PlayerSprayDecal, m_vecLeft) == 0xEE8, "m_vecLeft in C_PlayerSprayDecal should be at offset 0xEE8");
		static_assert(offsetof(CS2::client::C_PlayerSprayDecal, m_vecNormal) == 0xEF4, "m_vecNormal in C_PlayerSprayDecal should be at offset 0xEF4");
		static_assert(offsetof(CS2::client::C_PlayerSprayDecal, m_nPlayer) == 0xF00, "m_nPlayer in C_PlayerSprayDecal should be at offset 0xF00");
		static_assert(offsetof(CS2::client::C_PlayerSprayDecal, m_nEntity) == 0xF04, "m_nEntity in C_PlayerSprayDecal should be at offset 0xF04");
		static_assert(offsetof(CS2::client::C_PlayerSprayDecal, m_nHitbox) == 0xF08, "m_nHitbox in C_PlayerSprayDecal should be at offset 0xF08");
		static_assert(offsetof(CS2::client::C_PlayerSprayDecal, m_flCreationTime) == 0xF0C, "m_flCreationTime in C_PlayerSprayDecal should be at offset 0xF0C");
		static_assert(offsetof(CS2::client::C_PlayerSprayDecal, m_nTintID) == 0xF10, "m_nTintID in C_PlayerSprayDecal should be at offset 0xF10");
		static_assert(offsetof(CS2::client::C_PlayerSprayDecal, m_nVersion) == 0xF14, "m_nVersion in C_PlayerSprayDecal should be at offset 0xF14");
		static_assert(offsetof(CS2::client::C_PlayerSprayDecal, m_ubSignature) == 0xF15, "m_ubSignature in C_PlayerSprayDecal should be at offset 0xF15");
		static_assert(offsetof(CS2::client::C_PlayerSprayDecal, m_SprayRenderHelper) == 0xFA0, "m_SprayRenderHelper in C_PlayerSprayDecal should be at offset 0xFA0");
		static_assert(sizeof(CS2::client::C_PlayerSprayDecal) == 0xFD0, "C_PlayerSprayDecal size should be 0xFD0");
	}
}
