// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#include <SDK/GlobalTypes.hpp>

#include <SDK/client/C_BaseClientUIEntity.hpp>



namespace CS2 {
	namespace client {
		class CPointOffScreenIndicatorUi;
	}
}
namespace CS2 {
	namespace client {
		class C_PointClientUIWorldPanel : public CS2::client::C_BaseClientUIEntity {
		public:
			public:
			S2_PAD(0x8);
			bool m_bForceRecreateNextUpdate; // 0xef8 | Schema_Builtin | Size: 0x1
			bool m_bMoveViewToPlayerNextThink; // 0xef9 | Schema_Builtin | Size: 0x1
			bool m_bCheckCSSClasses; // 0xefa | Schema_Builtin | Size: 0x1
			S2_PAD(0x5);
			GlobalTypes::CTransform m_anchorDeltaTransform; // 0xf00 | Schema_Atomic | Size: 0x20
			S2_PAD(0x178);
			client::CPointOffScreenIndicatorUi* m_pOffScreenIndicator; // 0x1098 | Schema_Ptr | Size: 0x8
			S2_PAD(0x20);
			bool m_bIgnoreInput; // 0x10c0 | Schema_Builtin | Size: 0x1
			bool m_bLit; // 0x10c1 | Schema_Builtin | Size: 0x1
			bool m_bFollowPlayerAcrossTeleport; // 0x10c2 | Schema_Builtin | Size: 0x1
			S2_PAD(0x1);
			float32 m_flWidth; // 0x10c4 | Schema_Builtin | Size: 0x4
			float32 m_flHeight; // 0x10c8 | Schema_Builtin | Size: 0x4
			float32 m_flDPI; // 0x10cc | Schema_Builtin | Size: 0x4
			float32 m_flInteractDistance; // 0x10d0 | Schema_Builtin | Size: 0x4
			float32 m_flDepthOffset; // 0x10d4 | Schema_Builtin | Size: 0x4
			uint32_t m_unOwnerContext; // 0x10d8 | Schema_Builtin | Size: 0x4
			uint32_t m_unHorizontalAlign; // 0x10dc | Schema_Builtin | Size: 0x4
			uint32_t m_unVerticalAlign; // 0x10e0 | Schema_Builtin | Size: 0x4
			uint32_t m_unOrientation; // 0x10e4 | Schema_Builtin | Size: 0x4
			bool m_bAllowInteractionFromAllSceneWorlds; // 0x10e8 | Schema_Builtin | Size: 0x1
			S2_PAD(0x7);
			// GlobalTypes::C_NetworkUtlVectorBase< GlobalTypes::CUtlSymbolLarge > m_vecCSSClasses; // 0x10f0 | Schema_Atomic | Size: 0x18
			char  m_vecCSSClasses[0x18]; // 0x10f0 | Schema_Atomic | Size: 0x18
			bool m_bOpaque; // 0x1108 | Schema_Builtin | Size: 0x1
			bool m_bNoDepth; // 0x1109 | Schema_Builtin | Size: 0x1
			bool m_bVisibleWhenParentNoDraw; // 0x110a | Schema_Builtin | Size: 0x1
			bool m_bRenderBackface; // 0x110b | Schema_Builtin | Size: 0x1
			bool m_bUseOffScreenIndicator; // 0x110c | Schema_Builtin | Size: 0x1
			bool m_bExcludeFromSaveGames; // 0x110d | Schema_Builtin | Size: 0x1
			bool m_bGrabbable; // 0x110e | Schema_Builtin | Size: 0x1
			bool m_bOnlyRenderToTexture; // 0x110f | Schema_Builtin | Size: 0x1
			bool m_bDisableMipGen; // 0x1110 | Schema_Builtin | Size: 0x1
			S2_PAD(0x3);
			int32_t m_nExplicitImageLayout; // 0x1114 | Schema_Builtin | Size: 0x4
			S2_PAD(0x8); // End padding
		};
		static_assert(offsetof(CS2::client::C_PointClientUIWorldPanel, m_bForceRecreateNextUpdate) == 0xEF8, "m_bForceRecreateNextUpdate in C_PointClientUIWorldPanel should be at offset 0xEF8");
		static_assert(offsetof(CS2::client::C_PointClientUIWorldPanel, m_bMoveViewToPlayerNextThink) == 0xEF9, "m_bMoveViewToPlayerNextThink in C_PointClientUIWorldPanel should be at offset 0xEF9");
		static_assert(offsetof(CS2::client::C_PointClientUIWorldPanel, m_bCheckCSSClasses) == 0xEFA, "m_bCheckCSSClasses in C_PointClientUIWorldPanel should be at offset 0xEFA");
		static_assert(offsetof(CS2::client::C_PointClientUIWorldPanel, m_anchorDeltaTransform) == 0xF00, "m_anchorDeltaTransform in C_PointClientUIWorldPanel should be at offset 0xF00");
		static_assert(offsetof(CS2::client::C_PointClientUIWorldPanel, m_pOffScreenIndicator) == 0x1098, "m_pOffScreenIndicator in C_PointClientUIWorldPanel should be at offset 0x1098");
		static_assert(offsetof(CS2::client::C_PointClientUIWorldPanel, m_bIgnoreInput) == 0x10C0, "m_bIgnoreInput in C_PointClientUIWorldPanel should be at offset 0x10C0");
		static_assert(offsetof(CS2::client::C_PointClientUIWorldPanel, m_bLit) == 0x10C1, "m_bLit in C_PointClientUIWorldPanel should be at offset 0x10C1");
		static_assert(offsetof(CS2::client::C_PointClientUIWorldPanel, m_bFollowPlayerAcrossTeleport) == 0x10C2, "m_bFollowPlayerAcrossTeleport in C_PointClientUIWorldPanel should be at offset 0x10C2");
		static_assert(offsetof(CS2::client::C_PointClientUIWorldPanel, m_flWidth) == 0x10C4, "m_flWidth in C_PointClientUIWorldPanel should be at offset 0x10C4");
		static_assert(offsetof(CS2::client::C_PointClientUIWorldPanel, m_flHeight) == 0x10C8, "m_flHeight in C_PointClientUIWorldPanel should be at offset 0x10C8");
		static_assert(offsetof(CS2::client::C_PointClientUIWorldPanel, m_flDPI) == 0x10CC, "m_flDPI in C_PointClientUIWorldPanel should be at offset 0x10CC");
		static_assert(offsetof(CS2::client::C_PointClientUIWorldPanel, m_flInteractDistance) == 0x10D0, "m_flInteractDistance in C_PointClientUIWorldPanel should be at offset 0x10D0");
		static_assert(offsetof(CS2::client::C_PointClientUIWorldPanel, m_flDepthOffset) == 0x10D4, "m_flDepthOffset in C_PointClientUIWorldPanel should be at offset 0x10D4");
		static_assert(offsetof(CS2::client::C_PointClientUIWorldPanel, m_unOwnerContext) == 0x10D8, "m_unOwnerContext in C_PointClientUIWorldPanel should be at offset 0x10D8");
		static_assert(offsetof(CS2::client::C_PointClientUIWorldPanel, m_unHorizontalAlign) == 0x10DC, "m_unHorizontalAlign in C_PointClientUIWorldPanel should be at offset 0x10DC");
		static_assert(offsetof(CS2::client::C_PointClientUIWorldPanel, m_unVerticalAlign) == 0x10E0, "m_unVerticalAlign in C_PointClientUIWorldPanel should be at offset 0x10E0");
		static_assert(offsetof(CS2::client::C_PointClientUIWorldPanel, m_unOrientation) == 0x10E4, "m_unOrientation in C_PointClientUIWorldPanel should be at offset 0x10E4");
		static_assert(offsetof(CS2::client::C_PointClientUIWorldPanel, m_bAllowInteractionFromAllSceneWorlds) == 0x10E8, "m_bAllowInteractionFromAllSceneWorlds in C_PointClientUIWorldPanel should be at offset 0x10E8");
		static_assert(offsetof(CS2::client::C_PointClientUIWorldPanel, m_vecCSSClasses) == 0x10F0, "m_vecCSSClasses in C_PointClientUIWorldPanel should be at offset 0x10F0");
		static_assert(offsetof(CS2::client::C_PointClientUIWorldPanel, m_bOpaque) == 0x1108, "m_bOpaque in C_PointClientUIWorldPanel should be at offset 0x1108");
		static_assert(offsetof(CS2::client::C_PointClientUIWorldPanel, m_bNoDepth) == 0x1109, "m_bNoDepth in C_PointClientUIWorldPanel should be at offset 0x1109");
		static_assert(offsetof(CS2::client::C_PointClientUIWorldPanel, m_bVisibleWhenParentNoDraw) == 0x110A, "m_bVisibleWhenParentNoDraw in C_PointClientUIWorldPanel should be at offset 0x110A");
		static_assert(offsetof(CS2::client::C_PointClientUIWorldPanel, m_bRenderBackface) == 0x110B, "m_bRenderBackface in C_PointClientUIWorldPanel should be at offset 0x110B");
		static_assert(offsetof(CS2::client::C_PointClientUIWorldPanel, m_bUseOffScreenIndicator) == 0x110C, "m_bUseOffScreenIndicator in C_PointClientUIWorldPanel should be at offset 0x110C");
		static_assert(offsetof(CS2::client::C_PointClientUIWorldPanel, m_bExcludeFromSaveGames) == 0x110D, "m_bExcludeFromSaveGames in C_PointClientUIWorldPanel should be at offset 0x110D");
		static_assert(offsetof(CS2::client::C_PointClientUIWorldPanel, m_bGrabbable) == 0x110E, "m_bGrabbable in C_PointClientUIWorldPanel should be at offset 0x110E");
		static_assert(offsetof(CS2::client::C_PointClientUIWorldPanel, m_bOnlyRenderToTexture) == 0x110F, "m_bOnlyRenderToTexture in C_PointClientUIWorldPanel should be at offset 0x110F");
		static_assert(offsetof(CS2::client::C_PointClientUIWorldPanel, m_bDisableMipGen) == 0x1110, "m_bDisableMipGen in C_PointClientUIWorldPanel should be at offset 0x1110");
		static_assert(offsetof(CS2::client::C_PointClientUIWorldPanel, m_nExplicitImageLayout) == 0x1114, "m_nExplicitImageLayout in C_PointClientUIWorldPanel should be at offset 0x1114");
		static_assert(sizeof(CS2::client::C_PointClientUIWorldPanel) == 0x1120, "C_PointClientUIWorldPanel size should be 0x1120");
	}
}
