// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#ifndef CUSTOM_GLOBAL_TYPES
	#include "../GlobalTypes.hpp"
#else
	#include <Custom/GlobalTypes.hpp>
#endif


#include "C_BaseClientUIEntity.hpp"



namespace CS2 {
	namespace client {
		class CPointOffScreenIndicatorUi;
	}
}


using namespace GlobalTypes;
namespace CS2 {
	namespace client {
		class C_PointClientUIWorldPanel : public CS2::client::C_BaseClientUIEntity {
		public:
			S2_PAD(0x8);
			bool m_bForceRecreateNextUpdate; // 0xec0 | Schema_Builtin | Size: 0x1
			bool m_bMoveViewToPlayerNextThink; // 0xec1 | Schema_Builtin | Size: 0x1
			bool m_bCheckCSSClasses; // 0xec2 | Schema_Builtin | Size: 0x1
			S2_PAD(0xd);
			GlobalTypes::CTransform m_anchorDeltaTransform; // 0xed0 | Schema_Atomic | Size: 0x20
			S2_PAD(0x170);
			client::CPointOffScreenIndicatorUi* m_pOffScreenIndicator; // 0x1060 | Schema_Ptr | Size: 0x8
			S2_PAD(0x20);
			bool m_bIgnoreInput; // 0x1088 | Schema_Builtin | Size: 0x1
			bool m_bLit; // 0x1089 | Schema_Builtin | Size: 0x1
			bool m_bFollowPlayerAcrossTeleport; // 0x108a | Schema_Builtin | Size: 0x1
			S2_PAD(0x1);
			float32 m_flWidth; // 0x108c | Schema_Builtin | Size: 0x4
			float32 m_flHeight; // 0x1090 | Schema_Builtin | Size: 0x4
			float32 m_flDPI; // 0x1094 | Schema_Builtin | Size: 0x4
			float32 m_flInteractDistance; // 0x1098 | Schema_Builtin | Size: 0x4
			float32 m_flDepthOffset; // 0x109c | Schema_Builtin | Size: 0x4
			uint32_t m_unOwnerContext; // 0x10a0 | Schema_Builtin | Size: 0x4
			uint32_t m_unHorizontalAlign; // 0x10a4 | Schema_Builtin | Size: 0x4
			uint32_t m_unVerticalAlign; // 0x10a8 | Schema_Builtin | Size: 0x4
			uint32_t m_unOrientation; // 0x10ac | Schema_Builtin | Size: 0x4
			bool m_bAllowInteractionFromAllSceneWorlds; // 0x10b0 | Schema_Builtin | Size: 0x1
			S2_PAD(0x7);
			// GlobalTypes::C_NetworkUtlVectorBase<GlobalTypes::CUtlSymbolLarge> m_vecCSSClasses; // 0x10b8 | Schema_Atomic | Size: 0x18
			char m_vecCSSClasses[0x18]; // 0x10b8 | Schema_Atomic | Size: 0x18
			bool m_bOpaque; // 0x10d0 | Schema_Builtin | Size: 0x1
			bool m_bNoDepth; // 0x10d1 | Schema_Builtin | Size: 0x1
			bool m_bVisibleWhenParentNoDraw; // 0x10d2 | Schema_Builtin | Size: 0x1
			bool m_bRenderBackface; // 0x10d3 | Schema_Builtin | Size: 0x1
			bool m_bUseOffScreenIndicator; // 0x10d4 | Schema_Builtin | Size: 0x1
			bool m_bExcludeFromSaveGames; // 0x10d5 | Schema_Builtin | Size: 0x1
			bool m_bGrabbable; // 0x10d6 | Schema_Builtin | Size: 0x1
			bool m_bOnlyRenderToTexture; // 0x10d7 | Schema_Builtin | Size: 0x1
			bool m_bDisableMipGen; // 0x10d8 | Schema_Builtin | Size: 0x1
			S2_PAD(0x3);
			int32_t m_nExplicitImageLayout; // 0x10dc | Schema_Builtin | Size: 0x4
		};
#ifdef USE_STATIC_ASSERTS
		static_assert(offsetof(CS2::client::C_PointClientUIWorldPanel, m_bForceRecreateNextUpdate) == 0xEC0, "m_bForceRecreateNextUpdate in C_PointClientUIWorldPanel should be at offset 0xEC0");
		static_assert(offsetof(CS2::client::C_PointClientUIWorldPanel, m_bMoveViewToPlayerNextThink) == 0xEC1, "m_bMoveViewToPlayerNextThink in C_PointClientUIWorldPanel should be at offset 0xEC1");
		static_assert(offsetof(CS2::client::C_PointClientUIWorldPanel, m_bCheckCSSClasses) == 0xEC2, "m_bCheckCSSClasses in C_PointClientUIWorldPanel should be at offset 0xEC2");
		static_assert(offsetof(CS2::client::C_PointClientUIWorldPanel, m_anchorDeltaTransform) == 0xED0, "m_anchorDeltaTransform in C_PointClientUIWorldPanel should be at offset 0xED0");
		static_assert(offsetof(CS2::client::C_PointClientUIWorldPanel, m_pOffScreenIndicator) == 0x1060, "m_pOffScreenIndicator in C_PointClientUIWorldPanel should be at offset 0x1060");
		static_assert(offsetof(CS2::client::C_PointClientUIWorldPanel, m_bIgnoreInput) == 0x1088, "m_bIgnoreInput in C_PointClientUIWorldPanel should be at offset 0x1088");
		static_assert(offsetof(CS2::client::C_PointClientUIWorldPanel, m_bLit) == 0x1089, "m_bLit in C_PointClientUIWorldPanel should be at offset 0x1089");
		static_assert(offsetof(CS2::client::C_PointClientUIWorldPanel, m_bFollowPlayerAcrossTeleport) == 0x108A, "m_bFollowPlayerAcrossTeleport in C_PointClientUIWorldPanel should be at offset 0x108A");
		static_assert(offsetof(CS2::client::C_PointClientUIWorldPanel, m_flWidth) == 0x108C, "m_flWidth in C_PointClientUIWorldPanel should be at offset 0x108C");
		static_assert(offsetof(CS2::client::C_PointClientUIWorldPanel, m_flHeight) == 0x1090, "m_flHeight in C_PointClientUIWorldPanel should be at offset 0x1090");
		static_assert(offsetof(CS2::client::C_PointClientUIWorldPanel, m_flDPI) == 0x1094, "m_flDPI in C_PointClientUIWorldPanel should be at offset 0x1094");
		static_assert(offsetof(CS2::client::C_PointClientUIWorldPanel, m_flInteractDistance) == 0x1098, "m_flInteractDistance in C_PointClientUIWorldPanel should be at offset 0x1098");
		static_assert(offsetof(CS2::client::C_PointClientUIWorldPanel, m_flDepthOffset) == 0x109C, "m_flDepthOffset in C_PointClientUIWorldPanel should be at offset 0x109C");
		static_assert(offsetof(CS2::client::C_PointClientUIWorldPanel, m_unOwnerContext) == 0x10A0, "m_unOwnerContext in C_PointClientUIWorldPanel should be at offset 0x10A0");
		static_assert(offsetof(CS2::client::C_PointClientUIWorldPanel, m_unHorizontalAlign) == 0x10A4, "m_unHorizontalAlign in C_PointClientUIWorldPanel should be at offset 0x10A4");
		static_assert(offsetof(CS2::client::C_PointClientUIWorldPanel, m_unVerticalAlign) == 0x10A8, "m_unVerticalAlign in C_PointClientUIWorldPanel should be at offset 0x10A8");
		static_assert(offsetof(CS2::client::C_PointClientUIWorldPanel, m_unOrientation) == 0x10AC, "m_unOrientation in C_PointClientUIWorldPanel should be at offset 0x10AC");
		static_assert(offsetof(CS2::client::C_PointClientUIWorldPanel, m_bAllowInteractionFromAllSceneWorlds) == 0x10B0, "m_bAllowInteractionFromAllSceneWorlds in C_PointClientUIWorldPanel should be at offset 0x10B0");
		static_assert(offsetof(CS2::client::C_PointClientUIWorldPanel, m_vecCSSClasses) == 0x10B8, "m_vecCSSClasses in C_PointClientUIWorldPanel should be at offset 0x10B8");
		static_assert(offsetof(CS2::client::C_PointClientUIWorldPanel, m_bOpaque) == 0x10D0, "m_bOpaque in C_PointClientUIWorldPanel should be at offset 0x10D0");
		static_assert(offsetof(CS2::client::C_PointClientUIWorldPanel, m_bNoDepth) == 0x10D1, "m_bNoDepth in C_PointClientUIWorldPanel should be at offset 0x10D1");
		static_assert(offsetof(CS2::client::C_PointClientUIWorldPanel, m_bVisibleWhenParentNoDraw) == 0x10D2, "m_bVisibleWhenParentNoDraw in C_PointClientUIWorldPanel should be at offset 0x10D2");
		static_assert(offsetof(CS2::client::C_PointClientUIWorldPanel, m_bRenderBackface) == 0x10D3, "m_bRenderBackface in C_PointClientUIWorldPanel should be at offset 0x10D3");
		static_assert(offsetof(CS2::client::C_PointClientUIWorldPanel, m_bUseOffScreenIndicator) == 0x10D4, "m_bUseOffScreenIndicator in C_PointClientUIWorldPanel should be at offset 0x10D4");
		static_assert(offsetof(CS2::client::C_PointClientUIWorldPanel, m_bExcludeFromSaveGames) == 0x10D5, "m_bExcludeFromSaveGames in C_PointClientUIWorldPanel should be at offset 0x10D5");
		static_assert(offsetof(CS2::client::C_PointClientUIWorldPanel, m_bGrabbable) == 0x10D6, "m_bGrabbable in C_PointClientUIWorldPanel should be at offset 0x10D6");
		static_assert(offsetof(CS2::client::C_PointClientUIWorldPanel, m_bOnlyRenderToTexture) == 0x10D7, "m_bOnlyRenderToTexture in C_PointClientUIWorldPanel should be at offset 0x10D7");
		static_assert(offsetof(CS2::client::C_PointClientUIWorldPanel, m_bDisableMipGen) == 0x10D8, "m_bDisableMipGen in C_PointClientUIWorldPanel should be at offset 0x10D8");
		static_assert(offsetof(CS2::client::C_PointClientUIWorldPanel, m_nExplicitImageLayout) == 0x10DC, "m_nExplicitImageLayout in C_PointClientUIWorldPanel should be at offset 0x10DC");
		static_assert(sizeof(CS2::client::C_PointClientUIWorldPanel) == 0x10E0, "C_PointClientUIWorldPanel size should be 0x10E0");

#endif
	}
}
