// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#ifndef CUSTOM_GLOBAL_TYPES
	#include "../GlobalTypes.hpp"
#else
	#include "../Custom/GlobalTypes.hpp"
#endif


#include "C_ModelPointEntity.hpp"
#include "PointWorldTextJustifyHorizontal_t.hpp"
#include "PointWorldTextJustifyVertical_t.hpp"
#include "PointWorldTextReorientMode_t.hpp"





using namespace GlobalTypes;
namespace CS2 {
	namespace client {
		class C_PointWorldText : public CS2::client::C_ModelPointEntity {
		public:
			S2_PAD(0x8);
			bool m_bForceRecreateNextUpdate; // 0xe90 | Schema_Builtin | Size: 0x1
			S2_PAD(0x17);
			int32_t m_nTextWidthPx; // 0xea8 | Schema_Builtin | Size: 0x4
			int32_t m_nTextHeightPx; // 0xeac | Schema_Builtin | Size: 0x4
			char m_messageText[512]; // 0xeb0 | Schema_FixedArray | Size: 0x200
			char m_FontName[64]; // 0x10b0 | Schema_FixedArray | Size: 0x40
			char m_BackgroundMaterialName[64]; // 0x10f0 | Schema_FixedArray | Size: 0x40
			bool m_bEnabled; // 0x1130 | Schema_Builtin | Size: 0x1
			bool m_bFullbright; // 0x1131 | Schema_Builtin | Size: 0x1
			S2_PAD(0x2);
			float32 m_flWorldUnitsPerPx; // 0x1134 | Schema_Builtin | Size: 0x4
			float32 m_flFontSize; // 0x1138 | Schema_Builtin | Size: 0x4
			float32 m_flDepthOffset; // 0x113c | Schema_Builtin | Size: 0x4
			bool m_bDrawBackground; // 0x1140 | Schema_Builtin | Size: 0x1
			S2_PAD(0x3);
			float32 m_flBackgroundBorderWidth; // 0x1144 | Schema_Builtin | Size: 0x4
			float32 m_flBackgroundBorderHeight; // 0x1148 | Schema_Builtin | Size: 0x4
			float32 m_flBackgroundWorldToUV; // 0x114c | Schema_Builtin | Size: 0x4
			GlobalTypes::Color m_Color; // 0x1150 | Schema_Atomic | Size: 0x4
			client::PointWorldTextJustifyHorizontal_t m_nJustifyHorizontal; // 0x1154 | Schema_DeclaredEnum | Size: 0x4
			client::PointWorldTextJustifyVertical_t m_nJustifyVertical; // 0x1158 | Schema_DeclaredEnum | Size: 0x4
			client::PointWorldTextReorientMode_t m_nReorientMode; // 0x115c | Schema_DeclaredEnum | Size: 0x4
		};
#ifdef USE_STATIC_ASSERTS
		static_assert(offsetof(CS2::client::C_PointWorldText, m_bForceRecreateNextUpdate) == 0xE90, "m_bForceRecreateNextUpdate in C_PointWorldText should be at offset 0xE90");
		static_assert(offsetof(CS2::client::C_PointWorldText, m_nTextWidthPx) == 0xEA8, "m_nTextWidthPx in C_PointWorldText should be at offset 0xEA8");
		static_assert(offsetof(CS2::client::C_PointWorldText, m_nTextHeightPx) == 0xEAC, "m_nTextHeightPx in C_PointWorldText should be at offset 0xEAC");
		static_assert(offsetof(CS2::client::C_PointWorldText, m_messageText) == 0xEB0, "m_messageText in C_PointWorldText should be at offset 0xEB0");
		static_assert(offsetof(CS2::client::C_PointWorldText, m_FontName) == 0x10B0, "m_FontName in C_PointWorldText should be at offset 0x10B0");
		static_assert(offsetof(CS2::client::C_PointWorldText, m_BackgroundMaterialName) == 0x10F0, "m_BackgroundMaterialName in C_PointWorldText should be at offset 0x10F0");
		static_assert(offsetof(CS2::client::C_PointWorldText, m_bEnabled) == 0x1130, "m_bEnabled in C_PointWorldText should be at offset 0x1130");
		static_assert(offsetof(CS2::client::C_PointWorldText, m_bFullbright) == 0x1131, "m_bFullbright in C_PointWorldText should be at offset 0x1131");
		static_assert(offsetof(CS2::client::C_PointWorldText, m_flWorldUnitsPerPx) == 0x1134, "m_flWorldUnitsPerPx in C_PointWorldText should be at offset 0x1134");
		static_assert(offsetof(CS2::client::C_PointWorldText, m_flFontSize) == 0x1138, "m_flFontSize in C_PointWorldText should be at offset 0x1138");
		static_assert(offsetof(CS2::client::C_PointWorldText, m_flDepthOffset) == 0x113C, "m_flDepthOffset in C_PointWorldText should be at offset 0x113C");
		static_assert(offsetof(CS2::client::C_PointWorldText, m_bDrawBackground) == 0x1140, "m_bDrawBackground in C_PointWorldText should be at offset 0x1140");
		static_assert(offsetof(CS2::client::C_PointWorldText, m_flBackgroundBorderWidth) == 0x1144, "m_flBackgroundBorderWidth in C_PointWorldText should be at offset 0x1144");
		static_assert(offsetof(CS2::client::C_PointWorldText, m_flBackgroundBorderHeight) == 0x1148, "m_flBackgroundBorderHeight in C_PointWorldText should be at offset 0x1148");
		static_assert(offsetof(CS2::client::C_PointWorldText, m_flBackgroundWorldToUV) == 0x114C, "m_flBackgroundWorldToUV in C_PointWorldText should be at offset 0x114C");
		static_assert(offsetof(CS2::client::C_PointWorldText, m_Color) == 0x1150, "m_Color in C_PointWorldText should be at offset 0x1150");
		static_assert(offsetof(CS2::client::C_PointWorldText, m_nJustifyHorizontal) == 0x1154, "m_nJustifyHorizontal in C_PointWorldText should be at offset 0x1154");
		static_assert(offsetof(CS2::client::C_PointWorldText, m_nJustifyVertical) == 0x1158, "m_nJustifyVertical in C_PointWorldText should be at offset 0x1158");
		static_assert(offsetof(CS2::client::C_PointWorldText, m_nReorientMode) == 0x115C, "m_nReorientMode in C_PointWorldText should be at offset 0x115C");
		static_assert(sizeof(CS2::client::C_PointWorldText) == 0x1160, "C_PointWorldText size should be 0x1160");

#endif
	}
}
