// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#ifndef CUSTOM_GLOBAL_TYPES
	#include "../GlobalTypes.hpp"
#else
	#include "../Custom/GlobalTypes.hpp"
#endif


#include "C_BaseClientUIEntity.hpp"





using namespace GlobalTypes;
namespace CS2 {
	namespace client {
		class C_PointClientUIHUD : public CS2::client::C_BaseClientUIEntity {
		public:
			S2_PAD(0x8);
			bool m_bCheckCSSClasses; // 0xec0 | Schema_Builtin | Size: 0x1
			S2_PAD(0x177);
			bool m_bIgnoreInput; // 0x1038 | Schema_Builtin | Size: 0x1
			S2_PAD(0x3);
			float32 m_flWidth; // 0x103c | Schema_Builtin | Size: 0x4
			float32 m_flHeight; // 0x1040 | Schema_Builtin | Size: 0x4
			float32 m_flDPI; // 0x1044 | Schema_Builtin | Size: 0x4
			float32 m_flInteractDistance; // 0x1048 | Schema_Builtin | Size: 0x4
			float32 m_flDepthOffset; // 0x104c | Schema_Builtin | Size: 0x4
			uint32_t m_unOwnerContext; // 0x1050 | Schema_Builtin | Size: 0x4
			uint32_t m_unHorizontalAlign; // 0x1054 | Schema_Builtin | Size: 0x4
			uint32_t m_unVerticalAlign; // 0x1058 | Schema_Builtin | Size: 0x4
			uint32_t m_unOrientation; // 0x105c | Schema_Builtin | Size: 0x4
			bool m_bAllowInteractionFromAllSceneWorlds; // 0x1060 | Schema_Builtin | Size: 0x1
			S2_PAD(0x7);
			// GlobalTypes::C_NetworkUtlVectorBase<GlobalTypes::CUtlSymbolLarge> m_vecCSSClasses; // 0x1068 | Schema_Atomic | Size: 0x18
			char m_vecCSSClasses[0x18]; // 0x1068 | Schema_Atomic | Size: 0x18
		};
		static_assert(offsetof(CS2::client::C_PointClientUIHUD, m_bCheckCSSClasses) == 0xEC0, "m_bCheckCSSClasses in C_PointClientUIHUD should be at offset 0xEC0");
		static_assert(offsetof(CS2::client::C_PointClientUIHUD, m_bIgnoreInput) == 0x1038, "m_bIgnoreInput in C_PointClientUIHUD should be at offset 0x1038");
		static_assert(offsetof(CS2::client::C_PointClientUIHUD, m_flWidth) == 0x103C, "m_flWidth in C_PointClientUIHUD should be at offset 0x103C");
		static_assert(offsetof(CS2::client::C_PointClientUIHUD, m_flHeight) == 0x1040, "m_flHeight in C_PointClientUIHUD should be at offset 0x1040");
		static_assert(offsetof(CS2::client::C_PointClientUIHUD, m_flDPI) == 0x1044, "m_flDPI in C_PointClientUIHUD should be at offset 0x1044");
		static_assert(offsetof(CS2::client::C_PointClientUIHUD, m_flInteractDistance) == 0x1048, "m_flInteractDistance in C_PointClientUIHUD should be at offset 0x1048");
		static_assert(offsetof(CS2::client::C_PointClientUIHUD, m_flDepthOffset) == 0x104C, "m_flDepthOffset in C_PointClientUIHUD should be at offset 0x104C");
		static_assert(offsetof(CS2::client::C_PointClientUIHUD, m_unOwnerContext) == 0x1050, "m_unOwnerContext in C_PointClientUIHUD should be at offset 0x1050");
		static_assert(offsetof(CS2::client::C_PointClientUIHUD, m_unHorizontalAlign) == 0x1054, "m_unHorizontalAlign in C_PointClientUIHUD should be at offset 0x1054");
		static_assert(offsetof(CS2::client::C_PointClientUIHUD, m_unVerticalAlign) == 0x1058, "m_unVerticalAlign in C_PointClientUIHUD should be at offset 0x1058");
		static_assert(offsetof(CS2::client::C_PointClientUIHUD, m_unOrientation) == 0x105C, "m_unOrientation in C_PointClientUIHUD should be at offset 0x105C");
		static_assert(offsetof(CS2::client::C_PointClientUIHUD, m_bAllowInteractionFromAllSceneWorlds) == 0x1060, "m_bAllowInteractionFromAllSceneWorlds in C_PointClientUIHUD should be at offset 0x1060");
		static_assert(offsetof(CS2::client::C_PointClientUIHUD, m_vecCSSClasses) == 0x1068, "m_vecCSSClasses in C_PointClientUIHUD should be at offset 0x1068");
		static_assert(sizeof(CS2::client::C_PointClientUIHUD) == 0x1080, "C_PointClientUIHUD size should be 0x1080");
	}
}
