// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#ifndef CUSTOM_GLOBAL_TYPES
	#include "../GlobalTypes.hpp"
#else
	#include <Custom/GlobalTypes.hpp>
#endif


#include "C_BaseTrigger.hpp"
#include "TimedEvent.hpp"





using namespace GlobalTypes;
namespace CS2 {
	namespace client {
		class C_Precipitation : public CS2::client::C_BaseTrigger {
		public:
			float32 m_flDensity; // 0xf58 | Schema_Builtin | Size: 0x4
			S2_PAD(0xc);
			float32 m_flParticleInnerDist; // 0xf68 | Schema_Builtin | Size: 0x4
			S2_PAD(0x4);
			char* m_pParticleDef; // 0xf70 | Schema_Ptr | Size: 0x8
			S2_PAD(0x20);
			client::TimedEvent m_tParticlePrecipTraceTimer[1]; // 0xf98 | Schema_FixedArray | Size: 0x8
			bool m_bActiveParticlePrecipEmitter[1]; // 0xfa0 | Schema_FixedArray | Size: 0x1
			bool m_bParticlePrecipInitialized; // 0xfa1 | Schema_Builtin | Size: 0x1
			bool m_bHasSimulatedSinceLastSceneObjectUpdate; // 0xfa2 | Schema_Builtin | Size: 0x1
			S2_PAD(0x1);
			int32_t m_nAvailableSheetSequencesMaxIndex; // 0xfa4 | Schema_Builtin | Size: 0x4
		};
#ifdef USE_STATIC_ASSERTS
		static_assert(offsetof(CS2::client::C_Precipitation, m_flDensity) == 0xF58, "m_flDensity in C_Precipitation should be at offset 0xF58");
		static_assert(offsetof(CS2::client::C_Precipitation, m_flParticleInnerDist) == 0xF68, "m_flParticleInnerDist in C_Precipitation should be at offset 0xF68");
		static_assert(offsetof(CS2::client::C_Precipitation, m_pParticleDef) == 0xF70, "m_pParticleDef in C_Precipitation should be at offset 0xF70");
		static_assert(offsetof(CS2::client::C_Precipitation, m_tParticlePrecipTraceTimer) == 0xF98, "m_tParticlePrecipTraceTimer in C_Precipitation should be at offset 0xF98");
		static_assert(offsetof(CS2::client::C_Precipitation, m_bActiveParticlePrecipEmitter) == 0xFA0, "m_bActiveParticlePrecipEmitter in C_Precipitation should be at offset 0xFA0");
		static_assert(offsetof(CS2::client::C_Precipitation, m_bParticlePrecipInitialized) == 0xFA1, "m_bParticlePrecipInitialized in C_Precipitation should be at offset 0xFA1");
		static_assert(offsetof(CS2::client::C_Precipitation, m_bHasSimulatedSinceLastSceneObjectUpdate) == 0xFA2, "m_bHasSimulatedSinceLastSceneObjectUpdate in C_Precipitation should be at offset 0xFA2");
		static_assert(offsetof(CS2::client::C_Precipitation, m_nAvailableSheetSequencesMaxIndex) == 0xFA4, "m_nAvailableSheetSequencesMaxIndex in C_Precipitation should be at offset 0xFA4");
		static_assert(sizeof(CS2::client::C_Precipitation) == 0xFA8, "C_Precipitation size should be 0xFA8");

#endif
	}
}
