// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#ifndef CUSTOM_GLOBAL_TYPES
	#include "../GlobalTypes.hpp"
#else
	#include "../Custom/GlobalTypes.hpp"
#endif


#include "C_BaseModelEntity.hpp"
#include "../modellib/AttachmentHandle_t.hpp"
#include "C_RopeKeyframe_CPhysicsDelegate.hpp"



namespace CS2 {
	namespace client {
		class C_BaseEntity;
	}
}


using namespace GlobalTypes;
namespace CS2 {
	namespace client {
		class C_RopeKeyframe : public CS2::client::C_BaseModelEntity {
		public:
			S2_PAD(0x8);
			// GlobalTypes::CBitVec< 10 > m_LinksTouchingSomething; // 0xe90 | Schema_Atomic | Size: 0x4
			char m_LinksTouchingSomething[0x4]; // 0xe90 | Schema_Atomic | Size: 0x4
			int32_t m_nLinksTouchingSomething; // 0xe94 | Schema_Builtin | Size: 0x4
			bool m_bApplyWind; // 0xe98 | Schema_Builtin | Size: 0x1
			S2_PAD(0x3);
			int32_t m_fPrevLockedPoints; // 0xe9c | Schema_Builtin | Size: 0x4
			int32_t m_iForcePointMoveCounter; // 0xea0 | Schema_Builtin | Size: 0x4
			bool m_bPrevEndPointPos[2]; // 0xea4 | Schema_FixedArray | Size: 0x2
			S2_PAD(0x2);
			GlobalTypes::Vector m_vPrevEndPointPos[2]; // 0xea8 | Schema_FixedArray | Size: 0x18
			float32 m_flCurScroll; // 0xec0 | Schema_Builtin | Size: 0x4
			float32 m_flScrollSpeed; // 0xec4 | Schema_Builtin | Size: 0x4
			uint16_t m_RopeFlags; // 0xec8 | Schema_Builtin | Size: 0x2
			S2_PAD(0x6);
			// GlobalTypes::CStrongHandle<resourcesystem::InfoForResourceTypeIMaterial2> m_iRopeMaterialModelIndex; // 0xed0 | Schema_Atomic | Size: 0x8
			char m_iRopeMaterialModelIndex[0x8]; // 0xed0 | Schema_Atomic | Size: 0x8
			S2_PAD(0x270);
			uint8_t m_nSegments; // 0x1148 | Schema_Builtin | Size: 0x1
			S2_PAD(0x3);
			GlobalTypes::CHandle<client::C_BaseEntity> m_hStartPoint; // 0x114c | Schema_Atomic | Size: 0x4
			// char m_hStartPoint[0x4]; // 0x114c | Schema_Atomic | Size: 0x4
			GlobalTypes::CHandle<client::C_BaseEntity> m_hEndPoint; // 0x1150 | Schema_Atomic | Size: 0x4
			// char m_hEndPoint[0x4]; // 0x1150 | Schema_Atomic | Size: 0x4
			modellib::AttachmentHandle_t m_iStartAttachment; // 0x1154 | Schema_DeclaredClass | Size: 0x1
			modellib::AttachmentHandle_t m_iEndAttachment; // 0x1155 | Schema_DeclaredClass | Size: 0x1
			uint8_t m_Subdiv; // 0x1156 | Schema_Builtin | Size: 0x1
			S2_PAD(0x1);
			int16_t m_RopeLength; // 0x1158 | Schema_Builtin | Size: 0x2
			int16_t m_Slack; // 0x115a | Schema_Builtin | Size: 0x2
			float32 m_TextureScale; // 0x115c | Schema_Builtin | Size: 0x4
			uint8_t m_fLockedPoints; // 0x1160 | Schema_Builtin | Size: 0x1
			uint8_t m_nChangeCount; // 0x1161 | Schema_Builtin | Size: 0x1
			S2_PAD(0x2);
			float32 m_Width; // 0x1164 | Schema_Builtin | Size: 0x4
			client::C_RopeKeyframe_CPhysicsDelegate m_PhysicsDelegate; // 0x1168 | Schema_DeclaredClass | Size: 0x10
			// GlobalTypes::CStrongHandle<resourcesystem::InfoForResourceTypeIMaterial2> m_hMaterial; // 0x1178 | Schema_Atomic | Size: 0x8
			char m_hMaterial[0x8]; // 0x1178 | Schema_Atomic | Size: 0x8
			int32_t m_TextureHeight; // 0x1180 | Schema_Builtin | Size: 0x4
			GlobalTypes::Vector m_vecImpulse; // 0x1184 | Schema_Atomic | Size: 0xc
			GlobalTypes::Vector m_vecPreviousImpulse; // 0x1190 | Schema_Atomic | Size: 0xc
			float32 m_flCurrentGustTimer; // 0x119c | Schema_Builtin | Size: 0x4
			float32 m_flCurrentGustLifetime; // 0x11a0 | Schema_Builtin | Size: 0x4
			float32 m_flTimeToNextGust; // 0x11a4 | Schema_Builtin | Size: 0x4
			GlobalTypes::Vector m_vWindDir; // 0x11a8 | Schema_Atomic | Size: 0xc
			GlobalTypes::Vector m_vColorMod; // 0x11b4 | Schema_Atomic | Size: 0xc
			GlobalTypes::Vector m_vCachedEndPointAttachmentPos[2]; // 0x11c0 | Schema_FixedArray | Size: 0x18
			GlobalTypes::QAngle m_vCachedEndPointAttachmentAngle[2]; // 0x11d8 | Schema_FixedArray | Size: 0x18
			bool m_bConstrainBetweenEndpoints; // 0x11f0 | Schema_Builtin | Size: 0x1
			S2_PAD(0x7); // End padding
		};
#ifdef USE_STATIC_ASSERTS
		static_assert(offsetof(CS2::client::C_RopeKeyframe, m_LinksTouchingSomething) == 0xE90, "m_LinksTouchingSomething in C_RopeKeyframe should be at offset 0xE90");
		static_assert(offsetof(CS2::client::C_RopeKeyframe, m_nLinksTouchingSomething) == 0xE94, "m_nLinksTouchingSomething in C_RopeKeyframe should be at offset 0xE94");
		static_assert(offsetof(CS2::client::C_RopeKeyframe, m_bApplyWind) == 0xE98, "m_bApplyWind in C_RopeKeyframe should be at offset 0xE98");
		static_assert(offsetof(CS2::client::C_RopeKeyframe, m_fPrevLockedPoints) == 0xE9C, "m_fPrevLockedPoints in C_RopeKeyframe should be at offset 0xE9C");
		static_assert(offsetof(CS2::client::C_RopeKeyframe, m_iForcePointMoveCounter) == 0xEA0, "m_iForcePointMoveCounter in C_RopeKeyframe should be at offset 0xEA0");
		static_assert(offsetof(CS2::client::C_RopeKeyframe, m_bPrevEndPointPos) == 0xEA4, "m_bPrevEndPointPos in C_RopeKeyframe should be at offset 0xEA4");
		static_assert(offsetof(CS2::client::C_RopeKeyframe, m_vPrevEndPointPos) == 0xEA8, "m_vPrevEndPointPos in C_RopeKeyframe should be at offset 0xEA8");
		static_assert(offsetof(CS2::client::C_RopeKeyframe, m_flCurScroll) == 0xEC0, "m_flCurScroll in C_RopeKeyframe should be at offset 0xEC0");
		static_assert(offsetof(CS2::client::C_RopeKeyframe, m_flScrollSpeed) == 0xEC4, "m_flScrollSpeed in C_RopeKeyframe should be at offset 0xEC4");
		static_assert(offsetof(CS2::client::C_RopeKeyframe, m_RopeFlags) == 0xEC8, "m_RopeFlags in C_RopeKeyframe should be at offset 0xEC8");
		static_assert(offsetof(CS2::client::C_RopeKeyframe, m_iRopeMaterialModelIndex) == 0xED0, "m_iRopeMaterialModelIndex in C_RopeKeyframe should be at offset 0xED0");
		static_assert(offsetof(CS2::client::C_RopeKeyframe, m_nSegments) == 0x1148, "m_nSegments in C_RopeKeyframe should be at offset 0x1148");
		static_assert(offsetof(CS2::client::C_RopeKeyframe, m_hStartPoint) == 0x114C, "m_hStartPoint in C_RopeKeyframe should be at offset 0x114C");
		static_assert(offsetof(CS2::client::C_RopeKeyframe, m_hEndPoint) == 0x1150, "m_hEndPoint in C_RopeKeyframe should be at offset 0x1150");
		static_assert(offsetof(CS2::client::C_RopeKeyframe, m_iStartAttachment) == 0x1154, "m_iStartAttachment in C_RopeKeyframe should be at offset 0x1154");
		static_assert(offsetof(CS2::client::C_RopeKeyframe, m_iEndAttachment) == 0x1155, "m_iEndAttachment in C_RopeKeyframe should be at offset 0x1155");
		static_assert(offsetof(CS2::client::C_RopeKeyframe, m_Subdiv) == 0x1156, "m_Subdiv in C_RopeKeyframe should be at offset 0x1156");
		static_assert(offsetof(CS2::client::C_RopeKeyframe, m_RopeLength) == 0x1158, "m_RopeLength in C_RopeKeyframe should be at offset 0x1158");
		static_assert(offsetof(CS2::client::C_RopeKeyframe, m_Slack) == 0x115A, "m_Slack in C_RopeKeyframe should be at offset 0x115A");
		static_assert(offsetof(CS2::client::C_RopeKeyframe, m_TextureScale) == 0x115C, "m_TextureScale in C_RopeKeyframe should be at offset 0x115C");
		static_assert(offsetof(CS2::client::C_RopeKeyframe, m_fLockedPoints) == 0x1160, "m_fLockedPoints in C_RopeKeyframe should be at offset 0x1160");
		static_assert(offsetof(CS2::client::C_RopeKeyframe, m_nChangeCount) == 0x1161, "m_nChangeCount in C_RopeKeyframe should be at offset 0x1161");
		static_assert(offsetof(CS2::client::C_RopeKeyframe, m_Width) == 0x1164, "m_Width in C_RopeKeyframe should be at offset 0x1164");
		static_assert(offsetof(CS2::client::C_RopeKeyframe, m_PhysicsDelegate) == 0x1168, "m_PhysicsDelegate in C_RopeKeyframe should be at offset 0x1168");
		static_assert(offsetof(CS2::client::C_RopeKeyframe, m_hMaterial) == 0x1178, "m_hMaterial in C_RopeKeyframe should be at offset 0x1178");
		static_assert(offsetof(CS2::client::C_RopeKeyframe, m_TextureHeight) == 0x1180, "m_TextureHeight in C_RopeKeyframe should be at offset 0x1180");
		static_assert(offsetof(CS2::client::C_RopeKeyframe, m_vecImpulse) == 0x1184, "m_vecImpulse in C_RopeKeyframe should be at offset 0x1184");
		static_assert(offsetof(CS2::client::C_RopeKeyframe, m_vecPreviousImpulse) == 0x1190, "m_vecPreviousImpulse in C_RopeKeyframe should be at offset 0x1190");
		static_assert(offsetof(CS2::client::C_RopeKeyframe, m_flCurrentGustTimer) == 0x119C, "m_flCurrentGustTimer in C_RopeKeyframe should be at offset 0x119C");
		static_assert(offsetof(CS2::client::C_RopeKeyframe, m_flCurrentGustLifetime) == 0x11A0, "m_flCurrentGustLifetime in C_RopeKeyframe should be at offset 0x11A0");
		static_assert(offsetof(CS2::client::C_RopeKeyframe, m_flTimeToNextGust) == 0x11A4, "m_flTimeToNextGust in C_RopeKeyframe should be at offset 0x11A4");
		static_assert(offsetof(CS2::client::C_RopeKeyframe, m_vWindDir) == 0x11A8, "m_vWindDir in C_RopeKeyframe should be at offset 0x11A8");
		static_assert(offsetof(CS2::client::C_RopeKeyframe, m_vColorMod) == 0x11B4, "m_vColorMod in C_RopeKeyframe should be at offset 0x11B4");
		static_assert(offsetof(CS2::client::C_RopeKeyframe, m_vCachedEndPointAttachmentPos) == 0x11C0, "m_vCachedEndPointAttachmentPos in C_RopeKeyframe should be at offset 0x11C0");
		static_assert(offsetof(CS2::client::C_RopeKeyframe, m_vCachedEndPointAttachmentAngle) == 0x11D8, "m_vCachedEndPointAttachmentAngle in C_RopeKeyframe should be at offset 0x11D8");
		static_assert(offsetof(CS2::client::C_RopeKeyframe, m_bConstrainBetweenEndpoints) == 0x11F0, "m_bConstrainBetweenEndpoints in C_RopeKeyframe should be at offset 0x11F0");
		static_assert(sizeof(CS2::client::C_RopeKeyframe) == 0x11F8, "C_RopeKeyframe size should be 0x11F8");

#endif
	}
}
