// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#ifndef CUSTOM_GLOBAL_TYPES
	#include <SDK/GlobalTypes.hpp>
#else
	#include <Custom/GlobalTypes.hpp>
#endif


#include <SDK/client/C_PointEntity.hpp>
#include <SDK/client/C_BaseFlex.hpp>
#include <SDK/client/QueuedEvents_t.hpp>





using namespace GlobalTypes;
namespace CS2 {
	namespace client {
		class C_SceneEntity : public CS2::client::C_PointEntity {
		public:
			S2_PAD(0x8);
			bool m_bIsPlayingBack; // 0x610 | Schema_Builtin | Size: 0x1
			bool m_bPaused; // 0x611 | Schema_Builtin | Size: 0x1
			bool m_bMultiplayer; // 0x612 | Schema_Builtin | Size: 0x1
			bool m_bAutogenerated; // 0x613 | Schema_Builtin | Size: 0x1
			float32 m_flForceClientTime; // 0x614 | Schema_Builtin | Size: 0x4
			uint16_t m_nSceneStringIndex; // 0x618 | Schema_Builtin | Size: 0x2
			bool m_bClientOnly; // 0x61a | Schema_Builtin | Size: 0x1
			S2_PAD(0x1);
			GlobalTypes::CHandle<client::C_BaseFlex> m_hOwner; // 0x61c | Schema_Atomic | Size: 0x4
			// char m_hOwner[0x4]; // 0x61c | Schema_Atomic | Size: 0x4
			// client::C_NetworkUtlVectorBase<GlobalTypes::CHandle<client::C_BaseFlex>> m_hActorList; // 0x620 | Schema_Atomic | Size: 0x18
			char m_hActorList[0x18]; // 0x620 | Schema_Atomic | Size: 0x18
			bool m_bWasPlaying; // 0x638 | Schema_Builtin | Size: 0x1
			S2_PAD(0xf);
			GlobalTypes::CUtlVector<client::QueuedEvents_t> m_QueuedEvents; // 0x648 | Schema_Atomic | Size: 0x18
			// char m_QueuedEvents[0x18]; // 0x648 | Schema_Atomic | Size: 0x18
			float32 m_flCurrentTime; // 0x660 | Schema_Builtin | Size: 0x4
			S2_PAD(0x4); // End padding
		};
		static_assert(offsetof(CS2::client::C_SceneEntity, m_bIsPlayingBack) == 0x610, "m_bIsPlayingBack in C_SceneEntity should be at offset 0x610");
		static_assert(offsetof(CS2::client::C_SceneEntity, m_bPaused) == 0x611, "m_bPaused in C_SceneEntity should be at offset 0x611");
		static_assert(offsetof(CS2::client::C_SceneEntity, m_bMultiplayer) == 0x612, "m_bMultiplayer in C_SceneEntity should be at offset 0x612");
		static_assert(offsetof(CS2::client::C_SceneEntity, m_bAutogenerated) == 0x613, "m_bAutogenerated in C_SceneEntity should be at offset 0x613");
		static_assert(offsetof(CS2::client::C_SceneEntity, m_flForceClientTime) == 0x614, "m_flForceClientTime in C_SceneEntity should be at offset 0x614");
		static_assert(offsetof(CS2::client::C_SceneEntity, m_nSceneStringIndex) == 0x618, "m_nSceneStringIndex in C_SceneEntity should be at offset 0x618");
		static_assert(offsetof(CS2::client::C_SceneEntity, m_bClientOnly) == 0x61A, "m_bClientOnly in C_SceneEntity should be at offset 0x61A");
		static_assert(offsetof(CS2::client::C_SceneEntity, m_hOwner) == 0x61C, "m_hOwner in C_SceneEntity should be at offset 0x61C");
		static_assert(offsetof(CS2::client::C_SceneEntity, m_hActorList) == 0x620, "m_hActorList in C_SceneEntity should be at offset 0x620");
		static_assert(offsetof(CS2::client::C_SceneEntity, m_bWasPlaying) == 0x638, "m_bWasPlaying in C_SceneEntity should be at offset 0x638");
		static_assert(offsetof(CS2::client::C_SceneEntity, m_QueuedEvents) == 0x648, "m_QueuedEvents in C_SceneEntity should be at offset 0x648");
		static_assert(offsetof(CS2::client::C_SceneEntity, m_flCurrentTime) == 0x660, "m_flCurrentTime in C_SceneEntity should be at offset 0x660");
		static_assert(sizeof(CS2::client::C_SceneEntity) == 0x668, "C_SceneEntity size should be 0x668");
	}
}
