// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#ifndef CUSTOM_GLOBAL_TYPES
	#include <SDK/GlobalTypes.hpp>
#else
	#include <Custom/GlobalTypes.hpp>
#endif


#include <SDK/client/C_BaseModelEntity.hpp>





using namespace GlobalTypes;
namespace CS2 {
	namespace client {
		class C_TextureBasedAnimatable : public CS2::client::C_BaseModelEntity {
		public:
			bool m_bLoop; // 0xe88 | Schema_Builtin | Size: 0x1
			S2_PAD(0x3);
			float32 m_flFPS; // 0xe8c | Schema_Builtin | Size: 0x4
			// GlobalTypes::CStrongHandle<resourcesystem::InfoForResourceTypeCTextureBase> m_hPositionKeys; // 0xe90 | Schema_Atomic | Size: 0x8
			char m_hPositionKeys[0x8]; // 0xe90 | Schema_Atomic | Size: 0x8
			// GlobalTypes::CStrongHandle<resourcesystem::InfoForResourceTypeCTextureBase> m_hRotationKeys; // 0xe98 | Schema_Atomic | Size: 0x8
			char m_hRotationKeys[0x8]; // 0xe98 | Schema_Atomic | Size: 0x8
			GlobalTypes::Vector m_vAnimationBoundsMin; // 0xea0 | Schema_Atomic | Size: 0xc
			GlobalTypes::Vector m_vAnimationBoundsMax; // 0xeac | Schema_Atomic | Size: 0xc
			float32 m_flStartTime; // 0xeb8 | Schema_Builtin | Size: 0x4
			float32 m_flStartFrame; // 0xebc | Schema_Builtin | Size: 0x4
		};
		static_assert(offsetof(CS2::client::C_TextureBasedAnimatable, m_bLoop) == 0xE88, "m_bLoop in C_TextureBasedAnimatable should be at offset 0xE88");
		static_assert(offsetof(CS2::client::C_TextureBasedAnimatable, m_flFPS) == 0xE8C, "m_flFPS in C_TextureBasedAnimatable should be at offset 0xE8C");
		static_assert(offsetof(CS2::client::C_TextureBasedAnimatable, m_hPositionKeys) == 0xE90, "m_hPositionKeys in C_TextureBasedAnimatable should be at offset 0xE90");
		static_assert(offsetof(CS2::client::C_TextureBasedAnimatable, m_hRotationKeys) == 0xE98, "m_hRotationKeys in C_TextureBasedAnimatable should be at offset 0xE98");
		static_assert(offsetof(CS2::client::C_TextureBasedAnimatable, m_vAnimationBoundsMin) == 0xEA0, "m_vAnimationBoundsMin in C_TextureBasedAnimatable should be at offset 0xEA0");
		static_assert(offsetof(CS2::client::C_TextureBasedAnimatable, m_vAnimationBoundsMax) == 0xEAC, "m_vAnimationBoundsMax in C_TextureBasedAnimatable should be at offset 0xEAC");
		static_assert(offsetof(CS2::client::C_TextureBasedAnimatable, m_flStartTime) == 0xEB8, "m_flStartTime in C_TextureBasedAnimatable should be at offset 0xEB8");
		static_assert(offsetof(CS2::client::C_TextureBasedAnimatable, m_flStartFrame) == 0xEBC, "m_flStartFrame in C_TextureBasedAnimatable should be at offset 0xEBC");
		static_assert(sizeof(CS2::client::C_TextureBasedAnimatable) == 0xEC0, "C_TextureBasedAnimatable size should be 0xEC0");
	}
}
