// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#ifndef CUSTOM_GLOBAL_TYPES
	#include <SDK/GlobalTypes.hpp>
#else
	#include <Custom/GlobalTypes.hpp>
#endif


#include <SDK/client/C_BaseEntity.hpp>





using namespace GlobalTypes;
namespace CS2 {
	namespace client {
		class C_TonemapController2 : public CS2::client::C_BaseEntity {
		public:
			float32 m_flAutoExposureMin; // 0x608 | Schema_Builtin | Size: 0x4
			float32 m_flAutoExposureMax; // 0x60c | Schema_Builtin | Size: 0x4
			float32 m_flExposureAdaptationSpeedUp; // 0x610 | Schema_Builtin | Size: 0x4
			float32 m_flExposureAdaptationSpeedDown; // 0x614 | Schema_Builtin | Size: 0x4
			float32 m_flTonemapEVSmoothingRange; // 0x618 | Schema_Builtin | Size: 0x4
			S2_PAD(0x4); // End padding
		};
		static_assert(offsetof(CS2::client::C_TonemapController2, m_flAutoExposureMin) == 0x608, "m_flAutoExposureMin in C_TonemapController2 should be at offset 0x608");
		static_assert(offsetof(CS2::client::C_TonemapController2, m_flAutoExposureMax) == 0x60C, "m_flAutoExposureMax in C_TonemapController2 should be at offset 0x60C");
		static_assert(offsetof(CS2::client::C_TonemapController2, m_flExposureAdaptationSpeedUp) == 0x610, "m_flExposureAdaptationSpeedUp in C_TonemapController2 should be at offset 0x610");
		static_assert(offsetof(CS2::client::C_TonemapController2, m_flExposureAdaptationSpeedDown) == 0x614, "m_flExposureAdaptationSpeedDown in C_TonemapController2 should be at offset 0x614");
		static_assert(offsetof(CS2::client::C_TonemapController2, m_flTonemapEVSmoothingRange) == 0x618, "m_flTonemapEVSmoothingRange in C_TonemapController2 should be at offset 0x618");
		static_assert(sizeof(CS2::client::C_TonemapController2) == 0x620, "C_TonemapController2 size should be 0x620");
	}
}
