// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#ifndef CUSTOM_GLOBAL_TYPES
	#include "../GlobalTypes.hpp"
#else
	#include "../Custom/GlobalTypes.hpp"
#endif


#include "CBaseAnimGraph.hpp"





using namespace GlobalTypes;
namespace CS2 {
	namespace client {
		class CBaseProp : public CS2::client::CBaseAnimGraph {
		public:
			bool m_bModelOverrodeBlockLOS; // 0x1168 | Schema_Builtin | Size: 0x1
			S2_PAD(0x3);
			int32_t m_iShapeType; // 0x116c | Schema_Builtin | Size: 0x4
			bool m_bConformToCollisionBounds; // 0x1170 | Schema_Builtin | Size: 0x1
			S2_PAD(0xf);
			GlobalTypes::CTransform m_mPreferredCatchTransform; // 0x1180 | Schema_Atomic | Size: 0x20
		};
		static_assert(offsetof(CS2::client::CBaseProp, m_bModelOverrodeBlockLOS) == 0x1168, "m_bModelOverrodeBlockLOS in CBaseProp should be at offset 0x1168");
		static_assert(offsetof(CS2::client::CBaseProp, m_iShapeType) == 0x116C, "m_iShapeType in CBaseProp should be at offset 0x116C");
		static_assert(offsetof(CS2::client::CBaseProp, m_bConformToCollisionBounds) == 0x1170, "m_bConformToCollisionBounds in CBaseProp should be at offset 0x1170");
		static_assert(offsetof(CS2::client::CBaseProp, m_mPreferredCatchTransform) == 0x1180, "m_mPreferredCatchTransform in CBaseProp should be at offset 0x1180");
		static_assert(sizeof(CS2::client::CBaseProp) == 0x11A0, "CBaseProp size should be 0x11A0");
	}
}
