// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#include <SDK/GlobalTypes.hpp>

#include <SDK/client/C_BaseModelEntity.hpp>
#include <SDK/client/PhysicsRagdollPose_t.hpp>



namespace CS2 {
	namespace client {
		class CBaseAnimGraph : public CS2::client::C_BaseModelEntity {
		public:
			public:
			S2_PAD(0x80);
			bool m_bInitiallyPopulateInterpHistory; // 0xf40 | Schema_Builtin | Size: 0x1
			S2_PAD(0x1);
			bool m_bSuppressAnimEventSounds; // 0xf42 | Schema_Builtin | Size: 0x1
			S2_PAD(0xd);
			bool m_bAnimGraphUpdateEnabled; // 0xf50 | Schema_Builtin | Size: 0x1
			S2_PAD(0x3);
			float32 m_flMaxSlopeDistance; // 0xf54 | Schema_Builtin | Size: 0x4
			GlobalTypes::Vector m_vLastSlopeCheckPos; // 0xf58 | Schema_Atomic | Size: 0xc
			bool m_bAnimationUpdateScheduled; // 0xf64 | Schema_Builtin | Size: 0x1
			S2_PAD(0x3);
			GlobalTypes::Vector m_vecForce; // 0xf68 | Schema_Atomic | Size: 0xc
			int32_t m_nForceBone; // 0xf74 | Schema_Builtin | Size: 0x4
			client::CBaseAnimGraph* m_pClientsideRagdoll; // 0xf78 | Schema_Ptr | Size: 0x8
			bool m_bBuiltRagdoll; // 0xf80 | Schema_Builtin | Size: 0x1
			S2_PAD(0x17);
			client::PhysicsRagdollPose_t m_RagdollPose; // 0xf98 | Schema_DeclaredClass | Size: 0x48
			bool m_bRagdollEnabled; // 0xfe0 | Schema_Builtin | Size: 0x1
			bool m_bRagdollClientSide; // 0xfe1 | Schema_Builtin | Size: 0x1
			S2_PAD(0xe);
			bool m_bHasAnimatedMaterialAttributes; // 0xff0 | Schema_Builtin | Size: 0x1
			S2_PAD(0x177); // End padding
		};
		static_assert(offsetof(CS2::client::CBaseAnimGraph, m_bInitiallyPopulateInterpHistory) == 0xF40, "m_bInitiallyPopulateInterpHistory in CBaseAnimGraph should be at offset 0xF40");
		static_assert(offsetof(CS2::client::CBaseAnimGraph, m_bSuppressAnimEventSounds) == 0xF42, "m_bSuppressAnimEventSounds in CBaseAnimGraph should be at offset 0xF42");
		static_assert(offsetof(CS2::client::CBaseAnimGraph, m_bAnimGraphUpdateEnabled) == 0xF50, "m_bAnimGraphUpdateEnabled in CBaseAnimGraph should be at offset 0xF50");
		static_assert(offsetof(CS2::client::CBaseAnimGraph, m_flMaxSlopeDistance) == 0xF54, "m_flMaxSlopeDistance in CBaseAnimGraph should be at offset 0xF54");
		static_assert(offsetof(CS2::client::CBaseAnimGraph, m_vLastSlopeCheckPos) == 0xF58, "m_vLastSlopeCheckPos in CBaseAnimGraph should be at offset 0xF58");
		static_assert(offsetof(CS2::client::CBaseAnimGraph, m_bAnimationUpdateScheduled) == 0xF64, "m_bAnimationUpdateScheduled in CBaseAnimGraph should be at offset 0xF64");
		static_assert(offsetof(CS2::client::CBaseAnimGraph, m_vecForce) == 0xF68, "m_vecForce in CBaseAnimGraph should be at offset 0xF68");
		static_assert(offsetof(CS2::client::CBaseAnimGraph, m_nForceBone) == 0xF74, "m_nForceBone in CBaseAnimGraph should be at offset 0xF74");
		static_assert(offsetof(CS2::client::CBaseAnimGraph, m_pClientsideRagdoll) == 0xF78, "m_pClientsideRagdoll in CBaseAnimGraph should be at offset 0xF78");
		static_assert(offsetof(CS2::client::CBaseAnimGraph, m_bBuiltRagdoll) == 0xF80, "m_bBuiltRagdoll in CBaseAnimGraph should be at offset 0xF80");
		static_assert(offsetof(CS2::client::CBaseAnimGraph, m_RagdollPose) == 0xF98, "m_RagdollPose in CBaseAnimGraph should be at offset 0xF98");
		static_assert(offsetof(CS2::client::CBaseAnimGraph, m_bRagdollEnabled) == 0xFE0, "m_bRagdollEnabled in CBaseAnimGraph should be at offset 0xFE0");
		static_assert(offsetof(CS2::client::CBaseAnimGraph, m_bRagdollClientSide) == 0xFE1, "m_bRagdollClientSide in CBaseAnimGraph should be at offset 0xFE1");
		static_assert(offsetof(CS2::client::CBaseAnimGraph, m_bHasAnimatedMaterialAttributes) == 0xFF0, "m_bHasAnimatedMaterialAttributes in CBaseAnimGraph should be at offset 0xFF0");
		static_assert(sizeof(CS2::client::CBaseAnimGraph) == 0x1168, "CBaseAnimGraph size should be 0x1168");
	}
}
