// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#ifndef CUSTOM_GLOBAL_TYPES
	#include <SDK/GlobalTypes.hpp>
#else
	#include <Custom/GlobalTypes.hpp>
#endif


#include <SDK/client/CAnimGraphControllerBase.hpp>



namespace CS2 {
	namespace client {
		class CBaseAnimGraphAnimGraphController : public CS2::client::CAnimGraphControllerBase {
		public:
			// GlobalTypes::CAnimGraphParamOptionalRef< GlobalTypes::CGlobalSymbol > m_sDestructiblePartDestroyedHitGroup; // 0x80 | Schema_Atomic | Size: 0x28
			char  m_sDestructiblePartDestroyedHitGroup[0x28]; // 0x80 | Schema_Atomic | Size: 0x28
			// GlobalTypes::CAnimGraphParamOptionalRef< int32 > m_nDestructiblePartDestroyedPartIndex; // 0xa8 | Schema_Atomic | Size: 0x20
			char  m_nDestructiblePartDestroyedPartIndex[0x20]; // 0xa8 | Schema_Atomic | Size: 0x20
			// GlobalTypes::CAnimGraphParamOptionalRef< bool > m_bHITGROUP_INVALID_Destroyed; // 0xc8 | Schema_Atomic | Size: 0x20
			char  m_bHITGROUP_INVALID_Destroyed[0x20]; // 0xc8 | Schema_Atomic | Size: 0x20
			// GlobalTypes::CAnimGraphParamOptionalRef< bool > m_bHITGROUP_GENERIC_Destroyed; // 0xe8 | Schema_Atomic | Size: 0x20
			char  m_bHITGROUP_GENERIC_Destroyed[0x20]; // 0xe8 | Schema_Atomic | Size: 0x20
			// GlobalTypes::CAnimGraphParamOptionalRef< bool > m_bHITGROUP_HEAD_Destroyed; // 0x108 | Schema_Atomic | Size: 0x20
			char  m_bHITGROUP_HEAD_Destroyed[0x20]; // 0x108 | Schema_Atomic | Size: 0x20
			// GlobalTypes::CAnimGraphParamOptionalRef< bool > m_bHITGROUP_CHEST_Destroyed; // 0x128 | Schema_Atomic | Size: 0x20
			char  m_bHITGROUP_CHEST_Destroyed[0x20]; // 0x128 | Schema_Atomic | Size: 0x20
			// GlobalTypes::CAnimGraphParamOptionalRef< bool > m_bHITGROUP_STOMACH_Destroyed; // 0x148 | Schema_Atomic | Size: 0x20
			char  m_bHITGROUP_STOMACH_Destroyed[0x20]; // 0x148 | Schema_Atomic | Size: 0x20
			// GlobalTypes::CAnimGraphParamOptionalRef< bool > m_bHITGROUP_LEFTARM_Destroyed; // 0x168 | Schema_Atomic | Size: 0x20
			char  m_bHITGROUP_LEFTARM_Destroyed[0x20]; // 0x168 | Schema_Atomic | Size: 0x20
			// GlobalTypes::CAnimGraphParamOptionalRef< bool > m_bHITGROUP_RIGHTARM_Destroyed; // 0x188 | Schema_Atomic | Size: 0x20
			char  m_bHITGROUP_RIGHTARM_Destroyed[0x20]; // 0x188 | Schema_Atomic | Size: 0x20
			// GlobalTypes::CAnimGraphParamOptionalRef< bool > m_bHITGROUP_LEFTLEG_Destroyed; // 0x1a8 | Schema_Atomic | Size: 0x20
			char  m_bHITGROUP_LEFTLEG_Destroyed[0x20]; // 0x1a8 | Schema_Atomic | Size: 0x20
			// GlobalTypes::CAnimGraphParamOptionalRef< bool > m_bHITGROUP_RIGHTLEG_Destroyed; // 0x1c8 | Schema_Atomic | Size: 0x20
			char  m_bHITGROUP_RIGHTLEG_Destroyed[0x20]; // 0x1c8 | Schema_Atomic | Size: 0x20
			// GlobalTypes::CAnimGraphParamOptionalRef< bool > m_bHITGROUP_NECK_Destroyed; // 0x1e8 | Schema_Atomic | Size: 0x20
			char  m_bHITGROUP_NECK_Destroyed[0x20]; // 0x1e8 | Schema_Atomic | Size: 0x20
			// GlobalTypes::CAnimGraphParamOptionalRef< bool > m_bHITGROUP_UNUSED_Destroyed; // 0x208 | Schema_Atomic | Size: 0x20
			char  m_bHITGROUP_UNUSED_Destroyed[0x20]; // 0x208 | Schema_Atomic | Size: 0x20
			// GlobalTypes::CAnimGraphParamOptionalRef< bool > m_bHITGROUP_GEAR_Destroyed; // 0x228 | Schema_Atomic | Size: 0x20
			char  m_bHITGROUP_GEAR_Destroyed[0x20]; // 0x228 | Schema_Atomic | Size: 0x20
			// GlobalTypes::CAnimGraphParamOptionalRef< bool > m_bHITGROUP_SPECIAL_Destroyed; // 0x248 | Schema_Atomic | Size: 0x20
			char  m_bHITGROUP_SPECIAL_Destroyed[0x20]; // 0x248 | Schema_Atomic | Size: 0x20
		};
		static_assert(offsetof(CS2::client::CBaseAnimGraphAnimGraphController, m_sDestructiblePartDestroyedHitGroup) == 0x80, "m_sDestructiblePartDestroyedHitGroup in CBaseAnimGraphAnimGraphController should be at offset 0x80");
		static_assert(offsetof(CS2::client::CBaseAnimGraphAnimGraphController, m_nDestructiblePartDestroyedPartIndex) == 0xA8, "m_nDestructiblePartDestroyedPartIndex in CBaseAnimGraphAnimGraphController should be at offset 0xA8");
		static_assert(offsetof(CS2::client::CBaseAnimGraphAnimGraphController, m_bHITGROUP_INVALID_Destroyed) == 0xC8, "m_bHITGROUP_INVALID_Destroyed in CBaseAnimGraphAnimGraphController should be at offset 0xC8");
		static_assert(offsetof(CS2::client::CBaseAnimGraphAnimGraphController, m_bHITGROUP_GENERIC_Destroyed) == 0xE8, "m_bHITGROUP_GENERIC_Destroyed in CBaseAnimGraphAnimGraphController should be at offset 0xE8");
		static_assert(offsetof(CS2::client::CBaseAnimGraphAnimGraphController, m_bHITGROUP_HEAD_Destroyed) == 0x108, "m_bHITGROUP_HEAD_Destroyed in CBaseAnimGraphAnimGraphController should be at offset 0x108");
		static_assert(offsetof(CS2::client::CBaseAnimGraphAnimGraphController, m_bHITGROUP_CHEST_Destroyed) == 0x128, "m_bHITGROUP_CHEST_Destroyed in CBaseAnimGraphAnimGraphController should be at offset 0x128");
		static_assert(offsetof(CS2::client::CBaseAnimGraphAnimGraphController, m_bHITGROUP_STOMACH_Destroyed) == 0x148, "m_bHITGROUP_STOMACH_Destroyed in CBaseAnimGraphAnimGraphController should be at offset 0x148");
		static_assert(offsetof(CS2::client::CBaseAnimGraphAnimGraphController, m_bHITGROUP_LEFTARM_Destroyed) == 0x168, "m_bHITGROUP_LEFTARM_Destroyed in CBaseAnimGraphAnimGraphController should be at offset 0x168");
		static_assert(offsetof(CS2::client::CBaseAnimGraphAnimGraphController, m_bHITGROUP_RIGHTARM_Destroyed) == 0x188, "m_bHITGROUP_RIGHTARM_Destroyed in CBaseAnimGraphAnimGraphController should be at offset 0x188");
		static_assert(offsetof(CS2::client::CBaseAnimGraphAnimGraphController, m_bHITGROUP_LEFTLEG_Destroyed) == 0x1A8, "m_bHITGROUP_LEFTLEG_Destroyed in CBaseAnimGraphAnimGraphController should be at offset 0x1A8");
		static_assert(offsetof(CS2::client::CBaseAnimGraphAnimGraphController, m_bHITGROUP_RIGHTLEG_Destroyed) == 0x1C8, "m_bHITGROUP_RIGHTLEG_Destroyed in CBaseAnimGraphAnimGraphController should be at offset 0x1C8");
		static_assert(offsetof(CS2::client::CBaseAnimGraphAnimGraphController, m_bHITGROUP_NECK_Destroyed) == 0x1E8, "m_bHITGROUP_NECK_Destroyed in CBaseAnimGraphAnimGraphController should be at offset 0x1E8");
		static_assert(offsetof(CS2::client::CBaseAnimGraphAnimGraphController, m_bHITGROUP_UNUSED_Destroyed) == 0x208, "m_bHITGROUP_UNUSED_Destroyed in CBaseAnimGraphAnimGraphController should be at offset 0x208");
		static_assert(offsetof(CS2::client::CBaseAnimGraphAnimGraphController, m_bHITGROUP_GEAR_Destroyed) == 0x228, "m_bHITGROUP_GEAR_Destroyed in CBaseAnimGraphAnimGraphController should be at offset 0x228");
		static_assert(offsetof(CS2::client::CBaseAnimGraphAnimGraphController, m_bHITGROUP_SPECIAL_Destroyed) == 0x248, "m_bHITGROUP_SPECIAL_Destroyed in CBaseAnimGraphAnimGraphController should be at offset 0x248");
		static_assert(sizeof(CS2::client::CBaseAnimGraphAnimGraphController) == 0x268, "CBaseAnimGraphAnimGraphController size should be 0x268");
	}
}
