// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#ifndef CUSTOM_GLOBAL_TYPES
	#include "../GlobalTypes.hpp"
#else
	#include "../Custom/GlobalTypes.hpp"
#endif


#include "IClientAlphaProperty.hpp"
#include "../entity2/GameTime_t.hpp"





using namespace GlobalTypes;
namespace CS2 {
	namespace client {
		class CClientAlphaProperty : public CS2::client::IClientAlphaProperty {
		public:
			S2_PAD(0x8);
			uint16_t m_nDistFadeStart; // 0x10 | Schema_Builtin | Size: 0x2
			uint16_t m_nDistFadeEnd; // 0x12 | Schema_Builtin | Size: 0x2
			S2_PAD(0x3);
			uint8_t m_nAlpha; // 0x17 | Schema_Builtin | Size: 0x1
			float32 m_flFadeScale; // 0x18 | Schema_Builtin | Size: 0x4
			entity2::GameTime_t m_flRenderFxStartTime; // 0x1c | Schema_DeclaredClass | Size: 0x4
			float32 m_flRenderFxDuration; // 0x20 | Schema_Builtin | Size: 0x4
			S2_PAD(0xc); // End padding
		};
#ifdef USE_STATIC_ASSERTS
		static_assert(offsetof(CS2::client::CClientAlphaProperty, m_nDistFadeStart) == 0x10, "m_nDistFadeStart in CClientAlphaProperty should be at offset 0x10");
		static_assert(offsetof(CS2::client::CClientAlphaProperty, m_nDistFadeEnd) == 0x12, "m_nDistFadeEnd in CClientAlphaProperty should be at offset 0x12");
		static_assert(offsetof(CS2::client::CClientAlphaProperty, m_nAlpha) == 0x17, "m_nAlpha in CClientAlphaProperty should be at offset 0x17");
		static_assert(offsetof(CS2::client::CClientAlphaProperty, m_flFadeScale) == 0x18, "m_flFadeScale in CClientAlphaProperty should be at offset 0x18");
		static_assert(offsetof(CS2::client::CClientAlphaProperty, m_flRenderFxStartTime) == 0x1C, "m_flRenderFxStartTime in CClientAlphaProperty should be at offset 0x1C");
		static_assert(offsetof(CS2::client::CClientAlphaProperty, m_flRenderFxDuration) == 0x20, "m_flRenderFxDuration in CClientAlphaProperty should be at offset 0x20");
		static_assert(sizeof(CS2::client::CClientAlphaProperty) == 0x30, "CClientAlphaProperty size should be 0x30");

#endif
	}
}
