// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#ifndef CUSTOM_GLOBAL_TYPES
	#include "../GlobalTypes.hpp"
#else
	#include <Custom/GlobalTypes.hpp>
#endif


#include "CAnimGraphControllerBase.hpp"





using namespace GlobalTypes;
namespace CS2 {
	namespace client {
		class CCS2ChickenGraphController : public CS2::client::CAnimGraphControllerBase {
		public:
			// GlobalTypes::CAnimGraph2ParamOptionalRef<GlobalTypes::CGlobalSymbol> m_action; // 0x90 | Schema_Atomic | Size: 0x18
			char m_action[0x18]; // 0x90 | Schema_Atomic | Size: 0x18
			// GlobalTypes::CAnimGraph2ParamOptionalRef<GlobalTypes::CGlobalSymbol> m_actionSubtype; // 0xa8 | Schema_Atomic | Size: 0x18
			char m_actionSubtype[0x18]; // 0xa8 | Schema_Atomic | Size: 0x18
			GlobalTypes::CAnimGraph2ParamAutoResetOptionalRef m_bActionReset; // 0xc0 | Schema_Atomic | Size: 0x20
			// GlobalTypes::CAnimGraph2ParamOptionalRef< float32 > m_idleVariation; // 0xe0 | Schema_Atomic | Size: 0x18
			char m_idleVariation[0x18]; // 0xe0 | Schema_Atomic | Size: 0x18
			// GlobalTypes::CAnimGraph2ParamOptionalRef< float32 > m_runVariation; // 0xf8 | Schema_Atomic | Size: 0x18
			char m_runVariation[0x18]; // 0xf8 | Schema_Atomic | Size: 0x18
			// GlobalTypes::CAnimGraph2ParamOptionalRef< float32 > m_panicVariation; // 0x110 | Schema_Atomic | Size: 0x18
			char m_panicVariation[0x18]; // 0x110 | Schema_Atomic | Size: 0x18
			// GlobalTypes::CAnimGraph2ParamOptionalRef< float32 > m_squatVariation; // 0x128 | Schema_Atomic | Size: 0x18
			char m_squatVariation[0x18]; // 0x128 | Schema_Atomic | Size: 0x18
			// GlobalTypes::CAnimGraph2ParamOptionalRef< bool > m_bInWater; // 0x140 | Schema_Atomic | Size: 0x18
			char m_bInWater[0x18]; // 0x140 | Schema_Atomic | Size: 0x18
			bool m_bHasActionCompletedEvent; // 0x158 | Schema_Builtin | Size: 0x1
			bool m_bWaitingForCompletedEvent; // 0x159 | Schema_Builtin | Size: 0x1
			S2_PAD(0x6); // End padding
		};
#ifdef USE_STATIC_ASSERTS
		static_assert(offsetof(CS2::client::CCS2ChickenGraphController, m_action) == 0x90, "m_action in CCS2ChickenGraphController should be at offset 0x90");
		static_assert(offsetof(CS2::client::CCS2ChickenGraphController, m_actionSubtype) == 0xA8, "m_actionSubtype in CCS2ChickenGraphController should be at offset 0xA8");
		static_assert(offsetof(CS2::client::CCS2ChickenGraphController, m_bActionReset) == 0xC0, "m_bActionReset in CCS2ChickenGraphController should be at offset 0xC0");
		static_assert(offsetof(CS2::client::CCS2ChickenGraphController, m_idleVariation) == 0xE0, "m_idleVariation in CCS2ChickenGraphController should be at offset 0xE0");
		static_assert(offsetof(CS2::client::CCS2ChickenGraphController, m_runVariation) == 0xF8, "m_runVariation in CCS2ChickenGraphController should be at offset 0xF8");
		static_assert(offsetof(CS2::client::CCS2ChickenGraphController, m_panicVariation) == 0x110, "m_panicVariation in CCS2ChickenGraphController should be at offset 0x110");
		static_assert(offsetof(CS2::client::CCS2ChickenGraphController, m_squatVariation) == 0x128, "m_squatVariation in CCS2ChickenGraphController should be at offset 0x128");
		static_assert(offsetof(CS2::client::CCS2ChickenGraphController, m_bInWater) == 0x140, "m_bInWater in CCS2ChickenGraphController should be at offset 0x140");
		static_assert(offsetof(CS2::client::CCS2ChickenGraphController, m_bHasActionCompletedEvent) == 0x158, "m_bHasActionCompletedEvent in CCS2ChickenGraphController should be at offset 0x158");
		static_assert(offsetof(CS2::client::CCS2ChickenGraphController, m_bWaitingForCompletedEvent) == 0x159, "m_bWaitingForCompletedEvent in CCS2ChickenGraphController should be at offset 0x159");
		static_assert(sizeof(CS2::client::CCS2ChickenGraphController) == 0x160, "CCS2ChickenGraphController size should be 0x160");

#endif
	}
}
