// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#ifndef CUSTOM_GLOBAL_TYPES
	#include <SDK/GlobalTypes.hpp>
#else
	#include <Custom/GlobalTypes.hpp>
#endif


#include <SDK/client/CPlayerControllerComponent.hpp>
#include <SDK/client/CSMatchStats_t.hpp>





using namespace GlobalTypes;
namespace CS2 {
	namespace client {
		class CCSPlayerController_ActionTrackingServices : public CS2::client::CPlayerControllerComponent {
		public:
			// client::C_UtlVectorEmbeddedNetworkVar<client::CSPerRoundStats_t> m_perRoundStats; // 0x40 | Schema_Atomic | Size: 0x68
			char  m_perRoundStats[0x68]; // 0x40 | Schema_Atomic | Size: 0x68
			client::CSMatchStats_t m_matchStats; // 0xa8 | Schema_DeclaredClass | Size: 0x80
			int32_t m_iNumRoundKills; // 0x128 | Schema_Builtin | Size: 0x4
			int32_t m_iNumRoundKillsHeadshots; // 0x12c | Schema_Builtin | Size: 0x4
			float32 m_flTotalRoundDamageDealt; // 0x130 | Schema_Builtin | Size: 0x4
			S2_PAD(0x4); // End padding
		};
		static_assert(offsetof(CS2::client::CCSPlayerController_ActionTrackingServices, m_perRoundStats) == 0x40, "m_perRoundStats in CCSPlayerController_ActionTrackingServices should be at offset 0x40");
		static_assert(offsetof(CS2::client::CCSPlayerController_ActionTrackingServices, m_matchStats) == 0xA8, "m_matchStats in CCSPlayerController_ActionTrackingServices should be at offset 0xA8");
		static_assert(offsetof(CS2::client::CCSPlayerController_ActionTrackingServices, m_iNumRoundKills) == 0x128, "m_iNumRoundKills in CCSPlayerController_ActionTrackingServices should be at offset 0x128");
		static_assert(offsetof(CS2::client::CCSPlayerController_ActionTrackingServices, m_iNumRoundKillsHeadshots) == 0x12C, "m_iNumRoundKillsHeadshots in CCSPlayerController_ActionTrackingServices should be at offset 0x12C");
		static_assert(offsetof(CS2::client::CCSPlayerController_ActionTrackingServices, m_flTotalRoundDamageDealt) == 0x130, "m_flTotalRoundDamageDealt in CCSPlayerController_ActionTrackingServices should be at offset 0x130");
		static_assert(sizeof(CS2::client::CCSPlayerController_ActionTrackingServices) == 0x138, "CCSPlayerController_ActionTrackingServices size should be 0x138");
	}
}
