// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#ifndef CUSTOM_GLOBAL_TYPES
	#include <SDK/GlobalTypes.hpp>
#else
	#include <Custom/GlobalTypes.hpp>
#endif


#include <SDK/client/CPlayerControllerComponent.hpp>





using namespace GlobalTypes;
namespace CS2 {
	namespace client {
		class CCSPlayerController_InGameMoneyServices : public CS2::client::CPlayerControllerComponent {
		public:
			int32_t m_iAccount; // 0x40 | Schema_Builtin | Size: 0x4
			int32_t m_iStartAccount; // 0x44 | Schema_Builtin | Size: 0x4
			int32_t m_iTotalCashSpent; // 0x48 | Schema_Builtin | Size: 0x4
			int32_t m_iCashSpentThisRound; // 0x4c | Schema_Builtin | Size: 0x4
		};
		static_assert(offsetof(CS2::client::CCSPlayerController_InGameMoneyServices, m_iAccount) == 0x40, "m_iAccount in CCSPlayerController_InGameMoneyServices should be at offset 0x40");
		static_assert(offsetof(CS2::client::CCSPlayerController_InGameMoneyServices, m_iStartAccount) == 0x44, "m_iStartAccount in CCSPlayerController_InGameMoneyServices should be at offset 0x44");
		static_assert(offsetof(CS2::client::CCSPlayerController_InGameMoneyServices, m_iTotalCashSpent) == 0x48, "m_iTotalCashSpent in CCSPlayerController_InGameMoneyServices should be at offset 0x48");
		static_assert(offsetof(CS2::client::CCSPlayerController_InGameMoneyServices, m_iCashSpentThisRound) == 0x4C, "m_iCashSpentThisRound in CCSPlayerController_InGameMoneyServices should be at offset 0x4C");
		static_assert(sizeof(CS2::client::CCSPlayerController_InGameMoneyServices) == 0x50, "CCSPlayerController_InGameMoneyServices size should be 0x50");
	}
}
