// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#ifndef CUSTOM_GLOBAL_TYPES
	#include <SDK/GlobalTypes.hpp>
#else
	#include <Custom/GlobalTypes.hpp>
#endif


#include <SDK/client/HitGroup_t.hpp>



namespace CS2 {
	namespace client {
		class CDestructiblePart_DamageLevel;
	}
}


using namespace GlobalTypes;
namespace CS2 {
	namespace client {
		class CDestructiblePart  {
		public:
			GlobalTypes::CGlobalSymbol m_DebugName; // 0x0 | Schema_Atomic | Size: 0x8
			client::HitGroup_t m_nHitGroup; // 0x8 | Schema_DeclaredEnum | Size: 0x4
			bool m_bDisableHitGroupWhenDestroyed; // 0xc | Schema_Builtin | Size: 0x1
			S2_PAD(0x3);
			GlobalTypes::CUtlVector< HitGroup_t > m_nOtherHitgroupsToDestroyWhenFullyDestructed; // 0x10 | Schema_Atomic | Size: 0x18
			// char  m_nOtherHitgroupsToDestroyWhenFullyDestructed[0x18]; // 0x10 | Schema_Atomic | Size: 0x18
			bool m_bOnlyDestroyWhenGibbing; // 0x28 | Schema_Builtin | Size: 0x1
			S2_PAD(0x7);
			GlobalTypes::CGlobalSymbol m_sBodyGroupName; // 0x30 | Schema_Atomic | Size: 0x8
			GlobalTypes::CUtlVector< client::CDestructiblePart_DamageLevel > m_DamageLevels; // 0x38 | Schema_Atomic | Size: 0x18
			// char  m_DamageLevels[0x18]; // 0x38 | Schema_Atomic | Size: 0x18
		};
		static_assert(offsetof(CS2::client::CDestructiblePart, m_DebugName) == 0x0, "m_DebugName in CDestructiblePart should be at offset 0x0");
		static_assert(offsetof(CS2::client::CDestructiblePart, m_nHitGroup) == 0x8, "m_nHitGroup in CDestructiblePart should be at offset 0x8");
		static_assert(offsetof(CS2::client::CDestructiblePart, m_bDisableHitGroupWhenDestroyed) == 0xC, "m_bDisableHitGroupWhenDestroyed in CDestructiblePart should be at offset 0xC");
		static_assert(offsetof(CS2::client::CDestructiblePart, m_nOtherHitgroupsToDestroyWhenFullyDestructed) == 0x10, "m_nOtherHitgroupsToDestroyWhenFullyDestructed in CDestructiblePart should be at offset 0x10");
		static_assert(offsetof(CS2::client::CDestructiblePart, m_bOnlyDestroyWhenGibbing) == 0x28, "m_bOnlyDestroyWhenGibbing in CDestructiblePart should be at offset 0x28");
		static_assert(offsetof(CS2::client::CDestructiblePart, m_sBodyGroupName) == 0x30, "m_sBodyGroupName in CDestructiblePart should be at offset 0x30");
		static_assert(offsetof(CS2::client::CDestructiblePart, m_DamageLevels) == 0x38, "m_DamageLevels in CDestructiblePart should be at offset 0x38");
		static_assert(sizeof(CS2::client::CDestructiblePart) == 0x50, "CDestructiblePart size should be 0x50");
	}
}
