// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#include <SDK/GlobalTypes.hpp>

#include <SDK/client/HitGroup_t.hpp>



namespace CS2 {
	namespace client {
		class CDestructiblePartsSystemData_HitGroupInfoAndDamageLevels  {
		public:
			GlobalTypes::CGlobalSymbol m_DebugName; // 0x0 | Schema_Atomic | Size: 0x8
			client::HitGroup_t m_nHitGroup; // 0x8 | Schema_DeclaredEnum | Size: 0x4
			bool m_bDisableHitGroupWhenDestroyed; // 0xc | Schema_Builtin | Size: 0x1
			S2_PAD(0x3);
			// GlobalTypes::CUtlVector< HitGroup_t > m_nOtherHitgroupsToDestroyWhenFullyDestructed; // 0x10 | Schema_Atomic | Size: 0x18
			char  m_nOtherHitgroupsToDestroyWhenFullyDestructed[0x18]; // 0x10 | Schema_Atomic | Size: 0x18
			bool m_bOnlyDestroyWhenGibbing; // 0x28 | Schema_Builtin | Size: 0x1
			S2_PAD(0x7);
			GlobalTypes::CGlobalSymbol m_sBodyGroupName; // 0x30 | Schema_Atomic | Size: 0x8
			// GlobalTypes::CUtlVector< client::CDestructiblePartsSystemData_DamageLevel > m_DamageLevels; // 0x38 | Schema_Atomic | Size: 0x18
			char  m_DamageLevels[0x18]; // 0x38 | Schema_Atomic | Size: 0x18
		};
		static_assert(offsetof(CS2::client::CDestructiblePartsSystemData_HitGroupInfoAndDamageLevels, m_DebugName) == 0x0, "m_DebugName in CDestructiblePartsSystemData_HitGroupInfoAndDamageLevels should be at offset 0x0");
		static_assert(offsetof(CS2::client::CDestructiblePartsSystemData_HitGroupInfoAndDamageLevels, m_nHitGroup) == 0x8, "m_nHitGroup in CDestructiblePartsSystemData_HitGroupInfoAndDamageLevels should be at offset 0x8");
		static_assert(offsetof(CS2::client::CDestructiblePartsSystemData_HitGroupInfoAndDamageLevels, m_bDisableHitGroupWhenDestroyed) == 0xC, "m_bDisableHitGroupWhenDestroyed in CDestructiblePartsSystemData_HitGroupInfoAndDamageLevels should be at offset 0xC");
		static_assert(offsetof(CS2::client::CDestructiblePartsSystemData_HitGroupInfoAndDamageLevels, m_nOtherHitgroupsToDestroyWhenFullyDestructed) == 0x10, "m_nOtherHitgroupsToDestroyWhenFullyDestructed in CDestructiblePartsSystemData_HitGroupInfoAndDamageLevels should be at offset 0x10");
		static_assert(offsetof(CS2::client::CDestructiblePartsSystemData_HitGroupInfoAndDamageLevels, m_bOnlyDestroyWhenGibbing) == 0x28, "m_bOnlyDestroyWhenGibbing in CDestructiblePartsSystemData_HitGroupInfoAndDamageLevels should be at offset 0x28");
		static_assert(offsetof(CS2::client::CDestructiblePartsSystemData_HitGroupInfoAndDamageLevels, m_sBodyGroupName) == 0x30, "m_sBodyGroupName in CDestructiblePartsSystemData_HitGroupInfoAndDamageLevels should be at offset 0x30");
		static_assert(offsetof(CS2::client::CDestructiblePartsSystemData_HitGroupInfoAndDamageLevels, m_DamageLevels) == 0x38, "m_DamageLevels in CDestructiblePartsSystemData_HitGroupInfoAndDamageLevels should be at offset 0x38");
		static_assert(sizeof(CS2::client::CDestructiblePartsSystemData_HitGroupInfoAndDamageLevels) == 0x50, "CDestructiblePartsSystemData_HitGroupInfoAndDamageLevels size should be 0x50");
	}
}
