// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#include <SDK/GlobalTypes.hpp>




namespace CS2 {
	namespace client {
		class CFlashlightEffect  {
		public:
			S2_PAD(0x10);
			bool m_bIsOn; // 0x10 | Schema_Builtin | Size: 0x1
			S2_PAD(0xf);
			bool m_bMuzzleFlashEnabled; // 0x20 | Schema_Builtin | Size: 0x1
			S2_PAD(0x3);
			float32 m_flMuzzleFlashBrightness; // 0x24 | Schema_Builtin | Size: 0x4
			S2_PAD(0x8);
			GlobalTypes::Quaternion m_quatMuzzleFlashOrientation; // 0x30 | Schema_Atomic | Size: 0x10
			GlobalTypes::Vector m_vecMuzzleFlashOrigin; // 0x40 | Schema_Atomic | Size: 0xc
			float32 m_flFov; // 0x4c | Schema_Builtin | Size: 0x4
			float32 m_flFarZ; // 0x50 | Schema_Builtin | Size: 0x4
			float32 m_flLinearAtten; // 0x54 | Schema_Builtin | Size: 0x4
			bool m_bCastsShadows; // 0x58 | Schema_Builtin | Size: 0x1
			S2_PAD(0x3);
			float32 m_flCurrentPullBackDist; // 0x5c | Schema_Builtin | Size: 0x4
			// GlobalTypes::CStrongHandle< resourcesystem::InfoForResourceTypeCTextureBase > m_FlashlightTexture; // 0x60 | Schema_Atomic | Size: 0x8
			char  m_FlashlightTexture[0x8]; // 0x60 | Schema_Atomic | Size: 0x8
			// GlobalTypes::CStrongHandle< resourcesystem::InfoForResourceTypeCTextureBase > m_MuzzleFlashTexture; // 0x68 | Schema_Atomic | Size: 0x8
			char  m_MuzzleFlashTexture[0x8]; // 0x68 | Schema_Atomic | Size: 0x8
			char m_textureName[64]; // 0x70 | Schema_FixedArray | Size: 0x40
			S2_PAD(0x230); // End padding
		};
		static_assert(offsetof(CS2::client::CFlashlightEffect, m_bIsOn) == 0x10, "m_bIsOn in CFlashlightEffect should be at offset 0x10");
		static_assert(offsetof(CS2::client::CFlashlightEffect, m_bMuzzleFlashEnabled) == 0x20, "m_bMuzzleFlashEnabled in CFlashlightEffect should be at offset 0x20");
		static_assert(offsetof(CS2::client::CFlashlightEffect, m_flMuzzleFlashBrightness) == 0x24, "m_flMuzzleFlashBrightness in CFlashlightEffect should be at offset 0x24");
		static_assert(offsetof(CS2::client::CFlashlightEffect, m_quatMuzzleFlashOrientation) == 0x30, "m_quatMuzzleFlashOrientation in CFlashlightEffect should be at offset 0x30");
		static_assert(offsetof(CS2::client::CFlashlightEffect, m_vecMuzzleFlashOrigin) == 0x40, "m_vecMuzzleFlashOrigin in CFlashlightEffect should be at offset 0x40");
		static_assert(offsetof(CS2::client::CFlashlightEffect, m_flFov) == 0x4C, "m_flFov in CFlashlightEffect should be at offset 0x4C");
		static_assert(offsetof(CS2::client::CFlashlightEffect, m_flFarZ) == 0x50, "m_flFarZ in CFlashlightEffect should be at offset 0x50");
		static_assert(offsetof(CS2::client::CFlashlightEffect, m_flLinearAtten) == 0x54, "m_flLinearAtten in CFlashlightEffect should be at offset 0x54");
		static_assert(offsetof(CS2::client::CFlashlightEffect, m_bCastsShadows) == 0x58, "m_bCastsShadows in CFlashlightEffect should be at offset 0x58");
		static_assert(offsetof(CS2::client::CFlashlightEffect, m_flCurrentPullBackDist) == 0x5C, "m_flCurrentPullBackDist in CFlashlightEffect should be at offset 0x5C");
		static_assert(offsetof(CS2::client::CFlashlightEffect, m_FlashlightTexture) == 0x60, "m_FlashlightTexture in CFlashlightEffect should be at offset 0x60");
		static_assert(offsetof(CS2::client::CFlashlightEffect, m_MuzzleFlashTexture) == 0x68, "m_MuzzleFlashTexture in CFlashlightEffect should be at offset 0x68");
		static_assert(offsetof(CS2::client::CFlashlightEffect, m_textureName) == 0x70, "m_textureName in CFlashlightEffect should be at offset 0x70");
		static_assert(sizeof(CS2::client::CFlashlightEffect) == 0x2E0, "CFlashlightEffect size should be 0x2E0");
	}
}
