// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#include <SDK/GlobalTypes.hpp>

#include <SDK/client/CGameSceneNodeHandle.hpp>
#include <SDK/client/CNetworkOriginCellCoordQuantizedVector.hpp>



namespace CS2 {
	namespace entity2 {
		class CEntityInstance;
	}
}
namespace CS2 {
	namespace client {
		class CGameSceneNode  {
		public:
			S2_PAD(0x10);
			GlobalTypes::CTransformWS m_nodeToWorld; // 0x10 | Schema_Atomic | Size: 0x20
			entity2::CEntityInstance* m_pOwner; // 0x30 | Schema_Ptr | Size: 0x8
			client::CGameSceneNode* m_pParent; // 0x38 | Schema_Ptr | Size: 0x8
			client::CGameSceneNode* m_pChild; // 0x40 | Schema_Ptr | Size: 0x8
			client::CGameSceneNode* m_pNextSibling; // 0x48 | Schema_Ptr | Size: 0x8
			S2_PAD(0x28);
			client::CGameSceneNodeHandle m_hParent; // 0x78 | Schema_DeclaredClass | Size: 0x10
			client::CNetworkOriginCellCoordQuantizedVector m_vecOrigin; // 0x88 | Schema_DeclaredClass | Size: 0x30
			S2_PAD(0x8);
			GlobalTypes::QAngle m_angRotation; // 0xc0 | Schema_Atomic | Size: 0xc
			float32 m_flScale; // 0xcc | Schema_Builtin | Size: 0x4
			GlobalTypes::VectorWS m_vecAbsOrigin; // 0xd0 | Schema_Atomic | Size: 0xc
			GlobalTypes::QAngle m_angAbsRotation; // 0xdc | Schema_Atomic | Size: 0xc
			float32 m_flAbsScale; // 0xe8 | Schema_Builtin | Size: 0x4
			GlobalTypes::Vector m_vecWrappedLocalOrigin; // 0xec | Schema_Atomic | Size: 0xc
			GlobalTypes::QAngle m_angWrappedLocalRotation; // 0xf8 | Schema_Atomic | Size: 0xc
			float32 m_flWrappedScale; // 0x104 | Schema_Builtin | Size: 0x4
			int16_t m_nParentAttachmentOrBone; // 0x108 | Schema_Builtin | Size: 0x2
			bool m_bDebugAbsOriginChanges; // 0x10a | Schema_Builtin | Size: 0x1
			bool m_bDormant; // 0x10b | Schema_Builtin | Size: 0x1
			bool m_bForceParentToBeNetworked; // 0x10c | Schema_Builtin | Size: 0x1
			S2_PAD(0x2);
			uint8_t m_nHierarchicalDepth; // 0x10f | Schema_Builtin | Size: 0x1
			uint8_t m_nHierarchyType; // 0x110 | Schema_Builtin | Size: 0x1
			uint8_t m_nDoNotSetAnimTimeInInvalidatePhysicsCount; // 0x111 | Schema_Builtin | Size: 0x1
			S2_PAD(0x2);
			GlobalTypes::CUtlStringToken m_name; // 0x114 | Schema_Atomic | Size: 0x4
			S2_PAD(0x40);
			GlobalTypes::CUtlStringToken m_hierarchyAttachName; // 0x158 | Schema_Atomic | Size: 0x4
			float32 m_flZOffset; // 0x15c | Schema_Builtin | Size: 0x4
			float32 m_flClientLocalScale; // 0x160 | Schema_Builtin | Size: 0x4
			GlobalTypes::Vector m_vRenderOrigin; // 0x164 | Schema_Atomic | Size: 0xc
			S2_PAD(0x10); // End padding
		};
		static_assert(offsetof(CS2::client::CGameSceneNode, m_nodeToWorld) == 0x10, "m_nodeToWorld in CGameSceneNode should be at offset 0x10");
		static_assert(offsetof(CS2::client::CGameSceneNode, m_pOwner) == 0x30, "m_pOwner in CGameSceneNode should be at offset 0x30");
		static_assert(offsetof(CS2::client::CGameSceneNode, m_pParent) == 0x38, "m_pParent in CGameSceneNode should be at offset 0x38");
		static_assert(offsetof(CS2::client::CGameSceneNode, m_pChild) == 0x40, "m_pChild in CGameSceneNode should be at offset 0x40");
		static_assert(offsetof(CS2::client::CGameSceneNode, m_pNextSibling) == 0x48, "m_pNextSibling in CGameSceneNode should be at offset 0x48");
		static_assert(offsetof(CS2::client::CGameSceneNode, m_hParent) == 0x78, "m_hParent in CGameSceneNode should be at offset 0x78");
		static_assert(offsetof(CS2::client::CGameSceneNode, m_vecOrigin) == 0x88, "m_vecOrigin in CGameSceneNode should be at offset 0x88");
		static_assert(offsetof(CS2::client::CGameSceneNode, m_angRotation) == 0xC0, "m_angRotation in CGameSceneNode should be at offset 0xC0");
		static_assert(offsetof(CS2::client::CGameSceneNode, m_flScale) == 0xCC, "m_flScale in CGameSceneNode should be at offset 0xCC");
		static_assert(offsetof(CS2::client::CGameSceneNode, m_vecAbsOrigin) == 0xD0, "m_vecAbsOrigin in CGameSceneNode should be at offset 0xD0");
		static_assert(offsetof(CS2::client::CGameSceneNode, m_angAbsRotation) == 0xDC, "m_angAbsRotation in CGameSceneNode should be at offset 0xDC");
		static_assert(offsetof(CS2::client::CGameSceneNode, m_flAbsScale) == 0xE8, "m_flAbsScale in CGameSceneNode should be at offset 0xE8");
		static_assert(offsetof(CS2::client::CGameSceneNode, m_vecWrappedLocalOrigin) == 0xEC, "m_vecWrappedLocalOrigin in CGameSceneNode should be at offset 0xEC");
		static_assert(offsetof(CS2::client::CGameSceneNode, m_angWrappedLocalRotation) == 0xF8, "m_angWrappedLocalRotation in CGameSceneNode should be at offset 0xF8");
		static_assert(offsetof(CS2::client::CGameSceneNode, m_flWrappedScale) == 0x104, "m_flWrappedScale in CGameSceneNode should be at offset 0x104");
		static_assert(offsetof(CS2::client::CGameSceneNode, m_nParentAttachmentOrBone) == 0x108, "m_nParentAttachmentOrBone in CGameSceneNode should be at offset 0x108");
		static_assert(offsetof(CS2::client::CGameSceneNode, m_bDebugAbsOriginChanges) == 0x10A, "m_bDebugAbsOriginChanges in CGameSceneNode should be at offset 0x10A");
		static_assert(offsetof(CS2::client::CGameSceneNode, m_bDormant) == 0x10B, "m_bDormant in CGameSceneNode should be at offset 0x10B");
		static_assert(offsetof(CS2::client::CGameSceneNode, m_bForceParentToBeNetworked) == 0x10C, "m_bForceParentToBeNetworked in CGameSceneNode should be at offset 0x10C");
		static_assert(offsetof(CS2::client::CGameSceneNode, m_nHierarchicalDepth) == 0x10F, "m_nHierarchicalDepth in CGameSceneNode should be at offset 0x10F");
		static_assert(offsetof(CS2::client::CGameSceneNode, m_nHierarchyType) == 0x110, "m_nHierarchyType in CGameSceneNode should be at offset 0x110");
		static_assert(offsetof(CS2::client::CGameSceneNode, m_nDoNotSetAnimTimeInInvalidatePhysicsCount) == 0x111, "m_nDoNotSetAnimTimeInInvalidatePhysicsCount in CGameSceneNode should be at offset 0x111");
		static_assert(offsetof(CS2::client::CGameSceneNode, m_name) == 0x114, "m_name in CGameSceneNode should be at offset 0x114");
		static_assert(offsetof(CS2::client::CGameSceneNode, m_hierarchyAttachName) == 0x158, "m_hierarchyAttachName in CGameSceneNode should be at offset 0x158");
		static_assert(offsetof(CS2::client::CGameSceneNode, m_flZOffset) == 0x15C, "m_flZOffset in CGameSceneNode should be at offset 0x15C");
		static_assert(offsetof(CS2::client::CGameSceneNode, m_flClientLocalScale) == 0x160, "m_flClientLocalScale in CGameSceneNode should be at offset 0x160");
		static_assert(offsetof(CS2::client::CGameSceneNode, m_vRenderOrigin) == 0x164, "m_vRenderOrigin in CGameSceneNode should be at offset 0x164");
		static_assert(sizeof(CS2::client::CGameSceneNode) == 0x180, "CGameSceneNode size should be 0x180");
	}
}
