// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#ifndef CUSTOM_GLOBAL_TYPES
	#include <SDK/GlobalTypes.hpp>
#else
	#include <Custom/GlobalTypes.hpp>
#endif


#include <SDK/client/C_PointEntity.hpp>





using namespace GlobalTypes;
namespace CS2 {
	namespace client {
		class CInfoFan : public CS2::client::C_PointEntity {
		public:
			S2_PAD(0x40);
			float32 m_fFanForceMaxRadius; // 0x648 | Schema_Builtin | Size: 0x4
			float32 m_fFanForceMinRadius; // 0x64c | Schema_Builtin | Size: 0x4
			float32 m_flCurveDistRange; // 0x650 | Schema_Builtin | Size: 0x4
			S2_PAD(0x4);
			GlobalTypes::CUtlSymbolLarge m_FanForceCurveString; // 0x658 | Schema_Atomic | Size: 0x8
		};
		static_assert(offsetof(CS2::client::CInfoFan, m_fFanForceMaxRadius) == 0x648, "m_fFanForceMaxRadius in CInfoFan should be at offset 0x648");
		static_assert(offsetof(CS2::client::CInfoFan, m_fFanForceMinRadius) == 0x64C, "m_fFanForceMinRadius in CInfoFan should be at offset 0x64C");
		static_assert(offsetof(CS2::client::CInfoFan, m_flCurveDistRange) == 0x650, "m_flCurveDistRange in CInfoFan should be at offset 0x650");
		static_assert(offsetof(CS2::client::CInfoFan, m_FanForceCurveString) == 0x658, "m_FanForceCurveString in CInfoFan should be at offset 0x658");
		static_assert(sizeof(CS2::client::CInfoFan) == 0x660, "CInfoFan size should be 0x660");
	}
}
