// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#ifndef CUSTOM_GLOBAL_TYPES
	#include "../GlobalTypes.hpp"
#else
	#include "../Custom/GlobalTypes.hpp"
#endif


#include "C_PointEntity.hpp"



namespace CS2 {
	namespace client {
		class C_BaseEntity;
	}
}


using namespace GlobalTypes;
namespace CS2 {
	namespace client {
		class CInfoDynamicShadowHint : public CS2::client::C_PointEntity {
		public:
			bool m_bDisabled; // 0x608 | Schema_Builtin | Size: 0x1
			S2_PAD(0x3);
			float32 m_flRange; // 0x60c | Schema_Builtin | Size: 0x4
			int32_t m_nImportance; // 0x610 | Schema_Builtin | Size: 0x4
			int32_t m_nLightChoice; // 0x614 | Schema_Builtin | Size: 0x4
			GlobalTypes::CHandle<client::C_BaseEntity> m_hLight; // 0x618 | Schema_Atomic | Size: 0x4
			// char m_hLight[0x4]; // 0x618 | Schema_Atomic | Size: 0x4
			S2_PAD(0x4); // End padding
		};
		static_assert(offsetof(CS2::client::CInfoDynamicShadowHint, m_bDisabled) == 0x608, "m_bDisabled in CInfoDynamicShadowHint should be at offset 0x608");
		static_assert(offsetof(CS2::client::CInfoDynamicShadowHint, m_flRange) == 0x60C, "m_flRange in CInfoDynamicShadowHint should be at offset 0x60C");
		static_assert(offsetof(CS2::client::CInfoDynamicShadowHint, m_nImportance) == 0x610, "m_nImportance in CInfoDynamicShadowHint should be at offset 0x610");
		static_assert(offsetof(CS2::client::CInfoDynamicShadowHint, m_nLightChoice) == 0x614, "m_nLightChoice in CInfoDynamicShadowHint should be at offset 0x614");
		static_assert(offsetof(CS2::client::CInfoDynamicShadowHint, m_hLight) == 0x618, "m_hLight in CInfoDynamicShadowHint should be at offset 0x618");
		static_assert(sizeof(CS2::client::CInfoDynamicShadowHint) == 0x620, "CInfoDynamicShadowHint size should be 0x620");
	}
}
