// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#include <SDK/GlobalTypes.hpp>

#include <SDK/client/C_PointEntity.hpp>



namespace CS2 {
	namespace client {
		class C_BaseEntity;
	}
}
namespace CS2 {
	namespace client {
		class CInfoDynamicShadowHint : public CS2::client::C_PointEntity {
		public:
			bool m_bDisabled; // 0x5f8 | Schema_Builtin | Size: 0x1
			S2_PAD(0x3);
			float32 m_flRange; // 0x5fc | Schema_Builtin | Size: 0x4
			int32_t m_nImportance; // 0x600 | Schema_Builtin | Size: 0x4
			int32_t m_nLightChoice; // 0x604 | Schema_Builtin | Size: 0x4
			GlobalTypes::CHandle< client::C_BaseEntity > m_hLight; // 0x608 | Schema_Atomic | Size: 0x4
			// char  m_hLight[0x4]; // 0x608 | Schema_Atomic | Size: 0x4
			// client::CHandle< client::C_BaseEntity > m_hLight; // 0x608 | Schema_Atomic | Size: 0x4
			S2_PAD(0x4); // End padding
		};
		static_assert(offsetof(CS2::client::CInfoDynamicShadowHint, m_bDisabled) == 0x5F8, "m_bDisabled in CInfoDynamicShadowHint should be at offset 0x5F8");
		static_assert(offsetof(CS2::client::CInfoDynamicShadowHint, m_flRange) == 0x5FC, "m_flRange in CInfoDynamicShadowHint should be at offset 0x5FC");
		static_assert(offsetof(CS2::client::CInfoDynamicShadowHint, m_nImportance) == 0x600, "m_nImportance in CInfoDynamicShadowHint should be at offset 0x600");
		static_assert(offsetof(CS2::client::CInfoDynamicShadowHint, m_nLightChoice) == 0x604, "m_nLightChoice in CInfoDynamicShadowHint should be at offset 0x604");
		static_assert(offsetof(CS2::client::CInfoDynamicShadowHint, m_hLight) == 0x608, "m_hLight in CInfoDynamicShadowHint should be at offset 0x608");
		static_assert(sizeof(CS2::client::CInfoDynamicShadowHint) == 0x610, "CInfoDynamicShadowHint size should be 0x610");
	}
}
