// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#ifndef CUSTOM_GLOBAL_TYPES
	#include "../GlobalTypes.hpp"
#else
	#include "../Custom/GlobalTypes.hpp"
#endif


#include "C_PointEntity.hpp"





using namespace GlobalTypes;
namespace CS2 {
	namespace client {
		class CMapInfo : public CS2::client::C_PointEntity {
		public:
			int32_t m_iBuyingStatus; // 0x608 | Schema_Builtin | Size: 0x4
			float32 m_flBombRadius; // 0x60c | Schema_Builtin | Size: 0x4
			int32_t m_iPetPopulation; // 0x610 | Schema_Builtin | Size: 0x4
			bool m_bUseNormalSpawnsForDM; // 0x614 | Schema_Builtin | Size: 0x1
			bool m_bDisableAutoGeneratedDMSpawns; // 0x615 | Schema_Builtin | Size: 0x1
			S2_PAD(0x2);
			float32 m_flBotMaxVisionDistance; // 0x618 | Schema_Builtin | Size: 0x4
			int32_t m_iHostageCount; // 0x61c | Schema_Builtin | Size: 0x4
			bool m_bFadePlayerVisibilityFarZ; // 0x620 | Schema_Builtin | Size: 0x1
			bool m_bRainTraceToSkyEnabled; // 0x621 | Schema_Builtin | Size: 0x1
			S2_PAD(0x2);
			float32 m_flEnvRainStrength; // 0x624 | Schema_Builtin | Size: 0x4
			float32 m_flEnvPuddleRippleStrength; // 0x628 | Schema_Builtin | Size: 0x4
			float32 m_flEnvPuddleRippleDirection; // 0x62c | Schema_Builtin | Size: 0x4
			float32 m_flEnvWetnessCoverage; // 0x630 | Schema_Builtin | Size: 0x4
			float32 m_flEnvWetnessDryingAmount; // 0x634 | Schema_Builtin | Size: 0x4
		};
#ifdef USE_STATIC_ASSERTS
		static_assert(offsetof(CS2::client::CMapInfo, m_iBuyingStatus) == 0x608, "m_iBuyingStatus in CMapInfo should be at offset 0x608");
		static_assert(offsetof(CS2::client::CMapInfo, m_flBombRadius) == 0x60C, "m_flBombRadius in CMapInfo should be at offset 0x60C");
		static_assert(offsetof(CS2::client::CMapInfo, m_iPetPopulation) == 0x610, "m_iPetPopulation in CMapInfo should be at offset 0x610");
		static_assert(offsetof(CS2::client::CMapInfo, m_bUseNormalSpawnsForDM) == 0x614, "m_bUseNormalSpawnsForDM in CMapInfo should be at offset 0x614");
		static_assert(offsetof(CS2::client::CMapInfo, m_bDisableAutoGeneratedDMSpawns) == 0x615, "m_bDisableAutoGeneratedDMSpawns in CMapInfo should be at offset 0x615");
		static_assert(offsetof(CS2::client::CMapInfo, m_flBotMaxVisionDistance) == 0x618, "m_flBotMaxVisionDistance in CMapInfo should be at offset 0x618");
		static_assert(offsetof(CS2::client::CMapInfo, m_iHostageCount) == 0x61C, "m_iHostageCount in CMapInfo should be at offset 0x61C");
		static_assert(offsetof(CS2::client::CMapInfo, m_bFadePlayerVisibilityFarZ) == 0x620, "m_bFadePlayerVisibilityFarZ in CMapInfo should be at offset 0x620");
		static_assert(offsetof(CS2::client::CMapInfo, m_bRainTraceToSkyEnabled) == 0x621, "m_bRainTraceToSkyEnabled in CMapInfo should be at offset 0x621");
		static_assert(offsetof(CS2::client::CMapInfo, m_flEnvRainStrength) == 0x624, "m_flEnvRainStrength in CMapInfo should be at offset 0x624");
		static_assert(offsetof(CS2::client::CMapInfo, m_flEnvPuddleRippleStrength) == 0x628, "m_flEnvPuddleRippleStrength in CMapInfo should be at offset 0x628");
		static_assert(offsetof(CS2::client::CMapInfo, m_flEnvPuddleRippleDirection) == 0x62C, "m_flEnvPuddleRippleDirection in CMapInfo should be at offset 0x62C");
		static_assert(offsetof(CS2::client::CMapInfo, m_flEnvWetnessCoverage) == 0x630, "m_flEnvWetnessCoverage in CMapInfo should be at offset 0x630");
		static_assert(offsetof(CS2::client::CMapInfo, m_flEnvWetnessDryingAmount) == 0x634, "m_flEnvWetnessDryingAmount in CMapInfo should be at offset 0x634");
		static_assert(sizeof(CS2::client::CMapInfo) == 0x638, "CMapInfo size should be 0x638");

#endif
	}
}
