// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#ifndef CUSTOM_GLOBAL_TYPES
	#include "../GlobalTypes.hpp"
#else
	#include <Custom/GlobalTypes.hpp>
#endif







using namespace GlobalTypes;
namespace CS2 {
	namespace client {
		class CModelState  {
		public:
			S2_PAD(0xa0);
			// GlobalTypes::CStrongHandle<resourcesystem::InfoForResourceTypeCModel> m_hModel; // 0xa0 | Schema_Atomic | Size: 0x8
			char m_hModel[0x8]; // 0xa0 | Schema_Atomic | Size: 0x8
			GlobalTypes::CUtlSymbolLarge m_ModelName; // 0xa8 | Schema_Atomic | Size: 0x8
			S2_PAD(0xc9);
			bool m_bClientClothCreationSuppressed; // 0x179 | Schema_Builtin | Size: 0x1
			S2_PAD(0xa6);
			uint64_t m_MeshGroupMask; // 0x220 | Schema_Builtin | Size: 0x8
			S2_PAD(0x48);
			// GlobalTypes::C_NetworkUtlVectorBase< int32 > m_nBodyGroupChoices; // 0x270 | Schema_Atomic | Size: 0x18
			char m_nBodyGroupChoices[0x18]; // 0x270 | Schema_Atomic | Size: 0x18
			S2_PAD(0x32);
			int8_t m_nIdealMotionType; // 0x2ba | Schema_Builtin | Size: 0x1
			int8_t m_nForceLOD; // 0x2bb | Schema_Builtin | Size: 0x1
			int8_t m_nClothUpdateFlags; // 0x2bc | Schema_Builtin | Size: 0x1
			S2_PAD(0x13); // End padding
		};
#ifdef USE_STATIC_ASSERTS
		static_assert(offsetof(CS2::client::CModelState, m_hModel) == 0xA0, "m_hModel in CModelState should be at offset 0xA0");
		static_assert(offsetof(CS2::client::CModelState, m_ModelName) == 0xA8, "m_ModelName in CModelState should be at offset 0xA8");
		static_assert(offsetof(CS2::client::CModelState, m_bClientClothCreationSuppressed) == 0x179, "m_bClientClothCreationSuppressed in CModelState should be at offset 0x179");
		static_assert(offsetof(CS2::client::CModelState, m_MeshGroupMask) == 0x220, "m_MeshGroupMask in CModelState should be at offset 0x220");
		static_assert(offsetof(CS2::client::CModelState, m_nBodyGroupChoices) == 0x270, "m_nBodyGroupChoices in CModelState should be at offset 0x270");
		static_assert(offsetof(CS2::client::CModelState, m_nIdealMotionType) == 0x2BA, "m_nIdealMotionType in CModelState should be at offset 0x2BA");
		static_assert(offsetof(CS2::client::CModelState, m_nForceLOD) == 0x2BB, "m_nForceLOD in CModelState should be at offset 0x2BB");
		static_assert(offsetof(CS2::client::CModelState, m_nClothUpdateFlags) == 0x2BC, "m_nClothUpdateFlags in CModelState should be at offset 0x2BC");
		static_assert(sizeof(CS2::client::CModelState) == 0x2D0, "CModelState size should be 0x2D0");

#endif
	}
}
