// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#include <SDK/GlobalTypes.hpp>




namespace CS2 {
	namespace client {
		class CNetworkOriginCellCoordQuantizedVector  {
		public:
			S2_PAD(0x10);
			uint16_t m_cellX; // 0x10 | Schema_Builtin | Size: 0x2
			uint16_t m_cellY; // 0x12 | Schema_Builtin | Size: 0x2
			uint16_t m_cellZ; // 0x14 | Schema_Builtin | Size: 0x2
			uint16_t m_nOutsideWorld; // 0x16 | Schema_Builtin | Size: 0x2
			GlobalTypes::CNetworkedQuantizedFloat m_vecX; // 0x18 | Schema_Atomic | Size: 0x8
			GlobalTypes::CNetworkedQuantizedFloat m_vecY; // 0x20 | Schema_Atomic | Size: 0x8
			GlobalTypes::CNetworkedQuantizedFloat m_vecZ; // 0x28 | Schema_Atomic | Size: 0x8
		};
		static_assert(offsetof(CS2::client::CNetworkOriginCellCoordQuantizedVector, m_cellX) == 0x10, "m_cellX in CNetworkOriginCellCoordQuantizedVector should be at offset 0x10");
		static_assert(offsetof(CS2::client::CNetworkOriginCellCoordQuantizedVector, m_cellY) == 0x12, "m_cellY in CNetworkOriginCellCoordQuantizedVector should be at offset 0x12");
		static_assert(offsetof(CS2::client::CNetworkOriginCellCoordQuantizedVector, m_cellZ) == 0x14, "m_cellZ in CNetworkOriginCellCoordQuantizedVector should be at offset 0x14");
		static_assert(offsetof(CS2::client::CNetworkOriginCellCoordQuantizedVector, m_nOutsideWorld) == 0x16, "m_nOutsideWorld in CNetworkOriginCellCoordQuantizedVector should be at offset 0x16");
		static_assert(offsetof(CS2::client::CNetworkOriginCellCoordQuantizedVector, m_vecX) == 0x18, "m_vecX in CNetworkOriginCellCoordQuantizedVector should be at offset 0x18");
		static_assert(offsetof(CS2::client::CNetworkOriginCellCoordQuantizedVector, m_vecY) == 0x20, "m_vecY in CNetworkOriginCellCoordQuantizedVector should be at offset 0x20");
		static_assert(offsetof(CS2::client::CNetworkOriginCellCoordQuantizedVector, m_vecZ) == 0x28, "m_vecZ in CNetworkOriginCellCoordQuantizedVector should be at offset 0x28");
		static_assert(sizeof(CS2::client::CNetworkOriginCellCoordQuantizedVector) == 0x30, "CNetworkOriginCellCoordQuantizedVector size should be 0x30");
	}
}
