// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#ifndef CUSTOM_GLOBAL_TYPES
	#include "../GlobalTypes.hpp"
#else
	#include <Custom/GlobalTypes.hpp>
#endif


#include "../animlib/CNmPassthroughNode_CDefinition.hpp"





using namespace GlobalTypes;
namespace CS2 {
	namespace client {
		class CNmAimCSNode_CDefinition : public CS2::animlib::CNmPassthroughNode_CDefinition {
		public:
			int16_t m_nVerticalAngleNodeIdx; // 0x18 | Schema_Builtin | Size: 0x2
			int16_t m_nHorizontalAngleNodeIdx; // 0x1a | Schema_Builtin | Size: 0x2
			int16_t m_nWeaponCategoryNodeIdx; // 0x1c | Schema_Builtin | Size: 0x2
			int16_t m_nWeaponTypeNodeIdx; // 0x1e | Schema_Builtin | Size: 0x2
			int16_t m_nIsWeaponActionActiveNodeIdx; // 0x20 | Schema_Builtin | Size: 0x2
			int16_t m_nWeaponDropNodeIdx; // 0x22 | Schema_Builtin | Size: 0x2
			int16_t m_nEnabledNodeIdx; // 0x24 | Schema_Builtin | Size: 0x2
			S2_PAD(0x2);
			float32 m_flBlendTimeSeconds; // 0x28 | Schema_Builtin | Size: 0x4
			float32 m_flReduceRangeTimeSeconds; // 0x2c | Schema_Builtin | Size: 0x4
		};
#ifdef USE_STATIC_ASSERTS
		static_assert(offsetof(CS2::client::CNmAimCSNode_CDefinition, m_nVerticalAngleNodeIdx) == 0x18, "m_nVerticalAngleNodeIdx in CNmAimCSNode::CDefinition should be at offset 0x18");
		static_assert(offsetof(CS2::client::CNmAimCSNode_CDefinition, m_nHorizontalAngleNodeIdx) == 0x1A, "m_nHorizontalAngleNodeIdx in CNmAimCSNode::CDefinition should be at offset 0x1A");
		static_assert(offsetof(CS2::client::CNmAimCSNode_CDefinition, m_nWeaponCategoryNodeIdx) == 0x1C, "m_nWeaponCategoryNodeIdx in CNmAimCSNode::CDefinition should be at offset 0x1C");
		static_assert(offsetof(CS2::client::CNmAimCSNode_CDefinition, m_nWeaponTypeNodeIdx) == 0x1E, "m_nWeaponTypeNodeIdx in CNmAimCSNode::CDefinition should be at offset 0x1E");
		static_assert(offsetof(CS2::client::CNmAimCSNode_CDefinition, m_nIsWeaponActionActiveNodeIdx) == 0x20, "m_nIsWeaponActionActiveNodeIdx in CNmAimCSNode::CDefinition should be at offset 0x20");
		static_assert(offsetof(CS2::client::CNmAimCSNode_CDefinition, m_nWeaponDropNodeIdx) == 0x22, "m_nWeaponDropNodeIdx in CNmAimCSNode::CDefinition should be at offset 0x22");
		static_assert(offsetof(CS2::client::CNmAimCSNode_CDefinition, m_nEnabledNodeIdx) == 0x24, "m_nEnabledNodeIdx in CNmAimCSNode::CDefinition should be at offset 0x24");
		static_assert(offsetof(CS2::client::CNmAimCSNode_CDefinition, m_flBlendTimeSeconds) == 0x28, "m_flBlendTimeSeconds in CNmAimCSNode::CDefinition should be at offset 0x28");
		static_assert(offsetof(CS2::client::CNmAimCSNode_CDefinition, m_flReduceRangeTimeSeconds) == 0x2C, "m_flReduceRangeTimeSeconds in CNmAimCSNode::CDefinition should be at offset 0x2C");
		static_assert(sizeof(CS2::client::CNmAimCSNode_CDefinition) == 0x30, "CNmAimCSNode::CDefinition size should be 0x30");

#endif
	}
}
