// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#include <SDK/GlobalTypes.hpp>

#include <SDK/entity2/GameTime_t.hpp>



namespace CS2 {
	namespace client {
		class CountdownTimer  {
		public:
			S2_PAD(0x8);
			float32 m_duration; // 0x8 | Schema_Builtin | Size: 0x4
			entity2::GameTime_t m_timestamp; // 0xc | Schema_DeclaredClass | Size: 0x4
			float32 m_timescale; // 0x10 | Schema_Builtin | Size: 0x4
			GlobalTypes::WorldGroupId_t m_nWorldGroupId; // 0x14 | Schema_Atomic | Size: 0x4
		};
		static_assert(offsetof(CS2::client::CountdownTimer, m_duration) == 0x8, "m_duration in CountdownTimer should be at offset 0x8");
		static_assert(offsetof(CS2::client::CountdownTimer, m_timestamp) == 0xC, "m_timestamp in CountdownTimer should be at offset 0xC");
		static_assert(offsetof(CS2::client::CountdownTimer, m_timescale) == 0x10, "m_timescale in CountdownTimer should be at offset 0x10");
		static_assert(offsetof(CS2::client::CountdownTimer, m_nWorldGroupId) == 0x14, "m_nWorldGroupId in CountdownTimer should be at offset 0x14");
		static_assert(sizeof(CS2::client::CountdownTimer) == 0x18, "CountdownTimer size should be 0x18");
	}
}
