// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#ifndef CUSTOM_GLOBAL_TYPES
	#include "../GlobalTypes.hpp"
#else
	#include "../Custom/GlobalTypes.hpp"
#endif


#include "C_PointEntity.hpp"



namespace CS2 {
	namespace client {
		class CPathWithDynamicNodes;
	}
}


using namespace GlobalTypes;
namespace CS2 {
	namespace client {
		class CPathNode : public CS2::client::C_PointEntity {
		public:
			GlobalTypes::Vector m_vInTangentLocal; // 0x608 | Schema_Atomic | Size: 0xc
			GlobalTypes::Vector m_vOutTangentLocal; // 0x614 | Schema_Atomic | Size: 0xc
			GlobalTypes::CUtlString m_strParentPathUniqueID; // 0x620 | Schema_Atomic | Size: 0x8
			GlobalTypes::CUtlString m_strPathNodeParameter; // 0x628 | Schema_Atomic | Size: 0x8
			GlobalTypes::CTransform m_xWSPrevParent; // 0x630 | Schema_Atomic | Size: 0x20
			GlobalTypes::CHandle<client::CPathWithDynamicNodes> m_hPath; // 0x650 | Schema_Atomic | Size: 0x4
			// char m_hPath[0x4]; // 0x650 | Schema_Atomic | Size: 0x4
			S2_PAD(0xc); // End padding
		};
		static_assert(offsetof(CS2::client::CPathNode, m_vInTangentLocal) == 0x608, "m_vInTangentLocal in CPathNode should be at offset 0x608");
		static_assert(offsetof(CS2::client::CPathNode, m_vOutTangentLocal) == 0x614, "m_vOutTangentLocal in CPathNode should be at offset 0x614");
		static_assert(offsetof(CS2::client::CPathNode, m_strParentPathUniqueID) == 0x620, "m_strParentPathUniqueID in CPathNode should be at offset 0x620");
		static_assert(offsetof(CS2::client::CPathNode, m_strPathNodeParameter) == 0x628, "m_strPathNodeParameter in CPathNode should be at offset 0x628");
		static_assert(offsetof(CS2::client::CPathNode, m_xWSPrevParent) == 0x630, "m_xWSPrevParent in CPathNode should be at offset 0x630");
		static_assert(offsetof(CS2::client::CPathNode, m_hPath) == 0x650, "m_hPath in CPathNode should be at offset 0x650");
		static_assert(sizeof(CS2::client::CPathNode) == 0x660, "CPathNode size should be 0x660");
	}
}
