// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#include <SDK/GlobalTypes.hpp>




namespace CS2 {
	namespace client {
		class CPathQueryUtil  {
		public:
			S2_PAD(0x10);
			GlobalTypes::CTransform m_PathToEntityTransform; // 0x10 | Schema_Atomic | Size: 0x20
			// GlobalTypes::CUtlGlobalTypes::Vector< Vector > m_vecPathSamplePositions; // 0x30 | Schema_Atomic | Size: 0x18
			char  m_vecPathSamplePositions[0x18]; // 0x30 | Schema_Atomic | Size: 0x18
			// GlobalTypes::CUtlVector< float32 > m_vecPathSampleParameters; // 0x48 | Schema_Atomic | Size: 0x18
			char  m_vecPathSampleParameters[0x18]; // 0x48 | Schema_Atomic | Size: 0x18
			// GlobalTypes::CUtlVector< float32 > m_vecPathSampleDistances; // 0x60 | Schema_Atomic | Size: 0x18
			char  m_vecPathSampleDistances[0x18]; // 0x60 | Schema_Atomic | Size: 0x18
			bool m_bIsClosedLoop; // 0x78 | Schema_Builtin | Size: 0x1
			S2_PAD(0x7); // End padding
		};
		static_assert(offsetof(CS2::client::CPathQueryUtil, m_PathToEntityTransform) == 0x10, "m_PathToEntityTransform in CPathQueryUtil should be at offset 0x10");
		static_assert(offsetof(CS2::client::CPathQueryUtil, m_vecPathSamplePositions) == 0x30, "m_vecPathSamplePositions in CPathQueryUtil should be at offset 0x30");
		static_assert(offsetof(CS2::client::CPathQueryUtil, m_vecPathSampleParameters) == 0x48, "m_vecPathSampleParameters in CPathQueryUtil should be at offset 0x48");
		static_assert(offsetof(CS2::client::CPathQueryUtil, m_vecPathSampleDistances) == 0x60, "m_vecPathSampleDistances in CPathQueryUtil should be at offset 0x60");
		static_assert(offsetof(CS2::client::CPathQueryUtil, m_bIsClosedLoop) == 0x78, "m_bIsClosedLoop in CPathQueryUtil should be at offset 0x78");
		static_assert(sizeof(CS2::client::CPathQueryUtil) == 0x80, "CPathQueryUtil size should be 0x80");
	}
}
