// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#include <SDK/GlobalTypes.hpp>

#include <SDK/client/CPlayerPawnComponent.hpp>
#include <SDK/client/ObserverMode_t.hpp>
#include <SDK/entity2/GameTime_t.hpp>



namespace CS2 {
	namespace client {
		class C_BaseEntity;
	}
}
namespace CS2 {
	namespace client {
		class CPlayer_ObserverServices : public CS2::client::CPlayerPawnComponent {
		public:
			uint8_t m_iObserverMode; // 0x40 | Schema_Builtin | Size: 0x1
			S2_PAD(0x3);
			GlobalTypes::CHandle< client::C_BaseEntity > m_hObserverTarget; // 0x44 | Schema_Atomic | Size: 0x4
			// char  m_hObserverTarget[0x4]; // 0x44 | Schema_Atomic | Size: 0x4
			client::ObserverMode_t m_iObserverLastMode; // 0x48 | Schema_DeclaredEnum | Size: 0x4
			bool m_bForcedObserverMode; // 0x4c | Schema_Builtin | Size: 0x1
			S2_PAD(0x3);
			float32 m_flObserverChaseDistance; // 0x50 | Schema_Builtin | Size: 0x4
			entity2::GameTime_t m_flObserverChaseDistanceCalcTime; // 0x54 | Schema_DeclaredClass | Size: 0x4
		};
		static_assert(offsetof(CS2::client::CPlayer_ObserverServices, m_iObserverMode) == 0x40, "m_iObserverMode in CPlayer_ObserverServices should be at offset 0x40");
		static_assert(offsetof(CS2::client::CPlayer_ObserverServices, m_hObserverTarget) == 0x44, "m_hObserverTarget in CPlayer_ObserverServices should be at offset 0x44");
		static_assert(offsetof(CS2::client::CPlayer_ObserverServices, m_iObserverLastMode) == 0x48, "m_iObserverLastMode in CPlayer_ObserverServices should be at offset 0x48");
		static_assert(offsetof(CS2::client::CPlayer_ObserverServices, m_bForcedObserverMode) == 0x4C, "m_bForcedObserverMode in CPlayer_ObserverServices should be at offset 0x4C");
		static_assert(offsetof(CS2::client::CPlayer_ObserverServices, m_flObserverChaseDistance) == 0x50, "m_flObserverChaseDistance in CPlayer_ObserverServices should be at offset 0x50");
		static_assert(offsetof(CS2::client::CPlayer_ObserverServices, m_flObserverChaseDistanceCalcTime) == 0x54, "m_flObserverChaseDistanceCalcTime in CPlayer_ObserverServices should be at offset 0x54");
		static_assert(sizeof(CS2::client::CPlayer_ObserverServices) == 0x58, "CPlayer_ObserverServices size should be 0x58");
	}
}
