// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#ifndef CUSTOM_GLOBAL_TYPES
	#include "../GlobalTypes.hpp"
#else
	#include "../Custom/GlobalTypes.hpp"
#endif


#include "CLogicalEntity.hpp"
#include "PointTemplateClientOnlyEntityBehavior_t.hpp"
#include "PointTemplateOwnerSpawnGroupType_t.hpp"





using namespace GlobalTypes;
namespace CS2 {
	namespace client {
		class CPointTemplate : public CS2::client::CLogicalEntity {
		public:
			GlobalTypes::CUtlSymbolLarge m_iszWorldName; // 0x608 | Schema_Atomic | Size: 0x8
			GlobalTypes::CUtlSymbolLarge m_iszSource2EntityLumpName; // 0x610 | Schema_Atomic | Size: 0x8
			GlobalTypes::CUtlSymbolLarge m_iszEntityFilterName; // 0x618 | Schema_Atomic | Size: 0x8
			float32 m_flTimeoutInterval; // 0x620 | Schema_Builtin | Size: 0x4
			bool m_bAsynchronouslySpawnEntities; // 0x624 | Schema_Builtin | Size: 0x1
			S2_PAD(0x3);
			client::PointTemplateClientOnlyEntityBehavior_t m_clientOnlyEntityBehavior; // 0x628 | Schema_DeclaredEnum | Size: 0x4
			client::PointTemplateOwnerSpawnGroupType_t m_ownerSpawnGroupType; // 0x62c | Schema_DeclaredEnum | Size: 0x4
			GlobalTypes::CUtlVector< uint32 > m_createdSpawnGroupHandles; // 0x630 | Schema_Atomic | Size: 0x18
			// char m_createdSpawnGroupHandles[0x18]; // 0x630 | Schema_Atomic | Size: 0x18
			GlobalTypes::CUtlVector<GlobalTypes::CEntityHandle> m_SpawnedEntityHandles; // 0x648 | Schema_Atomic | Size: 0x18
			// char m_SpawnedEntityHandles[0x18]; // 0x648 | Schema_Atomic | Size: 0x18
			GlobalTypes::HSCRIPT m_ScriptSpawnCallback; // 0x660 | Schema_Atomic | Size: 0x8
			GlobalTypes::HSCRIPT m_ScriptCallbackScope; // 0x668 | Schema_Atomic | Size: 0x8
		};
		static_assert(offsetof(CS2::client::CPointTemplate, m_iszWorldName) == 0x608, "m_iszWorldName in CPointTemplate should be at offset 0x608");
		static_assert(offsetof(CS2::client::CPointTemplate, m_iszSource2EntityLumpName) == 0x610, "m_iszSource2EntityLumpName in CPointTemplate should be at offset 0x610");
		static_assert(offsetof(CS2::client::CPointTemplate, m_iszEntityFilterName) == 0x618, "m_iszEntityFilterName in CPointTemplate should be at offset 0x618");
		static_assert(offsetof(CS2::client::CPointTemplate, m_flTimeoutInterval) == 0x620, "m_flTimeoutInterval in CPointTemplate should be at offset 0x620");
		static_assert(offsetof(CS2::client::CPointTemplate, m_bAsynchronouslySpawnEntities) == 0x624, "m_bAsynchronouslySpawnEntities in CPointTemplate should be at offset 0x624");
		static_assert(offsetof(CS2::client::CPointTemplate, m_clientOnlyEntityBehavior) == 0x628, "m_clientOnlyEntityBehavior in CPointTemplate should be at offset 0x628");
		static_assert(offsetof(CS2::client::CPointTemplate, m_ownerSpawnGroupType) == 0x62C, "m_ownerSpawnGroupType in CPointTemplate should be at offset 0x62C");
		static_assert(offsetof(CS2::client::CPointTemplate, m_createdSpawnGroupHandles) == 0x630, "m_createdSpawnGroupHandles in CPointTemplate should be at offset 0x630");
		static_assert(offsetof(CS2::client::CPointTemplate, m_SpawnedEntityHandles) == 0x648, "m_SpawnedEntityHandles in CPointTemplate should be at offset 0x648");
		static_assert(offsetof(CS2::client::CPointTemplate, m_ScriptSpawnCallback) == 0x660, "m_ScriptSpawnCallback in CPointTemplate should be at offset 0x660");
		static_assert(offsetof(CS2::client::CPointTemplate, m_ScriptCallbackScope) == 0x668, "m_ScriptCallbackScope in CPointTemplate should be at offset 0x668");
		static_assert(sizeof(CS2::client::CPointTemplate) == 0x670, "CPointTemplate size should be 0x670");
	}
}
