// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#ifndef CUSTOM_GLOBAL_TYPES
	#include "../GlobalTypes.hpp"
#else
	#include <Custom/GlobalTypes.hpp>
#endif


#include "C_PointClientUIWorldPanel.hpp"





using namespace GlobalTypes;
namespace CS2 {
	namespace client {
		class CPointOffScreenIndicatorUi : public CS2::client::C_PointClientUIWorldPanel {
		public:
			bool m_bBeenEnabled; // 0x10e0 | Schema_Builtin | Size: 0x1
			bool m_bHide; // 0x10e1 | Schema_Builtin | Size: 0x1
			S2_PAD(0x2);
			float32 m_flSeenTargetTime; // 0x10e4 | Schema_Builtin | Size: 0x4
			client::C_PointClientUIWorldPanel* m_pTargetPanel; // 0x10e8 | Schema_Ptr | Size: 0x8
		};
#ifdef USE_STATIC_ASSERTS
		static_assert(offsetof(CS2::client::CPointOffScreenIndicatorUi, m_bBeenEnabled) == 0x10E0, "m_bBeenEnabled in CPointOffScreenIndicatorUi should be at offset 0x10E0");
		static_assert(offsetof(CS2::client::CPointOffScreenIndicatorUi, m_bHide) == 0x10E1, "m_bHide in CPointOffScreenIndicatorUi should be at offset 0x10E1");
		static_assert(offsetof(CS2::client::CPointOffScreenIndicatorUi, m_flSeenTargetTime) == 0x10E4, "m_flSeenTargetTime in CPointOffScreenIndicatorUi should be at offset 0x10E4");
		static_assert(offsetof(CS2::client::CPointOffScreenIndicatorUi, m_pTargetPanel) == 0x10E8, "m_pTargetPanel in CPointOffScreenIndicatorUi should be at offset 0x10E8");
		static_assert(sizeof(CS2::client::CPointOffScreenIndicatorUi) == 0x10F0, "CPointOffScreenIndicatorUi size should be 0x10F0");

#endif
	}
}
