// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#ifndef CUSTOM_GLOBAL_TYPES
	#include <SDK/GlobalTypes.hpp>
#else
	#include <Custom/GlobalTypes.hpp>
#endif





namespace CS2 {
	namespace client {
		class CTakeDamageInfo;
	}
}
namespace CS2 {
	namespace client {
		class CTakeDamageResult  {
		public:
			client::CTakeDamageInfo* m_pOriginatingInfo; // 0x0 | Schema_Ptr | Size: 0x8
			int32_t m_nHealthLost; // 0x8 | Schema_Builtin | Size: 0x4
			int32_t m_nHealthBefore; // 0xc | Schema_Builtin | Size: 0x4
			int32_t m_nDamageDealt; // 0x10 | Schema_Builtin | Size: 0x4
			float32 m_flPreModifiedDamage; // 0x14 | Schema_Builtin | Size: 0x4
			int32_t m_nTotalledHealthLost; // 0x18 | Schema_Builtin | Size: 0x4
			int32_t m_nTotalledDamageDealt; // 0x1c | Schema_Builtin | Size: 0x4
			bool m_bWasDamageSuppressed; // 0x20 | Schema_Builtin | Size: 0x1
			S2_PAD(0x7); // End padding
		};
		static_assert(offsetof(CS2::client::CTakeDamageResult, m_pOriginatingInfo) == 0x0, "m_pOriginatingInfo in CTakeDamageResult should be at offset 0x0");
		static_assert(offsetof(CS2::client::CTakeDamageResult, m_nHealthLost) == 0x8, "m_nHealthLost in CTakeDamageResult should be at offset 0x8");
		static_assert(offsetof(CS2::client::CTakeDamageResult, m_nHealthBefore) == 0xC, "m_nHealthBefore in CTakeDamageResult should be at offset 0xC");
		static_assert(offsetof(CS2::client::CTakeDamageResult, m_nDamageDealt) == 0x10, "m_nDamageDealt in CTakeDamageResult should be at offset 0x10");
		static_assert(offsetof(CS2::client::CTakeDamageResult, m_flPreModifiedDamage) == 0x14, "m_flPreModifiedDamage in CTakeDamageResult should be at offset 0x14");
		static_assert(offsetof(CS2::client::CTakeDamageResult, m_nTotalledHealthLost) == 0x18, "m_nTotalledHealthLost in CTakeDamageResult should be at offset 0x18");
		static_assert(offsetof(CS2::client::CTakeDamageResult, m_nTotalledDamageDealt) == 0x1C, "m_nTotalledDamageDealt in CTakeDamageResult should be at offset 0x1C");
		static_assert(offsetof(CS2::client::CTakeDamageResult, m_bWasDamageSuppressed) == 0x20, "m_bWasDamageSuppressed in CTakeDamageResult should be at offset 0x20");
		static_assert(sizeof(CS2::client::CTakeDamageResult) == 0x28, "CTakeDamageResult size should be 0x28");
	}
}
