// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#include <SDK/GlobalTypes.hpp>

#include <SDK/client/C_BaseTrigger.hpp>
#include <SDK/client/CountdownTimer.hpp>



namespace CS2 {
	namespace client {
		class CTriggerFan : public CS2::client::C_BaseTrigger {
		public:
			GlobalTypes::Vector m_vFanOrigin; // 0x1000 | Schema_Atomic | Size: 0xc
			GlobalTypes::Vector m_vFanOriginOffset; // 0x100c | Schema_Atomic | Size: 0xc
			GlobalTypes::Vector m_vFanEnd; // 0x1018 | Schema_Atomic | Size: 0xc
			GlobalTypes::Vector m_vNoiseDirectionTarget; // 0x1024 | Schema_Atomic | Size: 0xc
			GlobalTypes::Vector m_vDirection; // 0x1030 | Schema_Atomic | Size: 0xc
			bool m_bPushTowardsInfoTarget; // 0x103c | Schema_Builtin | Size: 0x1
			bool m_bPushAwayFromInfoTarget; // 0x103d | Schema_Builtin | Size: 0x1
			S2_PAD(0x2);
			GlobalTypes::Quaternion m_qNoiseDelta; // 0x1040 | Schema_Atomic | Size: 0x10
			// client::CHandle< client::CInfoFan > m_hInfoFan; // 0x1050 | Schema_Atomic | Size: 0x4
			char  m_hInfoFan[0x4]; // 0x1050 | Schema_Atomic | Size: 0x4
			float32 m_flForce; // 0x1054 | Schema_Builtin | Size: 0x4
			bool m_bFalloff; // 0x1058 | Schema_Builtin | Size: 0x1
			S2_PAD(0x7);
			client::CountdownTimer m_RampTimer; // 0x1060 | Schema_DeclaredClass | Size: 0x18
			S2_PAD(0x8); // End padding
		};
		static_assert(offsetof(CS2::client::CTriggerFan, m_vFanOrigin) == 0x1000, "m_vFanOrigin in CTriggerFan should be at offset 0x1000");
		static_assert(offsetof(CS2::client::CTriggerFan, m_vFanOriginOffset) == 0x100C, "m_vFanOriginOffset in CTriggerFan should be at offset 0x100C");
		static_assert(offsetof(CS2::client::CTriggerFan, m_vFanEnd) == 0x1018, "m_vFanEnd in CTriggerFan should be at offset 0x1018");
		static_assert(offsetof(CS2::client::CTriggerFan, m_vNoiseDirectionTarget) == 0x1024, "m_vNoiseDirectionTarget in CTriggerFan should be at offset 0x1024");
		static_assert(offsetof(CS2::client::CTriggerFan, m_vDirection) == 0x1030, "m_vDirection in CTriggerFan should be at offset 0x1030");
		static_assert(offsetof(CS2::client::CTriggerFan, m_bPushTowardsInfoTarget) == 0x103C, "m_bPushTowardsInfoTarget in CTriggerFan should be at offset 0x103C");
		static_assert(offsetof(CS2::client::CTriggerFan, m_bPushAwayFromInfoTarget) == 0x103D, "m_bPushAwayFromInfoTarget in CTriggerFan should be at offset 0x103D");
		static_assert(offsetof(CS2::client::CTriggerFan, m_qNoiseDelta) == 0x1040, "m_qNoiseDelta in CTriggerFan should be at offset 0x1040");
		static_assert(offsetof(CS2::client::CTriggerFan, m_hInfoFan) == 0x1050, "m_hInfoFan in CTriggerFan should be at offset 0x1050");
		static_assert(offsetof(CS2::client::CTriggerFan, m_flForce) == 0x1054, "m_flForce in CTriggerFan should be at offset 0x1054");
		static_assert(offsetof(CS2::client::CTriggerFan, m_bFalloff) == 0x1058, "m_bFalloff in CTriggerFan should be at offset 0x1058");
		static_assert(offsetof(CS2::client::CTriggerFan, m_RampTimer) == 0x1060, "m_RampTimer in CTriggerFan should be at offset 0x1060");
		static_assert(sizeof(CS2::client::CTriggerFan) == 0x1080, "CTriggerFan size should be 0x1080");
	}
}
