// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#ifndef CUSTOM_GLOBAL_TYPES
	#include <SDK/GlobalTypes.hpp>
#else
	#include <Custom/GlobalTypes.hpp>
#endif







using namespace GlobalTypes;
namespace CS2 {
	namespace client {
		class DecalGroupOption_t  {
		public:
			// GlobalTypes::CStrongHandleCopyable< resourcesystem::InfoForResourceTypeIMaterial2 > m_hMaterial; // 0x0 | Schema_Atomic | Size: 0x8
			char  m_hMaterial[0x8]; // 0x0 | Schema_Atomic | Size: 0x8
			GlobalTypes::CGlobalSymbol m_sSequenceName; // 0x8 | Schema_Atomic | Size: 0x8
			float32 m_flProbability; // 0x10 | Schema_Builtin | Size: 0x4
			bool m_bEnableAngleBetweenNormalAndGravityRange; // 0x14 | Schema_Builtin | Size: 0x1
			S2_PAD(0x3);
			float32 m_flMinAngleBetweenNormalAndGravity; // 0x18 | Schema_Builtin | Size: 0x4
			float32 m_flMaxAngleBetweenNormalAndGravity; // 0x1c | Schema_Builtin | Size: 0x4
		};
		static_assert(offsetof(CS2::client::DecalGroupOption_t, m_hMaterial) == 0x0, "m_hMaterial in DecalGroupOption_t should be at offset 0x0");
		static_assert(offsetof(CS2::client::DecalGroupOption_t, m_sSequenceName) == 0x8, "m_sSequenceName in DecalGroupOption_t should be at offset 0x8");
		static_assert(offsetof(CS2::client::DecalGroupOption_t, m_flProbability) == 0x10, "m_flProbability in DecalGroupOption_t should be at offset 0x10");
		static_assert(offsetof(CS2::client::DecalGroupOption_t, m_bEnableAngleBetweenNormalAndGravityRange) == 0x14, "m_bEnableAngleBetweenNormalAndGravityRange in DecalGroupOption_t should be at offset 0x14");
		static_assert(offsetof(CS2::client::DecalGroupOption_t, m_flMinAngleBetweenNormalAndGravity) == 0x18, "m_flMinAngleBetweenNormalAndGravity in DecalGroupOption_t should be at offset 0x18");
		static_assert(offsetof(CS2::client::DecalGroupOption_t, m_flMaxAngleBetweenNormalAndGravity) == 0x1C, "m_flMaxAngleBetweenNormalAndGravity in DecalGroupOption_t should be at offset 0x1C");
		static_assert(sizeof(CS2::client::DecalGroupOption_t) == 0x20, "DecalGroupOption_t size should be 0x20");
	}
}
