// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#ifndef CUSTOM_GLOBAL_TYPES
	#include "../GlobalTypes.hpp"
#else
	#include "../Custom/GlobalTypes.hpp"
#endif


#include "EDestructibleParts_DestroyParameterFlags.hpp"
#include "DamageTypes_t.hpp"





using namespace GlobalTypes;
namespace CS2 {
	namespace client {
		class DestructiblePartDestructionRequest_t  {
		public:
			client::EDestructibleParts_DestroyParameterFlags m_nDestroyFlags; // 0x0 | Schema_DeclaredEnum | Size: 0x4
			client::DamageTypes_t m_nDamageType; // 0x4 | Schema_DeclaredEnum | Size: 0x4
			float32 m_flPartDamage; // 0x8 | Schema_Builtin | Size: 0x4
			float32 m_flPartDamageRadius; // 0xc | Schema_Builtin | Size: 0x4
			GlobalTypes::VectorWS m_vWsPartDamageOrigin; // 0x10 | Schema_Atomic | Size: 0xc
			GlobalTypes::Vector m_vWsPartDamageForce; // 0x1c | Schema_Atomic | Size: 0xc
		};
#ifdef USE_STATIC_ASSERTS
		static_assert(offsetof(CS2::client::DestructiblePartDestructionRequest_t, m_nDestroyFlags) == 0x0, "m_nDestroyFlags in DestructiblePartDestructionRequest_t should be at offset 0x0");
		static_assert(offsetof(CS2::client::DestructiblePartDestructionRequest_t, m_nDamageType) == 0x4, "m_nDamageType in DestructiblePartDestructionRequest_t should be at offset 0x4");
		static_assert(offsetof(CS2::client::DestructiblePartDestructionRequest_t, m_flPartDamage) == 0x8, "m_flPartDamage in DestructiblePartDestructionRequest_t should be at offset 0x8");
		static_assert(offsetof(CS2::client::DestructiblePartDestructionRequest_t, m_flPartDamageRadius) == 0xC, "m_flPartDamageRadius in DestructiblePartDestructionRequest_t should be at offset 0xC");
		static_assert(offsetof(CS2::client::DestructiblePartDestructionRequest_t, m_vWsPartDamageOrigin) == 0x10, "m_vWsPartDamageOrigin in DestructiblePartDestructionRequest_t should be at offset 0x10");
		static_assert(offsetof(CS2::client::DestructiblePartDestructionRequest_t, m_vWsPartDamageForce) == 0x1C, "m_vWsPartDamageForce in DestructiblePartDestructionRequest_t should be at offset 0x1C");
		static_assert(sizeof(CS2::client::DestructiblePartDestructionRequest_t) == 0x28, "DestructiblePartDestructionRequest_t size should be 0x28");

#endif
	}
}
