// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#include <SDK/GlobalTypes.hpp>




namespace CS2 {
	namespace client {
		class Emphasized_Phoneme  {
		public:
			GlobalTypes::CUtlString m_sClassName; // 0x0 | Schema_Atomic | Size: 0x8
			S2_PAD(0x10);
			float32 m_flAmount; // 0x18 | Schema_Builtin | Size: 0x4
			bool m_bRequired; // 0x1c | Schema_Builtin | Size: 0x1
			bool m_bBasechecked; // 0x1d | Schema_Builtin | Size: 0x1
			bool m_bValid; // 0x1e | Schema_Builtin | Size: 0x1
			S2_PAD(0x1); // End padding
		};
		static_assert(offsetof(CS2::client::Emphasized_Phoneme, m_sClassName) == 0x0, "m_sClassName in C_BaseFlex::Emphasized_Phoneme should be at offset 0x0");
		static_assert(offsetof(CS2::client::Emphasized_Phoneme, m_flAmount) == 0x18, "m_flAmount in C_BaseFlex::Emphasized_Phoneme should be at offset 0x18");
		static_assert(offsetof(CS2::client::Emphasized_Phoneme, m_bRequired) == 0x1C, "m_bRequired in C_BaseFlex::Emphasized_Phoneme should be at offset 0x1C");
		static_assert(offsetof(CS2::client::Emphasized_Phoneme, m_bBasechecked) == 0x1D, "m_bBasechecked in C_BaseFlex::Emphasized_Phoneme should be at offset 0x1D");
		static_assert(offsetof(CS2::client::Emphasized_Phoneme, m_bValid) == 0x1E, "m_bValid in C_BaseFlex::Emphasized_Phoneme should be at offset 0x1E");
		static_assert(sizeof(CS2::client::Emphasized_Phoneme) == 0x20, "C_BaseFlex::Emphasized_Phoneme size should be 0x20");
	}
}
