// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#include <SDK/GlobalTypes.hpp>

#include <SDK/client/EngineLoopState_t.hpp>



namespace CS2 {
	namespace client {
		class EventClientProcessInput_t  {
		public:
			client::EngineLoopState_t m_LoopState; // 0x0 | Schema_DeclaredClass | Size: 0x28
			float32 m_flRealTime; // 0x28 | Schema_Builtin | Size: 0x4
			float32 m_flTickInterval; // 0x2c | Schema_Builtin | Size: 0x4
			float64 m_flTickStartTime; // 0x30 | Schema_Builtin | Size: 0x8
		};
		static_assert(offsetof(CS2::client::EventClientProcessInput_t, m_LoopState) == 0x0, "m_LoopState in EventClientProcessInput_t should be at offset 0x0");
		static_assert(offsetof(CS2::client::EventClientProcessInput_t, m_flRealTime) == 0x28, "m_flRealTime in EventClientProcessInput_t should be at offset 0x28");
		static_assert(offsetof(CS2::client::EventClientProcessInput_t, m_flTickInterval) == 0x2C, "m_flTickInterval in EventClientProcessInput_t should be at offset 0x2C");
		static_assert(offsetof(CS2::client::EventClientProcessInput_t, m_flTickStartTime) == 0x30, "m_flTickStartTime in EventClientProcessInput_t should be at offset 0x30");
		static_assert(sizeof(CS2::client::EventClientProcessInput_t) == 0x38, "EventClientProcessInput_t size should be 0x38");
	}
}
