// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#ifndef CUSTOM_GLOBAL_TYPES
	#include <SDK/GlobalTypes.hpp>
#else
	#include <Custom/GlobalTypes.hpp>
#endif


#include <SDK/client/EngineLoopState_t.hpp>





using namespace GlobalTypes;
namespace CS2 {
	namespace client {
		class EventSetTime_t  {
		public:
			client::EngineLoopState_t m_LoopState; // 0x0 | Schema_DeclaredClass | Size: 0x28
			int32_t m_nClientOutputFrames; // 0x28 | Schema_Builtin | Size: 0x4
			S2_PAD(0x4);
			float64 m_flRealTime; // 0x30 | Schema_Builtin | Size: 0x8
			float64 m_flRenderTime; // 0x38 | Schema_Builtin | Size: 0x8
			float64 m_flRenderFrameTime; // 0x40 | Schema_Builtin | Size: 0x8
			float64 m_flRenderFrameTimeUnbounded; // 0x48 | Schema_Builtin | Size: 0x8
			float64 m_flRenderFrameTimeUnscaled; // 0x50 | Schema_Builtin | Size: 0x8
			float64 m_flTickRemainder; // 0x58 | Schema_Builtin | Size: 0x8
		};
		static_assert(offsetof(CS2::client::EventSetTime_t, m_LoopState) == 0x0, "m_LoopState in EventSetTime_t should be at offset 0x0");
		static_assert(offsetof(CS2::client::EventSetTime_t, m_nClientOutputFrames) == 0x28, "m_nClientOutputFrames in EventSetTime_t should be at offset 0x28");
		static_assert(offsetof(CS2::client::EventSetTime_t, m_flRealTime) == 0x30, "m_flRealTime in EventSetTime_t should be at offset 0x30");
		static_assert(offsetof(CS2::client::EventSetTime_t, m_flRenderTime) == 0x38, "m_flRenderTime in EventSetTime_t should be at offset 0x38");
		static_assert(offsetof(CS2::client::EventSetTime_t, m_flRenderFrameTime) == 0x40, "m_flRenderFrameTime in EventSetTime_t should be at offset 0x40");
		static_assert(offsetof(CS2::client::EventSetTime_t, m_flRenderFrameTimeUnbounded) == 0x48, "m_flRenderFrameTimeUnbounded in EventSetTime_t should be at offset 0x48");
		static_assert(offsetof(CS2::client::EventSetTime_t, m_flRenderFrameTimeUnscaled) == 0x50, "m_flRenderFrameTimeUnscaled in EventSetTime_t should be at offset 0x50");
		static_assert(offsetof(CS2::client::EventSetTime_t, m_flTickRemainder) == 0x58, "m_flTickRemainder in EventSetTime_t should be at offset 0x58");
		static_assert(sizeof(CS2::client::EventSetTime_t) == 0x60, "EventSetTime_t size should be 0x60");
	}
}
