// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#ifndef CUSTOM_GLOBAL_TYPES
	#include <SDK/GlobalTypes.hpp>
#else
	#include <Custom/GlobalTypes.hpp>
#endif


#include <SDK/client/EngineLoopState_t.hpp>



namespace CS2 {
	namespace client {
		class EventClientPreOutput_t  {
		public:
			client::EngineLoopState_t m_LoopState; // 0x0 | Schema_DeclaredClass | Size: 0x28
			float64 m_flRenderTime; // 0x28 | Schema_Builtin | Size: 0x8
			float64 m_flRenderFrameTime; // 0x30 | Schema_Builtin | Size: 0x8
			float64 m_flRenderFrameTimeUnbounded; // 0x38 | Schema_Builtin | Size: 0x8
			float32 m_flRealTime; // 0x40 | Schema_Builtin | Size: 0x4
			bool m_bRenderOnly; // 0x44 | Schema_Builtin | Size: 0x1
			S2_PAD(0x3); // End padding
		};
		static_assert(offsetof(CS2::client::EventClientPreOutput_t, m_LoopState) == 0x0, "m_LoopState in EventClientPreOutput_t should be at offset 0x0");
		static_assert(offsetof(CS2::client::EventClientPreOutput_t, m_flRenderTime) == 0x28, "m_flRenderTime in EventClientPreOutput_t should be at offset 0x28");
		static_assert(offsetof(CS2::client::EventClientPreOutput_t, m_flRenderFrameTime) == 0x30, "m_flRenderFrameTime in EventClientPreOutput_t should be at offset 0x30");
		static_assert(offsetof(CS2::client::EventClientPreOutput_t, m_flRenderFrameTimeUnbounded) == 0x38, "m_flRenderFrameTimeUnbounded in EventClientPreOutput_t should be at offset 0x38");
		static_assert(offsetof(CS2::client::EventClientPreOutput_t, m_flRealTime) == 0x40, "m_flRealTime in EventClientPreOutput_t should be at offset 0x40");
		static_assert(offsetof(CS2::client::EventClientPreOutput_t, m_bRenderOnly) == 0x44, "m_bRenderOnly in EventClientPreOutput_t should be at offset 0x44");
		static_assert(sizeof(CS2::client::EventClientPreOutput_t) == 0x48, "EventClientPreOutput_t size should be 0x48");
	}
}
