// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#ifndef CUSTOM_GLOBAL_TYPES
	#include <SDK/GlobalTypes.hpp>
#else
	#include <Custom/GlobalTypes.hpp>
#endif


#include <SDK/client/EngineLoopState_t.hpp>





using namespace GlobalTypes;
namespace CS2 {
	namespace client {
		class EventClientFrameSimulate_t  {
		public:
			client::EngineLoopState_t m_LoopState; // 0x0 | Schema_DeclaredClass | Size: 0x28
			float32 m_flRealTime; // 0x28 | Schema_Builtin | Size: 0x4
			float32 m_flFrameTime; // 0x2c | Schema_Builtin | Size: 0x4
			bool m_bScheduleSendTickPacket; // 0x30 | Schema_Builtin | Size: 0x1
			S2_PAD(0x7); // End padding
		};
		static_assert(offsetof(CS2::client::EventClientFrameSimulate_t, m_LoopState) == 0x0, "m_LoopState in EventClientFrameSimulate_t should be at offset 0x0");
		static_assert(offsetof(CS2::client::EventClientFrameSimulate_t, m_flRealTime) == 0x28, "m_flRealTime in EventClientFrameSimulate_t should be at offset 0x28");
		static_assert(offsetof(CS2::client::EventClientFrameSimulate_t, m_flFrameTime) == 0x2C, "m_flFrameTime in EventClientFrameSimulate_t should be at offset 0x2C");
		static_assert(offsetof(CS2::client::EventClientFrameSimulate_t, m_bScheduleSendTickPacket) == 0x30, "m_bScheduleSendTickPacket in EventClientFrameSimulate_t should be at offset 0x30");
		static_assert(sizeof(CS2::client::EventClientFrameSimulate_t) == 0x38, "EventClientFrameSimulate_t size should be 0x38");
	}
}
