// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#ifndef CUSTOM_GLOBAL_TYPES
	#include <SDK/GlobalTypes.hpp>
#else
	#include <Custom/GlobalTypes.hpp>
#endif







using namespace GlobalTypes;
namespace CS2 {
	namespace client {
		class PointCameraSettings_t  {
		public:
			float32 m_flNearBlurryDistance; // 0x0 | Schema_Builtin | Size: 0x4
			float32 m_flNearCrispDistance; // 0x4 | Schema_Builtin | Size: 0x4
			float32 m_flFarCrispDistance; // 0x8 | Schema_Builtin | Size: 0x4
			float32 m_flFarBlurryDistance; // 0xc | Schema_Builtin | Size: 0x4
		};
		static_assert(offsetof(CS2::client::PointCameraSettings_t, m_flNearBlurryDistance) == 0x0, "m_flNearBlurryDistance in PointCameraSettings_t should be at offset 0x0");
		static_assert(offsetof(CS2::client::PointCameraSettings_t, m_flNearCrispDistance) == 0x4, "m_flNearCrispDistance in PointCameraSettings_t should be at offset 0x4");
		static_assert(offsetof(CS2::client::PointCameraSettings_t, m_flFarCrispDistance) == 0x8, "m_flFarCrispDistance in PointCameraSettings_t should be at offset 0x8");
		static_assert(offsetof(CS2::client::PointCameraSettings_t, m_flFarBlurryDistance) == 0xC, "m_flFarBlurryDistance in PointCameraSettings_t should be at offset 0xC");
		static_assert(sizeof(CS2::client::PointCameraSettings_t) == 0x10, "PointCameraSettings_t size should be 0x10");
	}
}
