// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#ifndef CUSTOM_GLOBAL_TYPES
	#include <SDK/GlobalTypes.hpp>
#else
	#include <Custom/GlobalTypes.hpp>
#endif





namespace CS2 {
	namespace client {
		class ResponseFollowup  {
		public:
			char* followup_concept; // 0x0 | Schema_Ptr | Size: 0x8
			char* followup_contexts; // 0x8 | Schema_Ptr | Size: 0x8
			float32 followup_delay; // 0x10 | Schema_Builtin | Size: 0x4
			char* followup_target; // 0x14 | Schema_Ptr | Size: 0x8
			char* followup_entityiotarget; // 0x1c | Schema_Ptr | Size: 0x8
			char* followup_entityioinput; // 0x24 | Schema_Ptr | Size: 0x8
			float32 followup_entityiodelay; // 0x2c | Schema_Builtin | Size: 0x4
			bool bFired; // 0x30 | Schema_Builtin | Size: 0x1
		};
		static_assert(offsetof(CS2::client::ResponseFollowup, followup_concept) == 0x0, "followup_concept in ResponseFollowup should be at offset 0x0");
		static_assert(offsetof(CS2::client::ResponseFollowup, followup_contexts) == 0x8, "followup_contexts in ResponseFollowup should be at offset 0x8");
		static_assert(offsetof(CS2::client::ResponseFollowup, followup_delay) == 0x10, "followup_delay in ResponseFollowup should be at offset 0x10");
		static_assert(offsetof(CS2::client::ResponseFollowup, followup_target) == 0x14, "followup_target in ResponseFollowup should be at offset 0x14");
		static_assert(offsetof(CS2::client::ResponseFollowup, followup_entityiotarget) == 0x1C, "followup_entityiotarget in ResponseFollowup should be at offset 0x1C");
		static_assert(offsetof(CS2::client::ResponseFollowup, followup_entityioinput) == 0x24, "followup_entityioinput in ResponseFollowup should be at offset 0x24");
		static_assert(offsetof(CS2::client::ResponseFollowup, followup_entityiodelay) == 0x2C, "followup_entityiodelay in ResponseFollowup should be at offset 0x2C");
		static_assert(offsetof(CS2::client::ResponseFollowup, bFired) == 0x30, "bFired in ResponseFollowup should be at offset 0x30");
		static_assert(sizeof(CS2::client::ResponseFollowup) == 0x31, "ResponseFollowup size should be 0x31");
	}
}
