// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#include <SDK/GlobalTypes.hpp>




namespace CS2 {
	namespace physicslib {
		class CastSphereSATParams_t  {
		public:
			GlobalTypes::Vector m_vRayStart; // 0x0 | Schema_Atomic | Size: 0xc
			GlobalTypes::Vector m_vRayDelta; // 0xc | Schema_Atomic | Size: 0xc
			float32 m_flRadius; // 0x18 | Schema_Builtin | Size: 0x4
			float32 m_flMaxFraction; // 0x1c | Schema_Builtin | Size: 0x4
			float32 m_flScale; // 0x20 | Schema_Builtin | Size: 0x4
			S2_PAD(0x4);
			GlobalTypes::RnHull_t* m_pHull; // 0x28 | Schema_Ptr | Size: 0x8
		};
		static_assert(offsetof(CS2::physicslib::CastSphereSATParams_t, m_vRayStart) == 0x0, "m_vRayStart in CastSphereSATParams_t should be at offset 0x0");
		static_assert(offsetof(CS2::physicslib::CastSphereSATParams_t, m_vRayDelta) == 0xC, "m_vRayDelta in CastSphereSATParams_t should be at offset 0xC");
		static_assert(offsetof(CS2::physicslib::CastSphereSATParams_t, m_flRadius) == 0x18, "m_flRadius in CastSphereSATParams_t should be at offset 0x18");
		static_assert(offsetof(CS2::physicslib::CastSphereSATParams_t, m_flMaxFraction) == 0x1C, "m_flMaxFraction in CastSphereSATParams_t should be at offset 0x1C");
		static_assert(offsetof(CS2::physicslib::CastSphereSATParams_t, m_flScale) == 0x20, "m_flScale in CastSphereSATParams_t should be at offset 0x20");
		static_assert(offsetof(CS2::physicslib::CastSphereSATParams_t, m_pHull) == 0x28, "m_pHull in CastSphereSATParams_t should be at offset 0x28");
		static_assert(sizeof(CS2::physicslib::CastSphereSATParams_t) == 0x30, "CastSphereSATParams_t size should be 0x30");
	}
}
