// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#ifndef CUSTOM_GLOBAL_TYPES
	#include "../GlobalTypes.hpp"
#else
	#include "../Custom/GlobalTypes.hpp"
#endif


#include "CollisionDetailLayerInfo_t_Name_t.hpp"





using namespace GlobalTypes;
namespace CS2 {
	namespace physicslib {
		class CollisionDetailLayerInfo_t  {
		public:
			GlobalTypes::CUtlString m_sDescription; // 0x0 | Schema_Atomic | Size: 0x8
			GlobalTypes::CUtlString m_sFriendlyName; // 0x8 | Schema_Atomic | Size: 0x8
			bool m_bIsQueryOnly; // 0x10 | Schema_Builtin | Size: 0x1
			S2_PAD(0x7);
			GlobalTypes::CUtlString m_sParentDetailLayer; // 0x18 | Schema_Atomic | Size: 0x8
			GlobalTypes::CUtlVector<physicslib::CollisionDetailLayerInfo_t_Name_t> m_vecSubtreeDetailLayers; // 0x20 | Schema_Atomic | Size: 0x18
			// char m_vecSubtreeDetailLayers[0x18]; // 0x20 | Schema_Atomic | Size: 0x18
			bool m_bNotPickable; // 0x38 | Schema_Builtin | Size: 0x1
			S2_PAD(0x7); // End padding
		};
#ifdef USE_STATIC_ASSERTS
		static_assert(offsetof(CS2::physicslib::CollisionDetailLayerInfo_t, m_sDescription) == 0x0, "m_sDescription in CollisionDetailLayerInfo_t should be at offset 0x0");
		static_assert(offsetof(CS2::physicslib::CollisionDetailLayerInfo_t, m_sFriendlyName) == 0x8, "m_sFriendlyName in CollisionDetailLayerInfo_t should be at offset 0x8");
		static_assert(offsetof(CS2::physicslib::CollisionDetailLayerInfo_t, m_bIsQueryOnly) == 0x10, "m_bIsQueryOnly in CollisionDetailLayerInfo_t should be at offset 0x10");
		static_assert(offsetof(CS2::physicslib::CollisionDetailLayerInfo_t, m_sParentDetailLayer) == 0x18, "m_sParentDetailLayer in CollisionDetailLayerInfo_t should be at offset 0x18");
		static_assert(offsetof(CS2::physicslib::CollisionDetailLayerInfo_t, m_vecSubtreeDetailLayers) == 0x20, "m_vecSubtreeDetailLayers in CollisionDetailLayerInfo_t should be at offset 0x20");
		static_assert(offsetof(CS2::physicslib::CollisionDetailLayerInfo_t, m_bNotPickable) == 0x38, "m_bNotPickable in CollisionDetailLayerInfo_t should be at offset 0x38");
		static_assert(sizeof(CS2::physicslib::CollisionDetailLayerInfo_t) == 0x40, "CollisionDetailLayerInfo_t size should be 0x40");

#endif
	}
}
