// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#include <SDK/GlobalTypes.hpp>




namespace CS2 {
	namespace physicslib {
		class FeAntiTunnelProbeBuild_t  {
		public:
			float32 flWeight; // 0x0 | Schema_Builtin | Size: 0x4
			float32 flActivationDistance; // 0x4 | Schema_Builtin | Size: 0x4
			float32 flBias; // 0x8 | Schema_Builtin | Size: 0x4
			float32 flCurvature; // 0xc | Schema_Builtin | Size: 0x4
			uint32_t nFlags; // 0x10 | Schema_Builtin | Size: 0x4
			uint16_t nProbeNode; // 0x14 | Schema_Builtin | Size: 0x2
			S2_PAD(0x2);
			// GlobalTypes::CUtlVector< uint16 > targetNodes; // 0x18 | Schema_Atomic | Size: 0x18
			char  targetNodes[0x18]; // 0x18 | Schema_Atomic | Size: 0x18
		};
		static_assert(offsetof(CS2::physicslib::FeAntiTunnelProbeBuild_t, flWeight) == 0x0, "flWeight in FeAntiTunnelProbeBuild_t should be at offset 0x0");
		static_assert(offsetof(CS2::physicslib::FeAntiTunnelProbeBuild_t, flActivationDistance) == 0x4, "flActivationDistance in FeAntiTunnelProbeBuild_t should be at offset 0x4");
		static_assert(offsetof(CS2::physicslib::FeAntiTunnelProbeBuild_t, flBias) == 0x8, "flBias in FeAntiTunnelProbeBuild_t should be at offset 0x8");
		static_assert(offsetof(CS2::physicslib::FeAntiTunnelProbeBuild_t, flCurvature) == 0xC, "flCurvature in FeAntiTunnelProbeBuild_t should be at offset 0xC");
		static_assert(offsetof(CS2::physicslib::FeAntiTunnelProbeBuild_t, nFlags) == 0x10, "nFlags in FeAntiTunnelProbeBuild_t should be at offset 0x10");
		static_assert(offsetof(CS2::physicslib::FeAntiTunnelProbeBuild_t, nProbeNode) == 0x14, "nProbeNode in FeAntiTunnelProbeBuild_t should be at offset 0x14");
		static_assert(offsetof(CS2::physicslib::FeAntiTunnelProbeBuild_t, targetNodes) == 0x18, "targetNodes in FeAntiTunnelProbeBuild_t should be at offset 0x18");
		static_assert(sizeof(CS2::physicslib::FeAntiTunnelProbeBuild_t) == 0x30, "FeAntiTunnelProbeBuild_t size should be 0x30");
	}
}
