// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#include <SDK/GlobalTypes.hpp>




namespace CS2 {
	namespace physicslib {
		class FeAntiTunnelProbe_t  {
		public:
			float32 flWeight; // 0x0 | Schema_Builtin | Size: 0x4
			uint32_t nFlags; // 0x4 | Schema_Builtin | Size: 0x4
			uint16_t nProbeNode; // 0x8 | Schema_Builtin | Size: 0x2
			uint16_t nCount; // 0xa | Schema_Builtin | Size: 0x2
			uint32_t nBegin; // 0xc | Schema_Builtin | Size: 0x4
			float32 flActivationDistance; // 0x10 | Schema_Builtin | Size: 0x4
			float32 flCurvatureRadius; // 0x14 | Schema_Builtin | Size: 0x4
			float32 flBias; // 0x18 | Schema_Builtin | Size: 0x4
		};
		static_assert(offsetof(CS2::physicslib::FeAntiTunnelProbe_t, flWeight) == 0x0, "flWeight in FeAntiTunnelProbe_t should be at offset 0x0");
		static_assert(offsetof(CS2::physicslib::FeAntiTunnelProbe_t, nFlags) == 0x4, "nFlags in FeAntiTunnelProbe_t should be at offset 0x4");
		static_assert(offsetof(CS2::physicslib::FeAntiTunnelProbe_t, nProbeNode) == 0x8, "nProbeNode in FeAntiTunnelProbe_t should be at offset 0x8");
		static_assert(offsetof(CS2::physicslib::FeAntiTunnelProbe_t, nCount) == 0xA, "nCount in FeAntiTunnelProbe_t should be at offset 0xA");
		static_assert(offsetof(CS2::physicslib::FeAntiTunnelProbe_t, nBegin) == 0xC, "nBegin in FeAntiTunnelProbe_t should be at offset 0xC");
		static_assert(offsetof(CS2::physicslib::FeAntiTunnelProbe_t, flActivationDistance) == 0x10, "flActivationDistance in FeAntiTunnelProbe_t should be at offset 0x10");
		static_assert(offsetof(CS2::physicslib::FeAntiTunnelProbe_t, flCurvatureRadius) == 0x14, "flCurvatureRadius in FeAntiTunnelProbe_t should be at offset 0x14");
		static_assert(offsetof(CS2::physicslib::FeAntiTunnelProbe_t, flBias) == 0x18, "flBias in FeAntiTunnelProbe_t should be at offset 0x18");
		static_assert(sizeof(CS2::physicslib::FeAntiTunnelProbe_t) == 0x1C, "FeAntiTunnelProbe_t size should be 0x1C");
	}
}
