// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#ifndef CUSTOM_GLOBAL_TYPES
	#include <SDK/GlobalTypes.hpp>
#else
	#include <Custom/GlobalTypes.hpp>
#endif





namespace CS2 {
	namespace physicslib {
		class FeKelagerBend2_t  {
		public:
			float32 flWeight[3]; // 0x0 | Schema_FixedArray | Size: 0xc
			float32 flHeight0; // 0xc | Schema_Builtin | Size: 0x4
			uint16_t nNode[3]; // 0x10 | Schema_FixedArray | Size: 0x6
			uint16_t nReserved; // 0x16 | Schema_Builtin | Size: 0x2
		};
		static_assert(offsetof(CS2::physicslib::FeKelagerBend2_t, flWeight) == 0x0, "flWeight in FeKelagerBend2_t should be at offset 0x0");
		static_assert(offsetof(CS2::physicslib::FeKelagerBend2_t, flHeight0) == 0xC, "flHeight0 in FeKelagerBend2_t should be at offset 0xC");
		static_assert(offsetof(CS2::physicslib::FeKelagerBend2_t, nNode) == 0x10, "nNode in FeKelagerBend2_t should be at offset 0x10");
		static_assert(offsetof(CS2::physicslib::FeKelagerBend2_t, nReserved) == 0x16, "nReserved in FeKelagerBend2_t should be at offset 0x16");
		static_assert(sizeof(CS2::physicslib::FeKelagerBend2_t) == 0x18, "FeKelagerBend2_t size should be 0x18");
	}
}
