// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#ifndef CUSTOM_GLOBAL_TYPES
	#include "../GlobalTypes.hpp"
#else
	#include <Custom/GlobalTypes.hpp>
#endif







using namespace GlobalTypes;
namespace CS2 {
	namespace physicslib {
		class FeNodeStrayBox_t  {
		public:
			GlobalTypes::Vector vMin; // 0x0 | Schema_Atomic | Size: 0xc
			uint32_t nFlags; // 0xc | Schema_Builtin | Size: 0x4
			GlobalTypes::Vector vMax; // 0x10 | Schema_Atomic | Size: 0xc
			uint16_t nNode[2]; // 0x1c | Schema_FixedArray | Size: 0x4
		};
#ifdef USE_STATIC_ASSERTS
		static_assert(offsetof(CS2::physicslib::FeNodeStrayBox_t, vMin) == 0x0, "vMin in FeNodeStrayBox_t should be at offset 0x0");
		static_assert(offsetof(CS2::physicslib::FeNodeStrayBox_t, nFlags) == 0xC, "nFlags in FeNodeStrayBox_t should be at offset 0xC");
		static_assert(offsetof(CS2::physicslib::FeNodeStrayBox_t, vMax) == 0x10, "vMax in FeNodeStrayBox_t should be at offset 0x10");
		static_assert(offsetof(CS2::physicslib::FeNodeStrayBox_t, nNode) == 0x1C, "nNode in FeNodeStrayBox_t should be at offset 0x1C");
		static_assert(sizeof(CS2::physicslib::FeNodeStrayBox_t) == 0x20, "FeNodeStrayBox_t size should be 0x20");

#endif
	}
}
