// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#include <SDK/GlobalTypes.hpp>




namespace CS2 {
	namespace physicslib {
		class FeNodeWindBase_t  {
		public:
			uint16_t nNodeX0; // 0x0 | Schema_Builtin | Size: 0x2
			uint16_t nNodeX1; // 0x2 | Schema_Builtin | Size: 0x2
			uint16_t nNodeY0; // 0x4 | Schema_Builtin | Size: 0x2
			uint16_t nNodeY1; // 0x6 | Schema_Builtin | Size: 0x2
		};
		static_assert(offsetof(CS2::physicslib::FeNodeWindBase_t, nNodeX0) == 0x0, "nNodeX0 in FeNodeWindBase_t should be at offset 0x0");
		static_assert(offsetof(CS2::physicslib::FeNodeWindBase_t, nNodeX1) == 0x2, "nNodeX1 in FeNodeWindBase_t should be at offset 0x2");
		static_assert(offsetof(CS2::physicslib::FeNodeWindBase_t, nNodeY0) == 0x4, "nNodeY0 in FeNodeWindBase_t should be at offset 0x4");
		static_assert(offsetof(CS2::physicslib::FeNodeWindBase_t, nNodeY1) == 0x6, "nNodeY1 in FeNodeWindBase_t should be at offset 0x6");
		static_assert(sizeof(CS2::physicslib::FeNodeWindBase_t) == 0x8, "FeNodeWindBase_t size should be 0x8");
	}
}
