// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#include <SDK/GlobalTypes.hpp>




namespace CS2 {
	namespace physicslib {
		class FeSimdRodConstraint_t  {
		public:
			uint16_t nNode[4]; // 0x0 | Schema_FixedArray | Size: 0x0
			S2_PAD(0x10);
			GlobalTypes::fltx4 f4MaxDist; // 0x10 | Schema_Atomic | Size: 0x10
			GlobalTypes::fltx4 f4MinDist; // 0x20 | Schema_Atomic | Size: 0x10
			GlobalTypes::fltx4 f4Weight0; // 0x30 | Schema_Atomic | Size: 0x10
			GlobalTypes::fltx4 f4RelaxationFactor; // 0x40 | Schema_Atomic | Size: 0x10
		};
		static_assert(offsetof(CS2::physicslib::FeSimdRodConstraint_t, nNode) == 0x0, "nNode in FeSimdRodConstraint_t should be at offset 0x0");
		static_assert(offsetof(CS2::physicslib::FeSimdRodConstraint_t, f4MaxDist) == 0x10, "f4MaxDist in FeSimdRodConstraint_t should be at offset 0x10");
		static_assert(offsetof(CS2::physicslib::FeSimdRodConstraint_t, f4MinDist) == 0x20, "f4MinDist in FeSimdRodConstraint_t should be at offset 0x20");
		static_assert(offsetof(CS2::physicslib::FeSimdRodConstraint_t, f4Weight0) == 0x30, "f4Weight0 in FeSimdRodConstraint_t should be at offset 0x30");
		static_assert(offsetof(CS2::physicslib::FeSimdRodConstraint_t, f4RelaxationFactor) == 0x40, "f4RelaxationFactor in FeSimdRodConstraint_t should be at offset 0x40");
		static_assert(sizeof(CS2::physicslib::FeSimdRodConstraint_t) == 0x50, "FeSimdRodConstraint_t size should be 0x50");
	}
}
