// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#ifndef CUSTOM_GLOBAL_TYPES
	#include <SDK/GlobalTypes.hpp>
#else
	#include <Custom/GlobalTypes.hpp>
#endif





namespace CS2 {
	namespace physicslib {
		class FeStiffHingeBuild_t  {
		public:
			float32 flMaxAngle; // 0x0 | Schema_Builtin | Size: 0x4
			float32 flStrength; // 0x4 | Schema_Builtin | Size: 0x4
			float32 flMotionBias[3]; // 0x8 | Schema_FixedArray | Size: 0xc
			uint16_t nNode[3]; // 0x14 | Schema_FixedArray | Size: 0x6
			S2_PAD(0x2); // End padding
		};
		static_assert(offsetof(CS2::physicslib::FeStiffHingeBuild_t, flMaxAngle) == 0x0, "flMaxAngle in FeStiffHingeBuild_t should be at offset 0x0");
		static_assert(offsetof(CS2::physicslib::FeStiffHingeBuild_t, flStrength) == 0x4, "flStrength in FeStiffHingeBuild_t should be at offset 0x4");
		static_assert(offsetof(CS2::physicslib::FeStiffHingeBuild_t, flMotionBias) == 0x8, "flMotionBias in FeStiffHingeBuild_t should be at offset 0x8");
		static_assert(offsetof(CS2::physicslib::FeStiffHingeBuild_t, nNode) == 0x14, "nNode in FeStiffHingeBuild_t should be at offset 0x14");
		static_assert(sizeof(CS2::physicslib::FeStiffHingeBuild_t) == 0x1C, "FeStiffHingeBuild_t size should be 0x1C");
	}
}
