// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#include <SDK/GlobalTypes.hpp>




namespace CS2 {
	namespace physicslib {
		class FeTaperedCapsuleStretch_t  {
		public:
			uint16_t nNode[2]; // 0x0 | Schema_FixedArray | Size: 0x4
			uint16_t nCollisionMask; // 0x4 | Schema_Builtin | Size: 0x2
			uint16_t nDummy; // 0x6 | Schema_Builtin | Size: 0x2
			float32 flRadius[2]; // 0x8 | Schema_FixedArray | Size: 0x8
		};
		static_assert(offsetof(CS2::physicslib::FeTaperedCapsuleStretch_t, nNode) == 0x0, "nNode in FeTaperedCapsuleStretch_t should be at offset 0x0");
		static_assert(offsetof(CS2::physicslib::FeTaperedCapsuleStretch_t, nCollisionMask) == 0x4, "nCollisionMask in FeTaperedCapsuleStretch_t should be at offset 0x4");
		static_assert(offsetof(CS2::physicslib::FeTaperedCapsuleStretch_t, nDummy) == 0x6, "nDummy in FeTaperedCapsuleStretch_t should be at offset 0x6");
		static_assert(offsetof(CS2::physicslib::FeTaperedCapsuleStretch_t, flRadius) == 0x8, "flRadius in FeTaperedCapsuleStretch_t should be at offset 0x8");
		static_assert(sizeof(CS2::physicslib::FeTaperedCapsuleStretch_t) == 0x10, "FeTaperedCapsuleStretch_t size should be 0x10");
	}
}
