// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#include <SDK/GlobalTypes.hpp>




namespace CS2 {
	namespace physicslib {
		class FeVertexMapDesc_t  {
		public:
			GlobalTypes::CUtlString sName; // 0x0 | Schema_Atomic | Size: 0x8
			uint32_t nNameHash; // 0x8 | Schema_Builtin | Size: 0x4
			uint32_t nColor; // 0xc | Schema_Builtin | Size: 0x4
			uint32_t nFlags; // 0x10 | Schema_Builtin | Size: 0x4
			uint16_t nVertexBase; // 0x14 | Schema_Builtin | Size: 0x2
			uint16_t nVertexCount; // 0x16 | Schema_Builtin | Size: 0x2
			uint32_t nMapOffset; // 0x18 | Schema_Builtin | Size: 0x4
			uint32_t nNodeListOffset; // 0x1c | Schema_Builtin | Size: 0x4
			GlobalTypes::Vector vCenterOfMass; // 0x20 | Schema_Atomic | Size: 0xc
			float32 flVolumetricSolveStrength; // 0x2c | Schema_Builtin | Size: 0x4
			int16_t nScaleSourceNode; // 0x30 | Schema_Builtin | Size: 0x2
			uint16_t nNodeListCount; // 0x32 | Schema_Builtin | Size: 0x2
			S2_PAD(0x4); // End padding
		};
		static_assert(offsetof(CS2::physicslib::FeVertexMapDesc_t, sName) == 0x0, "sName in FeVertexMapDesc_t should be at offset 0x0");
		static_assert(offsetof(CS2::physicslib::FeVertexMapDesc_t, nNameHash) == 0x8, "nNameHash in FeVertexMapDesc_t should be at offset 0x8");
		static_assert(offsetof(CS2::physicslib::FeVertexMapDesc_t, nColor) == 0xC, "nColor in FeVertexMapDesc_t should be at offset 0xC");
		static_assert(offsetof(CS2::physicslib::FeVertexMapDesc_t, nFlags) == 0x10, "nFlags in FeVertexMapDesc_t should be at offset 0x10");
		static_assert(offsetof(CS2::physicslib::FeVertexMapDesc_t, nVertexBase) == 0x14, "nVertexBase in FeVertexMapDesc_t should be at offset 0x14");
		static_assert(offsetof(CS2::physicslib::FeVertexMapDesc_t, nVertexCount) == 0x16, "nVertexCount in FeVertexMapDesc_t should be at offset 0x16");
		static_assert(offsetof(CS2::physicslib::FeVertexMapDesc_t, nMapOffset) == 0x18, "nMapOffset in FeVertexMapDesc_t should be at offset 0x18");
		static_assert(offsetof(CS2::physicslib::FeVertexMapDesc_t, nNodeListOffset) == 0x1C, "nNodeListOffset in FeVertexMapDesc_t should be at offset 0x1C");
		static_assert(offsetof(CS2::physicslib::FeVertexMapDesc_t, vCenterOfMass) == 0x20, "vCenterOfMass in FeVertexMapDesc_t should be at offset 0x20");
		static_assert(offsetof(CS2::physicslib::FeVertexMapDesc_t, flVolumetricSolveStrength) == 0x2C, "flVolumetricSolveStrength in FeVertexMapDesc_t should be at offset 0x2C");
		static_assert(offsetof(CS2::physicslib::FeVertexMapDesc_t, nScaleSourceNode) == 0x30, "nScaleSourceNode in FeVertexMapDesc_t should be at offset 0x30");
		static_assert(offsetof(CS2::physicslib::FeVertexMapDesc_t, nNodeListCount) == 0x32, "nNodeListCount in FeVertexMapDesc_t should be at offset 0x32");
		static_assert(sizeof(CS2::physicslib::FeVertexMapDesc_t) == 0x38, "FeVertexMapDesc_t size should be 0x38");
	}
}
