// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#ifndef CUSTOM_GLOBAL_TYPES
	#include <SDK/GlobalTypes.hpp>
#else
	#include <Custom/GlobalTypes.hpp>
#endif





namespace CS2 {
	namespace physicslib {
		class OldFeEdge_t  {
		public:
			float32 m_flK[3]; // 0x0 | Schema_FixedArray | Size: 0xc
			float32 invA; // 0xc | Schema_Builtin | Size: 0x4
			float32 t; // 0x10 | Schema_Builtin | Size: 0x4
			float32 flThetaRelaxed; // 0x14 | Schema_Builtin | Size: 0x4
			float32 flThetaFactor; // 0x18 | Schema_Builtin | Size: 0x4
			float32 c01; // 0x1c | Schema_Builtin | Size: 0x4
			float32 c02; // 0x20 | Schema_Builtin | Size: 0x4
			float32 c03; // 0x24 | Schema_Builtin | Size: 0x4
			float32 c04; // 0x28 | Schema_Builtin | Size: 0x4
			float32 flAxialModelDist; // 0x2c | Schema_Builtin | Size: 0x4
			float32 flAxialModelWeights[4]; // 0x30 | Schema_FixedArray | Size: 0x10
			uint16_t m_nNode[4]; // 0x40 | Schema_FixedArray | Size: 0x8
		};
		static_assert(offsetof(CS2::physicslib::OldFeEdge_t, m_flK) == 0x0, "m_flK in OldFeEdge_t should be at offset 0x0");
		static_assert(offsetof(CS2::physicslib::OldFeEdge_t, invA) == 0xC, "invA in OldFeEdge_t should be at offset 0xC");
		static_assert(offsetof(CS2::physicslib::OldFeEdge_t, t) == 0x10, "t in OldFeEdge_t should be at offset 0x10");
		static_assert(offsetof(CS2::physicslib::OldFeEdge_t, flThetaRelaxed) == 0x14, "flThetaRelaxed in OldFeEdge_t should be at offset 0x14");
		static_assert(offsetof(CS2::physicslib::OldFeEdge_t, flThetaFactor) == 0x18, "flThetaFactor in OldFeEdge_t should be at offset 0x18");
		static_assert(offsetof(CS2::physicslib::OldFeEdge_t, c01) == 0x1C, "c01 in OldFeEdge_t should be at offset 0x1C");
		static_assert(offsetof(CS2::physicslib::OldFeEdge_t, c02) == 0x20, "c02 in OldFeEdge_t should be at offset 0x20");
		static_assert(offsetof(CS2::physicslib::OldFeEdge_t, c03) == 0x24, "c03 in OldFeEdge_t should be at offset 0x24");
		static_assert(offsetof(CS2::physicslib::OldFeEdge_t, c04) == 0x28, "c04 in OldFeEdge_t should be at offset 0x28");
		static_assert(offsetof(CS2::physicslib::OldFeEdge_t, flAxialModelDist) == 0x2C, "flAxialModelDist in OldFeEdge_t should be at offset 0x2C");
		static_assert(offsetof(CS2::physicslib::OldFeEdge_t, flAxialModelWeights) == 0x30, "flAxialModelWeights in OldFeEdge_t should be at offset 0x30");
		static_assert(offsetof(CS2::physicslib::OldFeEdge_t, m_nNode) == 0x40, "m_nNode in OldFeEdge_t should be at offset 0x40");
		static_assert(sizeof(CS2::physicslib::OldFeEdge_t) == 0x48, "OldFeEdge_t size should be 0x48");
	}
}
