// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#include <SDK/GlobalTypes.hpp>




namespace CS2 {
	namespace physicslib {
		class RnHalfEdge_t  {
		public:
			uint8_t m_nNext; // 0x0 | Schema_Builtin | Size: 0x1
			uint8_t m_nTwin; // 0x1 | Schema_Builtin | Size: 0x1
			uint8_t m_nOrigin; // 0x2 | Schema_Builtin | Size: 0x1
			uint8_t m_nFace; // 0x3 | Schema_Builtin | Size: 0x1
		};
		static_assert(offsetof(CS2::physicslib::RnHalfEdge_t, m_nNext) == 0x0, "m_nNext in RnHalfEdge_t should be at offset 0x0");
		static_assert(offsetof(CS2::physicslib::RnHalfEdge_t, m_nTwin) == 0x1, "m_nTwin in RnHalfEdge_t should be at offset 0x1");
		static_assert(offsetof(CS2::physicslib::RnHalfEdge_t, m_nOrigin) == 0x2, "m_nOrigin in RnHalfEdge_t should be at offset 0x2");
		static_assert(offsetof(CS2::physicslib::RnHalfEdge_t, m_nFace) == 0x3, "m_nFace in RnHalfEdge_t should be at offset 0x3");
		static_assert(sizeof(CS2::physicslib::RnHalfEdge_t) == 0x4, "RnHalfEdge_t size should be 0x4");
	}
}
