// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#include <SDK/GlobalTypes.hpp>




namespace CS2 {
	namespace physicslib {
		class RnShapeDesc_t  {
		public:
			uint32_t m_nCollisionAttributeIndex; // 0x0 | Schema_Builtin | Size: 0x4
			uint32_t m_nSurfacePropertyIndex; // 0x4 | Schema_Builtin | Size: 0x4
			GlobalTypes::CUtlString m_UserFriendlyName; // 0x8 | Schema_Atomic | Size: 0x8
			bool m_bUserFriendlyNameSealed; // 0x10 | Schema_Builtin | Size: 0x1
			bool m_bUserFriendlyNameLong; // 0x11 | Schema_Builtin | Size: 0x1
			S2_PAD(0x2);
			uint32_t m_nToolMaterialHash; // 0x14 | Schema_Builtin | Size: 0x4
		};
		static_assert(offsetof(CS2::physicslib::RnShapeDesc_t, m_nCollisionAttributeIndex) == 0x0, "m_nCollisionAttributeIndex in RnShapeDesc_t should be at offset 0x0");
		static_assert(offsetof(CS2::physicslib::RnShapeDesc_t, m_nSurfacePropertyIndex) == 0x4, "m_nSurfacePropertyIndex in RnShapeDesc_t should be at offset 0x4");
		static_assert(offsetof(CS2::physicslib::RnShapeDesc_t, m_UserFriendlyName) == 0x8, "m_UserFriendlyName in RnShapeDesc_t should be at offset 0x8");
		static_assert(offsetof(CS2::physicslib::RnShapeDesc_t, m_bUserFriendlyNameSealed) == 0x10, "m_bUserFriendlyNameSealed in RnShapeDesc_t should be at offset 0x10");
		static_assert(offsetof(CS2::physicslib::RnShapeDesc_t, m_bUserFriendlyNameLong) == 0x11, "m_bUserFriendlyNameLong in RnShapeDesc_t should be at offset 0x11");
		static_assert(offsetof(CS2::physicslib::RnShapeDesc_t, m_nToolMaterialHash) == 0x14, "m_nToolMaterialHash in RnShapeDesc_t should be at offset 0x14");
		static_assert(sizeof(CS2::physicslib::RnShapeDesc_t) == 0x18, "RnShapeDesc_t size should be 0x18");
	}
}
