// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#include <SDK/GlobalTypes.hpp>

#include <SDK/pulse_runtime_lib/PulseDocNodeID_t.hpp>



namespace CS2 {
	namespace pulse_runtime_lib {
		class CPulse_BlackboardReference  {
		public:
			// GlobalTypes::CStrongHandle< resourcesystem::InfoForResourceTypeIPulseGraphDef > m_hBlackboardResource; // 0x0 | Schema_Atomic | Size: 0x8
			char  m_hBlackboardResource[0x8]; // 0x0 | Schema_Atomic | Size: 0x8
			GlobalTypes::PulseSymbol_t m_BlackboardResource; // 0x8 | Schema_Atomic | Size: 0x10
			pulse_runtime_lib::PulseDocNodeID_t m_nNodeID; // 0x18 | Schema_DeclaredClass | Size: 0x4
			S2_PAD(0x4);
			GlobalTypes::CGlobalSymbol m_NodeName; // 0x20 | Schema_Atomic | Size: 0x8
		};
		static_assert(offsetof(CS2::pulse_runtime_lib::CPulse_BlackboardReference, m_hBlackboardResource) == 0x0, "m_hBlackboardResource in CPulse_BlackboardReference should be at offset 0x0");
		static_assert(offsetof(CS2::pulse_runtime_lib::CPulse_BlackboardReference, m_BlackboardResource) == 0x8, "m_BlackboardResource in CPulse_BlackboardReference should be at offset 0x8");
		static_assert(offsetof(CS2::pulse_runtime_lib::CPulse_BlackboardReference, m_nNodeID) == 0x18, "m_nNodeID in CPulse_BlackboardReference should be at offset 0x18");
		static_assert(offsetof(CS2::pulse_runtime_lib::CPulse_BlackboardReference, m_NodeName) == 0x20, "m_NodeName in CPulse_BlackboardReference should be at offset 0x20");
		static_assert(sizeof(CS2::pulse_runtime_lib::CPulse_BlackboardReference) == 0x28, "CPulse_BlackboardReference size should be 0x28");
	}
}
