// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#ifndef CUSTOM_GLOBAL_TYPES
	#include <SDK/GlobalTypes.hpp>
#else
	#include <Custom/GlobalTypes.hpp>
#endif


#include <SDK/pulse_runtime_lib/PulseRuntimeChunkIndex_t.hpp>
#include <SDK/pulse_runtime_lib/PulseRegisterMap_t.hpp>



namespace CS2 {
	namespace pulse_runtime_lib {
		class CPulse_OutflowConnection  {
		public:
			GlobalTypes::PulseSymbol_t m_SourceOutflowName; // 0x0 | Schema_Atomic | Size: 0x10
			pulse_runtime_lib::PulseRuntimeChunkIndex_t m_nDestChunk; // 0x10 | Schema_DeclaredClass | Size: 0x4
			int32_t m_nInstruction; // 0x14 | Schema_Builtin | Size: 0x4
			pulse_runtime_lib::PulseRegisterMap_t m_OutflowRegisterMap; // 0x18 | Schema_DeclaredClass | Size: 0x30
		};
		static_assert(offsetof(CS2::pulse_runtime_lib::CPulse_OutflowConnection, m_SourceOutflowName) == 0x0, "m_SourceOutflowName in CPulse_OutflowConnection should be at offset 0x0");
		static_assert(offsetof(CS2::pulse_runtime_lib::CPulse_OutflowConnection, m_nDestChunk) == 0x10, "m_nDestChunk in CPulse_OutflowConnection should be at offset 0x10");
		static_assert(offsetof(CS2::pulse_runtime_lib::CPulse_OutflowConnection, m_nInstruction) == 0x14, "m_nInstruction in CPulse_OutflowConnection should be at offset 0x14");
		static_assert(offsetof(CS2::pulse_runtime_lib::CPulse_OutflowConnection, m_OutflowRegisterMap) == 0x18, "m_OutflowRegisterMap in CPulse_OutflowConnection should be at offset 0x18");
		static_assert(sizeof(CS2::pulse_runtime_lib::CPulse_OutflowConnection) == 0x48, "CPulse_OutflowConnection size should be 0x48");
	}
}
