// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#ifndef CUSTOM_GLOBAL_TYPES
	#include "../GlobalTypes.hpp"
#else
	#include "../Custom/GlobalTypes.hpp"
#endif


#include "../entity2/GameTime_t.hpp"





using namespace GlobalTypes;
namespace CS2 {
	namespace pulse_runtime_lib {
		class CPulseCell_IntervalTimer_CursorState_t  {
		public:
			entity2::GameTime_t m_StartTime; // 0x0 | Schema_DeclaredClass | Size: 0x4
			entity2::GameTime_t m_EndTime; // 0x4 | Schema_DeclaredClass | Size: 0x4
			float32 m_flWaitInterval; // 0x8 | Schema_Builtin | Size: 0x4
			float32 m_flWaitIntervalHigh; // 0xc | Schema_Builtin | Size: 0x4
			bool m_bCompleteOnNextWake; // 0x10 | Schema_Builtin | Size: 0x1
			S2_PAD(0x3); // End padding
		};
		static_assert(offsetof(CS2::pulse_runtime_lib::CPulseCell_IntervalTimer_CursorState_t, m_StartTime) == 0x0, "m_StartTime in CPulseCell_IntervalTimer::CursorState_t should be at offset 0x0");
		static_assert(offsetof(CS2::pulse_runtime_lib::CPulseCell_IntervalTimer_CursorState_t, m_EndTime) == 0x4, "m_EndTime in CPulseCell_IntervalTimer::CursorState_t should be at offset 0x4");
		static_assert(offsetof(CS2::pulse_runtime_lib::CPulseCell_IntervalTimer_CursorState_t, m_flWaitInterval) == 0x8, "m_flWaitInterval in CPulseCell_IntervalTimer::CursorState_t should be at offset 0x8");
		static_assert(offsetof(CS2::pulse_runtime_lib::CPulseCell_IntervalTimer_CursorState_t, m_flWaitIntervalHigh) == 0xC, "m_flWaitIntervalHigh in CPulseCell_IntervalTimer::CursorState_t should be at offset 0xC");
		static_assert(offsetof(CS2::pulse_runtime_lib::CPulseCell_IntervalTimer_CursorState_t, m_bCompleteOnNextWake) == 0x10, "m_bCompleteOnNextWake in CPulseCell_IntervalTimer::CursorState_t should be at offset 0x10");
		static_assert(sizeof(CS2::pulse_runtime_lib::CPulseCell_IntervalTimer_CursorState_t) == 0x14, "CPulseCell_IntervalTimer::CursorState_t size should be 0x14");
	}
}
