// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#include <SDK/GlobalTypes.hpp>

#include <SDK/pulse_runtime_lib/CPulseCell_BaseFlow.hpp>
#include <SDK/pulse_runtime_lib/PulseDocNodeID_t.hpp>
#include <SDK/pulse_runtime_lib/PulseSelectorOutflowList_t.hpp>
#include <SDK/pulse_runtime_lib/CPulse_OutflowConnection.hpp>



namespace CS2 {
	namespace pulse_runtime_lib {
		class CPulseCell_InlineNodeSkipSelector : public CS2::pulse_runtime_lib::CPulseCell_BaseFlow {
		public:
			pulse_runtime_lib::PulseDocNodeID_t m_nFlowNodeID; // 0x48 | Schema_DeclaredClass | Size: 0x4
			bool m_bAnd; // 0x4c | Schema_Builtin | Size: 0x1
			S2_PAD(0x3);
			pulse_runtime_lib::PulseSelectorOutflowList_t m_PassOutflow; // 0x50 | Schema_DeclaredClass | Size: 0x18
			pulse_runtime_lib::CPulse_OutflowConnection m_FailOutflow; // 0x68 | Schema_DeclaredClass | Size: 0x48
		};
		static_assert(offsetof(CS2::pulse_runtime_lib::CPulseCell_InlineNodeSkipSelector, m_nFlowNodeID) == 0x48, "m_nFlowNodeID in CPulseCell_InlineNodeSkipSelector should be at offset 0x48");
		static_assert(offsetof(CS2::pulse_runtime_lib::CPulseCell_InlineNodeSkipSelector, m_bAnd) == 0x4C, "m_bAnd in CPulseCell_InlineNodeSkipSelector should be at offset 0x4C");
		static_assert(offsetof(CS2::pulse_runtime_lib::CPulseCell_InlineNodeSkipSelector, m_PassOutflow) == 0x50, "m_PassOutflow in CPulseCell_InlineNodeSkipSelector should be at offset 0x50");
		static_assert(offsetof(CS2::pulse_runtime_lib::CPulseCell_InlineNodeSkipSelector, m_FailOutflow) == 0x68, "m_FailOutflow in CPulseCell_InlineNodeSkipSelector should be at offset 0x68");
		static_assert(sizeof(CS2::pulse_runtime_lib::CPulseCell_InlineNodeSkipSelector) == 0xB0, "CPulseCell_InlineNodeSkipSelector size should be 0xB0");
	}
}
