// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#ifndef CUSTOM_GLOBAL_TYPES
	#include <SDK/GlobalTypes.hpp>
#else
	#include <Custom/GlobalTypes.hpp>
#endif


#include <SDK/pulse_runtime_lib/CPulseCell_BaseState.hpp>
#include <SDK/pulse_runtime_lib/PulseObservableBoolExpression_t.hpp>
#include <SDK/pulse_runtime_lib/CPulse_OutflowConnection.hpp>



namespace CS2 {
	namespace pulse_runtime_lib {
		class CPulseCell_BooleanSwitchState : public CS2::pulse_runtime_lib::CPulseCell_BaseState {
		public:
			pulse_runtime_lib::PulseObservableBoolExpression_t m_Condition; // 0x48 | Schema_DeclaredClass | Size: 0x78
			pulse_runtime_lib::CPulse_OutflowConnection m_SubGraph; // 0xc0 | Schema_DeclaredClass | Size: 0x48
			pulse_runtime_lib::CPulse_OutflowConnection m_WhenTrue; // 0x108 | Schema_DeclaredClass | Size: 0x48
			pulse_runtime_lib::CPulse_OutflowConnection m_WhenFalse; // 0x150 | Schema_DeclaredClass | Size: 0x48
		};
		static_assert(offsetof(CS2::pulse_runtime_lib::CPulseCell_BooleanSwitchState, m_Condition) == 0x48, "m_Condition in CPulseCell_BooleanSwitchState should be at offset 0x48");
		static_assert(offsetof(CS2::pulse_runtime_lib::CPulseCell_BooleanSwitchState, m_SubGraph) == 0xC0, "m_SubGraph in CPulseCell_BooleanSwitchState should be at offset 0xC0");
		static_assert(offsetof(CS2::pulse_runtime_lib::CPulseCell_BooleanSwitchState, m_WhenTrue) == 0x108, "m_WhenTrue in CPulseCell_BooleanSwitchState should be at offset 0x108");
		static_assert(offsetof(CS2::pulse_runtime_lib::CPulseCell_BooleanSwitchState, m_WhenFalse) == 0x150, "m_WhenFalse in CPulseCell_BooleanSwitchState should be at offset 0x150");
		static_assert(sizeof(CS2::pulse_runtime_lib::CPulseCell_BooleanSwitchState) == 0x198, "CPulseCell_BooleanSwitchState size should be 0x198");
	}
}
