// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#include <SDK/GlobalTypes.hpp>

#include <SDK/pulse_runtime_lib/PulseGraphInstanceID_t.hpp>



namespace CS2 {
	namespace pulse_runtime_lib {
		class CPulseGraphExecutionHistory  {
		public:
			pulse_runtime_lib::PulseGraphInstanceID_t m_nInstanceID; // 0x0 | Schema_DeclaredClass | Size: 0x4
			S2_PAD(0x4);
			GlobalTypes::CUtlString m_strFileName; // 0x8 | Schema_Atomic | Size: 0x8
			// GlobalTypes::CUtlVector< PulseGraphExecutionHistoryEntry_t >* m_vecHistory; // 0x10 | Schema_Atomic | Size: 0x18
			char  m_vecHistory[0x18]; // 0x10 | Schema_Atomic | Size: 0x18
			// GlobalTypes::CUtlOrderedMap< PulseDocNodeID_t, PulseGraphExecutionHistoryNodeDesc_t >* m_mapCellDesc; // 0x28 | Schema_Atomic | Size: 0x28
			char  m_mapCellDesc[0x28]; // 0x28 | Schema_Atomic | Size: 0x28
			// GlobalTypes::CUtlOrderedMap< PulseCursorID_t, PulseGraphExecutionHistoryCursorDesc_t >* m_mapCursorDesc; // 0x50 | Schema_Atomic | Size: 0x28
			char  m_mapCursorDesc[0x28]; // 0x50 | Schema_Atomic | Size: 0x28
		};
		static_assert(offsetof(CS2::pulse_runtime_lib::CPulseGraphExecutionHistory, m_nInstanceID) == 0x0, "m_nInstanceID in CPulseGraphExecutionHistory should be at offset 0x0");
		static_assert(offsetof(CS2::pulse_runtime_lib::CPulseGraphExecutionHistory, m_strFileName) == 0x8, "m_strFileName in CPulseGraphExecutionHistory should be at offset 0x8");
		static_assert(offsetof(CS2::pulse_runtime_lib::CPulseGraphExecutionHistory, m_vecHistory) == 0x10, "m_vecHistory in CPulseGraphExecutionHistory should be at offset 0x10");
		static_assert(offsetof(CS2::pulse_runtime_lib::CPulseGraphExecutionHistory, m_mapCellDesc) == 0x28, "m_mapCellDesc in CPulseGraphExecutionHistory should be at offset 0x28");
		static_assert(offsetof(CS2::pulse_runtime_lib::CPulseGraphExecutionHistory, m_mapCursorDesc) == 0x50, "m_mapCursorDesc in CPulseGraphExecutionHistory should be at offset 0x50");
		static_assert(sizeof(CS2::pulse_runtime_lib::CPulseGraphExecutionHistory) == 0x78, "CPulseGraphExecutionHistory size should be 0x78");
	}
}
