// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#include <SDK/GlobalTypes.hpp>

#include <SDK/pulse_runtime_lib/PulseDocNodeID_t.hpp>



namespace CS2 {
	namespace pulse_runtime_lib {
		class PulseGraphExecutionHistoryCursorDesc_t  {
		public:
			// GlobalTypes::CUtlVector< pulse_runtime_lib::PulseCursorID_t > vecAncestorCursorIDs; // 0x0 | Schema_Atomic | Size: 0x18
			char  vecAncestorCursorIDs[0x18]; // 0x0 | Schema_Atomic | Size: 0x18
			pulse_runtime_lib::PulseDocNodeID_t nSpawnNodeID; // 0x18 | Schema_DeclaredClass | Size: 0x4
			pulse_runtime_lib::PulseDocNodeID_t nRetiredAtNodeID; // 0x1c | Schema_DeclaredClass | Size: 0x4
			float32 flLastReferenced; // 0x20 | Schema_Builtin | Size: 0x4
			int32_t nLastValidEntryIdx; // 0x24 | Schema_Builtin | Size: 0x4
		};
		static_assert(offsetof(CS2::pulse_runtime_lib::PulseGraphExecutionHistoryCursorDesc_t, vecAncestorCursorIDs) == 0x0, "vecAncestorCursorIDs in PulseGraphExecutionHistoryCursorDesc_t should be at offset 0x0");
		static_assert(offsetof(CS2::pulse_runtime_lib::PulseGraphExecutionHistoryCursorDesc_t, nSpawnNodeID) == 0x18, "nSpawnNodeID in PulseGraphExecutionHistoryCursorDesc_t should be at offset 0x18");
		static_assert(offsetof(CS2::pulse_runtime_lib::PulseGraphExecutionHistoryCursorDesc_t, nRetiredAtNodeID) == 0x1C, "nRetiredAtNodeID in PulseGraphExecutionHistoryCursorDesc_t should be at offset 0x1C");
		static_assert(offsetof(CS2::pulse_runtime_lib::PulseGraphExecutionHistoryCursorDesc_t, flLastReferenced) == 0x20, "flLastReferenced in PulseGraphExecutionHistoryCursorDesc_t should be at offset 0x20");
		static_assert(offsetof(CS2::pulse_runtime_lib::PulseGraphExecutionHistoryCursorDesc_t, nLastValidEntryIdx) == 0x24, "nLastValidEntryIdx in PulseGraphExecutionHistoryCursorDesc_t should be at offset 0x24");
		static_assert(sizeof(CS2::pulse_runtime_lib::PulseGraphExecutionHistoryCursorDesc_t) == 0x28, "PulseGraphExecutionHistoryCursorDesc_t size should be 0x28");
	}
}
