// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#ifndef CUSTOM_GLOBAL_TYPES
	#include <SDK/GlobalTypes.hpp>
#else
	#include <Custom/GlobalTypes.hpp>
#endif


#include <SDK/animgraphlib/CAnimUpdateNodeRef.hpp>
#include <SDK/animationsystem/HSequence.hpp>



namespace CS2 {
	namespace animgraphlib {
		class TagSpan_t;
	}
}


using namespace GlobalTypes;
namespace CS2 {
	namespace animgraphlib {
		class BlendItem_t  {
		public:
			GlobalTypes::CUtlVector<animgraphlib::TagSpan_t> m_tags; // 0x0 | Schema_Atomic | Size: 0x18
			// char  m_tags[0x18]; // 0x0 | Schema_Atomic | Size: 0x18
			animgraphlib::CAnimUpdateNodeRef m_pChild; // 0x18 | Schema_DeclaredClass | Size: 0x10
			animationsystem::HSequence m_hSequence; // 0x28 | Schema_DeclaredClass | Size: 0x4
			GlobalTypes::Vector2D m_vPos; // 0x2c | Schema_Atomic | Size: 0x8
			float32 m_flDuration; // 0x34 | Schema_Builtin | Size: 0x4
			bool m_bUseCustomDuration; // 0x38 | Schema_Builtin | Size: 0x1
			S2_PAD(0x7); // End padding
		};
		static_assert(offsetof(CS2::animgraphlib::BlendItem_t, m_tags) == 0x0, "m_tags in BlendItem_t should be at offset 0x0");
		static_assert(offsetof(CS2::animgraphlib::BlendItem_t, m_pChild) == 0x18, "m_pChild in BlendItem_t should be at offset 0x18");
		static_assert(offsetof(CS2::animgraphlib::BlendItem_t, m_hSequence) == 0x28, "m_hSequence in BlendItem_t should be at offset 0x28");
		static_assert(offsetof(CS2::animgraphlib::BlendItem_t, m_vPos) == 0x2C, "m_vPos in BlendItem_t should be at offset 0x2C");
		static_assert(offsetof(CS2::animgraphlib::BlendItem_t, m_flDuration) == 0x34, "m_flDuration in BlendItem_t should be at offset 0x34");
		static_assert(offsetof(CS2::animgraphlib::BlendItem_t, m_bUseCustomDuration) == 0x38, "m_bUseCustomDuration in BlendItem_t should be at offset 0x38");
		static_assert(sizeof(CS2::animgraphlib::BlendItem_t) == 0x40, "BlendItem_t size should be 0x40");
	}
}
