// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#include <SDK/GlobalTypes.hpp>




namespace CS2 {
	namespace animgraphlib {
		class BoneDemoCaptureSettings_t  {
		public:
			GlobalTypes::CUtlString m_boneName; // 0x0 | Schema_Atomic | Size: 0x8
			float32 m_flErrorSplineRotationMax; // 0x8 | Schema_Builtin | Size: 0x4
			float32 m_flErrorSplineTranslationMax; // 0xc | Schema_Builtin | Size: 0x4
			float32 m_flErrorSplineScaleMax; // 0x10 | Schema_Builtin | Size: 0x4
			float32 m_flErrorQuantizationRotationMax; // 0x14 | Schema_Builtin | Size: 0x4
			float32 m_flErrorQuantizationTranslationMax; // 0x18 | Schema_Builtin | Size: 0x4
			float32 m_flErrorQuantizationScaleMax; // 0x1c | Schema_Builtin | Size: 0x4
		};
		static_assert(offsetof(CS2::animgraphlib::BoneDemoCaptureSettings_t, m_boneName) == 0x0, "m_boneName in BoneDemoCaptureSettings_t should be at offset 0x0");
		static_assert(offsetof(CS2::animgraphlib::BoneDemoCaptureSettings_t, m_flErrorSplineRotationMax) == 0x8, "m_flErrorSplineRotationMax in BoneDemoCaptureSettings_t should be at offset 0x8");
		static_assert(offsetof(CS2::animgraphlib::BoneDemoCaptureSettings_t, m_flErrorSplineTranslationMax) == 0xC, "m_flErrorSplineTranslationMax in BoneDemoCaptureSettings_t should be at offset 0xC");
		static_assert(offsetof(CS2::animgraphlib::BoneDemoCaptureSettings_t, m_flErrorSplineScaleMax) == 0x10, "m_flErrorSplineScaleMax in BoneDemoCaptureSettings_t should be at offset 0x10");
		static_assert(offsetof(CS2::animgraphlib::BoneDemoCaptureSettings_t, m_flErrorQuantizationRotationMax) == 0x14, "m_flErrorQuantizationRotationMax in BoneDemoCaptureSettings_t should be at offset 0x14");
		static_assert(offsetof(CS2::animgraphlib::BoneDemoCaptureSettings_t, m_flErrorQuantizationTranslationMax) == 0x18, "m_flErrorQuantizationTranslationMax in BoneDemoCaptureSettings_t should be at offset 0x18");
		static_assert(offsetof(CS2::animgraphlib::BoneDemoCaptureSettings_t, m_flErrorQuantizationScaleMax) == 0x1C, "m_flErrorQuantizationScaleMax in BoneDemoCaptureSettings_t should be at offset 0x1C");
		static_assert(sizeof(CS2::animgraphlib::BoneDemoCaptureSettings_t) == 0x20, "BoneDemoCaptureSettings_t size should be 0x20");
	}
}
