// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#ifndef CUSTOM_GLOBAL_TYPES
	#include <SDK/GlobalTypes.hpp>
#else
	#include <Custom/GlobalTypes.hpp>
#endif


#include <SDK/animgraphlib/CUnaryUpdateNode.hpp>
#include <SDK/animgraphlib/AimMatrixOpFixedSettings_t.hpp>
#include <SDK/animgraphlib/AnimVectorSource.hpp>
#include <SDK/animgraphlib/CAnimParamHandle.hpp>
#include <SDK/animationsystem/HSequence.hpp>





using namespace GlobalTypes;
namespace CS2 {
	namespace animgraphlib {
		class CAimMatrixUpdateNode : public CS2::animgraphlib::CUnaryUpdateNode {
		public:
			animgraphlib::AimMatrixOpFixedSettings_t m_opFixedSettings; // 0x70 | Schema_DeclaredClass | Size: 0xf0
			S2_PAD(0x8);
			animgraphlib::AnimVectorSource m_target; // 0x168 | Schema_DeclaredEnum | Size: 0x4
			animgraphlib::CAnimParamHandle m_paramIndex; // 0x16c | Schema_DeclaredClass | Size: 0x2
			S2_PAD(0x2);
			animationsystem::HSequence m_hSequence; // 0x170 | Schema_DeclaredClass | Size: 0x4
			bool m_bResetChild; // 0x174 | Schema_Builtin | Size: 0x1
			bool m_bLockWhenWaning; // 0x175 | Schema_Builtin | Size: 0x1
			S2_PAD(0xa); // End padding
		};
		static_assert(offsetof(CS2::animgraphlib::CAimMatrixUpdateNode, m_opFixedSettings) == 0x70, "m_opFixedSettings in CAimMatrixUpdateNode should be at offset 0x70");
		static_assert(offsetof(CS2::animgraphlib::CAimMatrixUpdateNode, m_target) == 0x168, "m_target in CAimMatrixUpdateNode should be at offset 0x168");
		static_assert(offsetof(CS2::animgraphlib::CAimMatrixUpdateNode, m_paramIndex) == 0x16C, "m_paramIndex in CAimMatrixUpdateNode should be at offset 0x16C");
		static_assert(offsetof(CS2::animgraphlib::CAimMatrixUpdateNode, m_hSequence) == 0x170, "m_hSequence in CAimMatrixUpdateNode should be at offset 0x170");
		static_assert(offsetof(CS2::animgraphlib::CAimMatrixUpdateNode, m_bResetChild) == 0x174, "m_bResetChild in CAimMatrixUpdateNode should be at offset 0x174");
		static_assert(offsetof(CS2::animgraphlib::CAimMatrixUpdateNode, m_bLockWhenWaning) == 0x175, "m_bLockWhenWaning in CAimMatrixUpdateNode should be at offset 0x175");
		static_assert(sizeof(CS2::animgraphlib::CAimMatrixUpdateNode) == 0x180, "CAimMatrixUpdateNode size should be 0x180");
	}
}
