// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#ifndef CUSTOM_GLOBAL_TYPES
	#include <SDK/GlobalTypes.hpp>
#else
	#include <Custom/GlobalTypes.hpp>
#endif


#include <SDK/animgraphlib/CUnaryUpdateNode.hpp>
#include <SDK/animgraphlib/CAnimParamHandle.hpp>
#include <SDK/animgraphlib/AimCameraOpFixedSettings_t.hpp>



namespace CS2 {
	namespace animgraphlib {
		class CAimCameraUpdateNode : public CS2::animgraphlib::CUnaryUpdateNode {
		public:
			animgraphlib::CAnimParamHandle m_hParameterPosition; // 0x70 | Schema_DeclaredClass | Size: 0x2
			animgraphlib::CAnimParamHandle m_hParameterOrientation; // 0x72 | Schema_DeclaredClass | Size: 0x2
			animgraphlib::CAnimParamHandle m_hParameterSpineRotationWeight; // 0x74 | Schema_DeclaredClass | Size: 0x2
			animgraphlib::CAnimParamHandle m_hParameterPelvisOffset; // 0x76 | Schema_DeclaredClass | Size: 0x2
			animgraphlib::CAnimParamHandle m_hParameterUseIK; // 0x78 | Schema_DeclaredClass | Size: 0x2
			animgraphlib::CAnimParamHandle m_hParameterCameraOnly; // 0x7a | Schema_DeclaredClass | Size: 0x2
			animgraphlib::CAnimParamHandle m_hParameterWeaponDepenetrationDistance; // 0x7c | Schema_DeclaredClass | Size: 0x2
			animgraphlib::CAnimParamHandle m_hParameterWeaponDepenetrationDelta; // 0x7e | Schema_DeclaredClass | Size: 0x2
			animgraphlib::CAnimParamHandle m_hParameterCameraClearanceDistance; // 0x80 | Schema_DeclaredClass | Size: 0x2
			S2_PAD(0x6);
			animgraphlib::AimCameraOpFixedSettings_t m_opFixedSettings; // 0x88 | Schema_DeclaredClass | Size: 0x30
			S2_PAD(0x8); // End padding
		};
		static_assert(offsetof(CS2::animgraphlib::CAimCameraUpdateNode, m_hParameterPosition) == 0x70, "m_hParameterPosition in CAimCameraUpdateNode should be at offset 0x70");
		static_assert(offsetof(CS2::animgraphlib::CAimCameraUpdateNode, m_hParameterOrientation) == 0x72, "m_hParameterOrientation in CAimCameraUpdateNode should be at offset 0x72");
		static_assert(offsetof(CS2::animgraphlib::CAimCameraUpdateNode, m_hParameterSpineRotationWeight) == 0x74, "m_hParameterSpineRotationWeight in CAimCameraUpdateNode should be at offset 0x74");
		static_assert(offsetof(CS2::animgraphlib::CAimCameraUpdateNode, m_hParameterPelvisOffset) == 0x76, "m_hParameterPelvisOffset in CAimCameraUpdateNode should be at offset 0x76");
		static_assert(offsetof(CS2::animgraphlib::CAimCameraUpdateNode, m_hParameterUseIK) == 0x78, "m_hParameterUseIK in CAimCameraUpdateNode should be at offset 0x78");
		static_assert(offsetof(CS2::animgraphlib::CAimCameraUpdateNode, m_hParameterCameraOnly) == 0x7A, "m_hParameterCameraOnly in CAimCameraUpdateNode should be at offset 0x7A");
		static_assert(offsetof(CS2::animgraphlib::CAimCameraUpdateNode, m_hParameterWeaponDepenetrationDistance) == 0x7C, "m_hParameterWeaponDepenetrationDistance in CAimCameraUpdateNode should be at offset 0x7C");
		static_assert(offsetof(CS2::animgraphlib::CAimCameraUpdateNode, m_hParameterWeaponDepenetrationDelta) == 0x7E, "m_hParameterWeaponDepenetrationDelta in CAimCameraUpdateNode should be at offset 0x7E");
		static_assert(offsetof(CS2::animgraphlib::CAimCameraUpdateNode, m_hParameterCameraClearanceDistance) == 0x80, "m_hParameterCameraClearanceDistance in CAimCameraUpdateNode should be at offset 0x80");
		static_assert(offsetof(CS2::animgraphlib::CAimCameraUpdateNode, m_opFixedSettings) == 0x88, "m_opFixedSettings in CAimCameraUpdateNode should be at offset 0x88");
		static_assert(sizeof(CS2::animgraphlib::CAimCameraUpdateNode) == 0xC0, "CAimCameraUpdateNode size should be 0xC0");
	}
}
