// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#ifndef CUSTOM_GLOBAL_TYPES
	#include <SDK/GlobalTypes.hpp>
#else
	#include <Custom/GlobalTypes.hpp>
#endif


#include <SDK/modellib/AnimTagID.hpp>





using namespace GlobalTypes;
namespace CS2 {
	namespace animgraphlib {
		class CAnimTagBase  {
		public:
			S2_PAD(0x18);
			GlobalTypes::CGlobalSymbol m_name; // 0x18 | Schema_Atomic | Size: 0x8
			GlobalTypes::CUtlString m_sComment; // 0x20 | Schema_Atomic | Size: 0x8
			GlobalTypes::CGlobalSymbol m_group; // 0x28 | Schema_Atomic | Size: 0x8
			modellib::AnimTagID m_tagID; // 0x30 | Schema_DeclaredClass | Size: 0x4
			S2_PAD(0x14);
			bool m_bIsReferenced; // 0x48 | Schema_Builtin | Size: 0x1
			S2_PAD(0x7); // End padding
		};
		static_assert(offsetof(CS2::animgraphlib::CAnimTagBase, m_name) == 0x18, "m_name in CAnimTagBase should be at offset 0x18");
		static_assert(offsetof(CS2::animgraphlib::CAnimTagBase, m_sComment) == 0x20, "m_sComment in CAnimTagBase should be at offset 0x20");
		static_assert(offsetof(CS2::animgraphlib::CAnimTagBase, m_group) == 0x28, "m_group in CAnimTagBase should be at offset 0x28");
		static_assert(offsetof(CS2::animgraphlib::CAnimTagBase, m_tagID) == 0x30, "m_tagID in CAnimTagBase should be at offset 0x30");
		static_assert(offsetof(CS2::animgraphlib::CAnimTagBase, m_bIsReferenced) == 0x48, "m_bIsReferenced in CAnimTagBase should be at offset 0x48");
		static_assert(sizeof(CS2::animgraphlib::CAnimTagBase) == 0x50, "CAnimTagBase size should be 0x50");
	}
}
