// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#ifndef CUSTOM_GLOBAL_TYPES
	#include <SDK/GlobalTypes.hpp>
#else
	#include <Custom/GlobalTypes.hpp>
#endif


#include <SDK/animgraphlib/CAnimGraphSettingsManager.hpp>
#include <SDK/animgraphlib/CAnimNodePath.hpp>





using namespace GlobalTypes;
namespace CS2 {
	namespace animgraphlib {
		class CAnimUpdateSharedData  {
		public:
			S2_PAD(0x10);
			GlobalTypes::CUtlVector< GlobalTypes::CSmartPtr< CAnimUpdateNodeBase > > m_nodes; // 0x10 | Schema_Atomic | Size: 0x18
			// char  m_nodes[0x18]; // 0x10 | Schema_Atomic | Size: 0x18
			// GlobalTypes::CUtlHashtable< CAnimNodePath, int32 > m_nodeIndexMap; // 0x28 | Schema_Atomic | Size: 0x20
			char  m_nodeIndexMap[0x20]; // 0x28 | Schema_Atomic | Size: 0x20
			GlobalTypes::CUtlVector< GlobalTypes::CSmartPtr< CAnimComponentUpdater > > m_components; // 0x48 | Schema_Atomic | Size: 0x18
			// char  m_components[0x18]; // 0x48 | Schema_Atomic | Size: 0x18
			// GlobalTypes::CSmartPtr< animgraphlib::CAnimParameterManagerUpdater > m_pParamListUpdater; // 0x60 | Schema_Atomic | Size: 0x8
			char  m_pParamListUpdater[0x8]; // 0x60 | Schema_Atomic | Size: 0x8
			// GlobalTypes::CSmartPtr< animgraphlib::CAnimTagManagerUpdater > m_pTagManagerUpdater; // 0x68 | Schema_Atomic | Size: 0x8
			char  m_pTagManagerUpdater[0x8]; // 0x68 | Schema_Atomic | Size: 0x8
			// GlobalTypes::CSmartPtr< animgraphlib::CAnimScriptManager > m_scriptManager; // 0x70 | Schema_Atomic | Size: 0x8
			char  m_scriptManager[0x8]; // 0x70 | Schema_Atomic | Size: 0x8
			animgraphlib::CAnimGraphSettingsManager m_settings; // 0x78 | Schema_DeclaredClass | Size: 0x30
			// GlobalTypes::CSmartPtr< animgraphlib::CStaticPoseCacheBuilder > m_pStaticPoseCache; // 0xa8 | Schema_Atomic | Size: 0x8
			char  m_pStaticPoseCache[0x8]; // 0xa8 | Schema_Atomic | Size: 0x8
			// GlobalTypes::CSmartPtr< modellib::CAnimSkeleton > m_pSkeleton; // 0xb0 | Schema_Atomic | Size: 0x8
			char  m_pSkeleton[0x8]; // 0xb0 | Schema_Atomic | Size: 0x8
			animgraphlib::CAnimNodePath m_rootNodePath; // 0xb8 | Schema_DeclaredClass | Size: 0x30
			S2_PAD(0x18); // End padding
		};
		static_assert(offsetof(CS2::animgraphlib::CAnimUpdateSharedData, m_nodes) == 0x10, "m_nodes in CAnimUpdateSharedData should be at offset 0x10");
		static_assert(offsetof(CS2::animgraphlib::CAnimUpdateSharedData, m_nodeIndexMap) == 0x28, "m_nodeIndexMap in CAnimUpdateSharedData should be at offset 0x28");
		static_assert(offsetof(CS2::animgraphlib::CAnimUpdateSharedData, m_components) == 0x48, "m_components in CAnimUpdateSharedData should be at offset 0x48");
		static_assert(offsetof(CS2::animgraphlib::CAnimUpdateSharedData, m_pParamListUpdater) == 0x60, "m_pParamListUpdater in CAnimUpdateSharedData should be at offset 0x60");
		static_assert(offsetof(CS2::animgraphlib::CAnimUpdateSharedData, m_pTagManagerUpdater) == 0x68, "m_pTagManagerUpdater in CAnimUpdateSharedData should be at offset 0x68");
		static_assert(offsetof(CS2::animgraphlib::CAnimUpdateSharedData, m_scriptManager) == 0x70, "m_scriptManager in CAnimUpdateSharedData should be at offset 0x70");
		static_assert(offsetof(CS2::animgraphlib::CAnimUpdateSharedData, m_settings) == 0x78, "m_settings in CAnimUpdateSharedData should be at offset 0x78");
		static_assert(offsetof(CS2::animgraphlib::CAnimUpdateSharedData, m_pStaticPoseCache) == 0xA8, "m_pStaticPoseCache in CAnimUpdateSharedData should be at offset 0xA8");
		static_assert(offsetof(CS2::animgraphlib::CAnimUpdateSharedData, m_pSkeleton) == 0xB0, "m_pSkeleton in CAnimUpdateSharedData should be at offset 0xB0");
		static_assert(offsetof(CS2::animgraphlib::CAnimUpdateSharedData, m_rootNodePath) == 0xB8, "m_rootNodePath in CAnimUpdateSharedData should be at offset 0xB8");
		static_assert(sizeof(CS2::animgraphlib::CAnimUpdateSharedData) == 0x100, "CAnimUpdateSharedData size should be 0x100");
	}
}
