// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#ifndef CUSTOM_GLOBAL_TYPES
	#include <SDK/GlobalTypes.hpp>
#else
	#include <Custom/GlobalTypes.hpp>
#endif





namespace CS2 {
	namespace animgraphlib {
		class CAnimParameterManagerUpdater  {
		public:
			S2_PAD(0x18);
			// GlobalTypes::CUtlVector< GlobalTypes::CSmartPtr< CAnimParameterBase > > m_parameters; // 0x18 | Schema_Atomic | Size: 0x18
			char  m_parameters[0x18]; // 0x18 | Schema_Atomic | Size: 0x18
			// GlobalTypes::CUtlHashtable< AnimParamID, int32 > m_idToIndexMap; // 0x30 | Schema_Atomic | Size: 0x20
			char  m_idToIndexMap[0x20]; // 0x30 | Schema_Atomic | Size: 0x20
			// GlobalTypes::CUtlHashtable< CUtlString, int32 > m_nameToIndexMap; // 0x50 | Schema_Atomic | Size: 0x20
			char  m_nameToIndexMap[0x20]; // 0x50 | Schema_Atomic | Size: 0x20
			// GlobalTypes::CUtlVector< animgraphlib::CAnimParamHandle > m_indexToHandle; // 0x70 | Schema_Atomic | Size: 0x18
			char  m_indexToHandle[0x18]; // 0x70 | Schema_Atomic | Size: 0x18
			// GlobalTypes::pair< CAnimParamHandle, CAnimVariant > > m_autoResetParams; // 0x88 | Schema_Atomic | Size: 0x18
			char  m_autoResetParams[0x18]; // 0x88 | Schema_Atomic | Size: 0x18
			// GlobalTypes::CUtlHashtable< CAnimParamHandle, int16 > m_autoResetMap; // 0xa0 | Schema_Atomic | Size: 0x20
			char  m_autoResetMap[0x20]; // 0xa0 | Schema_Atomic | Size: 0x20
			S2_PAD(0x40); // End padding
		};
		static_assert(offsetof(CS2::animgraphlib::CAnimParameterManagerUpdater, m_parameters) == 0x18, "m_parameters in CAnimParameterManagerUpdater should be at offset 0x18");
		static_assert(offsetof(CS2::animgraphlib::CAnimParameterManagerUpdater, m_idToIndexMap) == 0x30, "m_idToIndexMap in CAnimParameterManagerUpdater should be at offset 0x30");
		static_assert(offsetof(CS2::animgraphlib::CAnimParameterManagerUpdater, m_nameToIndexMap) == 0x50, "m_nameToIndexMap in CAnimParameterManagerUpdater should be at offset 0x50");
		static_assert(offsetof(CS2::animgraphlib::CAnimParameterManagerUpdater, m_indexToHandle) == 0x70, "m_indexToHandle in CAnimParameterManagerUpdater should be at offset 0x70");
		static_assert(offsetof(CS2::animgraphlib::CAnimParameterManagerUpdater, m_autoResetParams) == 0x88, "m_autoResetParams in CAnimParameterManagerUpdater should be at offset 0x88");
		static_assert(offsetof(CS2::animgraphlib::CAnimParameterManagerUpdater, m_autoResetMap) == 0xA0, "m_autoResetMap in CAnimParameterManagerUpdater should be at offset 0xA0");
		static_assert(sizeof(CS2::animgraphlib::CAnimParameterManagerUpdater) == 0x100, "CAnimParameterManagerUpdater size should be 0x100");
	}
}
