// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#include <SDK/GlobalTypes.hpp>

#include <SDK/animgraphlib/EDemoBoneSelectionMode.hpp>



namespace CS2 {
	namespace animgraphlib {
		class CAnimDemoCaptureSettings  {
		public:
			GlobalTypes::Vector2D m_vecErrorRangeSplineRotation; // 0x0 | Schema_Atomic | Size: 0x8
			GlobalTypes::Vector2D m_vecErrorRangeSplineTranslation; // 0x8 | Schema_Atomic | Size: 0x8
			GlobalTypes::Vector2D m_vecErrorRangeSplineScale; // 0x10 | Schema_Atomic | Size: 0x8
			float32 m_flIkRotation_MaxSplineError; // 0x18 | Schema_Builtin | Size: 0x4
			float32 m_flIkTranslation_MaxSplineError; // 0x1c | Schema_Builtin | Size: 0x4
			GlobalTypes::Vector2D m_vecErrorRangeQuantizationRotation; // 0x20 | Schema_Atomic | Size: 0x8
			GlobalTypes::Vector2D m_vecErrorRangeQuantizationTranslation; // 0x28 | Schema_Atomic | Size: 0x8
			GlobalTypes::Vector2D m_vecErrorRangeQuantizationScale; // 0x30 | Schema_Atomic | Size: 0x8
			float32 m_flIkRotation_MaxQuantizationError; // 0x38 | Schema_Builtin | Size: 0x4
			float32 m_flIkTranslation_MaxQuantizationError; // 0x3c | Schema_Builtin | Size: 0x4
			GlobalTypes::CUtlString m_baseSequence; // 0x40 | Schema_Atomic | Size: 0x8
			int32_t m_nBaseSequenceFrame; // 0x48 | Schema_Builtin | Size: 0x4
			animgraphlib::EDemoBoneSelectionMode m_boneSelectionMode; // 0x4c | Schema_DeclaredEnum | Size: 0x4
			// GlobalTypes::CUtlVector< animgraphlib::BoneDemoCaptureSettings_t > m_bones; // 0x50 | Schema_Atomic | Size: 0x18
			char  m_bones[0x18]; // 0x50 | Schema_Atomic | Size: 0x18
			// GlobalTypes::CUtlVector< animgraphlib::IKDemoCaptureSettings_t > m_ikChains; // 0x68 | Schema_Atomic | Size: 0x18
			char  m_ikChains[0x18]; // 0x68 | Schema_Atomic | Size: 0x18
		};
		static_assert(offsetof(CS2::animgraphlib::CAnimDemoCaptureSettings, m_vecErrorRangeSplineRotation) == 0x0, "m_vecErrorRangeSplineRotation in CAnimDemoCaptureSettings should be at offset 0x0");
		static_assert(offsetof(CS2::animgraphlib::CAnimDemoCaptureSettings, m_vecErrorRangeSplineTranslation) == 0x8, "m_vecErrorRangeSplineTranslation in CAnimDemoCaptureSettings should be at offset 0x8");
		static_assert(offsetof(CS2::animgraphlib::CAnimDemoCaptureSettings, m_vecErrorRangeSplineScale) == 0x10, "m_vecErrorRangeSplineScale in CAnimDemoCaptureSettings should be at offset 0x10");
		static_assert(offsetof(CS2::animgraphlib::CAnimDemoCaptureSettings, m_flIkRotation_MaxSplineError) == 0x18, "m_flIkRotation_MaxSplineError in CAnimDemoCaptureSettings should be at offset 0x18");
		static_assert(offsetof(CS2::animgraphlib::CAnimDemoCaptureSettings, m_flIkTranslation_MaxSplineError) == 0x1C, "m_flIkTranslation_MaxSplineError in CAnimDemoCaptureSettings should be at offset 0x1C");
		static_assert(offsetof(CS2::animgraphlib::CAnimDemoCaptureSettings, m_vecErrorRangeQuantizationRotation) == 0x20, "m_vecErrorRangeQuantizationRotation in CAnimDemoCaptureSettings should be at offset 0x20");
		static_assert(offsetof(CS2::animgraphlib::CAnimDemoCaptureSettings, m_vecErrorRangeQuantizationTranslation) == 0x28, "m_vecErrorRangeQuantizationTranslation in CAnimDemoCaptureSettings should be at offset 0x28");
		static_assert(offsetof(CS2::animgraphlib::CAnimDemoCaptureSettings, m_vecErrorRangeQuantizationScale) == 0x30, "m_vecErrorRangeQuantizationScale in CAnimDemoCaptureSettings should be at offset 0x30");
		static_assert(offsetof(CS2::animgraphlib::CAnimDemoCaptureSettings, m_flIkRotation_MaxQuantizationError) == 0x38, "m_flIkRotation_MaxQuantizationError in CAnimDemoCaptureSettings should be at offset 0x38");
		static_assert(offsetof(CS2::animgraphlib::CAnimDemoCaptureSettings, m_flIkTranslation_MaxQuantizationError) == 0x3C, "m_flIkTranslation_MaxQuantizationError in CAnimDemoCaptureSettings should be at offset 0x3C");
		static_assert(offsetof(CS2::animgraphlib::CAnimDemoCaptureSettings, m_baseSequence) == 0x40, "m_baseSequence in CAnimDemoCaptureSettings should be at offset 0x40");
		static_assert(offsetof(CS2::animgraphlib::CAnimDemoCaptureSettings, m_nBaseSequenceFrame) == 0x48, "m_nBaseSequenceFrame in CAnimDemoCaptureSettings should be at offset 0x48");
		static_assert(offsetof(CS2::animgraphlib::CAnimDemoCaptureSettings, m_boneSelectionMode) == 0x4C, "m_boneSelectionMode in CAnimDemoCaptureSettings should be at offset 0x4C");
		static_assert(offsetof(CS2::animgraphlib::CAnimDemoCaptureSettings, m_bones) == 0x50, "m_bones in CAnimDemoCaptureSettings should be at offset 0x50");
		static_assert(offsetof(CS2::animgraphlib::CAnimDemoCaptureSettings, m_ikChains) == 0x68, "m_ikChains in CAnimDemoCaptureSettings should be at offset 0x68");
		static_assert(sizeof(CS2::animgraphlib::CAnimDemoCaptureSettings) == 0x80, "CAnimDemoCaptureSettings size should be 0x80");
	}
}
