// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#include <SDK/GlobalTypes.hpp>

#include <SDK/modellib/AnimComponentID.hpp>
#include <SDK/animgraphlib/AnimNodeNetworkMode.hpp>



namespace CS2 {
	namespace animgraphlib {
		class CAnimComponentUpdater  {
		public:
			S2_PAD(0x18);
			GlobalTypes::CUtlString m_name; // 0x18 | Schema_Atomic | Size: 0x8
			modellib::AnimComponentID m_id; // 0x20 | Schema_DeclaredClass | Size: 0x4
			animgraphlib::AnimNodeNetworkMode m_networkMode; // 0x24 | Schema_DeclaredEnum | Size: 0x4
			bool m_bStartEnabled; // 0x28 | Schema_Builtin | Size: 0x1
			S2_PAD(0x7); // End padding
		};
		static_assert(offsetof(CS2::animgraphlib::CAnimComponentUpdater, m_name) == 0x18, "m_name in CAnimComponentUpdater should be at offset 0x18");
		static_assert(offsetof(CS2::animgraphlib::CAnimComponentUpdater, m_id) == 0x20, "m_id in CAnimComponentUpdater should be at offset 0x20");
		static_assert(offsetof(CS2::animgraphlib::CAnimComponentUpdater, m_networkMode) == 0x24, "m_networkMode in CAnimComponentUpdater should be at offset 0x24");
		static_assert(offsetof(CS2::animgraphlib::CAnimComponentUpdater, m_bStartEnabled) == 0x28, "m_bStartEnabled in CAnimComponentUpdater should be at offset 0x28");
		static_assert(sizeof(CS2::animgraphlib::CAnimComponentUpdater) == 0x30, "CAnimComponentUpdater size should be 0x30");
	}
}
