// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#include <SDK/GlobalTypes.hpp>

#include <SDK/modellib/AnimParamID.hpp>



namespace CS2 {
	namespace animgraphlib {
		class CAnimParameterBase  {
		public:
			S2_PAD(0x18);
			GlobalTypes::CGlobalSymbol m_name; // 0x18 | Schema_Atomic | Size: 0x8
			GlobalTypes::CUtlString m_sComment; // 0x20 | Schema_Atomic | Size: 0x8
			GlobalTypes::CUtlString m_group; // 0x28 | Schema_Atomic | Size: 0x8
			modellib::AnimParamID m_id; // 0x30 | Schema_DeclaredClass | Size: 0x4
			S2_PAD(0x14);
			GlobalTypes::CUtlString m_componentName; // 0x48 | Schema_Atomic | Size: 0x8
			S2_PAD(0x18);
			bool m_bNetworkingRequested; // 0x68 | Schema_Builtin | Size: 0x1
			bool m_bIsReferenced; // 0x69 | Schema_Builtin | Size: 0x1
			S2_PAD(0x6); // End padding
		};
		static_assert(offsetof(CS2::animgraphlib::CAnimParameterBase, m_name) == 0x18, "m_name in CAnimParameterBase should be at offset 0x18");
		static_assert(offsetof(CS2::animgraphlib::CAnimParameterBase, m_sComment) == 0x20, "m_sComment in CAnimParameterBase should be at offset 0x20");
		static_assert(offsetof(CS2::animgraphlib::CAnimParameterBase, m_group) == 0x28, "m_group in CAnimParameterBase should be at offset 0x28");
		static_assert(offsetof(CS2::animgraphlib::CAnimParameterBase, m_id) == 0x30, "m_id in CAnimParameterBase should be at offset 0x30");
		static_assert(offsetof(CS2::animgraphlib::CAnimParameterBase, m_componentName) == 0x48, "m_componentName in CAnimParameterBase should be at offset 0x48");
		static_assert(offsetof(CS2::animgraphlib::CAnimParameterBase, m_bNetworkingRequested) == 0x68, "m_bNetworkingRequested in CAnimParameterBase should be at offset 0x68");
		static_assert(offsetof(CS2::animgraphlib::CAnimParameterBase, m_bIsReferenced) == 0x69, "m_bIsReferenced in CAnimParameterBase should be at offset 0x69");
		static_assert(sizeof(CS2::animgraphlib::CAnimParameterBase) == 0x70, "CAnimParameterBase size should be 0x70");
	}
}
