// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#include <SDK/GlobalTypes.hpp>

#include <SDK/animgraphlib/CAnimTagBase.hpp>



namespace CS2 {
	namespace animgraphlib {
		class CAudioAnimTag : public CS2::animgraphlib::CAnimTagBase {
		public:
			S2_PAD(0x8);
			GlobalTypes::CUtlString m_clipName; // 0x58 | Schema_Atomic | Size: 0x8
			GlobalTypes::CUtlString m_attachmentName; // 0x60 | Schema_Atomic | Size: 0x8
			float32 m_flVolume; // 0x68 | Schema_Builtin | Size: 0x4
			bool m_bStopWhenTagEnds; // 0x6c | Schema_Builtin | Size: 0x1
			bool m_bStopWhenGraphEnds; // 0x6d | Schema_Builtin | Size: 0x1
			bool m_bPlayOnServer; // 0x6e | Schema_Builtin | Size: 0x1
			bool m_bPlayOnClient; // 0x6f | Schema_Builtin | Size: 0x1
		};
		static_assert(offsetof(CS2::animgraphlib::CAudioAnimTag, m_clipName) == 0x58, "m_clipName in CAudioAnimTag should be at offset 0x58");
		static_assert(offsetof(CS2::animgraphlib::CAudioAnimTag, m_attachmentName) == 0x60, "m_attachmentName in CAudioAnimTag should be at offset 0x60");
		static_assert(offsetof(CS2::animgraphlib::CAudioAnimTag, m_flVolume) == 0x68, "m_flVolume in CAudioAnimTag should be at offset 0x68");
		static_assert(offsetof(CS2::animgraphlib::CAudioAnimTag, m_bStopWhenTagEnds) == 0x6C, "m_bStopWhenTagEnds in CAudioAnimTag should be at offset 0x6C");
		static_assert(offsetof(CS2::animgraphlib::CAudioAnimTag, m_bStopWhenGraphEnds) == 0x6D, "m_bStopWhenGraphEnds in CAudioAnimTag should be at offset 0x6D");
		static_assert(offsetof(CS2::animgraphlib::CAudioAnimTag, m_bPlayOnServer) == 0x6E, "m_bPlayOnServer in CAudioAnimTag should be at offset 0x6E");
		static_assert(offsetof(CS2::animgraphlib::CAudioAnimTag, m_bPlayOnClient) == 0x6F, "m_bPlayOnClient in CAudioAnimTag should be at offset 0x6F");
		static_assert(sizeof(CS2::animgraphlib::CAudioAnimTag) == 0x70, "CAudioAnimTag size should be 0x70");
	}
}
