// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#include <SDK/GlobalTypes.hpp>

#include <SDK/animgraphlib/CAnimUpdateNodeBase.hpp>
#include <SDK/animgraphlib/CAnimUpdateNodeRef.hpp>
#include <SDK/animgraphlib/BinaryNodeTiming.hpp>



namespace CS2 {
	namespace animgraphlib {
		class CBinaryUpdateNode : public CS2::animgraphlib::CAnimUpdateNodeBase {
		public:
			S2_PAD(0x8);
			animgraphlib::CAnimUpdateNodeRef m_pChild1; // 0x60 | Schema_DeclaredClass | Size: 0x10
			animgraphlib::CAnimUpdateNodeRef m_pChild2; // 0x70 | Schema_DeclaredClass | Size: 0x10
			animgraphlib::BinaryNodeTiming m_timingBehavior; // 0x80 | Schema_DeclaredEnum | Size: 0x4
			float32 m_flTimingBlend; // 0x84 | Schema_Builtin | Size: 0x4
			bool m_bResetChild1; // 0x88 | Schema_Builtin | Size: 0x1
			bool m_bResetChild2; // 0x89 | Schema_Builtin | Size: 0x1
			S2_PAD(0x6); // End padding
		};
		static_assert(offsetof(CS2::animgraphlib::CBinaryUpdateNode, m_pChild1) == 0x60, "m_pChild1 in CBinaryUpdateNode should be at offset 0x60");
		static_assert(offsetof(CS2::animgraphlib::CBinaryUpdateNode, m_pChild2) == 0x70, "m_pChild2 in CBinaryUpdateNode should be at offset 0x70");
		static_assert(offsetof(CS2::animgraphlib::CBinaryUpdateNode, m_timingBehavior) == 0x80, "m_timingBehavior in CBinaryUpdateNode should be at offset 0x80");
		static_assert(offsetof(CS2::animgraphlib::CBinaryUpdateNode, m_flTimingBlend) == 0x84, "m_flTimingBlend in CBinaryUpdateNode should be at offset 0x84");
		static_assert(offsetof(CS2::animgraphlib::CBinaryUpdateNode, m_bResetChild1) == 0x88, "m_bResetChild1 in CBinaryUpdateNode should be at offset 0x88");
		static_assert(offsetof(CS2::animgraphlib::CBinaryUpdateNode, m_bResetChild2) == 0x89, "m_bResetChild2 in CBinaryUpdateNode should be at offset 0x89");
		static_assert(sizeof(CS2::animgraphlib::CBinaryUpdateNode) == 0x90, "CBinaryUpdateNode size should be 0x90");
	}
}
