// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#ifndef CUSTOM_GLOBAL_TYPES
	#include <SDK/GlobalTypes.hpp>
#else
	#include <Custom/GlobalTypes.hpp>
#endif


#include <SDK/animgraphlib/CBinaryUpdateNode.hpp>
#include <SDK/animgraphlib/BoneMaskBlendSpace.hpp>
#include <SDK/animgraphlib/BinaryNodeChildOption.hpp>
#include <SDK/animgraphlib/AnimValueSource.hpp>
#include <SDK/animgraphlib/CAnimParamHandle.hpp>





using namespace GlobalTypes;
namespace CS2 {
	namespace animgraphlib {
		class CBoneMaskUpdateNode : public CS2::animgraphlib::CBinaryUpdateNode {
		public:
			S2_PAD(0x4);
			int32_t m_nWeightListIndex; // 0x94 | Schema_Builtin | Size: 0x4
			float32 m_flRootMotionBlend; // 0x98 | Schema_Builtin | Size: 0x4
			animgraphlib::BoneMaskBlendSpace m_blendSpace; // 0x9c | Schema_DeclaredEnum | Size: 0x4
			animgraphlib::BinaryNodeChildOption m_footMotionTiming; // 0xa0 | Schema_DeclaredEnum | Size: 0x4
			bool m_bUseBlendScale; // 0xa4 | Schema_Builtin | Size: 0x1
			S2_PAD(0x3);
			animgraphlib::AnimValueSource m_blendValueSource; // 0xa8 | Schema_DeclaredEnum | Size: 0x4
			animgraphlib::CAnimParamHandle m_hBlendParameter; // 0xac | Schema_DeclaredClass | Size: 0x2
			S2_PAD(0x2); // End padding
		};
		static_assert(offsetof(CS2::animgraphlib::CBoneMaskUpdateNode, m_nWeightListIndex) == 0x94, "m_nWeightListIndex in CBoneMaskUpdateNode should be at offset 0x94");
		static_assert(offsetof(CS2::animgraphlib::CBoneMaskUpdateNode, m_flRootMotionBlend) == 0x98, "m_flRootMotionBlend in CBoneMaskUpdateNode should be at offset 0x98");
		static_assert(offsetof(CS2::animgraphlib::CBoneMaskUpdateNode, m_blendSpace) == 0x9C, "m_blendSpace in CBoneMaskUpdateNode should be at offset 0x9C");
		static_assert(offsetof(CS2::animgraphlib::CBoneMaskUpdateNode, m_footMotionTiming) == 0xA0, "m_footMotionTiming in CBoneMaskUpdateNode should be at offset 0xA0");
		static_assert(offsetof(CS2::animgraphlib::CBoneMaskUpdateNode, m_bUseBlendScale) == 0xA4, "m_bUseBlendScale in CBoneMaskUpdateNode should be at offset 0xA4");
		static_assert(offsetof(CS2::animgraphlib::CBoneMaskUpdateNode, m_blendValueSource) == 0xA8, "m_blendValueSource in CBoneMaskUpdateNode should be at offset 0xA8");
		static_assert(offsetof(CS2::animgraphlib::CBoneMaskUpdateNode, m_hBlendParameter) == 0xAC, "m_hBlendParameter in CBoneMaskUpdateNode should be at offset 0xAC");
		static_assert(sizeof(CS2::animgraphlib::CBoneMaskUpdateNode) == 0xB0, "CBoneMaskUpdateNode size should be 0xB0");
	}
}
