// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#include <SDK/GlobalTypes.hpp>

#include <SDK/animgraphlib/CAnimTagBase.hpp>



namespace CS2 {
	namespace animgraphlib {
		class CClothSettingsAnimTag : public CS2::animgraphlib::CAnimTagBase {
		public:
			S2_PAD(0x8);
			float32 m_flStiffness; // 0x58 | Schema_Builtin | Size: 0x4
			float32 m_flEaseIn; // 0x5c | Schema_Builtin | Size: 0x4
			float32 m_flEaseOut; // 0x60 | Schema_Builtin | Size: 0x4
			S2_PAD(0x4);
			GlobalTypes::CUtlString m_nVertexSet; // 0x68 | Schema_Atomic | Size: 0x8
		};
		static_assert(offsetof(CS2::animgraphlib::CClothSettingsAnimTag, m_flStiffness) == 0x58, "m_flStiffness in CClothSettingsAnimTag should be at offset 0x58");
		static_assert(offsetof(CS2::animgraphlib::CClothSettingsAnimTag, m_flEaseIn) == 0x5C, "m_flEaseIn in CClothSettingsAnimTag should be at offset 0x5C");
		static_assert(offsetof(CS2::animgraphlib::CClothSettingsAnimTag, m_flEaseOut) == 0x60, "m_flEaseOut in CClothSettingsAnimTag should be at offset 0x60");
		static_assert(offsetof(CS2::animgraphlib::CClothSettingsAnimTag, m_nVertexSet) == 0x68, "m_nVertexSet in CClothSettingsAnimTag should be at offset 0x68");
		static_assert(sizeof(CS2::animgraphlib::CClothSettingsAnimTag) == 0x70, "CClothSettingsAnimTag size should be 0x70");
	}
}
