// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#include <SDK/GlobalTypes.hpp>

#include <SDK/animgraphlib/CAnimParameterBase.hpp>
#include <SDK/animgraphlib/AnimParamButton_t.hpp>
#include <SDK/animgraphlib/AnimParamNetworkSetting.hpp>



namespace CS2 {
	namespace animgraphlib {
		class CConcreteAnimParameter : public CS2::animgraphlib::CAnimParameterBase {
		public:
			animgraphlib::AnimParamButton_t m_previewButton; // 0x70 | Schema_DeclaredEnum | Size: 0x4
			animgraphlib::AnimParamNetworkSetting m_eNetworkSetting; // 0x74 | Schema_DeclaredEnum | Size: 0x4
			bool m_bUseMostRecentValue; // 0x78 | Schema_Builtin | Size: 0x1
			bool m_bAutoReset; // 0x79 | Schema_Builtin | Size: 0x1
			bool m_bGameWritable; // 0x7a | Schema_Builtin | Size: 0x1
			bool m_bGraphWritable; // 0x7b | Schema_Builtin | Size: 0x1
			S2_PAD(0x4); // End padding
		};
		static_assert(offsetof(CS2::animgraphlib::CConcreteAnimParameter, m_previewButton) == 0x70, "m_previewButton in CConcreteAnimParameter should be at offset 0x70");
		static_assert(offsetof(CS2::animgraphlib::CConcreteAnimParameter, m_eNetworkSetting) == 0x74, "m_eNetworkSetting in CConcreteAnimParameter should be at offset 0x74");
		static_assert(offsetof(CS2::animgraphlib::CConcreteAnimParameter, m_bUseMostRecentValue) == 0x78, "m_bUseMostRecentValue in CConcreteAnimParameter should be at offset 0x78");
		static_assert(offsetof(CS2::animgraphlib::CConcreteAnimParameter, m_bAutoReset) == 0x79, "m_bAutoReset in CConcreteAnimParameter should be at offset 0x79");
		static_assert(offsetof(CS2::animgraphlib::CConcreteAnimParameter, m_bGameWritable) == 0x7A, "m_bGameWritable in CConcreteAnimParameter should be at offset 0x7A");
		static_assert(offsetof(CS2::animgraphlib::CConcreteAnimParameter, m_bGraphWritable) == 0x7B, "m_bGraphWritable in CConcreteAnimParameter should be at offset 0x7B");
		static_assert(sizeof(CS2::animgraphlib::CConcreteAnimParameter) == 0x80, "CConcreteAnimParameter size should be 0x80");
	}
}
