// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#ifndef CUSTOM_GLOBAL_TYPES
	#include <SDK/GlobalTypes.hpp>
#else
	#include <Custom/GlobalTypes.hpp>
#endif


#include <SDK/animgraphlib/CLeafUpdateNode.hpp>
#include <SDK/animationsystem/HSequence.hpp>
#include <SDK/animgraphlib/AnimValueSource.hpp>
#include <SDK/animgraphlib/CAnimParamHandle.hpp>



namespace CS2 {
	namespace animgraphlib {
		class TagSpan_t;
	}
}


using namespace GlobalTypes;
namespace CS2 {
	namespace animgraphlib {
		class CCycleControlClipUpdateNode : public CS2::animgraphlib::CLeafUpdateNode {
		public:
			S2_PAD(0x8);
			GlobalTypes::CUtlVector<animgraphlib::TagSpan_t> m_tags; // 0x60 | Schema_Atomic | Size: 0x18
			// char  m_tags[0x18]; // 0x60 | Schema_Atomic | Size: 0x18
			S2_PAD(0x4);
			animationsystem::HSequence m_hSequence; // 0x7c | Schema_DeclaredClass | Size: 0x4
			float32 m_duration; // 0x80 | Schema_Builtin | Size: 0x4
			animgraphlib::AnimValueSource m_valueSource; // 0x84 | Schema_DeclaredEnum | Size: 0x4
			animgraphlib::CAnimParamHandle m_paramIndex; // 0x88 | Schema_DeclaredClass | Size: 0x2
			bool m_bLockWhenWaning; // 0x8a | Schema_Builtin | Size: 0x1
			S2_PAD(0x5); // End padding
		};
		static_assert(offsetof(CS2::animgraphlib::CCycleControlClipUpdateNode, m_tags) == 0x60, "m_tags in CCycleControlClipUpdateNode should be at offset 0x60");
		static_assert(offsetof(CS2::animgraphlib::CCycleControlClipUpdateNode, m_hSequence) == 0x7C, "m_hSequence in CCycleControlClipUpdateNode should be at offset 0x7C");
		static_assert(offsetof(CS2::animgraphlib::CCycleControlClipUpdateNode, m_duration) == 0x80, "m_duration in CCycleControlClipUpdateNode should be at offset 0x80");
		static_assert(offsetof(CS2::animgraphlib::CCycleControlClipUpdateNode, m_valueSource) == 0x84, "m_valueSource in CCycleControlClipUpdateNode should be at offset 0x84");
		static_assert(offsetof(CS2::animgraphlib::CCycleControlClipUpdateNode, m_paramIndex) == 0x88, "m_paramIndex in CCycleControlClipUpdateNode should be at offset 0x88");
		static_assert(offsetof(CS2::animgraphlib::CCycleControlClipUpdateNode, m_bLockWhenWaning) == 0x8A, "m_bLockWhenWaning in CCycleControlClipUpdateNode should be at offset 0x8A");
		static_assert(sizeof(CS2::animgraphlib::CCycleControlClipUpdateNode) == 0x90, "CCycleControlClipUpdateNode size should be 0x90");
	}
}
