// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#ifndef CUSTOM_GLOBAL_TYPES
	#include <SDK/GlobalTypes.hpp>
#else
	#include <Custom/GlobalTypes.hpp>
#endif


#include <SDK/animgraphlib/CPathAnimMotorUpdaterBase.hpp>
#include <SDK/animgraphlib/CAnimParamHandle.hpp>



namespace CS2 {
	namespace animgraphlib {
		class CDampedPathAnimMotorUpdater : public CS2::animgraphlib::CPathAnimMotorUpdaterBase {
		public:
			S2_PAD(0x4);
			float32 m_flAnticipationTime; // 0x2c | Schema_Builtin | Size: 0x4
			float32 m_flMinSpeedScale; // 0x30 | Schema_Builtin | Size: 0x4
			animgraphlib::CAnimParamHandle m_hAnticipationPosParam; // 0x34 | Schema_DeclaredClass | Size: 0x2
			animgraphlib::CAnimParamHandle m_hAnticipationHeadingParam; // 0x36 | Schema_DeclaredClass | Size: 0x2
			float32 m_flSpringConstant; // 0x38 | Schema_Builtin | Size: 0x4
			float32 m_flMinSpringTension; // 0x3c | Schema_Builtin | Size: 0x4
			float32 m_flMaxSpringTension; // 0x40 | Schema_Builtin | Size: 0x4
			S2_PAD(0x4); // End padding
		};
		static_assert(offsetof(CS2::animgraphlib::CDampedPathAnimMotorUpdater, m_flAnticipationTime) == 0x2C, "m_flAnticipationTime in CDampedPathAnimMotorUpdater should be at offset 0x2C");
		static_assert(offsetof(CS2::animgraphlib::CDampedPathAnimMotorUpdater, m_flMinSpeedScale) == 0x30, "m_flMinSpeedScale in CDampedPathAnimMotorUpdater should be at offset 0x30");
		static_assert(offsetof(CS2::animgraphlib::CDampedPathAnimMotorUpdater, m_hAnticipationPosParam) == 0x34, "m_hAnticipationPosParam in CDampedPathAnimMotorUpdater should be at offset 0x34");
		static_assert(offsetof(CS2::animgraphlib::CDampedPathAnimMotorUpdater, m_hAnticipationHeadingParam) == 0x36, "m_hAnticipationHeadingParam in CDampedPathAnimMotorUpdater should be at offset 0x36");
		static_assert(offsetof(CS2::animgraphlib::CDampedPathAnimMotorUpdater, m_flSpringConstant) == 0x38, "m_flSpringConstant in CDampedPathAnimMotorUpdater should be at offset 0x38");
		static_assert(offsetof(CS2::animgraphlib::CDampedPathAnimMotorUpdater, m_flMinSpringTension) == 0x3C, "m_flMinSpringTension in CDampedPathAnimMotorUpdater should be at offset 0x3C");
		static_assert(offsetof(CS2::animgraphlib::CDampedPathAnimMotorUpdater, m_flMaxSpringTension) == 0x40, "m_flMaxSpringTension in CDampedPathAnimMotorUpdater should be at offset 0x40");
		static_assert(sizeof(CS2::animgraphlib::CDampedPathAnimMotorUpdater) == 0x48, "CDampedPathAnimMotorUpdater size should be 0x48");
	}
}
