// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#ifndef CUSTOM_GLOBAL_TYPES
	#include <SDK/GlobalTypes.hpp>
#else
	#include <Custom/GlobalTypes.hpp>
#endif


#include <SDK/animgraphlib/CMotionMetricEvaluator.hpp>



namespace CS2 {
	namespace animgraphlib {
		class CDistanceRemainingMetricEvaluator : public CS2::animgraphlib::CMotionMetricEvaluator {
		public:
			float32 m_flMaxDistance; // 0x50 | Schema_Builtin | Size: 0x4
			float32 m_flMinDistance; // 0x54 | Schema_Builtin | Size: 0x4
			float32 m_flStartGoalFilterDistance; // 0x58 | Schema_Builtin | Size: 0x4
			float32 m_flMaxGoalOvershootScale; // 0x5c | Schema_Builtin | Size: 0x4
			bool m_bFilterFixedMinDistance; // 0x60 | Schema_Builtin | Size: 0x1
			bool m_bFilterGoalDistance; // 0x61 | Schema_Builtin | Size: 0x1
			bool m_bFilterGoalOvershoot; // 0x62 | Schema_Builtin | Size: 0x1
			S2_PAD(0x5); // End padding
		};
		static_assert(offsetof(CS2::animgraphlib::CDistanceRemainingMetricEvaluator, m_flMaxDistance) == 0x50, "m_flMaxDistance in CDistanceRemainingMetricEvaluator should be at offset 0x50");
		static_assert(offsetof(CS2::animgraphlib::CDistanceRemainingMetricEvaluator, m_flMinDistance) == 0x54, "m_flMinDistance in CDistanceRemainingMetricEvaluator should be at offset 0x54");
		static_assert(offsetof(CS2::animgraphlib::CDistanceRemainingMetricEvaluator, m_flStartGoalFilterDistance) == 0x58, "m_flStartGoalFilterDistance in CDistanceRemainingMetricEvaluator should be at offset 0x58");
		static_assert(offsetof(CS2::animgraphlib::CDistanceRemainingMetricEvaluator, m_flMaxGoalOvershootScale) == 0x5C, "m_flMaxGoalOvershootScale in CDistanceRemainingMetricEvaluator should be at offset 0x5C");
		static_assert(offsetof(CS2::animgraphlib::CDistanceRemainingMetricEvaluator, m_bFilterFixedMinDistance) == 0x60, "m_bFilterFixedMinDistance in CDistanceRemainingMetricEvaluator should be at offset 0x60");
		static_assert(offsetof(CS2::animgraphlib::CDistanceRemainingMetricEvaluator, m_bFilterGoalDistance) == 0x61, "m_bFilterGoalDistance in CDistanceRemainingMetricEvaluator should be at offset 0x61");
		static_assert(offsetof(CS2::animgraphlib::CDistanceRemainingMetricEvaluator, m_bFilterGoalOvershoot) == 0x62, "m_bFilterGoalOvershoot in CDistanceRemainingMetricEvaluator should be at offset 0x62");
		static_assert(sizeof(CS2::animgraphlib::CDistanceRemainingMetricEvaluator) == 0x68, "CDistanceRemainingMetricEvaluator size should be 0x68");
	}
}
