// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#ifndef CUSTOM_GLOBAL_TYPES
	#include <SDK/GlobalTypes.hpp>
#else
	#include <Custom/GlobalTypes.hpp>
#endif


#include <SDK/animgraphlib/CConcreteAnimParameter.hpp>





using namespace GlobalTypes;
namespace CS2 {
	namespace animgraphlib {
		class CFloatAnimParameter : public CS2::animgraphlib::CConcreteAnimParameter {
		public:
			float32 m_fDefaultValue; // 0x80 | Schema_Builtin | Size: 0x4
			float32 m_fMinValue; // 0x84 | Schema_Builtin | Size: 0x4
			float32 m_fMaxValue; // 0x88 | Schema_Builtin | Size: 0x4
			bool m_bInterpolate; // 0x8c | Schema_Builtin | Size: 0x1
			S2_PAD(0x3); // End padding
		};
		static_assert(offsetof(CS2::animgraphlib::CFloatAnimParameter, m_fDefaultValue) == 0x80, "m_fDefaultValue in CFloatAnimParameter should be at offset 0x80");
		static_assert(offsetof(CS2::animgraphlib::CFloatAnimParameter, m_fMinValue) == 0x84, "m_fMinValue in CFloatAnimParameter should be at offset 0x84");
		static_assert(offsetof(CS2::animgraphlib::CFloatAnimParameter, m_fMaxValue) == 0x88, "m_fMaxValue in CFloatAnimParameter should be at offset 0x88");
		static_assert(offsetof(CS2::animgraphlib::CFloatAnimParameter, m_bInterpolate) == 0x8C, "m_bInterpolate in CFloatAnimParameter should be at offset 0x8C");
		static_assert(sizeof(CS2::animgraphlib::CFloatAnimParameter) == 0x90, "CFloatAnimParameter size should be 0x90");
	}
}
