// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#ifndef CUSTOM_GLOBAL_TYPES
	#include <SDK/GlobalTypes.hpp>
#else
	#include <Custom/GlobalTypes.hpp>
#endif


#include <SDK/animgraphlib/CAnimTagBase.hpp>
#include <SDK/animgraphlib/FootstepLandedFootSoundType_t.hpp>



namespace CS2 {
	namespace animgraphlib {
		class CFootstepLandedAnimTag : public CS2::animgraphlib::CAnimTagBase {
		public:
			S2_PAD(0x8);
			animgraphlib::FootstepLandedFootSoundType_t m_FootstepType; // 0x58 | Schema_DeclaredEnum | Size: 0x4
			S2_PAD(0x4);
			GlobalTypes::CUtlString m_OverrideSoundName; // 0x60 | Schema_Atomic | Size: 0x8
			GlobalTypes::CUtlString m_DebugAnimSourceString; // 0x68 | Schema_Atomic | Size: 0x8
			GlobalTypes::CUtlString m_BoneName; // 0x70 | Schema_Atomic | Size: 0x8
		};
		static_assert(offsetof(CS2::animgraphlib::CFootstepLandedAnimTag, m_FootstepType) == 0x58, "m_FootstepType in CFootstepLandedAnimTag should be at offset 0x58");
		static_assert(offsetof(CS2::animgraphlib::CFootstepLandedAnimTag, m_OverrideSoundName) == 0x60, "m_OverrideSoundName in CFootstepLandedAnimTag should be at offset 0x60");
		static_assert(offsetof(CS2::animgraphlib::CFootstepLandedAnimTag, m_DebugAnimSourceString) == 0x68, "m_DebugAnimSourceString in CFootstepLandedAnimTag should be at offset 0x68");
		static_assert(offsetof(CS2::animgraphlib::CFootstepLandedAnimTag, m_BoneName) == 0x70, "m_BoneName in CFootstepLandedAnimTag should be at offset 0x70");
		static_assert(sizeof(CS2::animgraphlib::CFootstepLandedAnimTag) == 0x78, "CFootstepLandedAnimTag size should be 0x78");
	}
}
