// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#ifndef CUSTOM_GLOBAL_TYPES
	#include <SDK/GlobalTypes.hpp>
#else
	#include <Custom/GlobalTypes.hpp>
#endif


#include <SDK/animgraphlib/CUnaryUpdateNode.hpp>
#include <SDK/animgraphlib/FootPinningPoseOpFixedData_t.hpp>
#include <SDK/animgraphlib/FootPinningTimingSource.hpp>



namespace CS2 {
	namespace animgraphlib {
		class CAnimParamHandle;
	}
}


using namespace GlobalTypes;
namespace CS2 {
	namespace animgraphlib {
		class CFootPinningUpdateNode : public CS2::animgraphlib::CUnaryUpdateNode {
		public:
			S2_PAD(0x8);
			animgraphlib::FootPinningPoseOpFixedData_t m_poseOpFixedData; // 0x78 | Schema_DeclaredClass | Size: 0x30
			animgraphlib::FootPinningTimingSource m_eTimingSource; // 0xa8 | Schema_DeclaredEnum | Size: 0x4
			S2_PAD(0x4);
			GlobalTypes::CUtlVector<animgraphlib::CAnimParamHandle> m_params; // 0xb0 | Schema_Atomic | Size: 0x18
			// char  m_params[0x18]; // 0xb0 | Schema_Atomic | Size: 0x18
			bool m_bResetChild; // 0xc8 | Schema_Builtin | Size: 0x1
			S2_PAD(0x7); // End padding
		};
		static_assert(offsetof(CS2::animgraphlib::CFootPinningUpdateNode, m_poseOpFixedData) == 0x78, "m_poseOpFixedData in CFootPinningUpdateNode should be at offset 0x78");
		static_assert(offsetof(CS2::animgraphlib::CFootPinningUpdateNode, m_eTimingSource) == 0xA8, "m_eTimingSource in CFootPinningUpdateNode should be at offset 0xA8");
		static_assert(offsetof(CS2::animgraphlib::CFootPinningUpdateNode, m_params) == 0xB0, "m_params in CFootPinningUpdateNode should be at offset 0xB0");
		static_assert(offsetof(CS2::animgraphlib::CFootPinningUpdateNode, m_bResetChild) == 0xC8, "m_bResetChild in CFootPinningUpdateNode should be at offset 0xC8");
		static_assert(sizeof(CS2::animgraphlib::CFootPinningUpdateNode) == 0xD0, "CFootPinningUpdateNode size should be 0xD0");
	}
}
