// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#ifndef CUSTOM_GLOBAL_TYPES
	#include <SDK/GlobalTypes.hpp>
#else
	#include <Custom/GlobalTypes.hpp>
#endif


#include <SDK/animgraphlib/CMotionMetricEvaluator.hpp>
#include <SDK/animgraphlib/VelocityMetricMode.hpp>





using namespace GlobalTypes;
namespace CS2 {
	namespace animgraphlib {
		class CFutureVelocityMetricEvaluator : public CS2::animgraphlib::CMotionMetricEvaluator {
		public:
			float32 m_flDistance; // 0x50 | Schema_Builtin | Size: 0x4
			float32 m_flStoppingDistance; // 0x54 | Schema_Builtin | Size: 0x4
			float32 m_flTargetSpeed; // 0x58 | Schema_Builtin | Size: 0x4
			animgraphlib::VelocityMetricMode m_eMode; // 0x5c | Schema_DeclaredEnum | Size: 0x1
			S2_PAD(0x3); // End padding
		};
		static_assert(offsetof(CS2::animgraphlib::CFutureVelocityMetricEvaluator, m_flDistance) == 0x50, "m_flDistance in CFutureVelocityMetricEvaluator should be at offset 0x50");
		static_assert(offsetof(CS2::animgraphlib::CFutureVelocityMetricEvaluator, m_flStoppingDistance) == 0x54, "m_flStoppingDistance in CFutureVelocityMetricEvaluator should be at offset 0x54");
		static_assert(offsetof(CS2::animgraphlib::CFutureVelocityMetricEvaluator, m_flTargetSpeed) == 0x58, "m_flTargetSpeed in CFutureVelocityMetricEvaluator should be at offset 0x58");
		static_assert(offsetof(CS2::animgraphlib::CFutureVelocityMetricEvaluator, m_eMode) == 0x5C, "m_eMode in CFutureVelocityMetricEvaluator should be at offset 0x5C");
		static_assert(sizeof(CS2::animgraphlib::CFutureVelocityMetricEvaluator) == 0x60, "CFutureVelocityMetricEvaluator size should be 0x60");
	}
}
