// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#ifndef CUSTOM_GLOBAL_TYPES
	#include <SDK/GlobalTypes.hpp>
#else
	#include <Custom/GlobalTypes.hpp>
#endif


#include <SDK/animgraphlib/IKSolverSettings_t.hpp>
#include <SDK/animgraphlib/IKTargetSettings_t.hpp>
#include <SDK/animgraphlib/SolveIKChainAnimNodeDebugSetting.hpp>





using namespace GlobalTypes;
namespace CS2 {
	namespace animgraphlib {
		class ChainToSolveData_t  {
		public:
			int32_t m_nChainIndex; // 0x0 | Schema_Builtin | Size: 0x4
			animgraphlib::IKSolverSettings_t m_SolverSettings; // 0x4 | Schema_DeclaredClass | Size: 0xc
			animgraphlib::IKTargetSettings_t m_TargetSettings; // 0x10 | Schema_DeclaredClass | Size: 0x28
			animgraphlib::SolveIKChainAnimNodeDebugSetting m_DebugSetting; // 0x38 | Schema_DeclaredEnum | Size: 0x4
			float32 m_flDebugNormalizedValue; // 0x3c | Schema_Builtin | Size: 0x4
			GlobalTypes::VectorAligned m_vDebugOffset; // 0x40 | Schema_Atomic | Size: 0x10
		};
		static_assert(offsetof(CS2::animgraphlib::ChainToSolveData_t, m_nChainIndex) == 0x0, "m_nChainIndex in ChainToSolveData_t should be at offset 0x0");
		static_assert(offsetof(CS2::animgraphlib::ChainToSolveData_t, m_SolverSettings) == 0x4, "m_SolverSettings in ChainToSolveData_t should be at offset 0x4");
		static_assert(offsetof(CS2::animgraphlib::ChainToSolveData_t, m_TargetSettings) == 0x10, "m_TargetSettings in ChainToSolveData_t should be at offset 0x10");
		static_assert(offsetof(CS2::animgraphlib::ChainToSolveData_t, m_DebugSetting) == 0x38, "m_DebugSetting in ChainToSolveData_t should be at offset 0x38");
		static_assert(offsetof(CS2::animgraphlib::ChainToSolveData_t, m_flDebugNormalizedValue) == 0x3C, "m_flDebugNormalizedValue in ChainToSolveData_t should be at offset 0x3C");
		static_assert(offsetof(CS2::animgraphlib::ChainToSolveData_t, m_vDebugOffset) == 0x40, "m_vDebugOffset in ChainToSolveData_t should be at offset 0x40");
		static_assert(sizeof(CS2::animgraphlib::ChainToSolveData_t) == 0x50, "ChainToSolveData_t size should be 0x50");
	}
}
