// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#ifndef CUSTOM_GLOBAL_TYPES
	#include <SDK/GlobalTypes.hpp>
#else
	#include <Custom/GlobalTypes.hpp>
#endif


#include <SDK/animgraphlib/CUnaryUpdateNode.hpp>
#include <SDK/animgraphlib/HitReactFixedSettings_t.hpp>
#include <SDK/animgraphlib/CAnimParamHandle.hpp>



namespace CS2 {
	namespace animgraphlib {
		class CHitReactUpdateNode : public CS2::animgraphlib::CUnaryUpdateNode {
		public:
			animgraphlib::HitReactFixedSettings_t m_opFixedSettings; // 0x70 | Schema_DeclaredClass | Size: 0x44
			S2_PAD(0x8);
			animgraphlib::CAnimParamHandle m_triggerParam; // 0xbc | Schema_DeclaredClass | Size: 0x2
			animgraphlib::CAnimParamHandle m_hitBoneParam; // 0xbe | Schema_DeclaredClass | Size: 0x2
			animgraphlib::CAnimParamHandle m_hitOffsetParam; // 0xc0 | Schema_DeclaredClass | Size: 0x2
			animgraphlib::CAnimParamHandle m_hitDirectionParam; // 0xc2 | Schema_DeclaredClass | Size: 0x2
			animgraphlib::CAnimParamHandle m_hitStrengthParam; // 0xc4 | Schema_DeclaredClass | Size: 0x2
			S2_PAD(0x2);
			float32 m_flMinDelayBetweenHits; // 0xc8 | Schema_Builtin | Size: 0x4
			bool m_bResetChild; // 0xcc | Schema_Builtin | Size: 0x1
			S2_PAD(0x3); // End padding
		};
		static_assert(offsetof(CS2::animgraphlib::CHitReactUpdateNode, m_opFixedSettings) == 0x70, "m_opFixedSettings in CHitReactUpdateNode should be at offset 0x70");
		static_assert(offsetof(CS2::animgraphlib::CHitReactUpdateNode, m_triggerParam) == 0xBC, "m_triggerParam in CHitReactUpdateNode should be at offset 0xBC");
		static_assert(offsetof(CS2::animgraphlib::CHitReactUpdateNode, m_hitBoneParam) == 0xBE, "m_hitBoneParam in CHitReactUpdateNode should be at offset 0xBE");
		static_assert(offsetof(CS2::animgraphlib::CHitReactUpdateNode, m_hitOffsetParam) == 0xC0, "m_hitOffsetParam in CHitReactUpdateNode should be at offset 0xC0");
		static_assert(offsetof(CS2::animgraphlib::CHitReactUpdateNode, m_hitDirectionParam) == 0xC2, "m_hitDirectionParam in CHitReactUpdateNode should be at offset 0xC2");
		static_assert(offsetof(CS2::animgraphlib::CHitReactUpdateNode, m_hitStrengthParam) == 0xC4, "m_hitStrengthParam in CHitReactUpdateNode should be at offset 0xC4");
		static_assert(offsetof(CS2::animgraphlib::CHitReactUpdateNode, m_flMinDelayBetweenHits) == 0xC8, "m_flMinDelayBetweenHits in CHitReactUpdateNode should be at offset 0xC8");
		static_assert(offsetof(CS2::animgraphlib::CHitReactUpdateNode, m_bResetChild) == 0xCC, "m_bResetChild in CHitReactUpdateNode should be at offset 0xCC");
		static_assert(sizeof(CS2::animgraphlib::CHitReactUpdateNode) == 0xD0, "CHitReactUpdateNode size should be 0xD0");
	}
}
