// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#include <SDK/GlobalTypes.hpp>

#include <SDK/animgraphlib/CSequenceUpdateNode.hpp>
#include <SDK/animgraphlib/CAnimParamHandle.hpp>
#include <SDK/animgraphlib/JumpCorrectionMethod.hpp>



namespace CS2 {
	namespace animgraphlib {
		class CJumpHelperUpdateNode : public CS2::animgraphlib::CSequenceUpdateNode {
		public:
			animgraphlib::CAnimParamHandle m_hTargetParam; // 0xb0 | Schema_DeclaredClass | Size: 0x2
			S2_PAD(0x2);
			GlobalTypes::Vector m_flOriginalJumpMovement; // 0xb4 | Schema_Atomic | Size: 0xc
			float32 m_flOriginalJumpDuration; // 0xc0 | Schema_Builtin | Size: 0x4
			float32 m_flJumpStartCycle; // 0xc4 | Schema_Builtin | Size: 0x4
			float32 m_flJumpEndCycle; // 0xc8 | Schema_Builtin | Size: 0x4
			animgraphlib::JumpCorrectionMethod m_eCorrectionMethod; // 0xcc | Schema_DeclaredEnum | Size: 0x4
			bool m_bTranslationAxis[3]; // 0xd0 | Schema_FixedArray | Size: 0x3
			bool m_bScaleSpeed; // 0xd3 | Schema_Builtin | Size: 0x1
			S2_PAD(0x4); // End padding
		};
		static_assert(offsetof(CS2::animgraphlib::CJumpHelperUpdateNode, m_hTargetParam) == 0xB0, "m_hTargetParam in CJumpHelperUpdateNode should be at offset 0xB0");
		static_assert(offsetof(CS2::animgraphlib::CJumpHelperUpdateNode, m_flOriginalJumpMovement) == 0xB4, "m_flOriginalJumpMovement in CJumpHelperUpdateNode should be at offset 0xB4");
		static_assert(offsetof(CS2::animgraphlib::CJumpHelperUpdateNode, m_flOriginalJumpDuration) == 0xC0, "m_flOriginalJumpDuration in CJumpHelperUpdateNode should be at offset 0xC0");
		static_assert(offsetof(CS2::animgraphlib::CJumpHelperUpdateNode, m_flJumpStartCycle) == 0xC4, "m_flJumpStartCycle in CJumpHelperUpdateNode should be at offset 0xC4");
		static_assert(offsetof(CS2::animgraphlib::CJumpHelperUpdateNode, m_flJumpEndCycle) == 0xC8, "m_flJumpEndCycle in CJumpHelperUpdateNode should be at offset 0xC8");
		static_assert(offsetof(CS2::animgraphlib::CJumpHelperUpdateNode, m_eCorrectionMethod) == 0xCC, "m_eCorrectionMethod in CJumpHelperUpdateNode should be at offset 0xCC");
		static_assert(offsetof(CS2::animgraphlib::CJumpHelperUpdateNode, m_bTranslationAxis) == 0xD0, "m_bTranslationAxis in CJumpHelperUpdateNode should be at offset 0xD0");
		static_assert(offsetof(CS2::animgraphlib::CJumpHelperUpdateNode, m_bScaleSpeed) == 0xD3, "m_bScaleSpeed in CJumpHelperUpdateNode should be at offset 0xD3");
		static_assert(sizeof(CS2::animgraphlib::CJumpHelperUpdateNode) == 0xD8, "CJumpHelperUpdateNode size should be 0xD8");
	}
}
