// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#ifndef CUSTOM_GLOBAL_TYPES
	#include <SDK/GlobalTypes.hpp>
#else
	#include <Custom/GlobalTypes.hpp>
#endif


#include <SDK/animgraphlib/CUnaryUpdateNode.hpp>
#include <SDK/animgraphlib/LookAtOpFixedSettings_t.hpp>
#include <SDK/animgraphlib/AnimVectorSource.hpp>
#include <SDK/animgraphlib/CAnimParamHandle.hpp>





using namespace GlobalTypes;
namespace CS2 {
	namespace animgraphlib {
		class CLookAtUpdateNode : public CS2::animgraphlib::CUnaryUpdateNode {
		public:
			animgraphlib::LookAtOpFixedSettings_t m_opFixedSettings; // 0x70 | Schema_DeclaredClass | Size: 0xd0
			S2_PAD(0x8);
			animgraphlib::AnimVectorSource m_target; // 0x148 | Schema_DeclaredEnum | Size: 0x4
			animgraphlib::CAnimParamHandle m_paramIndex; // 0x14c | Schema_DeclaredClass | Size: 0x2
			animgraphlib::CAnimParamHandle m_weightParamIndex; // 0x14e | Schema_DeclaredClass | Size: 0x2
			bool m_bResetChild; // 0x150 | Schema_Builtin | Size: 0x1
			bool m_bLockWhenWaning; // 0x151 | Schema_Builtin | Size: 0x1
			S2_PAD(0xe); // End padding
		};
		static_assert(offsetof(CS2::animgraphlib::CLookAtUpdateNode, m_opFixedSettings) == 0x70, "m_opFixedSettings in CLookAtUpdateNode should be at offset 0x70");
		static_assert(offsetof(CS2::animgraphlib::CLookAtUpdateNode, m_target) == 0x148, "m_target in CLookAtUpdateNode should be at offset 0x148");
		static_assert(offsetof(CS2::animgraphlib::CLookAtUpdateNode, m_paramIndex) == 0x14C, "m_paramIndex in CLookAtUpdateNode should be at offset 0x14C");
		static_assert(offsetof(CS2::animgraphlib::CLookAtUpdateNode, m_weightParamIndex) == 0x14E, "m_weightParamIndex in CLookAtUpdateNode should be at offset 0x14E");
		static_assert(offsetof(CS2::animgraphlib::CLookAtUpdateNode, m_bResetChild) == 0x150, "m_bResetChild in CLookAtUpdateNode should be at offset 0x150");
		static_assert(offsetof(CS2::animgraphlib::CLookAtUpdateNode, m_bLockWhenWaning) == 0x151, "m_bLockWhenWaning in CLookAtUpdateNode should be at offset 0x151");
		static_assert(sizeof(CS2::animgraphlib::CLookAtUpdateNode) == 0x160, "CLookAtUpdateNode size should be 0x160");
	}
}
