// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#include <SDK/GlobalTypes.hpp>

#include <SDK/animgraphlib/CAnimComponentUpdater.hpp>
#include <SDK/animgraphlib/CAnimParamHandle.hpp>



namespace CS2 {
	namespace animgraphlib {
		class CLookComponentUpdater : public CS2::animgraphlib::CAnimComponentUpdater {
		public:
			S2_PAD(0x4);
			animgraphlib::CAnimParamHandle m_hLookHeading; // 0x34 | Schema_DeclaredClass | Size: 0x2
			animgraphlib::CAnimParamHandle m_hLookHeadingNormalized; // 0x36 | Schema_DeclaredClass | Size: 0x2
			animgraphlib::CAnimParamHandle m_hLookHeadingVelocity; // 0x38 | Schema_DeclaredClass | Size: 0x2
			animgraphlib::CAnimParamHandle m_hLookPitch; // 0x3a | Schema_DeclaredClass | Size: 0x2
			animgraphlib::CAnimParamHandle m_hLookDistance; // 0x3c | Schema_DeclaredClass | Size: 0x2
			animgraphlib::CAnimParamHandle m_hLookDirection; // 0x3e | Schema_DeclaredClass | Size: 0x2
			animgraphlib::CAnimParamHandle m_hLookTarget; // 0x40 | Schema_DeclaredClass | Size: 0x2
			animgraphlib::CAnimParamHandle m_hLookTargetWorldSpace; // 0x42 | Schema_DeclaredClass | Size: 0x2
			bool m_bNetworkLookTarget; // 0x44 | Schema_Builtin | Size: 0x1
			S2_PAD(0x3); // End padding
		};
		static_assert(offsetof(CS2::animgraphlib::CLookComponentUpdater, m_hLookHeading) == 0x34, "m_hLookHeading in CLookComponentUpdater should be at offset 0x34");
		static_assert(offsetof(CS2::animgraphlib::CLookComponentUpdater, m_hLookHeadingNormalized) == 0x36, "m_hLookHeadingNormalized in CLookComponentUpdater should be at offset 0x36");
		static_assert(offsetof(CS2::animgraphlib::CLookComponentUpdater, m_hLookHeadingVelocity) == 0x38, "m_hLookHeadingVelocity in CLookComponentUpdater should be at offset 0x38");
		static_assert(offsetof(CS2::animgraphlib::CLookComponentUpdater, m_hLookPitch) == 0x3A, "m_hLookPitch in CLookComponentUpdater should be at offset 0x3A");
		static_assert(offsetof(CS2::animgraphlib::CLookComponentUpdater, m_hLookDistance) == 0x3C, "m_hLookDistance in CLookComponentUpdater should be at offset 0x3C");
		static_assert(offsetof(CS2::animgraphlib::CLookComponentUpdater, m_hLookDirection) == 0x3E, "m_hLookDirection in CLookComponentUpdater should be at offset 0x3E");
		static_assert(offsetof(CS2::animgraphlib::CLookComponentUpdater, m_hLookTarget) == 0x40, "m_hLookTarget in CLookComponentUpdater should be at offset 0x40");
		static_assert(offsetof(CS2::animgraphlib::CLookComponentUpdater, m_hLookTargetWorldSpace) == 0x42, "m_hLookTargetWorldSpace in CLookComponentUpdater should be at offset 0x42");
		static_assert(offsetof(CS2::animgraphlib::CLookComponentUpdater, m_bNetworkLookTarget) == 0x44, "m_bNetworkLookTarget in CLookComponentUpdater should be at offset 0x44");
		static_assert(sizeof(CS2::animgraphlib::CLookComponentUpdater) == 0x48, "CLookComponentUpdater size should be 0x48");
	}
}
