// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#include <SDK/GlobalTypes.hpp>

#include <SDK/animgraphlib/CAnimTagBase.hpp>
#include <SDK/animgraphlib/MatterialAttributeTagType_t.hpp>



namespace CS2 {
	namespace animgraphlib {
		class CMaterialAttributeAnimTag : public CS2::animgraphlib::CAnimTagBase {
		public:
			S2_PAD(0x8);
			GlobalTypes::CUtlString m_AttributeName; // 0x58 | Schema_Atomic | Size: 0x8
			animgraphlib::MatterialAttributeTagType_t m_AttributeType; // 0x60 | Schema_DeclaredEnum | Size: 0x4
			float32 m_flValue; // 0x64 | Schema_Builtin | Size: 0x4
			GlobalTypes::Color m_Color; // 0x68 | Schema_Atomic | Size: 0x4
			S2_PAD(0x4); // End padding
		};
		static_assert(offsetof(CS2::animgraphlib::CMaterialAttributeAnimTag, m_AttributeName) == 0x58, "m_AttributeName in CMaterialAttributeAnimTag should be at offset 0x58");
		static_assert(offsetof(CS2::animgraphlib::CMaterialAttributeAnimTag, m_AttributeType) == 0x60, "m_AttributeType in CMaterialAttributeAnimTag should be at offset 0x60");
		static_assert(offsetof(CS2::animgraphlib::CMaterialAttributeAnimTag, m_flValue) == 0x64, "m_flValue in CMaterialAttributeAnimTag should be at offset 0x64");
		static_assert(offsetof(CS2::animgraphlib::CMaterialAttributeAnimTag, m_Color) == 0x68, "m_Color in CMaterialAttributeAnimTag should be at offset 0x68");
		static_assert(sizeof(CS2::animgraphlib::CMaterialAttributeAnimTag) == 0x70, "CMaterialAttributeAnimTag size should be 0x70");
	}
}
