// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#ifndef CUSTOM_GLOBAL_TYPES
	#include <SDK/GlobalTypes.hpp>
#else
	#include <Custom/GlobalTypes.hpp>
#endif


#include <SDK/animgraphlib/CMotionSearchDB.hpp>
#include <SDK/modellib/AnimScriptHandle.hpp>



namespace CS2 {
	namespace animgraphlib {
		class CMotionGraphConfig;
	}
}
namespace CS2 {
	namespace animgraphlib {
		class CMotionGraphGroup  {
		public:
			animgraphlib::CMotionSearchDB m_searchDB; // 0x0 | Schema_DeclaredClass | Size: 0xb8
			GlobalTypes::CUtlVector< GlobalTypes::CSmartPtr< CMotionGraph > > m_motionGraphs; // 0xb8 | Schema_Atomic | Size: 0x18
			// char  m_motionGraphs[0x18]; // 0xb8 | Schema_Atomic | Size: 0x18
			// GlobalTypes::CUtlVector< GlobalTypes::CSmartPtr< CMotionGraph > > m_motionGraphs; // 0xb8 | Schema_Atomic | Size: 0x18
			GlobalTypes::CUtlVector< animgraphlib::CMotionGraphConfig > m_motionGraphConfigs; // 0xd0 | Schema_Atomic | Size: 0x18
			// char  m_motionGraphConfigs[0x18]; // 0xd0 | Schema_Atomic | Size: 0x18
			// GlobalTypes::CUtlVector< animgraphlib::CMotionGraphConfig > m_motionGraphConfigs; // 0xd0 | Schema_Atomic | Size: 0x18
			// GlobalTypes::CUtlVector< int32 > m_sampleToConfig; // 0xe8 | Schema_Atomic | Size: 0x18
			char  m_sampleToConfig[0x18]; // 0xe8 | Schema_Atomic | Size: 0x18
			modellib::AnimScriptHandle m_hIsActiveScript; // 0x100 | Schema_DeclaredClass | Size: 0x4
			S2_PAD(0x4); // End padding
		};
		static_assert(offsetof(CS2::animgraphlib::CMotionGraphGroup, m_searchDB) == 0x0, "m_searchDB in CMotionGraphGroup should be at offset 0x0");
		static_assert(offsetof(CS2::animgraphlib::CMotionGraphGroup, m_motionGraphs) == 0xB8, "m_motionGraphs in CMotionGraphGroup should be at offset 0xB8");
		static_assert(offsetof(CS2::animgraphlib::CMotionGraphGroup, m_motionGraphConfigs) == 0xD0, "m_motionGraphConfigs in CMotionGraphGroup should be at offset 0xD0");
		static_assert(offsetof(CS2::animgraphlib::CMotionGraphGroup, m_sampleToConfig) == 0xE8, "m_sampleToConfig in CMotionGraphGroup should be at offset 0xE8");
		static_assert(offsetof(CS2::animgraphlib::CMotionGraphGroup, m_hIsActiveScript) == 0x100, "m_hIsActiveScript in CMotionGraphGroup should be at offset 0x100");
		static_assert(sizeof(CS2::animgraphlib::CMotionGraphGroup) == 0x108, "CMotionGraphGroup size should be 0x108");
	}
}
