// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#ifndef CUSTOM_GLOBAL_TYPES
	#include <SDK/GlobalTypes.hpp>
#else
	#include <Custom/GlobalTypes.hpp>
#endif


#include <SDK/animgraphlib/MotionIndex.hpp>





using namespace GlobalTypes;
namespace CS2 {
	namespace animgraphlib {
		class CMotionGraphConfig  {
		public:
			float32 m_paramValues[4]; // 0x0 | Schema_FixedArray | Size: 0x10
			float32 m_flDuration; // 0x10 | Schema_Builtin | Size: 0x4
			animgraphlib::MotionIndex m_nMotionIndex; // 0x14 | Schema_DeclaredClass | Size: 0x4
			int32_t m_nSampleStart; // 0x18 | Schema_Builtin | Size: 0x4
			int32_t m_nSampleCount; // 0x1c | Schema_Builtin | Size: 0x4
		};
		static_assert(offsetof(CS2::animgraphlib::CMotionGraphConfig, m_paramValues) == 0x0, "m_paramValues in CMotionGraphConfig should be at offset 0x0");
		static_assert(offsetof(CS2::animgraphlib::CMotionGraphConfig, m_flDuration) == 0x10, "m_flDuration in CMotionGraphConfig should be at offset 0x10");
		static_assert(offsetof(CS2::animgraphlib::CMotionGraphConfig, m_nMotionIndex) == 0x14, "m_nMotionIndex in CMotionGraphConfig should be at offset 0x14");
		static_assert(offsetof(CS2::animgraphlib::CMotionGraphConfig, m_nSampleStart) == 0x18, "m_nSampleStart in CMotionGraphConfig should be at offset 0x18");
		static_assert(offsetof(CS2::animgraphlib::CMotionGraphConfig, m_nSampleCount) == 0x1C, "m_nSampleCount in CMotionGraphConfig should be at offset 0x1C");
		static_assert(sizeof(CS2::animgraphlib::CMotionGraphConfig) == 0x20, "CMotionGraphConfig size should be 0x20");
	}
}
