// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#ifndef CUSTOM_GLOBAL_TYPES
	#include <SDK/GlobalTypes.hpp>
#else
	#include <Custom/GlobalTypes.hpp>
#endif


#include <SDK/animgraphlib/CAnimComponentUpdater.hpp>
#include <SDK/animgraphlib/CAnimInputDamping.hpp>
#include <SDK/animgraphlib/CAnimParamHandle.hpp>





using namespace GlobalTypes;
namespace CS2 {
	namespace animgraphlib {
		class CMovementComponentUpdater : public CS2::animgraphlib::CAnimComponentUpdater {
		public:
			GlobalTypes::CUtlVector< GlobalTypes::CSmartPtr< CAnimMotorUpdaterBase > > m_motors; // 0x30 | Schema_Atomic | Size: 0x18
			// char  m_motors[0x18]; // 0x30 | Schema_Atomic | Size: 0x18
			animgraphlib::CAnimInputDamping m_facingDamping; // 0x48 | Schema_DeclaredClass | Size: 0x18
			S2_PAD(0x8);
			int32_t m_nDefaultMotorIndex; // 0x68 | Schema_Builtin | Size: 0x4
			float32 m_flDefaultRunSpeed; // 0x6c | Schema_Builtin | Size: 0x4
			bool m_bMoveVarsDisabled; // 0x70 | Schema_Builtin | Size: 0x1
			bool m_bNetworkPath; // 0x71 | Schema_Builtin | Size: 0x1
			bool m_bNetworkFacing; // 0x72 | Schema_Builtin | Size: 0x1
			animgraphlib::CAnimParamHandle m_paramHandles[34]; // 0x73 | Schema_FixedArray | Size: 0x908
		};
		static_assert(offsetof(CS2::animgraphlib::CMovementComponentUpdater, m_motors) == 0x30, "m_motors in CMovementComponentUpdater should be at offset 0x30");
		static_assert(offsetof(CS2::animgraphlib::CMovementComponentUpdater, m_facingDamping) == 0x48, "m_facingDamping in CMovementComponentUpdater should be at offset 0x48");
		static_assert(offsetof(CS2::animgraphlib::CMovementComponentUpdater, m_nDefaultMotorIndex) == 0x68, "m_nDefaultMotorIndex in CMovementComponentUpdater should be at offset 0x68");
		static_assert(offsetof(CS2::animgraphlib::CMovementComponentUpdater, m_flDefaultRunSpeed) == 0x6C, "m_flDefaultRunSpeed in CMovementComponentUpdater should be at offset 0x6C");
		static_assert(offsetof(CS2::animgraphlib::CMovementComponentUpdater, m_bMoveVarsDisabled) == 0x70, "m_bMoveVarsDisabled in CMovementComponentUpdater should be at offset 0x70");
		static_assert(offsetof(CS2::animgraphlib::CMovementComponentUpdater, m_bNetworkPath) == 0x71, "m_bNetworkPath in CMovementComponentUpdater should be at offset 0x71");
		static_assert(offsetof(CS2::animgraphlib::CMovementComponentUpdater, m_bNetworkFacing) == 0x72, "m_bNetworkFacing in CMovementComponentUpdater should be at offset 0x72");
		static_assert(offsetof(CS2::animgraphlib::CMovementComponentUpdater, m_paramHandles) == 0x73, "m_paramHandles in CMovementComponentUpdater should be at offset 0x73");
		static_assert(sizeof(CS2::animgraphlib::CMovementComponentUpdater) == 0xB8, "CMovementComponentUpdater size should be 0xB8");
	}
}
