// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#ifndef CUSTOM_GLOBAL_TYPES
	#include <SDK/GlobalTypes.hpp>
#else
	#include <Custom/GlobalTypes.hpp>
#endif


#include <SDK/animgraphlib/CMotionMetricEvaluator.hpp>





using namespace GlobalTypes;
namespace CS2 {
	namespace animgraphlib {
		class CPathMetricEvaluator : public CS2::animgraphlib::CMotionMetricEvaluator {
		public:
			GlobalTypes::CUtlVector< float32 > m_pathTimeSamples; // 0x50 | Schema_Atomic | Size: 0x18
			// char  m_pathTimeSamples[0x18]; // 0x50 | Schema_Atomic | Size: 0x18
			float32 m_flDistance; // 0x68 | Schema_Builtin | Size: 0x4
			bool m_bExtrapolateMovement; // 0x6c | Schema_Builtin | Size: 0x1
			S2_PAD(0x3);
			float32 m_flMinExtrapolationSpeed; // 0x70 | Schema_Builtin | Size: 0x4
			S2_PAD(0x4); // End padding
		};
		static_assert(offsetof(CS2::animgraphlib::CPathMetricEvaluator, m_pathTimeSamples) == 0x50, "m_pathTimeSamples in CPathMetricEvaluator should be at offset 0x50");
		static_assert(offsetof(CS2::animgraphlib::CPathMetricEvaluator, m_flDistance) == 0x68, "m_flDistance in CPathMetricEvaluator should be at offset 0x68");
		static_assert(offsetof(CS2::animgraphlib::CPathMetricEvaluator, m_bExtrapolateMovement) == 0x6C, "m_bExtrapolateMovement in CPathMetricEvaluator should be at offset 0x6C");
		static_assert(offsetof(CS2::animgraphlib::CPathMetricEvaluator, m_flMinExtrapolationSpeed) == 0x70, "m_flMinExtrapolationSpeed in CPathMetricEvaluator should be at offset 0x70");
		static_assert(sizeof(CS2::animgraphlib::CPathMetricEvaluator) == 0x78, "CPathMetricEvaluator size should be 0x78");
	}
}
