// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#ifndef CUSTOM_GLOBAL_TYPES
	#include <SDK/GlobalTypes.hpp>
#else
	#include <Custom/GlobalTypes.hpp>
#endif


#include <SDK/animgraphlib/CAnimMotorUpdaterBase.hpp>
#include <SDK/animgraphlib/CAnimParamHandle.hpp>



namespace CS2 {
	namespace animgraphlib {
		class CPlayerInputAnimMotorUpdater : public CS2::animgraphlib::CAnimMotorUpdaterBase {
		public:
			// GlobalTypes::CUtlVector< float32 > m_sampleTimes; // 0x20 | Schema_Atomic | Size: 0x18
			char  m_sampleTimes[0x18]; // 0x20 | Schema_Atomic | Size: 0x18
			S2_PAD(0x4);
			float32 m_flSpringConstant; // 0x3c | Schema_Builtin | Size: 0x4
			float32 m_flAnticipationDistance; // 0x40 | Schema_Builtin | Size: 0x4
			animgraphlib::CAnimParamHandle m_hAnticipationPosParam; // 0x44 | Schema_DeclaredClass | Size: 0x2
			animgraphlib::CAnimParamHandle m_hAnticipationHeadingParam; // 0x46 | Schema_DeclaredClass | Size: 0x2
			bool m_bUseAcceleration; // 0x48 | Schema_Builtin | Size: 0x1
			S2_PAD(0x7); // End padding
		};
		static_assert(offsetof(CS2::animgraphlib::CPlayerInputAnimMotorUpdater, m_sampleTimes) == 0x20, "m_sampleTimes in CPlayerInputAnimMotorUpdater should be at offset 0x20");
		static_assert(offsetof(CS2::animgraphlib::CPlayerInputAnimMotorUpdater, m_flSpringConstant) == 0x3C, "m_flSpringConstant in CPlayerInputAnimMotorUpdater should be at offset 0x3C");
		static_assert(offsetof(CS2::animgraphlib::CPlayerInputAnimMotorUpdater, m_flAnticipationDistance) == 0x40, "m_flAnticipationDistance in CPlayerInputAnimMotorUpdater should be at offset 0x40");
		static_assert(offsetof(CS2::animgraphlib::CPlayerInputAnimMotorUpdater, m_hAnticipationPosParam) == 0x44, "m_hAnticipationPosParam in CPlayerInputAnimMotorUpdater should be at offset 0x44");
		static_assert(offsetof(CS2::animgraphlib::CPlayerInputAnimMotorUpdater, m_hAnticipationHeadingParam) == 0x46, "m_hAnticipationHeadingParam in CPlayerInputAnimMotorUpdater should be at offset 0x46");
		static_assert(offsetof(CS2::animgraphlib::CPlayerInputAnimMotorUpdater, m_bUseAcceleration) == 0x48, "m_bUseAcceleration in CPlayerInputAnimMotorUpdater should be at offset 0x48");
		static_assert(sizeof(CS2::animgraphlib::CPlayerInputAnimMotorUpdater) == 0x50, "CPlayerInputAnimMotorUpdater size should be 0x50");
	}
}
