// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#include <SDK/GlobalTypes.hpp>

#include <SDK/animgraphlib/CSequenceUpdateNodeBase.hpp>
#include <SDK/animationsystem/HSequence.hpp>
#include <SDK/animgraphlib/CParamSpanUpdater.hpp>



namespace CS2 {
	namespace animgraphlib {
		class CSequenceUpdateNode : public CS2::animgraphlib::CSequenceUpdateNodeBase {
		public:
			animationsystem::HSequence m_hSequence; // 0x78 | Schema_DeclaredClass | Size: 0x4
			float32 m_duration; // 0x7c | Schema_Builtin | Size: 0x4
			animgraphlib::CParamSpanUpdater m_paramSpans; // 0x80 | Schema_DeclaredClass | Size: 0x18
			// GlobalTypes::CUtlVector< animgraphlib::TagSpan_t > m_tags; // 0x98 | Schema_Atomic | Size: 0x18
			char  m_tags[0x18]; // 0x98 | Schema_Atomic | Size: 0x18
		};
		static_assert(offsetof(CS2::animgraphlib::CSequenceUpdateNode, m_hSequence) == 0x78, "m_hSequence in CSequenceUpdateNode should be at offset 0x78");
		static_assert(offsetof(CS2::animgraphlib::CSequenceUpdateNode, m_duration) == 0x7C, "m_duration in CSequenceUpdateNode should be at offset 0x7C");
		static_assert(offsetof(CS2::animgraphlib::CSequenceUpdateNode, m_paramSpans) == 0x80, "m_paramSpans in CSequenceUpdateNode should be at offset 0x80");
		static_assert(offsetof(CS2::animgraphlib::CSequenceUpdateNode, m_tags) == 0x98, "m_tags in CSequenceUpdateNode should be at offset 0x98");
		static_assert(sizeof(CS2::animgraphlib::CSequenceUpdateNode) == 0xB0, "CSequenceUpdateNode size should be 0xB0");
	}
}
