// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#ifndef CUSTOM_GLOBAL_TYPES
	#include <SDK/GlobalTypes.hpp>
#else
	#include <Custom/GlobalTypes.hpp>
#endif


#include <SDK/animgraphlib/CLeafUpdateNode.hpp>
#include <SDK/animgraphlib/CPoseHandle.hpp>
#include <SDK/animationsystem/HSequence.hpp>



namespace CS2 {
	namespace animgraphlib {
		class CSingleFrameUpdateNode : public CS2::animgraphlib::CLeafUpdateNode {
		public:
			// GlobalTypes::CUtlVector< GlobalTypes::CSmartPtr< CAnimActionUpdater > > m_actions; // 0x58 | Schema_Atomic | Size: 0x18
			char  m_actions[0x18]; // 0x58 | Schema_Atomic | Size: 0x18
			animgraphlib::CPoseHandle m_hPoseCacheHandle; // 0x70 | Schema_DeclaredClass | Size: 0x4
			animationsystem::HSequence m_hSequence; // 0x74 | Schema_DeclaredClass | Size: 0x4
			float32 m_flCycle; // 0x78 | Schema_Builtin | Size: 0x4
			S2_PAD(0x4); // End padding
		};
		static_assert(offsetof(CS2::animgraphlib::CSingleFrameUpdateNode, m_actions) == 0x58, "m_actions in CSingleFrameUpdateNode should be at offset 0x58");
		static_assert(offsetof(CS2::animgraphlib::CSingleFrameUpdateNode, m_hPoseCacheHandle) == 0x70, "m_hPoseCacheHandle in CSingleFrameUpdateNode should be at offset 0x70");
		static_assert(offsetof(CS2::animgraphlib::CSingleFrameUpdateNode, m_hSequence) == 0x74, "m_hSequence in CSingleFrameUpdateNode should be at offset 0x74");
		static_assert(offsetof(CS2::animgraphlib::CSingleFrameUpdateNode, m_flCycle) == 0x78, "m_flCycle in CSingleFrameUpdateNode should be at offset 0x78");
		static_assert(sizeof(CS2::animgraphlib::CSingleFrameUpdateNode) == 0x80, "CSingleFrameUpdateNode size should be 0x80");
	}
}
