// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#ifndef CUSTOM_GLOBAL_TYPES
	#include <SDK/GlobalTypes.hpp>
#else
	#include <Custom/GlobalTypes.hpp>
#endif


#include <SDK/animgraphlib/CAnimComponentUpdater.hpp>
#include <SDK/animgraphlib/CAnimParamHandle.hpp>



namespace CS2 {
	namespace animgraphlib {
		class CSlopeComponentUpdater : public CS2::animgraphlib::CAnimComponentUpdater {
		public:
			S2_PAD(0x4);
			float32 m_flTraceDistance; // 0x34 | Schema_Builtin | Size: 0x4
			animgraphlib::CAnimParamHandle m_hSlopeAngle; // 0x38 | Schema_DeclaredClass | Size: 0x2
			animgraphlib::CAnimParamHandle m_hSlopeAngleFront; // 0x3a | Schema_DeclaredClass | Size: 0x2
			animgraphlib::CAnimParamHandle m_hSlopeAngleSide; // 0x3c | Schema_DeclaredClass | Size: 0x2
			animgraphlib::CAnimParamHandle m_hSlopeHeading; // 0x3e | Schema_DeclaredClass | Size: 0x2
			animgraphlib::CAnimParamHandle m_hSlopeNormal; // 0x40 | Schema_DeclaredClass | Size: 0x2
			animgraphlib::CAnimParamHandle m_hSlopeNormal_WorldSpace; // 0x42 | Schema_DeclaredClass | Size: 0x2
			S2_PAD(0x4); // End padding
		};
		static_assert(offsetof(CS2::animgraphlib::CSlopeComponentUpdater, m_flTraceDistance) == 0x34, "m_flTraceDistance in CSlopeComponentUpdater should be at offset 0x34");
		static_assert(offsetof(CS2::animgraphlib::CSlopeComponentUpdater, m_hSlopeAngle) == 0x38, "m_hSlopeAngle in CSlopeComponentUpdater should be at offset 0x38");
		static_assert(offsetof(CS2::animgraphlib::CSlopeComponentUpdater, m_hSlopeAngleFront) == 0x3A, "m_hSlopeAngleFront in CSlopeComponentUpdater should be at offset 0x3A");
		static_assert(offsetof(CS2::animgraphlib::CSlopeComponentUpdater, m_hSlopeAngleSide) == 0x3C, "m_hSlopeAngleSide in CSlopeComponentUpdater should be at offset 0x3C");
		static_assert(offsetof(CS2::animgraphlib::CSlopeComponentUpdater, m_hSlopeHeading) == 0x3E, "m_hSlopeHeading in CSlopeComponentUpdater should be at offset 0x3E");
		static_assert(offsetof(CS2::animgraphlib::CSlopeComponentUpdater, m_hSlopeNormal) == 0x40, "m_hSlopeNormal in CSlopeComponentUpdater should be at offset 0x40");
		static_assert(offsetof(CS2::animgraphlib::CSlopeComponentUpdater, m_hSlopeNormal_WorldSpace) == 0x42, "m_hSlopeNormal_WorldSpace in CSlopeComponentUpdater should be at offset 0x42");
		static_assert(sizeof(CS2::animgraphlib::CSlopeComponentUpdater) == 0x48, "CSlopeComponentUpdater size should be 0x48");
	}
}
