// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#include <SDK/GlobalTypes.hpp>

#include <SDK/modellib/AnimScriptHandle.hpp>
#include <SDK/modellib/AnimStateID.hpp>



namespace CS2 {
	namespace animgraphlib {
		class CStateUpdateData  {
		public:
			GlobalTypes::CUtlString m_name; // 0x0 | Schema_Atomic | Size: 0x8
			modellib::AnimScriptHandle m_hScript; // 0x8 | Schema_DeclaredClass | Size: 0x4
			S2_PAD(0x4);
			// GlobalTypes::CUtlVector< int32 > m_transitionIndices; // 0x10 | Schema_Atomic | Size: 0x18
			char  m_transitionIndices[0x18]; // 0x10 | Schema_Atomic | Size: 0x18
			// GlobalTypes::CUtlVector< animgraphlib::CStateActionUpdater > m_actions; // 0x28 | Schema_Atomic | Size: 0x18
			char  m_actions[0x18]; // 0x28 | Schema_Atomic | Size: 0x18
			modellib::AnimStateID m_stateID; // 0x40 | Schema_DeclaredClass | Size: 0x4
			S2_PAD(0x4); // End padding
		};
		static_assert(offsetof(CS2::animgraphlib::CStateUpdateData, m_name) == 0x0, "m_name in CStateUpdateData should be at offset 0x0");
		static_assert(offsetof(CS2::animgraphlib::CStateUpdateData, m_hScript) == 0x8, "m_hScript in CStateUpdateData should be at offset 0x8");
		static_assert(offsetof(CS2::animgraphlib::CStateUpdateData, m_transitionIndices) == 0x10, "m_transitionIndices in CStateUpdateData should be at offset 0x10");
		static_assert(offsetof(CS2::animgraphlib::CStateUpdateData, m_actions) == 0x28, "m_actions in CStateUpdateData should be at offset 0x28");
		static_assert(offsetof(CS2::animgraphlib::CStateUpdateData, m_stateID) == 0x40, "m_stateID in CStateUpdateData should be at offset 0x40");
		static_assert(sizeof(CS2::animgraphlib::CStateUpdateData) == 0x48, "CStateUpdateData size should be 0x48");
	}
}
