// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#ifndef CUSTOM_GLOBAL_TYPES
	#include <SDK/GlobalTypes.hpp>
#else
	#include <Custom/GlobalTypes.hpp>
#endif


#include <SDK/animgraphlib/CUnaryUpdateNode.hpp>
#include <SDK/animgraphlib/CAnimUpdateNodeRef.hpp>
#include <SDK/animgraphlib/CAnimParamHandle.hpp>
#include <SDK/animgraphlib/StanceOverrideMode.hpp>



namespace CS2 {
	namespace animgraphlib {
		class StanceInfo_t;
	}
}
namespace CS2 {
	namespace animgraphlib {
		class CStanceOverrideUpdateNode : public CS2::animgraphlib::CUnaryUpdateNode {
		public:
			GlobalTypes::CUtlVector< animgraphlib::StanceInfo_t > m_footStanceInfo; // 0x70 | Schema_Atomic | Size: 0x18
			// char  m_footStanceInfo[0x18]; // 0x70 | Schema_Atomic | Size: 0x18
			// GlobalTypes::CUtlVector< animgraphlib::StanceInfo_t > m_footStanceInfo; // 0x70 | Schema_Atomic | Size: 0x18
			animgraphlib::CAnimUpdateNodeRef m_pStanceSourceNode; // 0x88 | Schema_DeclaredClass | Size: 0x10
			animgraphlib::CAnimParamHandle m_hParameter; // 0x98 | Schema_DeclaredClass | Size: 0x2
			S2_PAD(0x2);
			animgraphlib::StanceOverrideMode m_eMode; // 0x9c | Schema_DeclaredEnum | Size: 0x4
		};
		static_assert(offsetof(CS2::animgraphlib::CStanceOverrideUpdateNode, m_footStanceInfo) == 0x70, "m_footStanceInfo in CStanceOverrideUpdateNode should be at offset 0x70");
		static_assert(offsetof(CS2::animgraphlib::CStanceOverrideUpdateNode, m_pStanceSourceNode) == 0x88, "m_pStanceSourceNode in CStanceOverrideUpdateNode should be at offset 0x88");
		static_assert(offsetof(CS2::animgraphlib::CStanceOverrideUpdateNode, m_hParameter) == 0x98, "m_hParameter in CStanceOverrideUpdateNode should be at offset 0x98");
		static_assert(offsetof(CS2::animgraphlib::CStanceOverrideUpdateNode, m_eMode) == 0x9C, "m_eMode in CStanceOverrideUpdateNode should be at offset 0x9C");
		static_assert(sizeof(CS2::animgraphlib::CStanceOverrideUpdateNode) == 0xA0, "CStanceOverrideUpdateNode size should be 0xA0");
	}
}
