// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#include <SDK/GlobalTypes.hpp>

#include <SDK/animgraphlib/CUnaryUpdateNode.hpp>
#include <SDK/animgraphlib/CAnimInputDamping.hpp>



namespace CS2 {
	namespace animgraphlib {
		class CStopAtGoalUpdateNode : public CS2::animgraphlib::CUnaryUpdateNode {
		public:
			S2_PAD(0x4);
			float32 m_flOuterRadius; // 0x74 | Schema_Builtin | Size: 0x4
			float32 m_flInnerRadius; // 0x78 | Schema_Builtin | Size: 0x4
			float32 m_flMaxScale; // 0x7c | Schema_Builtin | Size: 0x4
			float32 m_flMinScale; // 0x80 | Schema_Builtin | Size: 0x4
			S2_PAD(0x4);
			animgraphlib::CAnimInputDamping m_damping; // 0x88 | Schema_DeclaredClass | Size: 0x18
		};
		static_assert(offsetof(CS2::animgraphlib::CStopAtGoalUpdateNode, m_flOuterRadius) == 0x74, "m_flOuterRadius in CStopAtGoalUpdateNode should be at offset 0x74");
		static_assert(offsetof(CS2::animgraphlib::CStopAtGoalUpdateNode, m_flInnerRadius) == 0x78, "m_flInnerRadius in CStopAtGoalUpdateNode should be at offset 0x78");
		static_assert(offsetof(CS2::animgraphlib::CStopAtGoalUpdateNode, m_flMaxScale) == 0x7C, "m_flMaxScale in CStopAtGoalUpdateNode should be at offset 0x7C");
		static_assert(offsetof(CS2::animgraphlib::CStopAtGoalUpdateNode, m_flMinScale) == 0x80, "m_flMinScale in CStopAtGoalUpdateNode should be at offset 0x80");
		static_assert(offsetof(CS2::animgraphlib::CStopAtGoalUpdateNode, m_damping) == 0x88, "m_damping in CStopAtGoalUpdateNode should be at offset 0x88");
		static_assert(sizeof(CS2::animgraphlib::CStopAtGoalUpdateNode) == 0xA0, "CStopAtGoalUpdateNode size should be 0xA0");
	}
}
