// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#include <SDK/GlobalTypes.hpp>

#include <SDK/animgraphlib/CMotionMetricEvaluator.hpp>



namespace CS2 {
	namespace animgraphlib {
		class CTimeRemainingMetricEvaluator : public CS2::animgraphlib::CMotionMetricEvaluator {
		public:
			bool m_bMatchByTimeRemaining; // 0x50 | Schema_Builtin | Size: 0x1
			S2_PAD(0x3);
			float32 m_flMaxTimeRemaining; // 0x54 | Schema_Builtin | Size: 0x4
			bool m_bFilterByTimeRemaining; // 0x58 | Schema_Builtin | Size: 0x1
			S2_PAD(0x3);
			float32 m_flMinTimeRemaining; // 0x5c | Schema_Builtin | Size: 0x4
		};
		static_assert(offsetof(CS2::animgraphlib::CTimeRemainingMetricEvaluator, m_bMatchByTimeRemaining) == 0x50, "m_bMatchByTimeRemaining in CTimeRemainingMetricEvaluator should be at offset 0x50");
		static_assert(offsetof(CS2::animgraphlib::CTimeRemainingMetricEvaluator, m_flMaxTimeRemaining) == 0x54, "m_flMaxTimeRemaining in CTimeRemainingMetricEvaluator should be at offset 0x54");
		static_assert(offsetof(CS2::animgraphlib::CTimeRemainingMetricEvaluator, m_bFilterByTimeRemaining) == 0x58, "m_bFilterByTimeRemaining in CTimeRemainingMetricEvaluator should be at offset 0x58");
		static_assert(offsetof(CS2::animgraphlib::CTimeRemainingMetricEvaluator, m_flMinTimeRemaining) == 0x5C, "m_flMinTimeRemaining in CTimeRemainingMetricEvaluator should be at offset 0x5C");
		static_assert(sizeof(CS2::animgraphlib::CTimeRemainingMetricEvaluator) == 0x60, "CTimeRemainingMetricEvaluator size should be 0x60");
	}
}
