// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#include <SDK/GlobalTypes.hpp>

#include <SDK/animgraphlib/CUnaryUpdateNode.hpp>
#include <SDK/animgraphlib/AnimValueSource.hpp>



namespace CS2 {
	namespace animgraphlib {
		class CTurnHelperUpdateNode : public CS2::animgraphlib::CUnaryUpdateNode {
		public:
			S2_PAD(0x4);
			animgraphlib::AnimValueSource m_facingTarget; // 0x74 | Schema_DeclaredEnum | Size: 0x4
			float32 m_turnStartTimeOffset; // 0x78 | Schema_Builtin | Size: 0x4
			float32 m_turnDuration; // 0x7c | Schema_Builtin | Size: 0x4
			bool m_bMatchChildDuration; // 0x80 | Schema_Builtin | Size: 0x1
			S2_PAD(0x3);
			float32 m_manualTurnOffset; // 0x84 | Schema_Builtin | Size: 0x4
			bool m_bUseManualTurnOffset; // 0x88 | Schema_Builtin | Size: 0x1
			S2_PAD(0x7); // End padding
		};
		static_assert(offsetof(CS2::animgraphlib::CTurnHelperUpdateNode, m_facingTarget) == 0x74, "m_facingTarget in CTurnHelperUpdateNode should be at offset 0x74");
		static_assert(offsetof(CS2::animgraphlib::CTurnHelperUpdateNode, m_turnStartTimeOffset) == 0x78, "m_turnStartTimeOffset in CTurnHelperUpdateNode should be at offset 0x78");
		static_assert(offsetof(CS2::animgraphlib::CTurnHelperUpdateNode, m_turnDuration) == 0x7C, "m_turnDuration in CTurnHelperUpdateNode should be at offset 0x7C");
		static_assert(offsetof(CS2::animgraphlib::CTurnHelperUpdateNode, m_bMatchChildDuration) == 0x80, "m_bMatchChildDuration in CTurnHelperUpdateNode should be at offset 0x80");
		static_assert(offsetof(CS2::animgraphlib::CTurnHelperUpdateNode, m_manualTurnOffset) == 0x84, "m_manualTurnOffset in CTurnHelperUpdateNode should be at offset 0x84");
		static_assert(offsetof(CS2::animgraphlib::CTurnHelperUpdateNode, m_bUseManualTurnOffset) == 0x88, "m_bUseManualTurnOffset in CTurnHelperUpdateNode should be at offset 0x88");
		static_assert(sizeof(CS2::animgraphlib::CTurnHelperUpdateNode) == 0x90, "CTurnHelperUpdateNode size should be 0x90");
	}
}
