// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#include <SDK/GlobalTypes.hpp>

#include <SDK/animgraphlib/CUnaryUpdateNode.hpp>



namespace CS2 {
	namespace animgraphlib {
		class CWayPointHelperUpdateNode : public CS2::animgraphlib::CUnaryUpdateNode {
		public:
			S2_PAD(0x4);
			float32 m_flStartCycle; // 0x74 | Schema_Builtin | Size: 0x4
			float32 m_flEndCycle; // 0x78 | Schema_Builtin | Size: 0x4
			bool m_bOnlyGoals; // 0x7c | Schema_Builtin | Size: 0x1
			bool m_bPreventOvershoot; // 0x7d | Schema_Builtin | Size: 0x1
			bool m_bPreventUndershoot; // 0x7e | Schema_Builtin | Size: 0x1
			S2_PAD(0x1); // End padding
		};
		static_assert(offsetof(CS2::animgraphlib::CWayPointHelperUpdateNode, m_flStartCycle) == 0x74, "m_flStartCycle in CWayPointHelperUpdateNode should be at offset 0x74");
		static_assert(offsetof(CS2::animgraphlib::CWayPointHelperUpdateNode, m_flEndCycle) == 0x78, "m_flEndCycle in CWayPointHelperUpdateNode should be at offset 0x78");
		static_assert(offsetof(CS2::animgraphlib::CWayPointHelperUpdateNode, m_bOnlyGoals) == 0x7C, "m_bOnlyGoals in CWayPointHelperUpdateNode should be at offset 0x7C");
		static_assert(offsetof(CS2::animgraphlib::CWayPointHelperUpdateNode, m_bPreventOvershoot) == 0x7D, "m_bPreventOvershoot in CWayPointHelperUpdateNode should be at offset 0x7D");
		static_assert(offsetof(CS2::animgraphlib::CWayPointHelperUpdateNode, m_bPreventUndershoot) == 0x7E, "m_bPreventUndershoot in CWayPointHelperUpdateNode should be at offset 0x7E");
		static_assert(sizeof(CS2::animgraphlib::CWayPointHelperUpdateNode) == 0x80, "CWayPointHelperUpdateNode size should be 0x80");
	}
}
