// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#ifndef CUSTOM_GLOBAL_TYPES
	#include <SDK/GlobalTypes.hpp>
#else
	#include <Custom/GlobalTypes.hpp>
#endif







using namespace GlobalTypes;
namespace CS2 {
	namespace animgraphlib {
		class FollowTargetOpFixedSettings_t  {
		public:
			int32_t m_boneIndex; // 0x0 | Schema_Builtin | Size: 0x4
			bool m_bBoneTarget; // 0x4 | Schema_Builtin | Size: 0x1
			S2_PAD(0x3);
			int32_t m_boneTargetIndex; // 0x8 | Schema_Builtin | Size: 0x4
			bool m_bWorldCoodinateTarget; // 0xc | Schema_Builtin | Size: 0x1
			bool m_bMatchTargetOrientation; // 0xd | Schema_Builtin | Size: 0x1
			S2_PAD(0x2); // End padding
		};
		static_assert(offsetof(CS2::animgraphlib::FollowTargetOpFixedSettings_t, m_boneIndex) == 0x0, "m_boneIndex in FollowTargetOpFixedSettings_t should be at offset 0x0");
		static_assert(offsetof(CS2::animgraphlib::FollowTargetOpFixedSettings_t, m_bBoneTarget) == 0x4, "m_bBoneTarget in FollowTargetOpFixedSettings_t should be at offset 0x4");
		static_assert(offsetof(CS2::animgraphlib::FollowTargetOpFixedSettings_t, m_boneTargetIndex) == 0x8, "m_boneTargetIndex in FollowTargetOpFixedSettings_t should be at offset 0x8");
		static_assert(offsetof(CS2::animgraphlib::FollowTargetOpFixedSettings_t, m_bWorldCoodinateTarget) == 0xC, "m_bWorldCoodinateTarget in FollowTargetOpFixedSettings_t should be at offset 0xC");
		static_assert(offsetof(CS2::animgraphlib::FollowTargetOpFixedSettings_t, m_bMatchTargetOrientation) == 0xD, "m_bMatchTargetOrientation in FollowTargetOpFixedSettings_t should be at offset 0xD");
		static_assert(sizeof(CS2::animgraphlib::FollowTargetOpFixedSettings_t) == 0x10, "FollowTargetOpFixedSettings_t size should be 0x10");
	}
}
