// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#ifndef CUSTOM_GLOBAL_TYPES
	#include <SDK/GlobalTypes.hpp>
#else
	#include <Custom/GlobalTypes.hpp>
#endif





namespace CS2 {
	namespace animgraphlib {
		class FootFixedData_t;
	}
}


using namespace GlobalTypes;
namespace CS2 {
	namespace animgraphlib {
		class FootPinningPoseOpFixedData_t  {
		public:
			GlobalTypes::CUtlVector< animgraphlib::FootFixedData_t > m_footInfo; // 0x0 | Schema_Atomic | Size: 0x18
			// char  m_footInfo[0x18]; // 0x0 | Schema_Atomic | Size: 0x18
			float32 m_flBlendTime; // 0x18 | Schema_Builtin | Size: 0x4
			float32 m_flLockBreakDistance; // 0x1c | Schema_Builtin | Size: 0x4
			float32 m_flMaxLegTwist; // 0x20 | Schema_Builtin | Size: 0x4
			int32_t m_nHipBoneIndex; // 0x24 | Schema_Builtin | Size: 0x4
			bool m_bApplyLegTwistLimits; // 0x28 | Schema_Builtin | Size: 0x1
			bool m_bApplyFootRotationLimits; // 0x29 | Schema_Builtin | Size: 0x1
			S2_PAD(0x6); // End padding
		};
		static_assert(offsetof(CS2::animgraphlib::FootPinningPoseOpFixedData_t, m_footInfo) == 0x0, "m_footInfo in FootPinningPoseOpFixedData_t should be at offset 0x0");
		static_assert(offsetof(CS2::animgraphlib::FootPinningPoseOpFixedData_t, m_flBlendTime) == 0x18, "m_flBlendTime in FootPinningPoseOpFixedData_t should be at offset 0x18");
		static_assert(offsetof(CS2::animgraphlib::FootPinningPoseOpFixedData_t, m_flLockBreakDistance) == 0x1C, "m_flLockBreakDistance in FootPinningPoseOpFixedData_t should be at offset 0x1C");
		static_assert(offsetof(CS2::animgraphlib::FootPinningPoseOpFixedData_t, m_flMaxLegTwist) == 0x20, "m_flMaxLegTwist in FootPinningPoseOpFixedData_t should be at offset 0x20");
		static_assert(offsetof(CS2::animgraphlib::FootPinningPoseOpFixedData_t, m_nHipBoneIndex) == 0x24, "m_nHipBoneIndex in FootPinningPoseOpFixedData_t should be at offset 0x24");
		static_assert(offsetof(CS2::animgraphlib::FootPinningPoseOpFixedData_t, m_bApplyLegTwistLimits) == 0x28, "m_bApplyLegTwistLimits in FootPinningPoseOpFixedData_t should be at offset 0x28");
		static_assert(offsetof(CS2::animgraphlib::FootPinningPoseOpFixedData_t, m_bApplyFootRotationLimits) == 0x29, "m_bApplyFootRotationLimits in FootPinningPoseOpFixedData_t should be at offset 0x29");
		static_assert(sizeof(CS2::animgraphlib::FootPinningPoseOpFixedData_t) == 0x30, "FootPinningPoseOpFixedData_t size should be 0x30");
	}
}
