// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#ifndef CUSTOM_GLOBAL_TYPES
	#include <SDK/GlobalTypes.hpp>
#else
	#include <Custom/GlobalTypes.hpp>
#endif







using namespace GlobalTypes;
namespace CS2 {
	namespace animgraphlib {
		class FootFixedData_t  {
		public:
			GlobalTypes::VectorAligned m_vToeOffset; // 0x0 | Schema_Atomic | Size: 0x10
			GlobalTypes::VectorAligned m_vHeelOffset; // 0x10 | Schema_Atomic | Size: 0x10
			int32_t m_nTargetBoneIndex; // 0x20 | Schema_Builtin | Size: 0x4
			int32_t m_nAnkleBoneIndex; // 0x24 | Schema_Builtin | Size: 0x4
			int32_t m_nIKAnchorBoneIndex; // 0x28 | Schema_Builtin | Size: 0x4
			int32_t m_ikChainIndex; // 0x2c | Schema_Builtin | Size: 0x4
			float32 m_flMaxIKLength; // 0x30 | Schema_Builtin | Size: 0x4
			int32_t m_nFootIndex; // 0x34 | Schema_Builtin | Size: 0x4
			int32_t m_nTagIndex; // 0x38 | Schema_Builtin | Size: 0x4
			float32 m_flMaxRotationLeft; // 0x3c | Schema_Builtin | Size: 0x4
			float32 m_flMaxRotationRight; // 0x40 | Schema_Builtin | Size: 0x4
			S2_PAD(0xc); // End padding
		};
		static_assert(offsetof(CS2::animgraphlib::FootFixedData_t, m_vToeOffset) == 0x0, "m_vToeOffset in FootFixedData_t should be at offset 0x0");
		static_assert(offsetof(CS2::animgraphlib::FootFixedData_t, m_vHeelOffset) == 0x10, "m_vHeelOffset in FootFixedData_t should be at offset 0x10");
		static_assert(offsetof(CS2::animgraphlib::FootFixedData_t, m_nTargetBoneIndex) == 0x20, "m_nTargetBoneIndex in FootFixedData_t should be at offset 0x20");
		static_assert(offsetof(CS2::animgraphlib::FootFixedData_t, m_nAnkleBoneIndex) == 0x24, "m_nAnkleBoneIndex in FootFixedData_t should be at offset 0x24");
		static_assert(offsetof(CS2::animgraphlib::FootFixedData_t, m_nIKAnchorBoneIndex) == 0x28, "m_nIKAnchorBoneIndex in FootFixedData_t should be at offset 0x28");
		static_assert(offsetof(CS2::animgraphlib::FootFixedData_t, m_ikChainIndex) == 0x2C, "m_ikChainIndex in FootFixedData_t should be at offset 0x2C");
		static_assert(offsetof(CS2::animgraphlib::FootFixedData_t, m_flMaxIKLength) == 0x30, "m_flMaxIKLength in FootFixedData_t should be at offset 0x30");
		static_assert(offsetof(CS2::animgraphlib::FootFixedData_t, m_nFootIndex) == 0x34, "m_nFootIndex in FootFixedData_t should be at offset 0x34");
		static_assert(offsetof(CS2::animgraphlib::FootFixedData_t, m_nTagIndex) == 0x38, "m_nTagIndex in FootFixedData_t should be at offset 0x38");
		static_assert(offsetof(CS2::animgraphlib::FootFixedData_t, m_flMaxRotationLeft) == 0x3C, "m_flMaxRotationLeft in FootFixedData_t should be at offset 0x3C");
		static_assert(offsetof(CS2::animgraphlib::FootFixedData_t, m_flMaxRotationRight) == 0x40, "m_flMaxRotationRight in FootFixedData_t should be at offset 0x40");
		static_assert(sizeof(CS2::animgraphlib::FootFixedData_t) == 0x50, "FootFixedData_t size should be 0x50");
	}
}
