// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#ifndef CUSTOM_GLOBAL_TYPES
	#include <SDK/GlobalTypes.hpp>
#else
	#include <Custom/GlobalTypes.hpp>
#endif


#include <SDK/animgraphlib/TraceSettings_t.hpp>





using namespace GlobalTypes;
namespace CS2 {
	namespace animgraphlib {
		class FootFixedSettings  {
		public:
			animgraphlib::TraceSettings_t m_traceSettings; // 0x0 | Schema_DeclaredClass | Size: 0x8
			S2_PAD(0x8);
			GlobalTypes::VectorAligned m_vFootBaseBindPosePositionMS; // 0x10 | Schema_Atomic | Size: 0x10
			float32 m_flFootBaseLength; // 0x20 | Schema_Builtin | Size: 0x4
			float32 m_flMaxRotationLeft; // 0x24 | Schema_Builtin | Size: 0x4
			float32 m_flMaxRotationRight; // 0x28 | Schema_Builtin | Size: 0x4
			int32_t m_footstepLandedTagIndex; // 0x2c | Schema_Builtin | Size: 0x4
			bool m_bEnableTracing; // 0x30 | Schema_Builtin | Size: 0x1
			S2_PAD(0x3);
			float32 m_flTraceAngleBlend; // 0x34 | Schema_Builtin | Size: 0x4
			int32_t m_nDisableTagIndex; // 0x38 | Schema_Builtin | Size: 0x4
			int32_t m_nFootIndex; // 0x3c | Schema_Builtin | Size: 0x4
		};
		static_assert(offsetof(CS2::animgraphlib::FootFixedSettings, m_traceSettings) == 0x0, "m_traceSettings in FootFixedSettings should be at offset 0x0");
		static_assert(offsetof(CS2::animgraphlib::FootFixedSettings, m_vFootBaseBindPosePositionMS) == 0x10, "m_vFootBaseBindPosePositionMS in FootFixedSettings should be at offset 0x10");
		static_assert(offsetof(CS2::animgraphlib::FootFixedSettings, m_flFootBaseLength) == 0x20, "m_flFootBaseLength in FootFixedSettings should be at offset 0x20");
		static_assert(offsetof(CS2::animgraphlib::FootFixedSettings, m_flMaxRotationLeft) == 0x24, "m_flMaxRotationLeft in FootFixedSettings should be at offset 0x24");
		static_assert(offsetof(CS2::animgraphlib::FootFixedSettings, m_flMaxRotationRight) == 0x28, "m_flMaxRotationRight in FootFixedSettings should be at offset 0x28");
		static_assert(offsetof(CS2::animgraphlib::FootFixedSettings, m_footstepLandedTagIndex) == 0x2C, "m_footstepLandedTagIndex in FootFixedSettings should be at offset 0x2C");
		static_assert(offsetof(CS2::animgraphlib::FootFixedSettings, m_bEnableTracing) == 0x30, "m_bEnableTracing in FootFixedSettings should be at offset 0x30");
		static_assert(offsetof(CS2::animgraphlib::FootFixedSettings, m_flTraceAngleBlend) == 0x34, "m_flTraceAngleBlend in FootFixedSettings should be at offset 0x34");
		static_assert(offsetof(CS2::animgraphlib::FootFixedSettings, m_nDisableTagIndex) == 0x38, "m_nDisableTagIndex in FootFixedSettings should be at offset 0x38");
		static_assert(offsetof(CS2::animgraphlib::FootFixedSettings, m_nFootIndex) == 0x3C, "m_nFootIndex in FootFixedSettings should be at offset 0x3C");
		static_assert(sizeof(CS2::animgraphlib::FootFixedSettings) == 0x40, "FootFixedSettings size should be 0x40");
	}
}
