// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#include <SDK/GlobalTypes.hpp>




namespace CS2 {
	namespace animgraphlib {
		class HitReactFixedSettings_t  {
		public:
			int32_t m_nWeightListIndex; // 0x0 | Schema_Builtin | Size: 0x4
			int32_t m_nEffectedBoneCount; // 0x4 | Schema_Builtin | Size: 0x4
			float32 m_flMaxImpactForce; // 0x8 | Schema_Builtin | Size: 0x4
			float32 m_flMinImpactForce; // 0xc | Schema_Builtin | Size: 0x4
			float32 m_flWhipImpactScale; // 0x10 | Schema_Builtin | Size: 0x4
			float32 m_flCounterRotationScale; // 0x14 | Schema_Builtin | Size: 0x4
			float32 m_flDistanceFadeScale; // 0x18 | Schema_Builtin | Size: 0x4
			float32 m_flPropagationScale; // 0x1c | Schema_Builtin | Size: 0x4
			float32 m_flWhipDelay; // 0x20 | Schema_Builtin | Size: 0x4
			float32 m_flSpringStrength; // 0x24 | Schema_Builtin | Size: 0x4
			float32 m_flWhipSpringStrength; // 0x28 | Schema_Builtin | Size: 0x4
			float32 m_flMaxAngleRadians; // 0x2c | Schema_Builtin | Size: 0x4
			int32_t m_nHipBoneIndex; // 0x30 | Schema_Builtin | Size: 0x4
			float32 m_flHipBoneTranslationScale; // 0x34 | Schema_Builtin | Size: 0x4
			float32 m_flHipDipSpringStrength; // 0x38 | Schema_Builtin | Size: 0x4
			float32 m_flHipDipImpactScale; // 0x3c | Schema_Builtin | Size: 0x4
			float32 m_flHipDipDelay; // 0x40 | Schema_Builtin | Size: 0x4
		};
		static_assert(offsetof(CS2::animgraphlib::HitReactFixedSettings_t, m_nWeightListIndex) == 0x0, "m_nWeightListIndex in HitReactFixedSettings_t should be at offset 0x0");
		static_assert(offsetof(CS2::animgraphlib::HitReactFixedSettings_t, m_nEffectedBoneCount) == 0x4, "m_nEffectedBoneCount in HitReactFixedSettings_t should be at offset 0x4");
		static_assert(offsetof(CS2::animgraphlib::HitReactFixedSettings_t, m_flMaxImpactForce) == 0x8, "m_flMaxImpactForce in HitReactFixedSettings_t should be at offset 0x8");
		static_assert(offsetof(CS2::animgraphlib::HitReactFixedSettings_t, m_flMinImpactForce) == 0xC, "m_flMinImpactForce in HitReactFixedSettings_t should be at offset 0xC");
		static_assert(offsetof(CS2::animgraphlib::HitReactFixedSettings_t, m_flWhipImpactScale) == 0x10, "m_flWhipImpactScale in HitReactFixedSettings_t should be at offset 0x10");
		static_assert(offsetof(CS2::animgraphlib::HitReactFixedSettings_t, m_flCounterRotationScale) == 0x14, "m_flCounterRotationScale in HitReactFixedSettings_t should be at offset 0x14");
		static_assert(offsetof(CS2::animgraphlib::HitReactFixedSettings_t, m_flDistanceFadeScale) == 0x18, "m_flDistanceFadeScale in HitReactFixedSettings_t should be at offset 0x18");
		static_assert(offsetof(CS2::animgraphlib::HitReactFixedSettings_t, m_flPropagationScale) == 0x1C, "m_flPropagationScale in HitReactFixedSettings_t should be at offset 0x1C");
		static_assert(offsetof(CS2::animgraphlib::HitReactFixedSettings_t, m_flWhipDelay) == 0x20, "m_flWhipDelay in HitReactFixedSettings_t should be at offset 0x20");
		static_assert(offsetof(CS2::animgraphlib::HitReactFixedSettings_t, m_flSpringStrength) == 0x24, "m_flSpringStrength in HitReactFixedSettings_t should be at offset 0x24");
		static_assert(offsetof(CS2::animgraphlib::HitReactFixedSettings_t, m_flWhipSpringStrength) == 0x28, "m_flWhipSpringStrength in HitReactFixedSettings_t should be at offset 0x28");
		static_assert(offsetof(CS2::animgraphlib::HitReactFixedSettings_t, m_flMaxAngleRadians) == 0x2C, "m_flMaxAngleRadians in HitReactFixedSettings_t should be at offset 0x2C");
		static_assert(offsetof(CS2::animgraphlib::HitReactFixedSettings_t, m_nHipBoneIndex) == 0x30, "m_nHipBoneIndex in HitReactFixedSettings_t should be at offset 0x30");
		static_assert(offsetof(CS2::animgraphlib::HitReactFixedSettings_t, m_flHipBoneTranslationScale) == 0x34, "m_flHipBoneTranslationScale in HitReactFixedSettings_t should be at offset 0x34");
		static_assert(offsetof(CS2::animgraphlib::HitReactFixedSettings_t, m_flHipDipSpringStrength) == 0x38, "m_flHipDipSpringStrength in HitReactFixedSettings_t should be at offset 0x38");
		static_assert(offsetof(CS2::animgraphlib::HitReactFixedSettings_t, m_flHipDipImpactScale) == 0x3C, "m_flHipDipImpactScale in HitReactFixedSettings_t should be at offset 0x3C");
		static_assert(offsetof(CS2::animgraphlib::HitReactFixedSettings_t, m_flHipDipDelay) == 0x40, "m_flHipDipDelay in HitReactFixedSettings_t should be at offset 0x40");
		static_assert(sizeof(CS2::animgraphlib::HitReactFixedSettings_t) == 0x44, "HitReactFixedSettings_t size should be 0x44");
	}
}
