// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#include <SDK/GlobalTypes.hpp>

#include <SDK/animgraphlib/IKTargetSource.hpp>
#include <SDK/animgraphlib/IKBoneNameAndIndex_t.hpp>
#include <SDK/modellib/AnimParamID.hpp>
#include <SDK/animgraphlib/IKTargetCoordinateSystem.hpp>



namespace CS2 {
	namespace animgraphlib {
		class IKTargetSettings_t  {
		public:
			animgraphlib::IKTargetSource m_TargetSource; // 0x0 | Schema_DeclaredEnum | Size: 0x4
			S2_PAD(0x4);
			animgraphlib::IKBoneNameAndIndex_t m_Bone; // 0x8 | Schema_DeclaredClass | Size: 0x10
			modellib::AnimParamID m_AnimgraphParameterNamePosition; // 0x18 | Schema_DeclaredClass | Size: 0x4
			modellib::AnimParamID m_AnimgraphParameterNameOrientation; // 0x1c | Schema_DeclaredClass | Size: 0x4
			animgraphlib::IKTargetCoordinateSystem m_TargetCoordSystem; // 0x20 | Schema_DeclaredEnum | Size: 0x4
			S2_PAD(0x4); // End padding
		};
		static_assert(offsetof(CS2::animgraphlib::IKTargetSettings_t, m_TargetSource) == 0x0, "m_TargetSource in IKTargetSettings_t should be at offset 0x0");
		static_assert(offsetof(CS2::animgraphlib::IKTargetSettings_t, m_Bone) == 0x8, "m_Bone in IKTargetSettings_t should be at offset 0x8");
		static_assert(offsetof(CS2::animgraphlib::IKTargetSettings_t, m_AnimgraphParameterNamePosition) == 0x18, "m_AnimgraphParameterNamePosition in IKTargetSettings_t should be at offset 0x18");
		static_assert(offsetof(CS2::animgraphlib::IKTargetSettings_t, m_AnimgraphParameterNameOrientation) == 0x1C, "m_AnimgraphParameterNameOrientation in IKTargetSettings_t should be at offset 0x1C");
		static_assert(offsetof(CS2::animgraphlib::IKTargetSettings_t, m_TargetCoordSystem) == 0x20, "m_TargetCoordSystem in IKTargetSettings_t should be at offset 0x20");
		static_assert(sizeof(CS2::animgraphlib::IKTargetSettings_t) == 0x28, "IKTargetSettings_t size should be 0x28");
	}
}
