// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#include <SDK/GlobalTypes.hpp>

#include <SDK/animgraphlib/JiggleBoneSimSpace.hpp>



namespace CS2 {
	namespace animgraphlib {
		class JiggleBoneSettings_t  {
		public:
			int32_t m_nBoneIndex; // 0x0 | Schema_Builtin | Size: 0x4
			float32 m_flSpringStrength; // 0x4 | Schema_Builtin | Size: 0x4
			float32 m_flMaxTimeStep; // 0x8 | Schema_Builtin | Size: 0x4
			float32 m_flDamping; // 0xc | Schema_Builtin | Size: 0x4
			GlobalTypes::Vector m_vBoundsMaxLS; // 0x10 | Schema_Atomic | Size: 0xc
			GlobalTypes::Vector m_vBoundsMinLS; // 0x1c | Schema_Atomic | Size: 0xc
			animgraphlib::JiggleBoneSimSpace m_eSimSpace; // 0x28 | Schema_DeclaredEnum | Size: 0x4
		};
		static_assert(offsetof(CS2::animgraphlib::JiggleBoneSettings_t, m_nBoneIndex) == 0x0, "m_nBoneIndex in JiggleBoneSettings_t should be at offset 0x0");
		static_assert(offsetof(CS2::animgraphlib::JiggleBoneSettings_t, m_flSpringStrength) == 0x4, "m_flSpringStrength in JiggleBoneSettings_t should be at offset 0x4");
		static_assert(offsetof(CS2::animgraphlib::JiggleBoneSettings_t, m_flMaxTimeStep) == 0x8, "m_flMaxTimeStep in JiggleBoneSettings_t should be at offset 0x8");
		static_assert(offsetof(CS2::animgraphlib::JiggleBoneSettings_t, m_flDamping) == 0xC, "m_flDamping in JiggleBoneSettings_t should be at offset 0xC");
		static_assert(offsetof(CS2::animgraphlib::JiggleBoneSettings_t, m_vBoundsMaxLS) == 0x10, "m_vBoundsMaxLS in JiggleBoneSettings_t should be at offset 0x10");
		static_assert(offsetof(CS2::animgraphlib::JiggleBoneSettings_t, m_vBoundsMinLS) == 0x1C, "m_vBoundsMinLS in JiggleBoneSettings_t should be at offset 0x1C");
		static_assert(offsetof(CS2::animgraphlib::JiggleBoneSettings_t, m_eSimSpace) == 0x28, "m_eSimSpace in JiggleBoneSettings_t should be at offset 0x28");
		static_assert(sizeof(CS2::animgraphlib::JiggleBoneSettings_t) == 0x2C, "JiggleBoneSettings_t size should be 0x2C");
	}
}
