// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#include <SDK/GlobalTypes.hpp>

#include <SDK/animgraphlib/CAnimParamHandle.hpp>
#include <SDK/animgraphlib/AnimParamType_t.hpp>



namespace CS2 {
	namespace animgraphlib {
		class ParamSpan_t  {
		public:
			// GlobalTypes::CUtlVector< animgraphlib::ParamSpanSample_t > m_samples; // 0x0 | Schema_Atomic | Size: 0x18
			char  m_samples[0x18]; // 0x0 | Schema_Atomic | Size: 0x18
			animgraphlib::CAnimParamHandle m_hParam; // 0x18 | Schema_DeclaredClass | Size: 0x2
			animgraphlib::AnimParamType_t m_eParamType; // 0x1a | Schema_DeclaredEnum | Size: 0x1
			S2_PAD(0x1);
			float32 m_flStartCycle; // 0x1c | Schema_Builtin | Size: 0x4
			float32 m_flEndCycle; // 0x20 | Schema_Builtin | Size: 0x4
			S2_PAD(0x4); // End padding
		};
		static_assert(offsetof(CS2::animgraphlib::ParamSpan_t, m_samples) == 0x0, "m_samples in ParamSpan_t should be at offset 0x0");
		static_assert(offsetof(CS2::animgraphlib::ParamSpan_t, m_hParam) == 0x18, "m_hParam in ParamSpan_t should be at offset 0x18");
		static_assert(offsetof(CS2::animgraphlib::ParamSpan_t, m_eParamType) == 0x1A, "m_eParamType in ParamSpan_t should be at offset 0x1A");
		static_assert(offsetof(CS2::animgraphlib::ParamSpan_t, m_flStartCycle) == 0x1C, "m_flStartCycle in ParamSpan_t should be at offset 0x1C");
		static_assert(offsetof(CS2::animgraphlib::ParamSpan_t, m_flEndCycle) == 0x20, "m_flEndCycle in ParamSpan_t should be at offset 0x20");
		static_assert(sizeof(CS2::animgraphlib::ParamSpan_t) == 0x28, "ParamSpan_t size should be 0x28");
	}
}
