// generated - do not edit!
// generated by @xsip cs2 schema generator

#pragma once

#ifndef CUSTOM_GLOBAL_TYPES
	#include <SDK/GlobalTypes.hpp>
#else
	#include <Custom/GlobalTypes.hpp>
#endif


#include <SDK/animgraphlib/IkEndEffectorType.hpp>
#include <SDK/modellib/CAnimAttachment.hpp>
#include <SDK/animgraphlib/IkTargetType.hpp>
#include <SDK/animgraphlib/CAnimParamHandle.hpp>





using namespace GlobalTypes;
namespace CS2 {
	namespace animgraphlib {
		class TwoBoneIKSettings_t  {
		public:
			animgraphlib::IkEndEffectorType m_endEffectorType; // 0x0 | Schema_DeclaredEnum | Size: 0x4
			S2_PAD(0xc);
			modellib::CAnimAttachment m_endEffectorAttachment; // 0x10 | Schema_DeclaredClass | Size: 0x80
			animgraphlib::IkTargetType m_targetType; // 0x90 | Schema_DeclaredEnum | Size: 0x4
			S2_PAD(0xc);
			modellib::CAnimAttachment m_targetAttachment; // 0xa0 | Schema_DeclaredClass | Size: 0x80
			int32_t m_targetBoneIndex; // 0x120 | Schema_Builtin | Size: 0x4
			animgraphlib::CAnimParamHandle m_hPositionParam; // 0x124 | Schema_DeclaredClass | Size: 0x2
			animgraphlib::CAnimParamHandle m_hRotationParam; // 0x126 | Schema_DeclaredClass | Size: 0x2
			bool m_bAlwaysUseFallbackHinge; // 0x128 | Schema_Builtin | Size: 0x1
			S2_PAD(0x7);
			GlobalTypes::VectorAligned m_vLsFallbackHingeAxis; // 0x130 | Schema_Atomic | Size: 0x10
			int32_t m_nFixedBoneIndex; // 0x140 | Schema_Builtin | Size: 0x4
			int32_t m_nMiddleBoneIndex; // 0x144 | Schema_Builtin | Size: 0x4
			int32_t m_nEndBoneIndex; // 0x148 | Schema_Builtin | Size: 0x4
			bool m_bMatchTargetOrientation; // 0x14c | Schema_Builtin | Size: 0x1
			bool m_bConstrainTwist; // 0x14d | Schema_Builtin | Size: 0x1
			S2_PAD(0x2);
			float32 m_flMaxTwist; // 0x150 | Schema_Builtin | Size: 0x4
			S2_PAD(0xc); // End padding
		};
		static_assert(offsetof(CS2::animgraphlib::TwoBoneIKSettings_t, m_endEffectorType) == 0x0, "m_endEffectorType in TwoBoneIKSettings_t should be at offset 0x0");
		static_assert(offsetof(CS2::animgraphlib::TwoBoneIKSettings_t, m_endEffectorAttachment) == 0x10, "m_endEffectorAttachment in TwoBoneIKSettings_t should be at offset 0x10");
		static_assert(offsetof(CS2::animgraphlib::TwoBoneIKSettings_t, m_targetType) == 0x90, "m_targetType in TwoBoneIKSettings_t should be at offset 0x90");
		static_assert(offsetof(CS2::animgraphlib::TwoBoneIKSettings_t, m_targetAttachment) == 0xA0, "m_targetAttachment in TwoBoneIKSettings_t should be at offset 0xA0");
		static_assert(offsetof(CS2::animgraphlib::TwoBoneIKSettings_t, m_targetBoneIndex) == 0x120, "m_targetBoneIndex in TwoBoneIKSettings_t should be at offset 0x120");
		static_assert(offsetof(CS2::animgraphlib::TwoBoneIKSettings_t, m_hPositionParam) == 0x124, "m_hPositionParam in TwoBoneIKSettings_t should be at offset 0x124");
		static_assert(offsetof(CS2::animgraphlib::TwoBoneIKSettings_t, m_hRotationParam) == 0x126, "m_hRotationParam in TwoBoneIKSettings_t should be at offset 0x126");
		static_assert(offsetof(CS2::animgraphlib::TwoBoneIKSettings_t, m_bAlwaysUseFallbackHinge) == 0x128, "m_bAlwaysUseFallbackHinge in TwoBoneIKSettings_t should be at offset 0x128");
		static_assert(offsetof(CS2::animgraphlib::TwoBoneIKSettings_t, m_vLsFallbackHingeAxis) == 0x130, "m_vLsFallbackHingeAxis in TwoBoneIKSettings_t should be at offset 0x130");
		static_assert(offsetof(CS2::animgraphlib::TwoBoneIKSettings_t, m_nFixedBoneIndex) == 0x140, "m_nFixedBoneIndex in TwoBoneIKSettings_t should be at offset 0x140");
		static_assert(offsetof(CS2::animgraphlib::TwoBoneIKSettings_t, m_nMiddleBoneIndex) == 0x144, "m_nMiddleBoneIndex in TwoBoneIKSettings_t should be at offset 0x144");
		static_assert(offsetof(CS2::animgraphlib::TwoBoneIKSettings_t, m_nEndBoneIndex) == 0x148, "m_nEndBoneIndex in TwoBoneIKSettings_t should be at offset 0x148");
		static_assert(offsetof(CS2::animgraphlib::TwoBoneIKSettings_t, m_bMatchTargetOrientation) == 0x14C, "m_bMatchTargetOrientation in TwoBoneIKSettings_t should be at offset 0x14C");
		static_assert(offsetof(CS2::animgraphlib::TwoBoneIKSettings_t, m_bConstrainTwist) == 0x14D, "m_bConstrainTwist in TwoBoneIKSettings_t should be at offset 0x14D");
		static_assert(offsetof(CS2::animgraphlib::TwoBoneIKSettings_t, m_flMaxTwist) == 0x150, "m_flMaxTwist in TwoBoneIKSettings_t should be at offset 0x150");
		static_assert(sizeof(CS2::animgraphlib::TwoBoneIKSettings_t) == 0x160, "TwoBoneIKSettings_t size should be 0x160");
	}
}
